[
{
  "model": "api.spell",
  "pk": "abrupt-hug",
  "fields": {
    "name": "Abrupt Hug",
    "desc": "You or the creature taking the Attack action can immediately make an unarmed strike. In addition to dealing damage with the unarmed strike, the target can grapple the creature it hit with the unarmed strike.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.185",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Ranger",
    "school": "transmutation",
    "casting_time": "1 reaction, which you take when you or a creature within 30 feet of you takes an Attack action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "avert-evil-eye",
  "fields": {
    "name": "Avert Evil Eye",
    "desc": "The evil eye takes many forms. Any incident of bad luck can be blamed on it, especially if a character recently displayed arrogance or selfishness. When avert evil eye is cast, the recipient has a small degree of protection against the evil eye for up to 1 hour. While the spell lasts, the target of the spell has advantage on saving throws against being blinded, charmed, cursed, and frightened. During the spell's duration, the target can also cancel disadvantage on one d20 roll the target is about to make, but doing so ends the spell's effect.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.191",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Wizard",
    "school": "abjuration",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 Hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "bardo",
  "fields": {
    "name": "Bardo",
    "desc": "You capture some of the fading life essence of the triggering creature, drawing on the energy of the tenuous moment between life and death. You can then use this essence to immediately harm or help a different creature you can see within range. If you choose to harm, the target must make a Wisdom saving throw. The target takes psychic damage equal to 6d8 + your spellcasting ability modifier on a failed save, or half as much damage on a successful one. If you choose to help, the target regains hit points equal to 3d8 + your spellcasting ability modifier. This spell can't be triggered by the death of a construct or an undead creature, and it can't restore hit points to constructs or undead.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.194",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Cleric, Paladin, Sorceror, Wizard",
    "school": "necromancy",
    "casting_time": "1 reaction, which you take when you see a creature within 30 feet of you die",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "battle-chant",
  "fields": {
    "name": "Battle Chant",
    "desc": "You bless up all allied creatures of your choice within range. Whenever a target lands a successful hit before the spell ends, the target can add 1 to the damage roll. When cast by multiple casters chanting in unison, the same increases to 2 points added to the damage roll.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.197",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Warlock",
    "school": "enchantment",
    "casting_time": "1 minute",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can extend the range by 10 feet for each slot level above 2nd.",
    "can_be_cast_as_ritual": true,
    "duration": "5 Minutes",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "bombardment-of-stings",
  "fields": {
    "name": "Bombardment of Stings",
    "desc": "Each creature in a 30-foot cone must make a Dexterity saving throw. On a failed save, a creature takes 4d6 piercing damage and is poisoned for 1 minute. On a successful save, a creature takes half as much damage and isn't poisoned. At the end of each of its turns, a poisoned target can make a Constitution saving throw. On a success, the condition ends on the target.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.202",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Druid, Ranger, Sorceror, Wizard",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "Self (30-foot cone)",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "charming-aesthetics",
  "fields": {
    "name": "Charming Aesthetics",
    "desc": "You affect a group of the same plants or animals within range, giving them a harmless and attractive appearance. If a creature studies one of the enchanted plants or animals, it must make a Wisdom saving throw. If it fails the saving throw, it is charmed by the plant or animal until the spell ends or until another creature other than one of its allies does anything harmful to it. While the creature is charmed and stays within sight of the enchanted plants or animals, it has disadvantage on Wisdom (Perception) checks as well as checks to notice signs of danger. If the charmed creature attempts to move out of sight of the spell's subject, it must make a second Wisdom saving throw. If it fails the saving throw, it refuses to move out of sight of the spell's subject. It can repeat this save once per minute. If it succeeds, it can move away, but it remains charmed.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.185",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Druid",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, you can target one additional group of plants or animals for each slot level above 4th.",
    "can_be_cast_as_ritual": false,
    "duration": "1 Day",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "child-of-light-and-darkness",
  "fields": {
    "name": "Child of Light and Darkness",
    "desc": "Roll a d20 at the end of each of your turns for the duration of the spell. On a roll of 1-10, you take the form of a humanoid made of pure, searing light. On a roll of 11-20, you take the form of a humanoid made of bone-chilling darkness. In both forms, you have immunity to bludgeoning, piercing, and slashing damage from nonmagical attacks, and a creature that attacks you has disadvantage on the attack roll. You gain additional benefits while in each form: Light Form. You shed bright light in a 60-foot radius and dim light for an additional 60 feet, you are immune to fire damage, and you have resistance to radiant damage. Once per turn, as a bonus action, you can teleport to a space you can see within the light you shed. Darkness Form. You are immune to cold damage, and you have resistance to necrotic damage. Once per turn, as a bonus action, you can target up to three Large or smaller creatures within 30 feet of you. Each target must succeed on a Strength saving throw or be pulled or pushed (your choice) up to 20 feet straight toward or away from you.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.186",
    "page_no": null,
    "page": "",
    "spell_level": 8,
    "dnd_class": "Wizard, Sorceror, Cleric",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "commanders-pavilion",
  "fields": {
    "name": "Commander's Pavilion",
    "desc": "Creates a command tent 30 feet by 30 feet with a peak height of 20 feet. It is filled with items a military commander might require of a headquarters tent on a campaign, such as maps of the area, a spyglass, a sandglass, materials for correspondence, references for coding and decoding messages, books on history and strategy relevant to the area, banners, spare uniforms, and badges of rank. Such minor mundane items dissipate once the spell's effect ends. Recasting the spell on subsequent days maintains the existing tent for another 24 hours.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.186",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": true,
    "duration": "24 Hours",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "devouring-darkness",
  "fields": {
    "name": "Devouring Darkness",
    "desc": "Terrifying and nightmarish monsters exist within the unknown void of the in-between. Choose up to six points you can see within range. Voidlike, magical darkness spreads from each point to fill a 10-footradius sphere for the duration. The darkness spreads around corners. A creature with darkvision can't see through this darkness, and no light, magical or nonmagical, can illuminate it.\n  Each creature inside a sphere when this spell is cast must make a Dexterity saving throw. On a failed save, the creature takes 6d10 piercing damage and 5d6 psychic damage and is restrained until it breaks free as unseen entities bite and tear at it from the Void. Once a successful save, the creature takes half as much damage and isn't restrained. A restrained creature can use its action to make a Strength check against your spell save DC. If it succeeds, it is no longer restrained.\n  When a creature enters a sphere for the first time on a turn or starts its turn in a sphere, that creature must make an Intelligence saving throw. The creature takes 5d6 psychic damage on a failed save, or half as much damage on a successful one.\n  Once created, the spheres can't be moved. A creature in overlapping spheres doesn't suffer additional effects for being in more than one sphere at a time.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.186",
    "page_no": null,
    "page": "",
    "spell_level": 9,
    "dnd_class": "Sorceror, Wizard",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "300 Feet",
    "target_range_sort": 300,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "door-of-the-far-traveler",
  "fields": {
    "name": "Door of the Far Traveler",
    "desc": "You conjure a door to the destination of your choice that lasts for the duration or until dispelled. You sketch the outline of the door with chalk on any hard surface (a wall, a cliffside, the deck of a ship, etc.) and scribe sigils of power around its outline. The doorway must be at least 1 foot wide by 2 feet tall and can be no larger than 5 feet wide by 10 feet tall. Once the door is drawn, place the knob appropriately; it attaches magically to the surface and your drawing becomes a real door to the spell's destination. The doorway remains functional for the spell's duration. During that time, anyone can open or close the door and pass through it in either direction.\n  The destination can be on any plane of existence. It must be familiar to you, and your level of familiarity with it determines the accuracy of the spell (determined by the GM). If it's a place you've visited, you can expect 100 percent accuracy. If it's been described to you by someone who was there, you might arrive in the wrong room or even the wrong structure, depending on how detailed their description was. If you've only heard about the destination third-hand, you may end up in a similar structure that's in a very different locale.\n  *Door of the far traveler* doesn't create a doorway at the destination. It connects to an existing, working door. It can't, for example, take you to an open field or a forest with no structures (unless someone built a doorframe with a door in that spot for this specific purpose!). While the spell is in effect, the pre-existing doorway connects only to the area you occupied while casting the spell. If you connected to an existing doorway between a home's parlor and library, for example, and your door leads into the library, then people can still walk through that doorway from the parlor into the library normally. Anyone trying to go the other direction, however, arrives wherever you came from instead of in the parlor.\n  Before casting the spell, you must spend one hour etching magical symbols onto the doorknob that will serve as the spell's material component to attune it to your desired destination. Once prepared, the knob remains attuned to that destination until it's used or you spend another hour attuning it to a different location.\n  *The door of the far traveler* is dispelled if you remove the knob from the door. You can do this as a bonus action from either side of the door, provided it's shut. If the spell's duration expires naturally, the knob falls to the ground on whichever side of the door you're on. Once the spell ends, the knob loses its attunement to any location and another hour must be spent attuning it before it can be used again.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.187",
    "page_no": null,
    "page": "",
    "spell_level": 8,
    "dnd_class": "Bard, Cleric, Druid, Wizard",
    "school": "conjuration",
    "casting_time": "10 minutes plus 1 hour of attunement",
    "range": "10 Feet",
    "target_range_sort": 10,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "If you cast this spell using a 9thlevel slot, the duration increases to 12 hours.",
    "can_be_cast_as_ritual": false,
    "duration": "6 hours",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "eternal-echo",
  "fields": {
    "name": "Eternal Echo",
    "desc": "You gain a portentous voice of compelling power, commanding all undead within 60 feet that fail a Wisdom saving throw. This overrides any prior loyalty to spellcasters such as necromancers or evil priests, and it can nullify the effect of a Turn Undead result from a cleric.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.187",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Wizard, Cleric",
    "school": "necromancy",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Concentration",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "ethereal-stairs",
  "fields": {
    "name": "Ethereal Stairs",
    "desc": "You create a staircase out of the nothingness of the air. A shimmering staircase 10 feet wide appears and remains for the duration. The staircase ascends at a 45-degree angle to a point as much as 60 feet above the ground. The staircase consists only of steps with no apparent support, unless you choose to have it resemble a stone or wooden structure. Even then, its magical nature is obvious, as it has no color and is translucent, and only the steps have solidity; the rest of it is no more solid than air. The staircase can support up to 10 tons of weight. It can be straight, spiral, or switchback. Its bottom must connect to solid ground, but its top need not connect to anything.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.188",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Bard, Cleric, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 6th level or higher, the staircase extends an additional 20 feet for each slot level above 5th.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "exchanged-knowledge",
  "fields": {
    "name": "Exchanged Knowledge",
    "desc": "When you cast this spell, you open a conduit to the Castle Library, granting access to difficult-to-obtain information. For the spell's duration, you double your proficiency bonus whenever you make an Intelligence check to recall information about any subject. Additionally, you can gain advantage on an Intelligence check to recall information. To do so, you must either sacrifice another lore-filled book or succeed on a Charisma saving throw. On a failed save, the spell ends, and you have disadvantage on all Intelligence checks to recall information for 1 week. A wish spell ends this effect.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.188",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Wizard, Cleric, Bard",
    "school": "divination",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 Hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "hedgehog-dozen",
  "fields": {
    "name": "Hedgehog Dozen",
    "desc": "Eleven illusory duplicates of the touched creature appear in its space. A creature affected by hedgehog dozen seems to have a dozen arms, shields, and weapons-a swarm of partially overlapping, identical creatures. Until the spell ends, these duplicates move with the target and mimic its actions, shifting position so it's impossible to track which image is real. You can use your action to dismiss the illusory duplicates. While surrounded by duplicates, a creature gains advantage against any opponent because of the bewildering number of weapons and movements. Each time a creature targets you with an attack during the spell's duration, roll a d8 to determine whether the attack instead targets one of your duplicates. On a roll of 1, it strikes you. On any other roll it removes one of your duplicates; when you have only five duplicates remaining, the spell ends. A creature is unaffected by this spell if it can't see, if it relies on senses other than sight, such as blindsight, or if it can perceive illusions as false as with truesight.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.189",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Warlock",
    "school": "illusion",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "hypnagogia",
  "fields": {
    "name": "Hypnagogia",
    "desc": "You alter the mental state of one creature you can see within range. The target must make an Intelligence saving throw. If it fails, choose one of the following effects. At the end of each of its turns, the target can make another Intelligence saving throw. On a success, the spell ends on the target. A creature with an Intelligence score of 4 or less isn't affected by this spell.\n  ***Sleep Paralysis.*** Overwhelming heaviness and fatigue overcome the creature, slowing it. The creature's speed is halved, and it has disadvantage on weapon attacks.\n  ***Phantasmata.*** The creature imagines vivid and terrifying hallucinations centered on a point of your choice within range. For the duration, the creature is frightened, and it must take the Dash action and move away from the point you chose by the safest available route on each of its turns, unless there is nowhere to move.\n  ***False Awakening.*** The creature enters a trancelike state of consciousness in which it's not fully aware of its surroundings. It can't take reactions, and it must roll a d4 at the beginning of its turn to determine its behavior. Each time the target takes damage, it makes a new Intelligence saving throw. On a success, the spell ends on the target.\n\n| d4  | Behavior  | \n|-----|-----------| \n| 1   | The creature takes the Dash action and uses all of its movement to move in a random direction. To determine the direction, roll a d8 and assign a direction to each die face.  | \n| 2   | The creature uses its action to pantomime preparing for its day: brushing teeth and hair, bathing, eating, or similar activity.  | \n| 3   | The creature moves up to its speed toward a randomly determined creature and uses its action to make one melee attack against that creature. If there is no creature within range, the creature does nothing this turn. | \n| 4   | The creature does nothing this turn. |",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.189",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Bard, Cleric, Druid, Wizard",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "90 Feet",
    "target_range_sort": 90,
    "requires_verbal_components": false,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "hypnic-jerk",
  "fields": {
    "name": "Hypnic Jerk",
    "desc": "Strange things happen in the mind and body in that moment between waking and sleeping. One of the most common is being startled awake by a sudden feeling of falling. With a snap of your fingers, you trigger that sensation in a creature you can see within range. The target must succeed on a Wisdom saving throw or take 1d6 force damage. If the target fails the saving throw by 5 or more, it drops one object it is holding. A dropped object lands in the creature's space.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.189",
    "page_no": null,
    "page": "",
    "spell_level": 0,
    "dnd_class": "Bard, Wizard",
    "school": "illusion",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": false,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "inconspicuous-facade",
  "fields": {
    "name": "Inconspicuous Facade",
    "desc": "By means of this spell, you make a target building seem much less important or ostentatious than it is. You can give the target an unremarkable appearance or one that blends in with nearby buildings. By its nature, this spell does not allow you to specify features that would make the building stand out. You also cannot make a building look more opulent to match surrounding buildings. You can make the building appear smaller or larger that its actual size to better fit into its environs. However, these size changes are noticeable with cursory physical inspection as an object will pass through extra illusory space or bump into a seemingly smaller section of the building. A creature can use its action to inspect the building and make an Intelligence (Investigation) check against your spell save DC. If it succeeds, it becomes aware the building has been disguised. In addition to you dispelling inconspicuous facade, the spell ends if the target building is destroyed.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.190",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Wizard, Sorceror",
    "school": "illusion",
    "casting_time": "1 minute",
    "range": "100 Feet",
    "target_range_sort": 100,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Until dispelled",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "march-of-the-dead",
  "fields": {
    "name": "March of the Dead",
    "desc": "This spell animates the recently dead to remove them from a battlefield. Choose one corpse of a Medium or Small humanoid per level of the caster (within range). Your spell imbues the targets with an animating spirit, raising them as construct creatures similar in appearance to flesh golems, though with the strength and abilities of zombies. Dwarves use this to return the bodies of the fallen to clan tombs and to deny the corpses the foul attention of ghouls, necromancers, and similar foes. On each of your turns, you can use a bonus action to mentally command all the creatures you made with this spell if the creatures are within 60 feet of you. You decide what action the creatures will take and where they will move during the next day; you cannot command them to guard. If you issue no commands, the creatures only defend themselves against hostile creatures. Once given an order and direction of march, the creatures continue to follow it until they arrive at the destination you named or until 24 hours have elapsed when the spell ends and the corpses fall lifeless once more. To tell creatures to move for another 24 hours, you must cast this spell on the creatures again before the current 24-hour period ends. This use of the spell reasserts your control over up to 50 creatures you have animated with this spell rather than animating a new one.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.190",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Warlock",
    "school": "necromancy",
    "casting_time": "1 minute",
    "range": "50 Feet",
    "target_range_sort": 50,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, you animate or reassert control over two additional construct creatures for each slot level above 3rd (two creatures/level at 4th, three creatures/level at 5th). Each of the creatures must come from a different corpse.",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "mind-maze",
  "fields": {
    "name": "Mind Maze",
    "desc": "Choose a creature you can see within range. It must succeed on an Intelligence saving throw or be mentally trapped in an imagined maze of mirrors for the duration. While trapped in this way, the creature is incapacitated, but it imagines itself alone and wandering through the maze. Externally, it appears dazed as it turns in place and reaches out at nonexistent barriers. Each time the target takes damage, it makes another Intelligence saving throw. On a success, the spell ends.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.191",
    "page_no": null,
    "page": "",
    "spell_level": 6,
    "dnd_class": "Bard, Cleric, Wizard",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "mirror-realm",
  "fields": {
    "name": "Mirror Realm",
    "desc": "You transform a mirror into a magical doorway to an extradimensional realm. You and any creatures you designate when you cast the spell can move through the doorway into the realm beyond. For the spell's duration, the mirror remains anchored in the plane of origin, where it can't be broken or otherwise damaged by any mundane means. No creatures other than those you designate can pass through the mirror or see into the mirror realm.\n  The realm within the mirror is an exact reflection of the location you left. The temperature is comfortable, and any environmental threats (lava, poisonous gas, or similar) are inert, harmless facsimiles of the real thing. Likewise, magic items reflected in the mirror realm have no magical properties, but those carried into it work normally. Food, drink, and other beneficial items within the mirror realm (reflections of originals in the real world) function as normal, real items; food can be eaten, wine can be drunk, and so on. Only items that were reflected in the mirror at the moment the spell was cast exist inside the mirror realm. Items placed in front of the mirror afterward don't appear in the mirror realm, and creatures never do unless they are allowed in by you. Items found in the mirror realm dissolve into nothingness when they leave it, but the effects of food and drink remain.\n  Sound passes through the mirror in both directions. Creatures in the mirror realm can see what's happening in the world, but creatures in the world see only what the mirror reflects. Objects can cross the mirror boundary only while worn or carried by a creature, and spells can't cross it at all. You can't stand in the mirror realm and shoot arrows or cast spells at targets in the world or vice versa.\n  The boundaries of the mirror realm are the same as the room or location in the plane of origin, but the mirror realm can't exceed 50,000 square feet (for simplicity, imagine 50 cubes, each cube being 10 feet on a side). If the original space is larger than this, such as an open field or a forest, the boundary is demarcated with an impenetrable, gray fog.\n  Any creature still inside the mirror realm when the spell ends is expelled through the mirror into the nearest empty space.\n  If this spell is cast in the same spot every day for a year, it becomes permanent. Once permanent, the mirror can't be moved or destroyed through mundane means. You can allow new creatures into the mirror realm (and disallow previous creatures) by recasting the spell within range of the permanent mirror. Casting the spell elsewhere doesn't affect the creation or the existence of a permanent mirror realm; a determined spellcaster could have multiple permanent mirror realms to use as storage spaces, hiding spots, and spy vantages.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.192",
    "page_no": null,
    "page": "",
    "spell_level": 7,
    "dnd_class": "Bard, Sorceror, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "90 Feet",
    "target_range_sort": 90,
    "requires_verbal_components": false,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": true,
    "duration": "24 hours",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "obfuscate-object",
  "fields": {
    "name": "Obfuscate Object",
    "desc": "While you are in dim light, you cause an object in range to become unobtrusively obscured from the sight of other creatures. For the duration, you have advantage on Dexterity (Sleight of Hand) checks to hide the object. The object can't be larger than a shortsword, and it must be on your person, held in your hand, or otherwise unattended.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.192",
    "page_no": null,
    "page": "",
    "spell_level": 0,
    "dnd_class": "Warlock, Bard",
    "school": "illusion",
    "casting_time": "1 bonus action",
    "range": "10 Feet",
    "target_range_sort": 10,
    "requires_verbal_components": false,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "You can affect two objects when you reach 5th level, three objects at 11th level, and four objects at 17th level.",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "order-of-revenge",
  "fields": {
    "name": "Order of Revenge",
    "desc": "You touch a weapon or a bundle of 30 ammunition, imbuing them with spell energy. Any creature damaged by a touched, affected weapon leaves an invisibly glowing trail of their path until the spell expires. The caster may see this trail by casting revenge's eye or see invisible. Any other caster may see the trail by casting see invisible. Casting dispel magic on an affected creature causes that creature to stop generating a trail, and the trail fades over the next hour.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.192",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Warlock",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast the spell using a slot of 4th level or higher, you can target one additional weapon or bundle of ammunition for each slot level above fourth.",
    "can_be_cast_as_ritual": false,
    "duration": "1 hour/caster level",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "pierce-the-veil",
  "fields": {
    "name": "Pierce the Veil",
    "desc": "By sketching a shimmering, ethereal doorway in the air and knocking three times, you call forth an otherworldly entity to provide insight or advice. The door swings open and the entity, wreathed in shadow or otherwise obscured, appears at the threshold. It answers up to five questions truthfully and to the best of its ability, but its answers aren't necessarily clear or direct. The entity can't pass through the doorway or interact with anything on your side of the doorway other than by speaking its responses.\n  Likewise, creatures on your side of the doorway can't pass through it to the other side or interact with the other side in any way other than asking questions. In addition, the spell allows you and the creature to understand each other's words even if you have no language in common, the same as if you were both under the effects of the comprehend languages spell.\n  When you cast this spell, you must request a specific, named entity, a specific type of creature, or a creature from a specific plane of existence. The target creature can't be native to the plane you are on when you cast the spell. After making this request, make an ability check using your spellcasting ability. The DC is 12 if you request a creature from a specific plane; 16 if you request a specific type of creature; or 20 if you request a specific entity. (The GM can choose to make this check for you secretly.) If the spellcasting check fails, the creature that responds to your summons is any entity of the GM's choosing, from any plane. No matter what, the creature is always of a type with an Intelligence of at least 8 and the ability to speak and to hear.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.193",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Cleric, Paladin, Warlock, Wizard",
    "school": "divination",
    "casting_time": "1 minute",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": true,
    "duration": "10 minutes",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "pratfall",
  "fields": {
    "name": "Pratfall",
    "desc": "You cause a small bit of bad luck to befall a creature, making it look humorously foolish. You create one of the following effects within range: A small, oily puddle appears under the feet of your target, causing it to lose balance. The target must succeed on a Dexterity saving throw or be unable use a bonus action on its next turn as it regains its footing. Tiny particles blow in your target's face, causing it to sneeze. The target must succeed on a Constitution saving throw or have disadvantage on its first attack roll on its next turn. Strobing lights flash briefly before your target's eyes, causing difficulties with its vision. The target must succeed on a Constitution saving throw or its passive Perception is halved until the end of its next turn. The target feels the sensation of a quick, mild clap against its ears, briefly disorienting it. The target must succeed on a Constitution saving throw to maintain its concentration. An invisible force sharply tugs on the target's trousers, causing the clothing to slip down. The target must make a Dexterity saving throw. On a failed save, the target has disadvantage on its next attack roll with a two-handed weapon or loses its shield bonus to its Armor Class until the end of its next turn as it uses one hand to gather its slipping clothing. Only one of these effects can be used on a single creature at a time.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.193",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Wizard, Warlock, Sorceror, Bard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "putrescent-faerie-circle",
  "fields": {
    "name": "Putrescent Faerie Circle",
    "desc": "You create a 20-foot-diameter circle of loosely-packed toadstools that spew sickly white spores and ooze a tarry substance. At the start of each of your turns, each creature within the circle must make a Constitution saving throw. A creature takes 4d8 necrotic damage on a failed save, or half as much damage on a successful one. If a creature attempts to pass through the ring of toadstools, the toadstools release a cloud of spores, and the creature must make a Constitution saving throw. On a failure, the creature takes 8d8 poison damage and is poisoned for 1 minute. On a success, the creature takes half as much damage and isn't poisoned. While a creature is poisoned, it is paralyzed. It can attempt a new Constitution saving throw at the end of each of its turns to remove the paralyzed condition (but not the poisoned condition).",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.194",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Druid, Cleric",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "reassemble",
  "fields": {
    "name": "Reassemble",
    "desc": "You touch an undead creature (dust and bones suffice) destroyed not more than 10 hours ago; the creature is surrounded by purple fire for 1 round and is returned to life with full hit points. This spell has no effect on any creatures except undead, and it cannot restore a lich whose phylactery has been destroyed, a vampire destroyed by sunlight, any undead whose remains are destroyed by fire, acid, or holy water, or any remains affected by a gentle repose spell. This spell doesn't remove magical effects. If they aren't removed prior to casting, they return when the undead creature comes back to life. This spell closes all mortal wounds but doesn't restore missing body parts. If the creature doesn't have body parts or organs necessary for survival, the spell fails. Sudden reassembly is an ordeal involving enormous expenditure of necrotic energy; ley line casters within 5 miles are aware that some great shift in life forces has occurred and a sense of its direction. The target takes a -4 penalty to all attacks, saves, and ability checks. Every time it finishes a long rest, the penalty is reduced by 1 until it disappears.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.194",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Wizard, Cleric",
    "school": "necromancy",
    "casting_time": "1 hour",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "reciprocating-portal",
  "fields": {
    "name": "Reciprocating Portal",
    "desc": "With a gesture and a muttered word, you cause an inky black, circular portal to open on the ground beneath one or more creatures. You can create one 15-foot-diameter portal, two 10-foot-diameter portals, or six 5-foot-diameter portals. A creature that's standing where you create a portal must make a Dexterity saving throw. On a failed save, the creature falls through the portal, disappears into a demiplane where it is stunned as it falls endlessly, and the portal closes.\n  At the start of your next turn, the creatures that failed their saving throws fall through matching portals directly above their previous locations. A falling creature lands prone in the space it once occupied or the nearest unoccupied space and takes falling damage as if it fell 60 feet, regardless of the distance between the exit portal and the ground. Flying and levitating creatures can't be affected by this spell.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.195",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Warlock, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "remove-insulation",
  "fields": {
    "name": "Remove Insulation",
    "desc": "You target a creature within range, and that creature must succeed on a Fortitude saving throw or become less resistant to lightning damage. A creature with immunity to lightning damage has advantage on this saving throw. On a failure, a creature with immunity to lightning damage instead has resistance to lightning damage for the spell's duration, and a creature with resistance to lightning damage loses its resistance for the duration. A creature without resistance to lightning damage that fails its saving throw takes double damage from lightning for the spell's duration. Remove curse or similar magic ends this spell.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.195",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Warlock",
    "school": "necromancy",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "If you cast this spell using a spell slot of 6th level or higher, the duration is 24 hours. If you use a spell slot of 8th level or higher, a creature with immunity to lightning damage no longer has advantage on its saving throw. If you use a spell slot of 9th level or higher, the spell lasts until it is dispelled.",
    "can_be_cast_as_ritual": false,
    "duration": "8 Hours",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "revenges-eye",
  "fields": {
    "name": "Revenge's Eye",
    "desc": "You touch a creature's visual organs and grant them the ability to see the trail left by creatures damaged by a weapon you cast invisible creatures; it only reveals trails left by those affected by order of revenge also cast by the spellcaster.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.196",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Warlock",
    "school": "divination",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can target +1 creature for each slot level above second.",
    "can_be_cast_as_ritual": false,
    "duration": "1 Hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "rise-of-the-green",
  "fields": {
    "name": "Rise of the Green",
    "desc": "The spell gives life to existing plants in range. If there are no plants in range, the spell creates undergrowth and trees that persist for the duration. One of the trees becomes a treant friendly to you and your companions. Roll initiative for the treant, which has its own turn. It obeys any verbal commands that you issue to it. If you don't issue it any commands, it defends itself from hostile creatures but otherwise takes no actions. The animated undergrowth creates difficult terrain for your enemies. Additionally, at the beginning of each of your turns, all creatures that are on the ground in range must succeed on a Strength saving throw or become restrained until the spell ends. A restrained creature can use an action to make a Strength (Athletics) check against your spell save DC, ending the effect on itself on a success. If a creature is restrained by plants at the beginning of your turn, it takes 1d6 bludgeoning damage. Finally, the trees swing at each enemy in range, requiring each creature to make a Dexterity saving throw. A creature takes 6d6 bludgeoning damage on a failed save or half as much damage on a successful one. You can use a bonus action to recenter the spell on yourself. This does not grow additional trees in areas that previously had none.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.196",
    "page_no": null,
    "page": "",
    "spell_level": 8,
    "dnd_class": "Druid",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "180 Feet",
    "target_range_sort": 180,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a 9th-level slot, an additional tree becomes a treant, the undergrowth deals an additional 1d6 bludgeoning damage, and the trees inflict an additional 2d6 bludgeoning damage.",
    "can_be_cast_as_ritual": false,
    "duration": "10 Minutes",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "rive",
  "fields": {
    "name": "Rive",
    "desc": "You pull on the filaments of transition and possibility to tear at your enemies. Choose a creature you can see within range and make a ranged spell attack. On a hit, the target takes 5d8 cold damage as strands of icy nothingness whip from your outstretched hand to envelop it. If the target isn't native to the plane you're on, it takes an extra 3d6 psychic damage and must succeed on a Constitution saving throw or be stunned until the end of its next turn.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.197",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Cleric, Druid, Warlock, Wizard",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": false,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "shadow-adaptation",
  "fields": {
    "name": "Shadow Adaptation",
    "desc": "Your flesh and clothing pale and become faded as your body takes on a tiny fragment of the Shadow Realm. For the duration of this spell, you are immune to shadow corruption and have resistance to necrotic damage. In addition, you have advantage on saving throws against effects that reduce your Strength score or hit point maximum, such as a shadow's Strength Drain or the harm spell.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.197",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Wizard, Warlock, Sorceror",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "8 Hours",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "skull-road",
  "fields": {
    "name": "Skull Road",
    "desc": "You conjure a portal linking an unoccupied space you can see within range to an imprecise location on the plane of Evermaw. The portal is a circular opening, which you can make 5-20 feet in diameter. You can orient the portal in any direction you choose. The portal lasts for the duration. If your casting is at 5th level, this opens a pathway to the River of Tears, to the Vitreous Mire, or to the Plains of Bone-travel to a settlement can take up to 7 days (1d6+1). If cast at 7th level, the skull road spell opens a portal to a small settlement of gnolls, ghouls, or shadows on the plane near the Eternal Palace of Mot or a similar settlement. Undead casters can use this spell in the reverse direction, opening a portal from Evermaw to the mortal world, though with similar restrictions. At 5th level, the portal opens in a dark forest, cavern, or ruins far from habitation. At 7th level, the skull road leads directly to a tomb, cemetery, or mass grave near a humanoid settlement of some kind.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.198",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Wizard, Cleric",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "storm-of-axes",
  "fields": {
    "name": "Storm of Axes",
    "desc": "Deep Magic: battle You conjure up dozens of axes and direct them in a pattern in chopping, whirling mayhem. The blades fill eight 5-foot squares in a line 40 feet long or in a double-strength line 20 feet long and 10 deep. The axes cause 6d8 slashing damage to creatures in the area at the moment the spell is cast or half damage with a successful Dexterity saving throw. By maintaining concentration, you can move the swarm of axes up to 20 feet per round in any direction you wish. If the storm of axes moves into spaces containing creatures, they immediately must make another Dexterity saving throw or suffer damage again.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.198",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Warlock",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "25 Feet",
    "target_range_sort": 25,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Concentration + 1 round",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "subliminal-aversion",
  "fields": {
    "name": "Subliminal Aversion",
    "desc": "You ward a creature within range against attacks by making the choice to hit them painful. When the warded creature is hit with a melee attack from within 5 feet of it, the attacker takes 1d4 psychic damage.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.199",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Bard, Cleric, Druid, Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "summon-clockwork-beast",
  "fields": {
    "name": "Summon Clockwork Beast",
    "desc": "Deep Magic: clockwork Once per day, you can cast this ritual to summon a Tiny clockwork beast doesn't require air, food, drink, or sleep. When its hit points are reduced to 0, it crumbles into a heap of gears and springs.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.199",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Warlock",
    "school": "conjuration",
    "casting_time": "10 minutes",
    "range": "10 Feet",
    "target_range_sort": 10,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": true,
    "duration": "1 Hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "suppress-regeneration",
  "fields": {
    "name": "Suppress Regeneration",
    "desc": "You temporarily remove the ability to regenerate from a creature you can see within range. The target must make a Constitution saving throw. On a failed save, the target can't regain hit points from the Regeneration trait or similar spell or trait for the duration. The target can receive magical healing or regain hit points from other traits, spells, or actions, as normal. At the end of each of its turns, the target can make another Constitution saving throw. On a success, the spell ends on the target.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.200",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Ranger, Sorceror, Warlock, Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "threshold-slip",
  "fields": {
    "name": "Threshold Slip",
    "desc": "The threshold of a doorway, the sill of a window, the junction where the floor meets the wall, the intersection of two wallsthese are all points of travel for you. When you cast this spell, you can step into the junction of two surfaces, slip through the boundary of the Material Plane, and reappear in an unoccupied space with another junction you can see within 60 feet.\n  You can take one willing creature of your size or smaller that you're touching with you. The target junction must have unoccupied spaces for both of you to enter when you reappear or the spell fails.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.200",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Druid, Warlock, Wizard",
    "school": "conjuration",
    "casting_time": "1 bonus action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "toxic-pollen",
  "fields": {
    "name": "Toxic Pollen",
    "desc": "Upon casting this spell, one type of plant within range gains the ability to puff a cloud of pollen based on conditions you supply during casting. If the conditions are met, an affected plant sprays a pollen cloud in a 10-foot-radius sphere centered on it. Creatures in the area must succeed on a Constitution saving throw or become poisoned for 1 minute. At the end of a poisoned creature's turn, it can make a Constitution saving throw. On a success, it is no longer poisoned. A plant can only release this pollen once within the duration.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.200",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Druid",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 Year",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "vagrants-nondescript-cloak",
  "fields": {
    "name": "Vagrant's Nondescript Cloak",
    "desc": "You touch a creature. The creature is warded against the effects of locate creature, the caster may determine if the affected creature is within 1,000 feet but cannot determine the direction to the target of vagrant's nondescript cloak. If the creature is already affected by one of the warded spells, then both the effect and vagrant's nondescript cloak end immediately.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.201",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Warlock",
    "school": "abjuration",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of third level or higher, you can target +1 creature for each slot level above second.",
    "can_be_cast_as_ritual": false,
    "duration": "1 Hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "vengeful-panopy-of-the-ley-line-ignited",
  "fields": {
    "name": "Vengeful Panopy of the Ley Line Ignited",
    "desc": "Deep Magic: ley line While bound to a ley line, you draw directly from its power, becoming cloaked in a magical heliotropic fire that sheds dim light in a 10-foot radius. Additionally, each round, including the round it is cast, you may make a ranged spell attack as an action. On a hit, the target takes 6d6 force damage. Every 3 minutes the effect is active, your bond with the ley line is reduced by one step; a bond to a Titanic ley line becomes effectively a Strong, then a Weak, and after 10 minutes, the bond is broken. The strength of the bond is only restored after a long rest; if the bond was broken, it can only be restored at the next weakest level for a week. A bond broken from a Weak ley line cannot be restored for two weeks. Some believe this spell damages ley lines, and there is some evidence to support this claim. Additionally, whenever a creature within 5 feet hits you with a melee attack, the cloak erupts with a heliotropic flare. The attacker takes 3d6 force damage.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.201",
    "page_no": null,
    "page": "",
    "spell_level": 6,
    "dnd_class": "Wizard, Warlock, Sorceror",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When casting this spell using a spell slot of 6th level, the damage from all effects of the spell increase by 1d6 for each slot level above 6th.",
    "can_be_cast_as_ritual": false,
    "duration": "10 Minutes",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "who-goes-there",
  "fields": {
    "name": "Who Goes There?",
    "desc": "You sift the surrounding air for sound wave remnants of recent conversations to discern passwords or other important information gleaned from a conversation, such as by guards on a picket line. The spell creates a cloud of words in the caster's mind, assigning relevance to them. Selecting the correct word or phrase is not foolproof, but you can make an educated guess. You make a Wisdom (Perception) check against the target person's Wisdom score (DC 10, if not specified) to successfully pick the key word or phrase.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.202",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Wizard",
    "school": "conjuration",
    "casting_time": "10 minutes",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "10 Minutes",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "zymurgic-aura",
  "fields": {
    "name": "Zymurgic Aura",
    "desc": "A wave of putrefaction surges from you, targeting creatures of your choice within a 30-foot radius around you, speeding the rate of decay in those it touches. The target must make a Constitution saving throw. It takes 10d6 necrotic damage on a failed save or half as much on a successful save. Its hit point maximum is reduced by an amount equal to the damage taken. This reduction lasts until the creature takes a long rest.",
    "document": 42,
    "created_at": "2023-11-05T00:01:41.202",
    "page_no": null,
    "page": "",
    "spell_level": 7,
    "dnd_class": "Druid",
    "school": "necromancy",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
}
]
