[
{
  "model": "api.spell",
  "pk": "ambush",
  "fields": {
    "name": "Ambush",
    "desc": "The forest floor swirls and shifts around you to welcome you into its embrace. While in a forest, you have advantage on Dexterity (Stealth) checks to Hide. While hidden in a forest, you have advantage on your next Initiative check. The spell ends if you attack or cast a spell.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.086",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Druid, Ranger, Sorceror, Wizard",
    "school": "illusion",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": false,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, you can affect one additional creature for each slot level above 1st. The spell ends if you or any target of this spell attacks or casts a spell.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 hour",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "blood-strike",
  "fields": {
    "name": "Blood Strike",
    "desc": "By performing this ritual, you can cast a spell on one nearby creature and have it affect a different, more distant creature. Both targets must be related by blood (no more distantly than first cousins). Neither of them needs to be a willing target. The blood strike ritual is completed first, taking 10 minutes to cast on yourself. Then the spell to be transferred is immediately cast by you on the initial target, which must be close enough to touch no matter what the spell's normal range is. The secondary target must be within 1 mile and on the same plane of existence as you. If the second spell allows a saving throw, it's made by the secondary target, not the initial target. If the saving throw succeeds, any portion of the spell that's avoided or negated by the secondary target affects the initial target instead. A creature can be the secondary target of blood strike only once every 24 hours; subsequent attempts during that time take full effect against the initial target with no chance to affect the secondary target. Only spells that have a single target can be transferred via blood stike. For example, a lesser restoration) currently affecting the initial creature and transfer it to the secondary creature, which then makes any applicable saving throw against the effect. If the saving throw fails or there is no saving throw, the affliction transfers completely and no longer affects the initial target. If the saving throw succeeds, the initial creature is still afflicted and also suffers anew any damage or conditions associated with first exposure to the affliction.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.099",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "",
    "school": "necromancy",
    "casting_time": "10 minutes",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": true,
    "duration": "Special (see below)",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "conjure-manabane-swarm",
  "fields": {
    "name": "Conjure Manabane Swarm",
    "desc": "Deep Magic: summoning You summon a swarm of manabane scarabs that has just 40 hit points. The swarm appears at a spot you choose within 60 feet and attacks the closest enemy. You can conjure the swarm to appear in an enemy's space. If you prefer, you can summon two full-strength, standard swarms of insects (including beetles, centipedes, spiders, or wasps) instead.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.086",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "curse-of-formlessness",
  "fields": {
    "name": "Curse of Formlessness",
    "desc": "A creature you touch must make a successful Constitution saving throw or be cursed with a shifting, amorphous form. Spells that change the target creature's shape (such as polymorph) do not end the curse, but they do hold the creature in a stable form, temporarily mitigating it until the end of that particular spell's duration; shapechange and stoneskin have similar effects. While under the effect of the curse of formlessness, the target creature is resistant to slashing and piercing damage and ignores the additional damage done by critical hits, but it can neither hold nor use any item, nor can it cast spells or activate magic items. Its movement is halved, and winged flight becomes impossible. Any armor, clothing, helmet, or ring becomes useless. Large items that are carried or worn, such as armor, backpacks, or clothing, become hindrances, so the target has disadvantage on Dexterity checks and saving throws while such items are in place. A creature under the effect of a curse of formlessness can try to hold itself together through force of will. The afflicted creature uses its action to repeat the saving throw; if it succeeds, the afflicted creature negates the penalties from the spell until the start of its next turn.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.087",
    "page_no": null,
    "page": "",
    "spell_level": 6,
    "dnd_class": "Wizard, Druid",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Permanent",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "delay-passing",
  "fields": {
    "name": "Delay Passing",
    "desc": "You draw forth the ebbing life force of a creature and question it. Upon casting this spell, you must touch a creature that dropped to 0 hit points since your last turn. If it fails a Wisdom saving throw, you temporarily prevent its spirit from passing into the next realm. You are able to hear the spirit, though the spirit doesn't appear to any creature without the ability to see invisible creatures. The spirit communicates directly with your psyche and cannot see or hear anything but what you tell it. You can ask the spirit a number of questions equal to your proficiency bonus. Questions must be asked directly; a delay of more than 10 seconds between the spirit answering one question and you asking another allows the spirit to escape into the afterlife. The corpse's knowledge is limited to what it knew during life, including the languages it spoke. The spirit cannot lie to you, but it can refuse to answer a question that would harm its living family or friends, or truthfully answer that it doesn't know. Once the spirit answers your allotment of questions, it passes on.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.087",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Anti-Paladin",
    "school": "necromancy",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "doom-of-ancient-decrepitude",
  "fields": {
    "name": "Doom of Ancient Decrepitude",
    "desc": "You generate an entropic field that rapidly ages every creature in the area of effect. The field covers a sphere with a 20-foot radius centered on you. Every creature inside the sphere when it's created, including you, must make a successful Constitution saving throw or gain 2 levels of exhaustion from sudden, traumatic aging. A creature that ends its turn in the field must repeat the saving throw, gaining 1 level of exhaustion per subsequent failure. You have advantage on these saving throws. An affected creature sheds 1 level of exhaustion at the end of its turn, if it started the turn outside the spell's area of effect (or the spell has ended). Only 1 level of exhaustion can be removed this way; all remaining levels are removed when the creature completes a short or long rest. A creature that died from gaining 6 levels of exhaustion, however, remains dead.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.088",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "",
    "school": "necromancy",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "doom-of-voracity",
  "fields": {
    "name": "Doom of Voracity",
    "desc": "You create a ripple of dark energy that destroys everything it touches. You create a 10-foot-radius, 10-foot-deep cylindrical extra-dimensional hole on a horizontal surface of sufficient size. Since it extends into another dimension, the pit has no weight and does not otherwise displace the original underlying material. You can create the pit in the deck of a ship as easily as in a dungeon floor or the ground of a forest. Any creature standing in the original conjured space, or on an expanded space as it grows, must succeed on a Dexterity saving throw to avoid falling in. The sloped pit edges crumble continuously, and any creature adjacent to the pit when it expands must succeed on a Dexterity saving throw to avoid falling in. Creatures subjected to a successful pushing effect (such as by a spell like incapacitated for 2 rounds. When the spell ends, creatures within the pit must make a Constitution saving throw. Those who succeed rise up with the bottom of the pit until they are standing on the original surface. Those who fail also rise up but are stunned for 2 rounds.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.088",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Wizard, Sorceror",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, increase the depth of the pit by 10 feet for each slot level above 3rd.",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "feed-the-worms",
  "fields": {
    "name": "Feed the Worms",
    "desc": "You draw forth the ebbing life force of a creature and use it to feed the worms. Upon casting this spell, you touch a creature that dropped to 0 hit points since your last turn. If it fails a Constitution saving throw, its body is completely consumed by worms in moments, leaving no remains. In its place is a swarm of worms (treat as a standard swarm of insects) that considers all other creatures except you as enemies. The swarm remains until it's killed.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.089",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Anti-Paladin",
    "school": "necromancy",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Until destroyed",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "greater-ley-protection",
  "fields": {
    "name": "Greater Ley Protection",
    "desc": "Deep Magic: forest-bound You create a 20-foot cube of antimagic within range that specifically protects against ley line magic. Ley line spells and magical effects up to level 7 that target a creature within the cube have no effect on that target. Any active ley line spells or magical effects up to level 7 on a creature or an object in the cube is suppressed while the creature or object is in it. The area of a ley line spell or magical effect up to level 7 can't extend into the cube. If the cube overlaps an area of ley line magic, such as greater ley pulse, the part of the area that is covered by the cube is suppressed. The cube has no effect on other types of magic or spells. You can exclude specific individuals within the cube from the protection.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.089",
    "page_no": null,
    "page": "",
    "spell_level": 7,
    "dnd_class": "Druid",
    "school": "abjuration",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 9th level or higher, its duration is concentration, up to 1 hour.",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "hirvsths-call",
  "fields": {
    "name": "Hirvsth's Call",
    "desc": "Deep Magic: Rothenian You summon a spectral herd of ponies to drag off a creature that you can see in range. The target must be no bigger than Large and must make a Dexterity saving throw. On a successful save, the spell has no effect. On a failed save, a spectral rope wraps around the target and pulls it 60 feet in a direction of your choosing as the herd races off. The ponies continue running in the chosen direction for the duration of the spell but will alter course to avoid impassable obstacles. Once you choose the direction, you cannot change it. The ponies ignore difficult terrain and are immune to damage. The target is prone and immobilized but can use its action to make a Strength or Dexterity check against your spell DC to escape the spectral bindings. The target takes 1d6 bludgeoning damage for every 20 feet it is dragged by the ponies. The herd moves 60 feet each round at the beginning of your turn.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.089",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Paladin, Cleric",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 5th level or higher, one additional creature can be targeted for each slot level above 4th.",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "incantation-of-lies-made-truth",
  "fields": {
    "name": "Incantation of Lies Made Truth",
    "desc": "This ritual must be cast during a solar eclipse. It can target a person, an organization (including a city), or a kingdom. If targeting an organization or a kingdom, the incantation requires an object epitomizing the entity as part of the material component, such as a crown, mayoral seal, standard, or primary relic. If targeting a person, the primary performer must hold a vial of the person's blood. Over the course of the incantation, the components are mixed and the primary caster inscribes a false history and a sum of knowledge concerning the target into the book using the mockingbird quills. When the incantation is completed, whatever the caster wrote in the book becomes known and accepted as truth by the target. The target can attempt a Wisdom saving throw to negate this effect. If the target was a city or a kingdom, the saving throw is made with advantage by its current leader or ruler. If the saving throw fails, all citizens or members of the target organization or kingdom believe the account written in the book to be fact. Any information contrary to what was written in the book is forgotten within an hour, but individuals who make a sustained study of such information can attempt a Wisdom saving throw to retain the contradictory knowledge. Books containing contradictory information are considered obsolete or purposely misleading. Permanent structures such as statues of heroes who've been written out of existence are believed to be purely artistic endeavors or so old that no one remembers their identities anymore. The effects of this ritual can be reversed by washing the written words from the book using universal solvent and then burning the book to ashes in a magical fire. Incantation of lies made truth is intended to be a villainous motivator in a campaign, with the player characters fighting to uncover the truth and reverse the spell's effect. The GM should take care not to remove too much player agency with this ritual. The creatures affected should be predominantly NPCs, with PCs and even select NPCs able to resist it. Reversing the effect of the ritual can be the entire basis of a campaign.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.090",
    "page_no": null,
    "page": "",
    "spell_level": 9,
    "dnd_class": "",
    "school": "enchantment",
    "casting_time": "9 hours",
    "range": "1000 Feet",
    "target_range_sort": 1000,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": true,
    "duration": "Permanent",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "jeweled-fissure",
  "fields": {
    "name": "Jeweled Fissure",
    "desc": "Deep Magic: dragon With a sweeping gesture, you cause jagged crystals to burst from the ground and hurtle directly upward. Choose an origin point within the spell's range that you can see. Starting from that point, the crystals burst out of the ground along a 30-foot line. All creatures in that line and up to 100 feet above it take 2d8 thunder damage plus 2d8 piercing damage; a successful Dexterity saving throw negates the piercing damage. A creature that fails the saving throw is impaled by a chunk of crystal that halves the creature's speed, prevents it from flying, and causes it to fall to the ground if it was flying. To remove a crystal, the creature or an ally within 5 feet of it must use an action and make a successful DC 13 Strength check. If the check succeeds, the impaled creature takes 1d8 piercing damage and its speed and flying ability are restored to normal.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.090",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Sorceror",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "100 Feet",
    "target_range_sort": 100,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "lesser-ley-protection",
  "fields": {
    "name": "Lesser Ley Protection",
    "desc": "Deep Magic: forest-bound You create a 10-foot cube of antimagic within range that specifically protects against ley line magic. Ley line spells and magical effects up to level 5 that target a creature within the cube have no effect on that target. Any active ley line spells or magical effects up to level 5 on a creature or an object in the cube is suppressed while the creature or object is in it. The area of a ley line spell or magical effect up to level 5 can't extend into the cube. If the cube overlaps an area of ley line magic, such as lesser ley pulse, the part of the area that is covered by the cube is suppressed. The cube has no effect on other types of magic or spells. You can exclude specific individuals within the cube from the protection.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.091",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Druid",
    "school": "abjuration",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 7th level or higher, its duration is concentration, up to 1 hour.",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "ley-disturbance",
  "fields": {
    "name": "Ley Disturbance",
    "desc": "Deep Magic: forest-bound While in your bound forest, you tune your senses to any disturbances of ley energy flowing through it. For the duration, you are aware of any ley line manipulation or ley spell casting within 5 miles of you. You know the approximate distance and general direction to each disturbance within that range, but you don't know its exact location. This doesn't allow you to locate the ley lines themselves, just any use or modification of them.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.091",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Druid",
    "school": "divination",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 Hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "locate-red-portal",
  "fields": {
    "name": "Locate Red Portal",
    "desc": "For the duration, you can sense the presence of any dimensional portals within range and whether they are one-way or two-way. If you sense a portal using this spell, you can use your action to peer through the portal to determine its destination. You gain a glimpse of the area at the other end of the shadow road. If the destination is not somewhere you have previously visited, you can make a DC 25 Intelligence (Arcana, History or Nature-whichever is most relevant) check to determine to where and when the portal leads.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.092",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Wizard",
    "school": "divination",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "10 Minutes",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "moons-respite",
  "fields": {
    "name": "Moon's Respite",
    "desc": "You touch a creature who must be present for the entire casting. A beam of moonlight shines down from above, bathing the target in radiant light. The spell fails if you can't see the open sky. If the target has any levels of shadow corruption, the moonlight burns away some of the Shadow tainting it. The creature must make a Constitution saving throw against a DC of 10 + the number of shadow corruption levels it has. The creature takes 2d10 radiant damage per level of shadow corruption and removes 1 level of shadow corruption on a failed saving throw, or half as much damage and removes 2 levels of shadow corruption on a success.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.092",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "",
    "school": "abjuration",
    "casting_time": "1 hour",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": true,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "morphic-flux",
  "fields": {
    "name": "Morphic Flux",
    "desc": "When you cast this spell, your body becomes highly mutable, your flesh constantly shifting and quivering, occasionally growing extra parts-limbs and eyes-only to reabsorb them soon afterward. While under the effect of this spell, you have resistance to slashing and piercing damage and ignore the additional damage done by critical hits. You can squeeze through Tiny spaces without penalty. In addition, once per round, as a bonus action, you can make an unarmed attack with a newly- grown limb. Treat it as a standard unarmed attack, but you choose whether it does bludgeoning, piercing, or slashing damage.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.092",
    "page_no": null,
    "page": "",
    "spell_level": 7,
    "dnd_class": "Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "open-red-portal",
  "fields": {
    "name": "Open Red Portal",
    "desc": "You must tap the power of a titanic or strong ley line to cast this spell (see the Ley Initiate feat). You open a new two-way Red Portal on the shadow road, leading to a precise location of your choosing on any plane of existence. If located on the Prime Material Plane, this destination can be in the present day or up to 1,000 years in the past. The portal lasts for the duration. Deities and other planar rulers can prevent portals from opening in their presence or anywhere within their domains.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.093",
    "page_no": null,
    "page": "",
    "spell_level": 9,
    "dnd_class": "Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "10 Minutes",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "peruns-doom",
  "fields": {
    "name": "Perun's Doom",
    "desc": "Deep Magic: Rothenian A powerful wind swirls from your outstretched hand toward a point you choose within range, where it explodes with a low roar into vortex of air. Each creature in a 20-foot-radius cylinder centered on that point must make a Strength saving throw. On a failed save, the creature takes 3d8 bludgeoning damage, is pulled to the center of the cylinder, and thrown 50 feet upward into the air. If a creature hits a solid obstruction, such as a stone ceiling, when it's thrown upward, it takes bludgeoning damage as if it had fallen (50 feet - the distance it's traveled upward). For example, if a creature hits the ceiling after rising only 10 feet, it takes bludgeoning damage as if it had fallen (50 feet - 10 feet =) 40 feet, or 4d6 bludgeoning damage.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.093",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Wizard, Sorceror, Druid",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, increase the distance affected creatures are thrown into the air by 10 feet for each slot above 3rd.",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "reset-red-portal",
  "fields": {
    "name": "Reset Red Portal",
    "desc": "When you cast this spell, you can reset the destination of a Red Portal within range, diverting the shadow road so it leads to a location of your choosing. This destination must be in the present day. You can specify the target destination in general terms such as the City of the Fire Snakes, Mammon's home, the Halls of Avarice, or in the Eleven Hells, and anyone stepping through the portal while the spell is in effect will appear in or near that destination. If you reset the destination to the City of the Fire Snakes, for example, the portal might now lead to the first inner courtyard inside the city, or to the marketplace just outside at the GM's discretion. Once the spell's duration expires, the Red Portal resets to its original destination (50% chance) or to a new random destination (roll on the Destinations table).",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.094",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "10 Feet",
    "target_range_sort": 10,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 6th level or higher, you can specify a destination up to 100 years in the past for each slot level beyond 5th.",
    "can_be_cast_as_ritual": false,
    "duration": "1 Hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "sanguine-spear",
  "fields": {
    "name": "Sanguine Spear",
    "desc": "You draw blood from the corpse of a creature that has been dead for no more than 24 hours and magically fashion it into a spear of frozen blood. This functions as a +1 spear that does cold damage instead of piercing damage. If the spear leaves your hand for more than 1 round, it melts and the spell ends.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.094",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Wizard, Sorceror",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "If the spell is cast with a 4th-level spell slot, it creates a +2 spear. A 6th-level spell slot creates a +3 spear.",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "scattered-images",
  "fields": {
    "name": "Scattered Images",
    "desc": "When you cast this spell, you create illusory doubles that move when you move but in different directions, distracting and misdirecting your opponents. When scattered images is cast, 1d4 + 2 images are created. Images behave exactly as those created with mirror image, with the exceptions described here. These images remain in your space, acting as invisible or the attacker is blind, the spell has no effect.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.094",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "",
    "school": "illusion",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 Minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "seal-red-portal",
  "fields": {
    "name": "Seal Red Portal",
    "desc": "You seal a Red Portal or other dimensional gate within range, rendering it inoperable until this spell is dispelled. While the portal remains sealed in this way, it cannot be found with the locate Red Portal spell.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.095",
    "page_no": null,
    "page": "",
    "spell_level": 6,
    "dnd_class": "Wizard",
    "school": "abjuration",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Until dispelled",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "selfish-wish",
  "fields": {
    "name": "Selfish Wish",
    "desc": "The selfish wish grants the desires of a supplicant in exchange for power. Like a wish for a great increase in Strength may come with an equal reduction in Intelligence). In exchange for casting the selfish wish, the caster also receives an influx of power. The caster receives the following bonuses for 2 minutes: Doubled speed one extra action each round (as haste) Armor class increases by 3",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.095",
    "page_no": null,
    "page": "",
    "spell_level": 9,
    "dnd_class": "Wizard, Sorceror",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "shadow-spawn",
  "fields": {
    "name": "Shadow Spawn",
    "desc": "Casting this spell consumes the corpse of a creature and creates a shadowy duplicate of it. The creature returns as a shadow beast. The shadow beast has dim memories of its former life and retains free will; casters are advised to be ready to make an attractive offer to the newly-risen shadow beast, to gain its cooperation.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.096",
    "page_no": null,
    "page": "",
    "spell_level": 6,
    "dnd_class": "Wizard, Sorceror, Cleric",
    "school": "illusion",
    "casting_time": "4 hours",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "shadow-tree",
  "fields": {
    "name": "Shadow Tree",
    "desc": "This spell temporarily draws a willow tree from the Shadow Realm to the location you designate within range. The tree is 5 feet in diameter and 20 feet tall.\n  When you cast the spell, you can specify individuals who can interact with the tree. All other creatures see the tree as a shadow version of itself and can't grasp or climb it, passing through its shadowy substance. A creature that can interact with the tree and that has Sunlight Sensitivity or Sunlight Hypersensitivity is protected from sunlight while within 20 feet of the tree. A creature that can interact with the tree can climb into its branches, giving the creature half cover.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.096",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Druid, Ranger, Sorceror, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "10 minutes",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "shadows-brand",
  "fields": {
    "name": "Shadow's Brand",
    "desc": "You draw a rune or inscription no larger than your hand on the target. The target must succeed on a Constitution saving throw or be branded with the mark on a location of your choosing. The brand appears as an unintelligible mark to most creatures. Those who understand the Umbral language recognize it as a mark indicating the target is an enemy of the shadow fey. Shadow fey who view the brand see it outlined in a faint glow. The brand can be hidden by mundane means, such as clothing, but it can be removed only by the *remove curse* spell.\n  While branded, the target has disadvantage on ability checks when interacting socially with shadow fey.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.097",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Bard, Cleric, Ranger, Sorceror, Warlock, Wizard",
    "school": "necromancy",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": false,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Until dispelled",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "stigmata-of-the-red-goddess",
  "fields": {
    "name": "Stigmata of the Red Goddess",
    "desc": "You cut yourself and bleed as tribute to Marena, gaining power as long as the blood continues flowing. The stigmata typically appears as blood running from the eyes or ears, or from wounds manifesting on the neck or chest. You take 1 piercing damage at the beginning of each turn and gain a +2 bonus on damage rolls. Any healing received by you, magical or otherwise, ends the spell.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.097",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Wizard, Cleric",
    "school": "necromancy",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage you take at the start of each of your turns and the bonus damage you do both increase by 1 for each slot level above 2nd, and the duration increases by 1 round for each slot level above 2nd.",
    "can_be_cast_as_ritual": false,
    "duration": "3 Rounds",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "the-black-gods-blessing",
  "fields": {
    "name": "The Black God's Blessing",
    "desc": "Chernobog doesn't care that the Night Cauldron only focuses on one aspect of his dominion. After all, eternal night leads perfectly well to destruction and murder, especially by the desperate fools seeking to survive in the new, lightless world. Having devotees at the forefront of the mayhem suits him, so he allows a small measure of his power to infuse worthy souls. After contacting the Black God, the ritual caster makes a respectful yet forceful demand for him to deposit some of his power into the creature that is the target of the ritual. For Chernobog to comply with this demand, the caster must make a successful DC 20 spellcasting check. If the check fails, the spell fails and the caster and the spell's target become permanently vulnerable to fire; this vulnerability can be ended with remove curse or comparable magic. If the spell succeeds, the target creature gains darkvision (60 feet) and immunity to cold. Chernobog retains the privilege of revoking these gifts if the recipient ever wavers in devotion to him.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.097",
    "page_no": null,
    "page": "",
    "spell_level": 9,
    "dnd_class": "Wizard, Sorceror",
    "school": "transmutation",
    "casting_time": "7 hours",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": true,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "wield-soul",
  "fields": {
    "name": "Wield Soul",
    "desc": "You draw forth the ebbing life force of a creature and use its arcane power. Upon casting this spell, you must touch a creature that dropped to 0 hit points since your last turn. If it fails a Wisdom saving throw, you gain knowledge of spells, innate spells, and similar abilities it could have used today were it still alive. Expended spells and abilities aren't revealed. Choose one of these spells or abilities with a casting time no longer than 1 action. Until you complete a long rest, you can use this spell or ability once, as a bonus action, using the creature's spell save DC or spellcasting ability bonus.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.098",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Anti-Paladin",
    "school": "necromancy",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "winged-spies",
  "fields": {
    "name": "Winged Spies",
    "desc": "This spell summons a swarm of ravens or other birds-or a swarm of bats if cast at night or underground-to serve you as spies. The swarm moves out as you direct, but it won't patrol farther away than the spell's range. Commands must be simple, such as “search the valley to the east for travelers” or “search everywhere for humans on horses.” The GM can judge how clear and effective your instructions are and use that estimation in determining what the spies report. You can recall the spies at any time by whispering into the air, but the spell ends when the swarm returns to you and reports. You must receive the swarm's report before the spell expires, or you gain nothing. The swarm doesn't fight for you; it avoids danger if possible but defends itself if it must. You know if the swarm is destroyed, and the spell ends.",
    "document": 40,
    "created_at": "2023-11-05T00:01:41.098",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "",
    "school": "divination",
    "casting_time": "1 action",
    "range": "10 Miles",
    "target_range_sort": 52800,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "10 Hours",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
}
]
