[
{
  "model": "api_v2.backgroundbenefit",
  "pk": 24,
  "fields": {
    "name": "Skill Proficiencies",
    "desc": "Religion, and either Insight or Persuasion.",
    "type": "skill_proficiency",
    "background": "a5e-acolyte"
  }
},
{
  "model": "api_v2.backgroundbenefit",
  "pk": 25,
  "fields": {
    "name": "Languages",
    "desc": "One of your choice.",
    "type": "language",
    "background": "a5e-acolyte"
  }
},
{
  "model": "api_v2.backgroundbenefit",
  "pk": 26,
  "fields": {
    "name": "Equipment",
    "desc": "Holy symbol (amulet or reliquary), common clothes, robe, and a prayer book, prayer wheel, or prayer beads.",
    "type": "equipment",
    "background": "a5e-acolyte"
  }
},
{
  "model": "api_v2.backgroundbenefit",
  "pk": 27,
  "fields": {
    "name": "Ability Score Increases",
    "desc": "+1 to Wisdom and one other ability score.",
    "type": "ability_score_increase",
    "background": "a5e-acolyte"
  }
},
{
  "model": "api_v2.backgroundbenefit",
  "pk": 28,
  "fields": {
    "name": "Adventures and Advancement",
    "desc": "In small settlements without other resources, your authority may extend to such matters as settling disputes and punishing criminals. You might also be expected to deal with local outbreaks of supernatural dangers such as fiendish possessions, cults, and the unquiet dead. \r\nIf you solve several problems brought to you by members of your faith, you may be promoted (or reinstated) within the hierarchy of your order. You gain the free service of up to 4 acolytes, and direct access to your order’s leaders.",
    "type": null,
    "background": "a5e-acolyte"
  }
},
{
  "model": "api_v2.backgroundbenefit",
  "pk": 29,
  "fields": {
    "name": "Memento",
    "desc": "Roll 1d10, choose, or make up your own.\r\n\r\n| d10 | Acolyte Memento |\r\n|---|---|\r\n| 1 | The timeworn holy symbol bequeathed to you by your beloved mentor on their deathbed. |\r\n| 2 | A precious holy relic secretly passed on to you in a moment of great danger. |\r\n| 3 | A prayer book which contains strange and sinister deviations from the accepted liturgy. |\r\n| 4 |  A half-complete book of prophecies which seems to hint at danger for your faith—if only the other half could be found! |\r\n| 5 |  A gift from a mentor: a book of complex theology which you don’t yet understand. |\r\n| 6 |  Your only possession when you entered the temple as a child: a signet ring bearing a coat of arms. |\r\n| 7 |  A strange candle which never burns down. |\r\n| 8 |  The true name of a devil that you glimpsed while tidying up papers for a sinister visitor. |\r\n| 9 |  A weapon (which seems to exhibit no magical properties) given to you with great solemnity by your mentor. |\r\n| 10 | A much-thumbed and heavily underlined prayer book given to you by the fellow acolyte you admire most. |",
    "type": "memento",
    "background": "a5e-acolyte"
  }
}
]
