[
{
  "model": "api_v2.background",
  "pk": "a5e-acolyte",
  "fields": {
    "name": "Acolyte",
    "desc": "Acolyte",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "artisan",
  "fields": {
    "name": "Artisan",
    "desc": "You are skilled enough in a trade to make a comfortable living and to aspire to mastery of your art. Yet here you are, ready to slog through mud and blood and danger.\r\n\r\nWhy did you become an adventurer? Did you flee a cruel master? Were you bored? Or are you a member in good standing, looking for new materials and new markets?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "charlatan",
  "fields": {
    "name": "Charlatan",
    "desc": "People call you a con artist, but you're really an entertainer. You make people happy—the separation of fools and villains from their money is purely a pleasant side effect.\r\n\r\nWhat is your most common con? Selling fake magic items? Speaking to ghosts? Posing as a long-lost relative? Or do you let dishonest people think they're cheating you?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "criminal",
  "fields": {
    "name": "Criminal",
    "desc": "As a career criminal you were acquainted with murderers, thieves, and those who hunt them. Your new career as an adventurer is, relatively speaking, an honest trade.\r\n\r\nWere you a pickpocket? An assassin? A back-alley mugger? Are you still?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "cultist",
  "fields": {
    "name": "Cultist",
    "desc": "None",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "entertainer",
  "fields": {
    "name": "Entertainer",
    "desc": "You're a performer who knows how to dazzle a crowd, an artist but also a professional: you never forget to pass the hat after a show.\r\n\r\nAre you a lute-strumming singer? An actor? A poet or author? A tumbler or juggler? Are you a rising talent, or a star with an established following?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "exile",
  "fields": {
    "name": "Exile",
    "desc": "Your homeland is barred to you and you wander strange lands. You will never be mistaken for a local but you find ready acceptance among other adventurers, many of which are as rootless as you are.\r\n\r\nAre you a banished noble? A refugee from war or from an undead uprising? A dissident or a criminal on the run? Or a stranded traveler from an unreachable distant land?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "farmer",
  "fields": {
    "name": "Farmer",
    "desc": "You were raised a farmer, an occupation where the money is short and the work days are long. You've become an adventurer, a career where the money is plentiful but your days—if you're not careful—may be all too short.\r\n\r\nWhy did you beat your plowshare into a sword? Do you seek adventure, excitement, or revenge? Do you leave behind a thriving farmstead or a smoking ruin?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "folk-hero",
  "fields": {
    "name": "Folk Hero",
    "desc": "You were born to a commoner family, but some event earned you fame. You're admired locally, and tales of your deeds have reached the far corners of the world.\r\n\r\nDid you win your fame by battling an oppressive tyrant? Saving your village from a monster? Or by something more prosaic like winning a wrestling bout or a pie-eating contest?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "gambler",
  "fields": {
    "name": "Gambler",
    "desc": "You haven't met your match at dice or cards. A career of high stakes and daring escapades has taught you when to play close to the chest and when to risk it all—but you haven't yet learned when to walk away.\r\n\r\nAre you a brilliant student of the game, a charming master of the bluff and counterbluff, or a cheater with fast hands? What turned you to a life of adventure: a string of bad luck, or an insatiable thirst for risk?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "guard",
  "fields": {
    "name": "Guard",
    "desc": "None",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "guildmember",
  "fields": {
    "name": "Guildmember",
    "desc": "It never hurts to be part of a team, and when you're part of a guild opportunities knock at your door.\r\n\r\nAre you a member of a trade or artisan's guild? Or an order of mages or monster hunters? Or have you found entry into a secretive guild of thieves or assassins?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "hermit",
  "fields": {
    "name": "Hermit",
    "desc": "You lived for years alone in a remote shrine, cave, monastery, or elsewhere away from the world. Among your daily tasks you had lots of time for introspection.\r\n\r\nWhy were you alone? Were you performing penance? In exile or hiding? Tending a shrine or holy spot? Grieving?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "marauder",
  "fields": {
    "name": "Marauder",
    "desc": "You were a member of an outlaw band. You might have been part of a troop of cutthroat bandits, or a resistance movement battling a tyrant, or a pirate fleet. You lived outside of settled lands, and your name was a terror to rich travelers.\r\n\r\nHow did you join your outlaw band? Why did you leave it—or did you?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "noble",
  "fields": {
    "name": "Noble",
    "desc": "None",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "outlander",
  "fields": {
    "name": "Outlander",
    "desc": "You lived far from the farms and fields of civilization. You know the beauties and the dangers of the wilderness.\r\n\r\nWere you part of a nomadic tribe? A hunter or guide? A lone wanderer or explorer? A guardian of civilization against monsters, or of the old ways against civilization?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "sage",
  "fields": {
    "name": "Sage",
    "desc": "You are a seeker of the world's truths and an expert in your chosen field, with esoteric knowledge at your fingertips, or at the farthest, in a book you vaguely remember.\r\n\r\nWhy have you left the confines of the library to explore the wider world? Do you seek ancient wisdom? Power? The answer to a specific question? Reinstatement in your former institution?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "sailor",
  "fields": {
    "name": "Sailor",
    "desc": "You're an experienced mariner with a keen weather eye and a favorite tavern in every port. Hard voyages have toughened you and the sea's power has made you humble.\r\n\r\nWere you a deckhand, an officer, or the captain of your vessel? Did you crew a naval cutter, a fishing boat, a merchant's barge, a privateering vessel, or a pirate ship?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "soldier",
  "fields": {
    "name": "Soldier",
    "desc": "None",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "trader",
  "fields": {
    "name": "Trader",
    "desc": "You served your apprenticeship among merchants and traders. You've traveled dusty miles and haggled under distant skies.\r\n\r\nWhy are you living a life of adventure? Are you working off your debt to the company store? Are you escorting a caravan through dangerous wilds?\r\n\r\nAre you raising capital to start your own business, or trying to restore the fortunes of a ruined trading family? Or are you a smuggler, following secret trade routes unknown to the authorities?",
    "document": "a5esrd"
  }
},
{
  "model": "api_v2.background",
  "pk": "urchin",
  "fields": {
    "name": "Urchin",
    "desc": "You grew up on the streets. You know where to hide and when your puppy dog eyes will earn you a hot meal.\r\n\r\nWhy were you on the streets? Were you a runaway? An orphan? Or just an adventurous kid who stayed out late?",
    "document": "a5esrd"
  }
}
]
