[
{
  "model": "api_v2.capability",
  "pk": 1,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with the herbalism kit, navigator’s kit, a simple ranged weapon, or a martial ranged weapon.",
    "type": null,
    "feat": "woodcraft-training"
  }
},
{
  "model": "api_v2.capability",
  "pk": 2,
  "fields": {
    "name": "",
    "desc": "You gain two exploration knacks of your choice from the ranger class.",
    "type": null,
    "feat": "woodcraft-training"
  }
},
{
  "model": "api_v2.capability",
  "pk": 3,
  "fields": {
    "name": "",
    "desc": "While raging, you and any creatures benefiting from your Living Stampede emit 5-foot auras of fury.",
    "type": null,
    "feat": "wild-rioter"
  }
},
{
  "model": "api_v2.capability",
  "pk": 4,
  "fields": {
    "name": "",
    "desc": "When a creature other than you or your allies enters a fury aura or starts its turn there it makes a Wisdom saving throw against your druid spell save DC. On a failed save, a creature becomes confused, except instead of rolling to determine their actions as normal for the confused condition, they are always considered to have rolled the 7 or 8 result. At the end of each of a confused creature’s turns it repeats the saving throw, ending the effect on itself on a success. Once a creature successfully saves against this effect, it is  immune to it for the remainder of your rage.",
    "type": null,
    "feat": "wild-rioter"
  }
},
{
  "model": "api_v2.capability",
  "pk": 5,
  "fields": {
    "name": "",
    "desc": "You are treated as royalty (or as closely as possible) by most commoners and traders, and as an equal when meeting other authority figures (who make time in their schedule to see you when requested to do so).",
    "type": null,
    "feat": "well-heeled"
  }
},
{
  "model": "api_v2.capability",
  "pk": 6,
  "fields": {
    "name": "",
    "desc": "You have passive investments and income that allow you to maintain a high quality of living. You have a rich lifestyle and do not need to pay for it.",
    "type": null,
    "feat": "well-heeled"
  }
},
{
  "model": "api_v2.capability",
  "pk": 7,
  "fields": {
    "name": "",
    "desc": "You gain a second Prestige Center. This must be an area where you have spent at least a week of time.",
    "type": null,
    "feat": "well-heeled"
  }
},
{
  "model": "api_v2.capability",
  "pk": 8,
  "fields": {
    "name": "",
    "desc": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "weapons-specialist"
  }
},
{
  "model": "api_v2.capability",
  "pk": 9,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with four weapons of your choice. Three of these must be a simple or a martial weapon. The fourth choice can be a simple, martial, or rare weapon.",
    "type": null,
    "feat": "weapons-specialist"
  }
},
{
  "model": "api_v2.capability",
  "pk": 10,
  "fields": {
    "name": "",
    "desc": "Your Wisdom or Dexterity score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "vigilante"
  }
},
{
  "model": "api_v2.capability",
  "pk": 11,
  "fields": {
    "name": "",
    "desc": "You have an alter ego, an identity associated with a costume or disguise. This alter ego can be as  complicated as a full outfit with a history or legends surrounding it or a simple mask or cowl. You can assume or remove this alter ego as an action and it can be worn with all types of armor.",
    "type": null,
    "feat": "vigilante"
  }
},
{
  "model": "api_v2.capability",
  "pk": 12,
  "fields": {
    "name": "",
    "desc": "You gain a 1d8 expertise die and advantage on Deception checks made regarding your alter ego,  Persuasion checks made to dissuade others from connecting you to your alter ego, and on disguise kit checks.",
    "type": null,
    "feat": "vigilante"
  }
},
{
  "model": "api_v2.capability",
  "pk": 13,
  "fields": {
    "name": "",
    "desc": "Your alter ego has its own Prestige rating that may increase or decrease as you perform deeds while in your alter ego. In addition, while in your alter ego you gain a 1d8 expertise die on Prestige checks.",
    "type": null,
    "feat": "vigilante"
  }
},
{
  "model": "api_v2.capability",
  "pk": 14,
  "fields": {
    "name": "",
    "desc": "While in your alter ego, you may make a Prestige check and use that result in place of any Intimidation or Persuasion check you would otherwise make.",
    "type": null,
    "feat": "vigilante"
  }
},
{
  "model": "api_v2.capability",
  "pk": 15,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with shields as weapons.",
    "type": null,
    "feat": "vengeful-protector"
  }
},
{
  "model": "api_v2.capability",
  "pk": 16,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with the Double Team maneuver and do not have to spend exertion to activate it.",
    "type": null,
    "feat": "vengeful-protector"
  }
},
{
  "model": "api_v2.capability",
  "pk": 17,
  "fields": {
    "name": "",
    "desc": "When a creature reduces a party member (not including animal companions, familiars, or followers) to 0 hit points, you gain an expertise die on attacks made against it until the end of combat.",
    "type": null,
    "feat": "vengeful-protector"
  }
},
{
  "model": "api_v2.capability",
  "pk": 18,
  "fields": {
    "name": "",
    "desc": "You gain an expertise die on attack rolls and initiative checks made against creatures that are part of your\r\nvendetta, and when making a saving throw to resist an attack, feature, maneuver, spell, or trait from a creature that is part of your vendetta. Whether or not a creature is part of your vendetta is at the Narrator’s discretion.",
    "type": null,
    "feat": "vendetta"
  }
},
{
  "model": "api_v2.capability",
  "pk": 19,
  "fields": {
    "name": "",
    "desc": "Your bite damage increases to 1d8, a creature affected by your Charming Gaze remains charmed for a number of hours equal to your level, and you regain the use of Charming Gaze when you finish any\r\nrest.",
    "type": null,
    "feat": "vampire-spawn"
  }
},
{
  "model": "api_v2.capability",
  "pk": 20,
  "fields": {
    "name": "",
    "desc": "You also gain the Spider Climb and Vampiric Regeneration features.\r\n**Spider Climb.** You gain a climb speed equal to your Speed, and you can climb even on difficult surfaces and upside down on ceilings.\r\n**Vampiric Regeneration.** Whenever you start your turn with at least 1 hit point and you haven’t taken radiant damage or entered direct sunlight since the end of your last turn, you gain a number of temporary hit points equal to twice your proficiency bonus. When you end your turn in contact with running water, you take 20 radiant damage.",
    "type": null,
    "feat": "vampire-spawn"
  }
},
{
  "model": "api_v2.capability",
  "pk": 21,
  "fields": {
    "name": "",
    "desc": "Your Speed increases by 10 feet.",
    "type": null,
    "feat": "vampire-lord"
  }
},
{
  "model": "api_v2.capability",
  "pk": 22,
  "fields": {
    "name": "",
    "desc": "You gain an expertise die on Stealth checks.",
    "type": null,
    "feat": "vampire-lord"
  }
},
{
  "model": "api_v2.capability",
  "pk": 23,
  "fields": {
    "name": "",
    "desc": "The range of your darkvision increases to 120 feet.",
    "type": null,
    "feat": "vampire-lord"
  }
},
{
  "model": "api_v2.capability",
  "pk": 24,
  "fields": {
    "name": "",
    "desc": "Your bite damage increases to 1d10.",
    "type": null,
    "feat": "vampire-lord"
  }
},
{
  "model": "api_v2.capability",
  "pk": 25,
  "fields": {
    "name": "",
    "desc": "You can use Charming Gaze twice between rests.",
    "type": null,
    "feat": "vampire-lord"
  }
},
{
  "model": "api_v2.capability",
  "pk": 26,
  "fields": {
    "name": "",
    "desc": "When using Charming Gaze, a target with at least one level of strife makes its saving throw with disadvantage.",
    "type": null,
    "feat": "vampire-lord"
  }
},
{
  "model": "api_v2.capability",
  "pk": 27,
  "fields": {
    "name": "",
    "desc": "You also gain the Vampiric Shapechange feature.\r\n\r\n**Vampiric Shapechange.** You can use an action to transform into the shape of a Medium or smaller beast of CR 3 or less, a mist, or back into your true form. While transformed into a beast, you have the beast’s size and movement modes. You can’t use reactions or speak. Otherwise, you use your statistics. Any items you are carrying transform with you. While transformed into a mist, you have a flying speed of 30 feet, can’t speak, can’t take actions or manipulate objects, are immune to nonmagical damage from weapons, and have advantage on saving throws and Stealth checks. You can pass through a space as narrow as 1 inch without squeezing but can’t pass through water. Any items you are carrying transform with you.",
    "type": null,
    "feat": "vampire-lord"
  }
},
{
  "model": "api_v2.capability",
  "pk": 28,
  "fields": {
    "name": "",
    "desc": "Additionally, you gain the undead type in addition to being a humanoid, and you take 20 radiant damage when you end your turn in contact with sunlight.",
    "type": null,
    "feat": "vampire-lord"
  }
},
{
  "model": "api_v2.capability",
  "pk": 29,
  "fields": {
    "name": "",
    "desc": "Your Strength or Wisdom score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "untamed"
  }
},
{
  "model": "api_v2.capability",
  "pk": 30,
  "fields": {
    "name": "",
    "desc": "You may enter a rage and assume a wild shape using the same bonus action.",
    "type": null,
    "feat": "untamed"
  }
},
{
  "model": "api_v2.capability",
  "pk": 31,
  "fields": {
    "name": "",
    "desc": "While using a wild shape, you can use Furious Critical with attacks made using natural weapons.",
    "type": null,
    "feat": "untamed"
  }
},
{
  "model": "api_v2.capability",
  "pk": 32,
  "fields": {
    "name": "",
    "desc": "Any temporary hit points you gain from assuming a wild shape while raging become rage hit points instead.",
    "type": null,
    "feat": "untamed"
  }
},
{
  "model": "api_v2.capability",
  "pk": 33,
  "fields": {
    "name": "",
    "desc": "You may cast and concentrate on druid spells with a range of Self or Touch while raging.",
    "type": null,
    "feat": "untamed"
  }
},
{
  "model": "api_v2.capability",
  "pk": 34,
  "fields": {
    "name": "",
    "desc": "You cannot be charmed, fatigued, frightened, paralyzed, or stunned.",
    "type": null,
    "feat": "true-revenant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 35,
  "fields": {
    "name": "",
    "desc": "You have advantage on saving throws against spells and other magical effects.",
    "type": null,
    "feat": "true-revenant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 36,
  "fields": {
    "name": "",
    "desc": "You regain all of your hit points after you do not take any damage for 1 minute.",
    "type": null,
    "feat": "true-revenant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 37,
  "fields": {
    "name": "",
    "desc": "In addition, you also gain the Fearsome Pursuit and Burning Hatred features. \r\n**Fearsome Pursuit.** You can spend 1 minute focusing on a creature that is part of your vendetta. If the creature is dead or on another plane of existence, you learn that. Otherwise, after focusing, you know the distance and direction to that creature, and so long as you’re moving in pursuit of that creature, you and anyone traveling with you ignore difficult terrain. This effect ends if you take damage or end your turn without moving for any reason.\r\n**Burning Hatred.** You can use an action to target the focus of your Fearsome Pursuit if it is within 30 feet. The creature makes a Wisdom saving throw (DC 8 + your proficiency bonus + your highest mental ability score modifier). On a failure, it takes psychic damage equal to 1d6 × your proficiency bonus and is stunned until the end of its next turn. On a success, it takes half damage and is rattled until the end of its\r\nnext turn. Once you have used this feature a number of times equal to your proficiency bonus, you can’t use it again until you finish a long rest.",
    "type": null,
    "feat": "true-revenant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 38,
  "fields": {
    "name": "",
    "desc": "Your Charisma score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "thespian"
  }
},
{
  "model": "api_v2.capability",
  "pk": 39,
  "fields": {
    "name": "",
    "desc": "You have advantage on Deception and Performance checks made when attempting to mimic another creature’s looks, mannerisms, or speech.",
    "type": null,
    "feat": "thespian"
  }
},
{
  "model": "api_v2.capability",
  "pk": 40,
  "fields": {
    "name": "",
    "desc": "You have a natural talent for perfectly mimicking the sounds of other creatures you’ve heard make sound for at least 1 minute. A suspicious listener can see through your perfect mimicry by succeeding on a Wisdom (Insight) check opposed by your Charisma (Deception) check.",
    "type": null,
    "feat": "thespian"
  }
},
{
  "model": "api_v2.capability",
  "pk": 41,
  "fields": {
    "name": "",
    "desc": "Choose one ability score. The chosen ability score increases by 1, to a maximum of 20, and you gain proficiency in saving throws using it.",
    "type": null,
    "feat": "tenacious"
  }
},
{
  "model": "api_v2.capability",
  "pk": 42,
  "fields": {
    "name": "",
    "desc": "When using the Help action to aid an ally in attacking a creature, the targeted creature can be up to 30 feet away instead of 5 feet.",
    "type": null,
    "feat": "tactical-support"
  }
},
{
  "model": "api_v2.capability",
  "pk": 43,
  "fields": {
    "name": "",
    "desc": "If an ally benefiting from your Help action scores a critical hit on the targeted creature, you can use your reaction to make a single weapon attack against that creature. Your attack scores a critical hit on a roll of 19–20. If you already have a feature that increases the range of your critical hits, your critical hit range\r\nfor that attack is increased by 1 (maximum 17–20).",
    "type": null,
    "feat": "tactical-support"
  }
},
{
  "model": "api_v2.capability",
  "pk": 44,
  "fields": {
    "name": "",
    "desc": "When a creature is damaged by an attack that was aided by the use of your Help action, you don’t provoke opportunity attacks from that creature until the end of your next turn.",
    "type": null,
    "feat": "tactical-support"
  }
},
{
  "model": "api_v2.capability",
  "pk": 45,
  "fields": {
    "name": "",
    "desc": "Your Speed increases by 5 feet.",
    "type": null,
    "feat": "swift-combatant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 46,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with the Charge, Rapid Drink, and Swift Stance maneuvers, and do not have to spend exertion to activate them.",
    "type": null,
    "feat": "swift-combatant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 47,
  "fields": {
    "name": "",
    "desc": "When you are reduced to 0 or fewer hit points, you can use your reaction to move up to your Speed before falling unconscious. Moving in this way doesn’t provoke opportunity attacks.",
    "type": null,
    "feat": "survivor"
  }
},
{
  "model": "api_v2.capability",
  "pk": 48,
  "fields": {
    "name": "",
    "desc": "On the first turn that you start with 0 hit points and must make a death saving throw, you make that saving throw with advantage.",
    "type": null,
    "feat": "survivor"
  }
},
{
  "model": "api_v2.capability",
  "pk": 49,
  "fields": {
    "name": "",
    "desc": "When you take massive damage that would kill you instantly, you can use your reaction to make a death saving throw. If the saving throw succeeds, you instead fall unconscious and are dying.",
    "type": null,
    "feat": "survivor"
  }
},
{
  "model": "api_v2.capability",
  "pk": 50,
  "fields": {
    "name": "",
    "desc": "Medicine checks made to stabilize you have advantage.",
    "type": null,
    "feat": "survivor"
  }
},
{
  "model": "api_v2.capability",
  "pk": 51,
  "fields": {
    "name": "",
    "desc": "Once between long rests, when a creature successfully stabilizes you, at the start of your next turn you regain 1 hit point.",
    "type": null,
    "feat": "survivor"
  }
},
{
  "model": "api_v2.capability",
  "pk": 52,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with the Dangerous Strikes maneuver and do not have to spend exertion to activate it.",
    "type": null,
    "feat": "surgical-combatant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 53,
  "fields": {
    "name": "",
    "desc": "You gain proficiency in Medicine. If you are already proficient, you instead gain an expertise die.",
    "type": null,
    "feat": "surgical-combatant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 54,
  "fields": {
    "name": "",
    "desc": "You gain an expertise die on Medicine checks made to diagnose the cause of or treat wounds.",
    "type": null,
    "feat": "surgical-combatant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 55,
  "fields": {
    "name": "",
    "desc": "You can add your martial arts die as a bonus to Acrobatics, Culture, Deception, Engineering, Intimidation, Investigation, Sleight of Hand, Stealth, Perception, Performance, and Persuasion checks.",
    "type": null,
    "feat": "subtly-skilled"
  }
},
{
  "model": "api_v2.capability",
  "pk": 56,
  "fields": {
    "name": "",
    "desc": "Your Strength or Constitution score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "street-fighter"
  }
},
{
  "model": "api_v2.capability",
  "pk": 57,
  "fields": {
    "name": "",
    "desc": "You can roll 1d4 in place of your normal damage for unarmed strikes.",
    "type": null,
    "feat": "street-fighter"
  }
},
{
  "model": "api_v2.capability",
  "pk": 58,
  "fields": {
    "name": "",
    "desc": "You are proficient with improvised weapons.",
    "type": null,
    "feat": "street-fighter"
  }
},
{
  "model": "api_v2.capability",
  "pk": 59,
  "fields": {
    "name": "",
    "desc": "You can use a bonus action to make a Grapple maneuver against a target you hit with an unarmed strike or improvised weapon on your turn.",
    "type": null,
    "feat": "street-fighter"
  }
},
{
  "model": "api_v2.capability",
  "pk": 60,
  "fields": {
    "name": "",
    "desc": "You can try to hide from a creature even while you are only lightly obscured from that creature.",
    "type": null,
    "feat": "stealth-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 61,
  "fields": {
    "name": "",
    "desc": "Your position isn’t revealed when you miss with a ranged weapon attack against a creature you are hidden from.",
    "type": null,
    "feat": "stealth-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 62,
  "fields": {
    "name": "",
    "desc": "Dim light does not impose disadvantage when you make Perception checks.",
    "type": null,
    "feat": "stealth-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 63,
  "fields": {
    "name": "",
    "desc": "Your Constitution score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "stalwart"
  }
},
{
  "model": "api_v2.capability",
  "pk": 64,
  "fields": {
    "name": "",
    "desc": "You regain an additional number of hit points equal to double your Constitution modifier (minimum 2) whenever you roll a hit die to regain hit points.",
    "type": null,
    "feat": "stalwart"
  }
},
{
  "model": "api_v2.capability",
  "pk": 65,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with the Purge Magic maneuver and do not have to spend exertion to activate it.",
    "type": null,
    "feat": "spellbreaker"
  }
},
{
  "model": "api_v2.capability",
  "pk": 66,
  "fields": {
    "name": "",
    "desc": "When a creature concentrating on a spell is damaged by you, it has disadvantage on its concentration check to maintain the spell it is concentrating on.",
    "type": null,
    "feat": "spellbreaker"
  }
},
{
  "model": "api_v2.capability",
  "pk": 67,
  "fields": {
    "name": "",
    "desc": "You have advantage on saving throws made against spells cast within 30 feet of you.",
    "type": null,
    "feat": "spellbreaker"
  }
},
{
  "model": "api_v2.capability",
  "pk": 68,
  "fields": {
    "name": "",
    "desc": "Your Speed increases by 10 feet.",
    "type": null,
    "feat": "skirmisher"
  }
},
{
  "model": "api_v2.capability",
  "pk": 69,
  "fields": {
    "name": "",
    "desc": "You can Dash through difficult terrain without requiring additional movement.",
    "type": null,
    "feat": "skirmisher"
  }
},
{
  "model": "api_v2.capability",
  "pk": 70,
  "fields": {
    "name": "",
    "desc": "Whenever you attack a creature, for the rest of your turn you don’t provoke opportunity attacks from that creature.",
    "type": null,
    "feat": "skirmisher"
  }
},
{
  "model": "api_v2.capability",
  "pk": 71,
  "fields": {
    "name": "",
    "desc": "Choose three skills, tools, languages, or any combination of these. You gain proficiency with each of your three choices. If you already have proficiency in a chosen skill, you instead gain a skill specialty with that skill.",
    "type": null,
    "feat": "skillful"
  }
},
{
  "model": "api_v2.capability",
  "pk": 72,
  "fields": {
    "name": "",
    "desc": "When you take the Attack action on your turn, as a bonus action you can make a Shove maneuver against a creature within 5 feet of you.",
    "type": null,
    "feat": "shield-focus"
  }
},
{
  "model": "api_v2.capability",
  "pk": 73,
  "fields": {
    "name": "",
    "desc": "When you make a Dexterity saving throw against a spell or harmful effect that only targets you, if you aren’t incapacitated you gain a bonus equal to your shield’s Armor Class bonus.",
    "type": null,
    "feat": "shield-focus"
  }
},
{
  "model": "api_v2.capability",
  "pk": 74,
  "fields": {
    "name": "",
    "desc": "When you succeed on a Dexterity saving throw against an effect that deals half damage on a success, you can use your reaction to take no damage by protecting yourself with your shield.",
    "type": null,
    "feat": "shield-focus"
  }
},
{
  "model": "api_v2.capability",
  "pk": 75,
  "fields": {
    "name": "",
    "desc": "You regain 1 spell point whenever you cast a spell from the shadow school.",
    "type": null,
    "feat": "shadowmancer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 76,
  "fields": {
    "name": "",
    "desc": "You gain a Stealth skill specialty for hiding while in areas of darkness or dim light, and you have  advantage on Dexterity (Stealth) checks made to hide while in areas of darkness or dim light.",
    "type": null,
    "feat": "shadowmancer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 77,
  "fields": {
    "name": "",
    "desc": "Whenever you use your Shadowdancer ability to teleport, after teleporting you can use your reaction to take the Dodge action.",
    "type": null,
    "feat": "shadowmancer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 78,
  "fields": {
    "name": "",
    "desc": "You gain darkvision to a range of 60 feet. Unlike other forms of darkvision you can see color in this way as if you were seeing normally. If you already had darkvision or would gain it later from another feature, its range increases by 30 feet.",
    "type": null,
    "feat": "shadowdancer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 79,
  "fields": {
    "name": "",
    "desc": "You can use a bonus action and spend 1 spell point to teleport up to 30 feet to an unoccupied area of darkness or dim light you can see. You must currently be in an area of darkness or dim light to teleport in this way. You can bring along objects if their weight doesn’t exceed what you can carry. You can also bring one willing creature of your size or smaller, provided it isn’t carrying gear beyond its carrying capacity and is within 5 feet. You can increase the range of this teleport by 30 additional feet per each additional spell point you spend.",
    "type": null,
    "feat": "shadowdancer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 80,
  "fields": {
    "name": "",
    "desc": "While you are hidden from a target and are in an area of darkness or dim light, you can apply your Sneak Attack damage to an eldritch blast.",
    "type": null,
    "feat": "shadow-assassin"
  }
},
{
  "model": "api_v2.capability",
  "pk": 81,
  "fields": {
    "name": "",
    "desc": "You gain a ritual book containing spells that you can cast as rituals while holding it.",
    "type": null,
    "feat": "rite-master"
  }
},
{
  "model": "api_v2.capability",
  "pk": 82,
  "fields": {
    "name": "",
    "desc": "Choose one of the following classes: bard, cleric, druid, herald, sorcerer, warlock, or wizard. When you acquire this feat, you create a ritual book holding two 1st-level spells of your choice from that class’ spell\r\nlist. These spells must have the ritual tag. The class you choose determines your spellcasting ability for these spells: Intelligence for wizard, Wisdom for cleric or druid, Charisma for bard, herald, or\r\nsorcerer, or your choice of Intelligence, Wisdom, or Charisma for warlock.",
    "type": null,
    "feat": "rite-master"
  }
},
{
  "model": "api_v2.capability",
  "pk": 83,
  "fields": {
    "name": "",
    "desc": "If you come across a written spell with the ritual tag (like on a spell scroll or in a wizard’s spellbook), you can add it to your ritual book if the spell is on the spell list for the class you chose and its level is no higher than half your level (rounded up). Copying the spell into your ritual book costs 50 gold and 2 hours per level of the spell.",
    "type": null,
    "feat": "rite-master"
  }
},
{
  "model": "api_v2.capability",
  "pk": 84,
  "fields": {
    "name": "",
    "desc": "Your destiny changes to Revenge.",
    "type": null,
    "feat": "revenant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 85,
  "fields": {
    "name": "",
    "desc": "You gain resistance to necrotic and psychic damage.",
    "type": null,
    "feat": "revenant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 86,
  "fields": {
    "name": "",
    "desc": "You gain darkvision to a range of 60 feet (or if you already have it, its range increases by 30 feet).",
    "type": null,
    "feat": "revenant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 87,
  "fields": {
    "name": "",
    "desc": "You become immune to poison damage and the poisoned condition.",
    "type": null,
    "feat": "revenant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 88,
  "fields": {
    "name": "",
    "desc": "If your vendetta has not ended, you regain all of your hit points when you finish a short rest or 1 hour after you are reduced to 0 hit points.",
    "type": null,
    "feat": "revenant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 89,
  "fields": {
    "name": "",
    "desc": "You gain an expertise die on saving throws made against spells and other magical effects, and on saving throws made to resist being charmed, fatigued, frightened, paralyzed, or stunned.",
    "type": null,
    "feat": "revenant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 90,
  "fields": {
    "name": "",
    "desc": "You gain an expertise die on ability checks made to find or track a creature that is part of your vendetta.",
    "type": null,
    "feat": "revenant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 91,
  "fields": {
    "name": "",
    "desc": "If the resonant item requires attunement and you meet the prerequisites to do so, you become attuned to the item. If you don’t meet the prerequisites, both the attunement and resonance with the item fails. \r\n\r\nThis attunement doesn’t count toward the maximum number of items you can be attuned to. Unlike other\r\nattuned items, your attunement to this item doesn’t end from being more than 100 feet away from it for 24 hours.",
    "type": null,
    "feat": "resonant-bond"
  }
},
{
  "model": "api_v2.capability",
  "pk": 92,
  "fields": {
    "name": "",
    "desc": "Once per rest, as a bonus action, you can summon a resonant item, which appears instantly in your hand so long as it is located on the same plane of existence. You must have a free hand to use this feature and be able to hold the item.",
    "type": null,
    "feat": "resonant-bond"
  }
},
{
  "model": "api_v2.capability",
  "pk": 93,
  "fields": {
    "name": "",
    "desc": "If the resonant item is sentient, you have advantage on Charisma checks and saving throws made when resolving a conflict with the item.",
    "type": null,
    "feat": "resonant-bond"
  }
},
{
  "model": "api_v2.capability",
  "pk": 94,
  "fields": {
    "name": "",
    "desc": "If the resonant item is an artifact, you can ignore the effects of one minor detrimental property.",
    "type": null,
    "feat": "resonant-bond"
  }
},
{
  "model": "api_v2.capability",
  "pk": 95,
  "fields": {
    "name": "",
    "desc": "You lose resonance with an item if another creature attunes to it or gains resonance with it. You can also voluntarily end the resonance by focusing on the item during a short rest, or during a long rest if the item is not in your possession.",
    "type": null,
    "feat": "resonant-bond"
  }
},
{
  "model": "api_v2.capability",
  "pk": 96,
  "fields": {
    "name": "",
    "desc": "When you spend 10 minutes speaking inspirationally, you can choose up to 6 friendly creatures (including yourself) within 30 feet that can hear and understand you. Each creature gains temporary hit points equal to your level + your Charisma modifier. A creature can’t gain temporary hit points from this feat again until it has finished a rest.",
    "type": null,
    "feat": "rallying-speaker"
  }
},
{
  "model": "api_v2.capability",
  "pk": 97,
  "fields": {
    "name": "",
    "desc": "**Divine (Radiant).** When you cast a spell that deals radiant damage, you can spend 1 sorcery point and choose one creature you can see within 60 feet. That creature regains a number of hit points equal to 1d8 × the spell’s level.",
    "type": null,
    "feat": "pure-arcanist"
  }
},
{
  "model": "api_v2.capability",
  "pk": 98,
  "fields": {
    "name": "",
    "desc": "**Pure Arcanum (Force).** When you cast a spell that deals force damage, you can spend 2 sorcery points and choose one creature you can see. After the spell’s damage is resolved, if the creature was damaged by the spell it makes an Intelligence saving throw or becomes stunned until the end of its next turn.",
    "type": null,
    "feat": "pure-arcanist"
  }
},
{
  "model": "api_v2.capability",
  "pk": 99,
  "fields": {
    "name": "",
    "desc": "Whenever the Narrator calls for you to roll for initiative, you may activate a use of your Divine Sense feature to warn yourself and up to a number of creatures equal to your Charisma modifier within 30 feet, granting advantage on the initiative check.",
    "type": null,
    "feat": "proclaimer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 100,
  "fields": {
    "name": "",
    "desc": "You can use your voice Art Specialty to cast herald spells.",
    "type": null,
    "feat": "proclaimer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 101,
  "fields": {
    "name": "",
    "desc": "You can spend exertion to cast spells from the divination school that you know at a cost of 1 exertion per spell level.",
    "type": null,
    "feat": "proclaimer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 102,
  "fields": {
    "name": "",
    "desc": "When you gain this feat, you gain one of the following alignment traits: Chaotic, Evil, Good, or Lawful. Once chosen your alignment trait cannot be changed, but you can gain a second alignment trait that is not opposed.",
    "type": null,
    "feat": "proclaimer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 103,
  "fields": {
    "name": "",
    "desc": "Upon gaining this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder.\r\n\r\nWhen you cast a spell that deals damage, your spell’s damage ignores damage resistance to the chosen type.",
    "type": null,
    "feat": "primordial-caster"
  }
},
{
  "model": "api_v2.capability",
  "pk": 104,
  "fields": {
    "name": "",
    "desc": "When you cast a spell that deals damage of the chosen type, you deal 1 additional damage for every damage die with a result of 1.",
    "type": null,
    "feat": "primordial-caster"
  }
},
{
  "model": "api_v2.capability",
  "pk": 105,
  "fields": {
    "name": "",
    "desc": "This feat can be selected multiple times, choosing a different damage type each time.",
    "type": null,
    "feat": "primordial-caster"
  }
},
{
  "model": "api_v2.capability",
  "pk": 106,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with the Cleaving Swing maneuver and do not have to spend exertion to activate it. In addition, you can use Cleaving Swing with a versatile weapon wielded with two hands.",
    "type": null,
    "feat": "powerful-attacker"
  }
},
{
  "model": "api_v2.capability",
  "pk": 107,
  "fields": {
    "name": "",
    "desc": "Before you make a melee attack with a two-handed weapon or versatile weapon wielded with two hands, if you are proficient with the weapon and do not have disadvantage you can declare a powerful attack. A\r\npowerful attack has disadvantage, but on a hit deals 10 extra damage.",
    "type": null,
    "feat": "powerful-attacker"
  }
},
{
  "model": "api_v2.capability",
  "pk": 108,
  "fields": {
    "name": "",
    "desc": "The range is doubled for any spell you cast that requires a spell attack roll.",
    "type": null,
    "feat": "power-caster"
  }
},
{
  "model": "api_v2.capability",
  "pk": 109,
  "fields": {
    "name": "",
    "desc": "You ignore half cover and three-quarters cover when making a ranged spell attack.",
    "type": null,
    "feat": "power-caster"
  }
},
{
  "model": "api_v2.capability",
  "pk": 110,
  "fields": {
    "name": "",
    "desc": "Choose one cantrip that requires an attack roll. The cantrip must be from the bard, cleric, druid, herald, sorcerer, warlock, or wizard spell list. You learn this cantrip and your spellcasting ability for it depends\r\non the spell list you chose from: Intelligence for wizard, Wisdom for cleric or druid, Charisma for bard, herald, or sorcerer, or your choice of Intelligence, Wisdom, or Charisma for warlock.",
    "type": null,
    "feat": "power-caster"
  }
},
{
  "model": "api_v2.capability",
  "pk": 111,
  "fields": {
    "name": "",
    "desc": "When you attack with a glaive, halberd, quarterstaff, or spear and no other weapon using the Attack action, as a bonus action you can make a melee attack with the weapon’s opposite end. This attack uses the same ability modifier as the primary attack, dealing 1d4 bludgeoning damage on a hit.",
    "type": null,
    "feat": "polearm-savant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 112,
  "fields": {
    "name": "",
    "desc": "While you are wielding a glaive, halberd, pike, quarterstaff, or spear, a creature that enters your reach provokes an opportunity attack from you. A creature can use its reaction to avoid provoking an opportunity attack from you in this way.",
    "type": null,
    "feat": "polearm-savant"
  }
},
{
  "model": "api_v2.capability",
  "pk": 113,
  "fields": {
    "name": "",
    "desc": "When you use a healer’s satchel to stabilize a dying creature, it regains a number of\r\nhit points equal to your Wisdom modifier.",
    "type": null,
    "feat": "physician"
  }
},
{
  "model": "api_v2.capability",
  "pk": 114,
  "fields": {
    "name": "",
    "desc": "You can spend an action and one use of a healer’s satchel to tend to a creature. The creature regains 1d6 + 4 hit points, plus one hit point for each of its hit dice. The creature can’t regain hit points from this feat again until it finishes a rest.",
    "type": null,
    "feat": "physician"
  }
},
{
  "model": "api_v2.capability",
  "pk": 115,
  "fields": {
    "name": "",
    "desc": "Your Dexterity or Wisdom score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "nightstalker"
  }
},
{
  "model": "api_v2.capability",
  "pk": 116,
  "fields": {
    "name": "",
    "desc": "You can deal Sneak Attack damage when making attacks using unarmed strikes or adept weapons.",
    "type": null,
    "feat": "nightstalker"
  }
},
{
  "model": "api_v2.capability",
  "pk": 117,
  "fields": {
    "name": "",
    "desc": "You gain a bonus equal to your Wisdom modifier on Acrobatics, Deception, and Stealth checks.",
    "type": null,
    "feat": "nightstalker"
  }
},
{
  "model": "api_v2.capability",
  "pk": 118,
  "fields": {
    "name": "",
    "desc": "In addition, you gain the following special focus feature:\r\n**Twilight Vanish.** On your turn you can use a reaction and spend 2 exertion to move up to 30 feet with such incredible speed that you seem to disappear: after moving this way you may immediately take the Hide action.",
    "type": null,
    "feat": "nightstalker"
  }
},
{
  "model": "api_v2.capability",
  "pk": 119,
  "fields": {
    "name": "",
    "desc": "You can spend exertion to cast any spells from the air, earth, fear, fire, movement, obscurement, plants, poison, senses, shadow, transformation, unarmed, or water schools at the cost of 2 exertion per spell level. You use your focus save DC for spells cast this way, and your spell attack modifier is equal to your proficiency bonus + your Wisdom modifier.",
    "type": null,
    "feat": "night-master"
  }
},
{
  "model": "api_v2.capability",
  "pk": 120,
  "fields": {
    "name": "",
    "desc": "You gain resistance to necrotic damage (or if you already have it, immunity to necrotic damage) and  darkvision to a range of 30 feet (or if you already have it, the range of your darkvision increases by 30 feet).",
    "type": null,
    "feat": "newblood"
  }
},
{
  "model": "api_v2.capability",
  "pk": 121,
  "fields": {
    "name": "",
    "desc": "You also gain a bite natural weapon and the Charming Gaze feature.\r\n\r\n**Bite.** You gain a bite natural weapon you are proficient with. You are only able to bite grappled,   incapacitated, restrained, or willing creatures. You can use Dexterity instead of Strength for the attack rolls of your bite. On a hit your bite deals piercing damage equal to 1d6 plus your Strength modifier or Dexterity modifier (whichever is highest). In addition, once per turn you can choose for your bite to also deal 1d6\r\nnecrotic damage × your proficiency bonus. You regain hit points equal to the amount of necrotic damage dealt to your target. This necrotic damage can only be increased by a critical hit.\r\n**Charming Gaze.** Once between long rests, you magically target a creature within 30 feet, forcing it to make a Wisdom saving throw (DC 8 + your proficiency bonus + your Charisma modifier). On a failure, the target is charmed by you for a number of hours equal to your proficiency bonus. While charmed it regards you as a trusted friend and is a willing target for your bite. The target repeats the saving throw each time it takes damage, ending the effect on itself on a success. If the target’s saving throw is successful or the effect ends for it, it is immune to your charm for 24 hours.",
    "type": null,
    "feat": "newblood"
  }
},
{
  "model": "api_v2.capability",
  "pk": 122,
  "fields": {
    "name": "",
    "desc": "Additionally, you have disadvantage on attack rolls and on Perception checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight. In addition, you cannot use your Charming Gaze while you are in direct sunlight.",
    "type": null,
    "feat": "newblood"
  }
},
{
  "model": "api_v2.capability",
  "pk": 123,
  "fields": {
    "name": "",
    "desc": "Your Speed increases by 5 feet.",
    "type": null,
    "feat": "natural-warrior"
  }
},
{
  "model": "api_v2.capability",
  "pk": 124,
  "fields": {
    "name": "",
    "desc": "When making an Acrobatics or Athletics check during combat, you can choose to use your Strength or Dexterity modifier for either skill.",
    "type": null,
    "feat": "natural-warrior"
  }
},
{
  "model": "api_v2.capability",
  "pk": 125,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with the Bounding Strike maneuver and do not have to spend exertion to activate it.",
    "type": null,
    "feat": "natural-warrior"
  }
},
{
  "model": "api_v2.capability",
  "pk": 126,
  "fields": {
    "name": "",
    "desc": "You can roll 1d4 in place of your normal damage for unarmed strikes. When rolling damage for your unarmed strikes, you can choose to deal bludgeoning, piercing, or slashing damage.",
    "type": null,
    "feat": "natural-warrior"
  }
},
{
  "model": "api_v2.capability",
  "pk": 127,
  "fields": {
    "name": "",
    "desc": "You learn two cantrips of your choice from the class’s spell list.",
    "type": null,
    "feat": "mystical-talent"
  }
},
{
  "model": "api_v2.capability",
  "pk": 128,
  "fields": {
    "name": "",
    "desc": "Choose a 1st-level spell to learn from that spell list. Once between long rests, you can cast this spell without expending a spell slot. You can also cast this spell using a spell slot of the appropriate level (or the appropriate number of spell points if you have warlock levels).\r\n\r\nYour spellcasting ability for these spells is Intelligence for wizard, Wisdom for cleric or druid, Charisma for bard, herald, or sorcerer, or your choice of Intelligence, Wisdom, or Charisma for warlock.",
    "type": null,
    "feat": "mystical-talent"
  }
},
{
  "model": "api_v2.capability",
  "pk": 129,
  "fields": {
    "name": "",
    "desc": "Your Wisdom or Charisma score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "mystic-arcanist"
  }
},
{
  "model": "api_v2.capability",
  "pk": 130,
  "fields": {
    "name": "",
    "desc": "When you cast a spell that restores hit points, you restore an additional number of hit points equal to your Charisma modifier.",
    "type": null,
    "feat": "mystic-arcanist"
  }
},
{
  "model": "api_v2.capability",
  "pk": 131,
  "fields": {
    "name": "",
    "desc": "You can spend sorcery points to temporarily gain a spell from the cleric or sorcerer spell lists. Gaining a spell in this way costs a number of sorcery points equal to the spell’s level. You cannot gain a spell that has a level higher than your highest level spell slot. When you gain a cleric spell in this way, it is considered prepared for the day. When you gain a sorcerer spell in this way, it is considered a spell you know for the day. You lose all spells gained in this way whenever you finish a long rest.",
    "type": null,
    "feat": "mystic-arcanist"
  }
},
{
  "model": "api_v2.capability",
  "pk": 132,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with the Lancer Strike maneuver and do not have to spend exertion to activate it.",
    "type": null,
    "feat": "mounted-warrior"
  }
},
{
  "model": "api_v2.capability",
  "pk": 133,
  "fields": {
    "name": "",
    "desc": "When your mount is targeted by an attack, you can instead make yourself the attack’s target.",
    "type": null,
    "feat": "mounted-warrior"
  }
},
{
  "model": "api_v2.capability",
  "pk": 134,
  "fields": {
    "name": "",
    "desc": "When your mount makes a Dexterity saving throw against an effect that deals half damage on a success, it takes no damage on a success and half damage on a failure.",
    "type": null,
    "feat": "mounted-warrior"
  }
},
{
  "model": "api_v2.capability",
  "pk": 135,
  "fields": {
    "name": "",
    "desc": "You gain an expertise die on checks made to learn legends and lore about a creature you can see.",
    "type": null,
    "feat": "monster-hunter"
  }
},
{
  "model": "api_v2.capability",
  "pk": 136,
  "fields": {
    "name": "",
    "desc": "You learn the altered strike cantrip.",
    "type": null,
    "feat": "monster-hunter"
  }
},
{
  "model": "api_v2.capability",
  "pk": 137,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with the Douse maneuver and do not have to spend exertion to activate it.",
    "type": null,
    "feat": "monster-hunter"
  }
},
{
  "model": "api_v2.capability",
  "pk": 138,
  "fields": {
    "name": "",
    "desc": "You gain the tracking skill specialty in Survival.",
    "type": null,
    "feat": "monster-hunter"
  }
},
{
  "model": "api_v2.capability",
  "pk": 139,
  "fields": {
    "name": "",
    "desc": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "moderately-outfitted"
  }
},
{
  "model": "api_v2.capability",
  "pk": 140,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with medium armor and shields.",
    "type": null,
    "feat": "moderately-outfitted"
  }
},
{
  "model": "api_v2.capability",
  "pk": 141,
  "fields": {
    "name": "",
    "desc": "Medium armor doesn’t impose disadvantage on your Dexterity (Stealth) checks.",
    "type": null,
    "feat": "medium-armor-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 142,
  "fields": {
    "name": "",
    "desc": "When you are wearing medium armor, the maximum Dexterity modifier you can add to your Armor Class increases to 3.",
    "type": null,
    "feat": "medium-armor-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 143,
  "fields": {
    "name": "",
    "desc": "You gain proficiency in a combat tradition of your choice.",
    "type": null,
    "feat": "martial-scholar"
  }
},
{
  "model": "api_v2.capability",
  "pk": 144,
  "fields": {
    "name": "",
    "desc": "You learn two combat maneuvers from a combat tradition you know. If you don’t already know any combat maneuvers, both must be 1st degree. Combat maneuvers gained from this feat do not count toward the maximum number of combat maneuvers you know.",
    "type": null,
    "feat": "martial-scholar"
  }
},
{
  "model": "api_v2.capability",
  "pk": 145,
  "fields": {
    "name": "",
    "desc": "Your exertion pool increases by 3. If you do not have an exertion pool, you gain an exertion pool with 3 exertion, regaining your exertion whenever you finish a rest.",
    "type": null,
    "feat": "martial-scholar"
  }
},
{
  "model": "api_v2.capability",
  "pk": 146,
  "fields": {
    "name": "",
    "desc": "Whenever you enter a rage you may choose up to a number of creatures equal to your Wisdom modifier within 60 feet that are beasts, fey, or plants. These chosen creatures gain the following benefits for as long as you rage, but are unable to take the Fall Back reaction:\r\n* Advantage on Strength checks and Strength saving throws.\r\n* Resistance to bludgeoning, piercing, and slashing damage.\r\n* Temporary hit points equal to your level.\r\n* A bonus to damage rolls equal to your proficiency bonus.",
    "type": null,
    "feat": "living-stampede"
  }
},
{
  "model": "api_v2.capability",
  "pk": 147,
  "fields": {
    "name": "",
    "desc": "Your Intelligence score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "linguistics-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 148,
  "fields": {
    "name": "",
    "desc": "You learn three languages of your choice.",
    "type": null,
    "feat": "linguistics-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 149,
  "fields": {
    "name": "",
    "desc": "You can invent ciphers and are able to teach a cipher you create to others. Anyone who knows the cipher can encode and read hidden messages made with it; the apparent text must be at least four times longer than the hidden message. A creature can detect the cipher’s presence if it spends a minute examining it and succeeds on an Investigation check against a DC of 8+ your proficiency bonus + your Intelligence modifier. If the check succeeds by 5 or more, they can read the hidden message.",
    "type": null,
    "feat": "linguistics-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 150,
  "fields": {
    "name": "",
    "desc": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "lightly-outfitted"
  }
},
{
  "model": "api_v2.capability",
  "pk": 151,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with light armor.",
    "type": null,
    "feat": "lightly-outfitted"
  }
},
{
  "model": "api_v2.capability",
  "pk": 152,
  "fields": {
    "name": "",
    "desc": "Your Intelligence score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "keen-intellect"
  }
},
{
  "model": "api_v2.capability",
  "pk": 153,
  "fields": {
    "name": "",
    "desc": "You can recall anything you’ve seen or heard within a number of weeks equal to your Intelligence  modifier.",
    "type": null,
    "feat": "keen-intellect"
  }
},
{
  "model": "api_v2.capability",
  "pk": 154,
  "fields": {
    "name": "",
    "desc": "You know how long it will be before the next sunset or sunrise.",
    "type": null,
    "feat": "keen-intellect"
  }
},
{
  "model": "api_v2.capability",
  "pk": 155,
  "fields": {
    "name": "",
    "desc": "You know which way is north.",
    "type": null,
    "feat": "keen-intellect"
  }
},
{
  "model": "api_v2.capability",
  "pk": 156,
  "fields": {
    "name": "",
    "desc": "Your Intelligence or Wisdom score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "intuitive"
  }
},
{
  "model": "api_v2.capability",
  "pk": 157,
  "fields": {
    "name": "",
    "desc": "Your passive Perception and passive Investigation scores increase by 5.",
    "type": null,
    "feat": "intuitive"
  }
},
{
  "model": "api_v2.capability",
  "pk": 158,
  "fields": {
    "name": "",
    "desc": "If you can see a creature’s mouth while it is speaking a language you know, you can read its lips.",
    "type": null,
    "feat": "intuitive"
  }
},
{
  "model": "api_v2.capability",
  "pk": 159,
  "fields": {
    "name": "",
    "desc": "Any stronghold you have or buy that is of frugal quality is automatically upgraded to average quality at no additional cost.",
    "type": null,
    "feat": "idealistic-leader"
  }
},
{
  "model": "api_v2.capability",
  "pk": 160,
  "fields": {
    "name": "",
    "desc": "You gain a new follower for every 50 staff you have in your stronghold, rather than every 100 staff.",
    "type": null,
    "feat": "idealistic-leader"
  }
},
{
  "model": "api_v2.capability",
  "pk": 161,
  "fields": {
    "name": "",
    "desc": "When you fulfill your destiny, choose a number of followers equal to your proficiency bonus. Each is upgraded to their most expensive version.",
    "type": null,
    "feat": "idealistic-leader"
  }
},
{
  "model": "api_v2.capability",
  "pk": 162,
  "fields": {
    "name": "",
    "desc": "You gain proficiency in your choice of one martial weapon, one rare weapon, or shields.",
    "type": null,
    "feat": "heraldic-training"
  }
},
{
  "model": "api_v2.capability",
  "pk": 163,
  "fields": {
    "name": "",
    "desc": "You gain two divine lessons of your choice from the herald class.",
    "type": null,
    "feat": "heraldic-training"
  }
},
{
  "model": "api_v2.capability",
  "pk": 164,
  "fields": {
    "name": "",
    "desc": "Your Strength score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "heavy-armor-expertise"
  }
},
{
  "model": "api_v2.capability",
  "pk": 165,
  "fields": {
    "name": "",
    "desc": "While wearing heavy armor, you reduce all bludgeoning, piercing, and slashing damage from nonmagical weapons by 3.",
    "type": null,
    "feat": "heavy-armor-expertise"
  }
},
{
  "model": "api_v2.capability",
  "pk": 166,
  "fields": {
    "name": "",
    "desc": "Your Strength score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "heavily-outfitted"
  }
},
{
  "model": "api_v2.capability",
  "pk": 167,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with heavy armor.",
    "type": null,
    "feat": "heavily-outfitted"
  }
},
{
  "model": "api_v2.capability",
  "pk": 168,
  "fields": {
    "name": "",
    "desc": "When you take this feat, you gain a number of hit points equal to twice your level.",
    "type": null,
    "feat": "hardy-adventurer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 169,
  "fields": {
    "name": "",
    "desc": "Whenever you gain a new level, you gain an additional 2 hit points to your hit point maximum.",
    "type": null,
    "feat": "hardy-adventurer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 170,
  "fields": {
    "name": "",
    "desc": "During a short rest, you regain 1 additional hit point per hit die spent to heal.",
    "type": null,
    "feat": "hardy-adventurer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 171,
  "fields": {
    "name": "",
    "desc": "You learn the Preach Despair and Preach Hope battle hymns. These special battle hymns can only be performed while you are using your voice Art Specialty as a spell focus.\r\n**Preach Despair.** A hostile creature within 60 feet of you suffers a level of strife. Creatures with an opposite alignment from yours or that worship a greater entity that has an opposite alignment suffer two levels of strife instead. A creature cannot suffer more than two levels of strife from Preach Despair in the same 24 hours.\r\n**Preach Hope.** Creatures of your choice within 60 feet of you gain advantage on saving throws. When the battle hymn ends, allies within 30 feet of you remove one level of strife. An ally that shares your alignment or worships a greater entity removes two levels of strife instead.",
    "type": null,
    "feat": "harbinger-of-things-to-come"
  }
},
{
  "model": "api_v2.capability",
  "pk": 172,
  "fields": {
    "name": "",
    "desc": "A creature that takes the Disengage action still provokes opportunity attacks from you.",
    "type": null,
    "feat": "guarded-warrior"
  }
},
{
  "model": "api_v2.capability",
  "pk": 173,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with the Warning Strike maneuver and do not have to spend exertion to activate it.",
    "type": null,
    "feat": "guarded-warrior"
  }
},
{
  "model": "api_v2.capability",
  "pk": 174,
  "fields": {
    "name": "",
    "desc": "You can use your reaction to make a melee weapon attack against a creature within 5 feet that makes an attack against a target other than you if the target does not also have this feat.",
    "type": null,
    "feat": "guarded-warrior"
  }
},
{
  "model": "api_v2.capability",
  "pk": 177,
  "fields": {
    "name": "",
    "desc": "You gain 3 fate points.",
    "type": null,
    "feat": "fortunate"
  }
},
{
  "model": "api_v2.capability",
  "pk": 178,
  "fields": {
    "name": "",
    "desc": "Whenever you make an attack roll, ability check, or saving throw and do not have disadvantage, you can spend a fate point to roll an additional d20 and choose whichever result you wish. \r\nYou may do this after the initial roll has occurred, but before the outcome is known. If you have disadvantage, you may instead spend a fate point to choose one of the d20 rolls and reroll it.",
    "type": null,
    "feat": "fortunate"
  }
},
{
  "model": "api_v2.capability",
  "pk": 179,
  "fields": {
    "name": "",
    "desc": "Alternatively, when you are attacked, you can choose to spend a fate point to force the attacking creature to reroll the attack. The creature resolves the attack with the result you choose.",
    "type": null,
    "feat": "fortunate"
  }
},
{
  "model": "api_v2.capability",
  "pk": 180,
  "fields": {
    "name": "",
    "desc": "You regain all expended fate points when you finish a long rest.",
    "type": null,
    "feat": "fortunate"
  }
},
{
  "model": "api_v2.capability",
  "pk": 181,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with the Victory Pose maneuver and do not have to spend exertion to activate it. In addition, you may use this maneuver with up to three different weapons you select instead of just one, and\r\naffect allies within 60 feet.",
    "type": null,
    "feat": "fear-breaker"
  }
},
{
  "model": "api_v2.capability",
  "pk": 182,
  "fields": {
    "name": "",
    "desc": "An ally affected by your Victory Pose gains an expertise die on their next saving throw against fear, and if they are rattled the condition ends for them.",
    "type": null,
    "feat": "fear-breaker"
  }
},
{
  "model": "api_v2.capability",
  "pk": 183,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with all types of artisan’s tools and miscellaneous tools. If you already have proficiency with any of these tools, you instead gain an expertise die with those tools.",
    "type": null,
    "feat": "equipped-for-justice"
  }
},
{
  "model": "api_v2.capability",
  "pk": 184,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with Engineering and a 1d8 expertise die on Engineering checks. In addition, you build a nonmagical grappling gun that only functions in your hands. Replacing your grappling gun requires 3 days of crafting and 500 gp.",
    "type": null,
    "feat": "equipped-for-justice"
  }
},
{
  "model": "api_v2.capability",
  "pk": 185,
  "fields": {
    "name": "",
    "desc": "You may add your Wisdom modifier to the DC of any saving throws used for miscellaneous adventuring gear items and to attack rolls made using miscellaneous adventuring gear items.",
    "type": null,
    "feat": "equipped-for-justice"
  }
},
{
  "model": "api_v2.capability",
  "pk": 186,
  "fields": {
    "name": "",
    "desc": "Your Wisdom or Charisma score increases by 1.",
    "type": null,
    "feat": "empathic"
  }
},
{
  "model": "api_v2.capability",
  "pk": 187,
  "fields": {
    "name": "",
    "desc": "You gain an expertise die on Insight checks made against other creatures.",
    "type": null,
    "feat": "empathic"
  }
},
{
  "model": "api_v2.capability",
  "pk": 188,
  "fields": {
    "name": "",
    "desc": "When using a social skill and making a Charisma check another creature, you score a critical success on a roll of 19–20.",
    "type": null,
    "feat": "empathic"
  }
},
{
  "model": "api_v2.capability",
  "pk": 189,
  "fields": {
    "name": "",
    "desc": "Whenever you cast a spell with a Cone area, you may additionally make ranged weapon attacks with a ranged weapon you are wielding against targets within that conical area. You may make up to a number of attacks equal to the level of the spell cast, each against a different target. Ranged attacks made in this way ignore the loading quality of weapons and use your conjured magical ammunition.",
    "type": null,
    "feat": "eldritch-volley-master"
  }
},
{
  "model": "api_v2.capability",
  "pk": 190,
  "fields": {
    "name": "",
    "desc": "Whenever you make a ranged weapon attack you can choose to conjure magical ammunition and select one of the following damage types: acid, cold, fire, or lightning. Your ranged weapon attacks using this conjured ammunition deal the chosen damage type instead of whatever damage type they would normally deal, and are considered magical for the purpose of overcoming resistance and immunity. Ammunition conjured in this way disappears at the end of the turn it was fired.",
    "type": null,
    "feat": "eldritch-archer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 191,
  "fields": {
    "name": "",
    "desc": "When you hit a target with a ranged weapon attack, you can use your reaction and choose a spell of 1st-level or higher, casting it through your ammunition. The spell must have a casting time of 1 action, and target a single creature or have a range of Touch. If a spell cast in this way requires an attack roll and targets the same target as the triggering ranged weapon attack, it also hits as part of that attack. You may\r\nchoose not to deal damage with a ranged weapon attack used to cast a spell.",
    "type": null,
    "feat": "eldritch-archer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 192,
  "fields": {
    "name": "",
    "desc": "You have advantage on Investigation and Perception checks made to detect secret doors.",
    "type": null,
    "feat": "dungeoneer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 193,
  "fields": {
    "name": "",
    "desc": "You have advantage on saving throws made against traps.",
    "type": null,
    "feat": "dungeoneer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 194,
  "fields": {
    "name": "",
    "desc": "You have resistance to damage dealt by traps.",
    "type": null,
    "feat": "dungeoneer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 195,
  "fields": {
    "name": "",
    "desc": "You don’t take a −5 penalty on your passive Perception score from traveling at a fast pace.",
    "type": null,
    "feat": "dungeoneer"
  }
},
{
  "model": "api_v2.capability",
  "pk": 196,
  "fields": {
    "name": "",
    "desc": "While wielding a separate melee weapon in each hand, you gain a +1 bonus to Armor Class.",
    "type": null,
    "feat": "dual-wielding-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 197,
  "fields": {
    "name": "",
    "desc": "You can use two-weapon fighting with any two one-handed melee weapons so long as neither has the heavy property.",
    "type": null,
    "feat": "dual-wielding-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 198,
  "fields": {
    "name": "",
    "desc": "When you would normally draw or sheathe a one-handed weapon, you can instead draw or sheathe two one-handed weapons.",
    "type": null,
    "feat": "dual-wielding-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 199,
  "fields": {
    "name": "",
    "desc": "You learn the Divine Inspiration and Persuasive Speech battle hymns. These special battle hymns can only be performed while you are using your voice Art Specialty as a spell focus.\r\n**Divine Inspiration.** When an ally within 15 feet hits a creature with a melee weapon attack, your ally can deliver a Divine Smite just as if you had delivered it yourself using your Divine Smite feature expending one of your uses). If you are able to empower your smites, you may choose to empower it as normal.\r\n**Persuasive Speech.** Hostile creatures within 60 feet take a –1d4 penalty on attack rolls. You can sustain this battle hymn for up to 3 rounds without expending additional uses of Bardic Inspiration. When a hostile creature begins its third consecutive turn within range of this battle hymn it becomes charmed by you and will not attack you or your allies. If this causes combat to end early, the creatures remain charmed\r\nby you for up to 1 minute afterward or until one of them is damaged by you or an ally. For the next 24 hours after the battle hymn ends, you gain an expertise die on Charisma checks made against creatures that were charmed in this way. A creature that either shares your alignment or worships a deity that has\r\nyour alignment becomes charmed on its second consecutive turn instead. Creatures that have an opposite alignment or worship a greater entity that has an opposite alignment cannot be charmed in this way.",
    "type": null,
    "feat": "divine-orator"
  }
},
{
  "model": "api_v2.capability",
  "pk": 200,
  "fields": {
    "name": "",
    "desc": "An ability score of your choice increases by 1.",
    "type": null,
    "feat": "destinys-call"
  }
},
{
  "model": "api_v2.capability",
  "pk": 201,
  "fields": {
    "name": "",
    "desc": "When you gain inspiration through your destiny’s source of inspiration, you can choose one party member within 30 feet of you. That party member gains inspiration if they don’t have it already. Once you inspire a party member in this way, you can’t use this feature again on that party member until you finish a long rest.",
    "type": null,
    "feat": "destinys-call"
  }
},
{
  "model": "api_v2.capability",
  "pk": 202,
  "fields": {
    "name": "",
    "desc": "When you are wielding a finesse weapon with which you are proficient and would be hit by a melee attack, you can use your reaction to add your proficiency bonus to your Armor Class against that attack.",
    "type": null,
    "feat": "deflector"
  }
},
{
  "model": "api_v2.capability",
  "pk": 203,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with the Farshot Stance and Ricochet maneuvers, and do not have to spend exertion to activate them.",
    "type": null,
    "feat": "deadeye"
  }
},
{
  "model": "api_v2.capability",
  "pk": 204,
  "fields": {
    "name": "",
    "desc": "Before you make an attack with a ranged weapon you are proficient with, you can choose to take a penalty on the attack roll equal to your proficiency bonus. If the attack hits, you deal extra damage equal to double your proficiency bonus. This extra damage does not double on a critical hit.",
    "type": null,
    "feat": "deadeye"
  }
},
{
  "model": "api_v2.capability",
  "pk": 205,
  "fields": {
    "name": "",
    "desc": "You ignore half cover and three-quarters cover when making a ranged weapon attack.",
    "type": null,
    "feat": "deadeye"
  }
},
{
  "model": "api_v2.capability",
  "pk": 206,
  "fields": {
    "name": "",
    "desc": "If proficient with a crossbow, you ignore its loading property.",
    "type": null,
    "feat": "crossbow-expertise"
  }
},
{
  "model": "api_v2.capability",
  "pk": 207,
  "fields": {
    "name": "",
    "desc": "You do not have disadvantage on ranged attack rolls from being within 5 feet of a hostile creature.",
    "type": null,
    "feat": "crossbow-expertise"
  }
},
{
  "model": "api_v2.capability",
  "pk": 208,
  "fields": {
    "name": "",
    "desc": "When you attack with a one-handed weapon using the Attack action, you can use a bonus action to  \r\nattack with a hand crossbow wielded in your off-hand.",
    "type": null,
    "feat": "crossbow-expertise"
  }
},
{
  "model": "api_v2.capability",
  "pk": 209,
  "fields": {
    "name": "",
    "desc": "Choose one of the following types of crafted item: armor, engineered items, potions, rings and rods, staves and wands, weapons, wondrous items.\r\n\r\nThis feat can be selected multiple times, choosing a different type of crafted item each time.",
    "type": null,
    "feat": "crafting-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 210,
  "fields": {
    "name": "",
    "desc": "You gain advantage on checks made to craft, maintain, and repair that type of item.",
    "type": null,
    "feat": "crafting-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 211,
  "fields": {
    "name": "",
    "desc": "You gain an expertise die on checks made to craft, maintain, and repair items.",
    "type": null,
    "feat": "crafting-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 212,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with two tools of your choice.",
    "type": null,
    "feat": "crafting-expert"
  }
},
{
  "model": "api_v2.capability",
  "pk": 213,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with thieves' tools, the poisoner's kit, or a rare weapon with the stealthy property.",
    "type": null,
    "feat": "covert-training"
  }
},
{
  "model": "api_v2.capability",
  "pk": 214,
  "fields": {
    "name": "",
    "desc": "You gain two skill tricks of your choice from the rogue class.",
    "type": null,
    "feat": "covert-training"
  }
},
{
  "model": "api_v2.capability",
  "pk": 215,
  "fields": {
    "name": "",
    "desc": "You gain proficiency with the Deceptive Stance and Painful Pickpocket maneuvers, and do not have to spend exertion to activate them.",
    "type": null,
    "feat": "combat-thievery"
  }
},
{
  "model": "api_v2.capability",
  "pk": 216,
  "fields": {
    "name": "",
    "desc": "You gain an expertise die on Sleight of Hand checks.",
    "type": null,
    "feat": "combat-thievery"
  }
},
{
  "model": "api_v2.capability",
  "pk": 217,
  "fields": {
    "name": "",
    "desc": "After dashing (with the Dash Action) at least ten feet towards a foe, you may perform a bonus action to select one of the following options.\r\n**Attack.** Make one melee weapon attack, dealing an extra 5 damage on a hit. \r\n**Shove.** Use the Shove maneuver, pushing the target 10 feet directly away on a success.",
    "type": null,
    "feat": "bull-rush"
  }
},
{
  "model": "api_v2.capability",
  "pk": 218,
  "fields": {
    "name": "",
    "desc": "After making a melee attack, you may reroll any weapon damage and choose the better result. This feat can be used no more than once per turn.",
    "type": null,
    "feat": "brutal-attack"
  }
},
{
  "model": "api_v2.capability",
  "pk": 219,
  "fields": {
    "name": "",
    "desc": "You gain a 1d6 expertise die on concentration checks to maintain spells you have cast.",
    "type": null,
    "feat": "battle-caster"
  }
},
{
  "model": "api_v2.capability",
  "pk": 220,
  "fields": {
    "name": "",
    "desc": "While wielding weapons and shields, you may cast spells with a seen component.",
    "type": null,
    "feat": "battle-caster"
  }
},
{
  "model": "api_v2.capability",
  "pk": 221,
  "fields": {
    "name": "",
    "desc": "Instead of making an opportunity attack with a weapon, you may use your reaction to cast a spell with a casting time of 1 action. The spell must be one that only targets that creature.",
    "type": null,
    "feat": "battle-caster"
  }
},
{
  "model": "api_v2.capability",
  "pk": 222,
  "fields": {
    "name": "",
    "desc": "When rolling initiative you gain a +5 bonus.",
    "type": null,
    "feat": "attentive"
  }
},
{
  "model": "api_v2.capability",
  "pk": 223,
  "fields": {
    "name": "",
    "desc": "You can only be surprised if you are unconscious. A creature attacking you does not gain advantage from being hidden from you or unseen by you.",
    "type": null,
    "feat": "attentive"
  }
},
{
  "model": "api_v2.capability",
  "pk": 224,
  "fields": {
    "name": "",
    "desc": "Your Strength or Dexterity score increases by 1, to a maximum of 20.",
    "type": null,
    "feat": "athletic"
  }
},
{
  "model": "api_v2.capability",
  "pk": 225,
  "fields": {
    "name": "",
    "desc": "When you are prone, standing up uses only 5 feet of your movement (instead of half).",
    "type": null,
    "feat": "athletic"
  }
},
{
  "model": "api_v2.capability",
  "pk": 226,
  "fields": {
    "name": "",
    "desc": "Your speed is not halved from climbing.",
    "type": null,
    "feat": "athletic"
  }
},
{
  "model": "api_v2.capability",
  "pk": 227,
  "fields": {
    "name": "",
    "desc": "You can make a running long jump or a running high jump after moving 5 feet on foot (instead of 10 feet).",
    "type": null,
    "feat": "athletic"
  }
},
{
  "model": "api_v2.capability",
  "pk": 228,
  "fields": {
    "name": "",
    "desc": "Whenever you make a ranged weapon attack, you can choose to expend a 1st-level or higher spell slot to enhance the attack to be empowered or unerring. You cannot enhance more than one attack in a\r\nturn in this way. \r\n**Empowered.** The shot deals an additional 2d6 force damage, and an additional 1d6 force damage for each spell slot level above 1st. \r\n**Unerring.** The shot gains a +2 bonus to the attack roll, and an additional +2 bonus for each spell slot level above 1st.",
    "type": null,
    "feat": "arrow-enchanter"
  }
},
{
  "model": "api_v2.capability",
  "pk": 229,
  "fields": {
    "name": "",
    "desc": "Whenever you cast a spell that deals damage, you may choose the type of damage that spell deals and the appearance of the spell’s effects.",
    "type": null,
    "feat": "arcanum-master"
  }
},
{
  "model": "api_v2.capability",
  "pk": 230,
  "fields": {
    "name": "",
    "desc": "You gain an expertise die on ability checks made to drive or pilot a vehicle.",
    "type": null,
    "feat": "ace-driver"
  }
},
{
  "model": "api_v2.capability",
  "pk": 231,
  "fields": {
    "name": "",
    "desc": "While piloting a vehicle, you can use your reaction to take the Brake or Maneuver vehicle actions.",
    "type": null,
    "feat": "ace-driver"
  }
},
{
  "model": "api_v2.capability",
  "pk": 232,
  "fields": {
    "name": "",
    "desc": "A vehicle you load can carry 25% more cargo than normal.",
    "type": null,
    "feat": "ace-driver"
  }
},
{
  "model": "api_v2.capability",
  "pk": 233,
  "fields": {
    "name": "",
    "desc": "Vehicles you are piloting only suffer a malfunction when reduced to 25% of their hit points, not 50%. In addition, when the vehicle does suffer a malfunction, you roll twice on the maneuver table and choose which die to use for the result.",
    "type": null,
    "feat": "ace-driver"
  }
},
{
  "model": "api_v2.capability",
  "pk": 234,
  "fields": {
    "name": "",
    "desc": "Vehicles you are piloting gain a bonus to their Armor Class equal to half your proficiency bonus.",
    "type": null,
    "feat": "ace-driver"
  }
},
{
  "model": "api_v2.capability",
  "pk": 235,
  "fields": {
    "name": "",
    "desc": "When you Brake, you can choose to immediately stop the vehicle without traveling half of its movement speed directly forward.",
    "type": null,
    "feat": "ace-driver"
  }
},
{
  "model": "api_v2.capability",
  "pk": 236,
  "fields": {
    "name": "",
    "desc": "You gain advantage on attack rolls against a creature you are grappling.",
    "type": null,
    "feat": "a5e-grappler"
  }
},
{
  "model": "api_v2.capability",
  "pk": 237,
  "fields": {
    "name": "",
    "desc": "You can use your action to try to pin a creature you are grappling. The creature makes a Strength or Dexterity saving throw against your maneuver DC. On a failure, you and the creature are both restrained  until the grapple ends.",
    "type": null,
    "feat": "a5e-grappler"
  }
},
{
  "model": "api_v2.capability",
  "pk": 238,
  "fields": {
    "name": "",
    "desc": "Creatures with a CR lower than your alter ego’s Prestige rating are frightened of you while you are in your alter ego.",
    "type": null,
    "feat": "a-symbol-that-strikes-fear"
  }
},
{
  "model": "api_v2.capability",
  "pk": 239,
  "fields": {
    "name": "",
    "desc": "In addition, you become particularly adept at subduing your enemies rather than outright killing them. Whenever you begin a turn grappling a creature, you can attempt to non-lethally subdue it. The grappled creature makes a Constitution saving throw against your maneuver DC. On a failed saving throw, a creature is knocked unconscious for the next hour. A creature with more than 25% of its maximum hit points automatically succeeds on this saving throw.",
    "type": null,
    "feat": "a-symbol-that-strikes-fear"
  }
}
]
