[
    {
        "name": "Court Servant",
        "desc": "Even though you are independent now, you were once a servant to a merchant, noble, regent, or other person of high station. You are an expert in complex social dynamics and knowledgeable in the history and customs of courtly life. Work with your GM to determine whom you served and why you are no longer a servant: did your master or masters retire and no longer require servants, did you resign from the service of a harsh master, did the court you served fall to a neighboring empire, or did something else happen?",
        "skill-proficiencies": "History, Insight",
        "tool-proficiencies": "One artisan's tools set of your choice",
        "languages": "One of your choice",
        "equipment": "A set of artisan's tools of your choice, a unique piece of jewelry, a set of fine clothes, a handcrafted pipe, and a belt pouch containing 20 gp",
        "feature-name": "Servant's Invisibility",
        "feature-desc": "The art of excellent service requires a balance struck between being always available and yet unobtrusive, and you've mastered it. If you don't perform a visible action, speak or be spoken to, or otherwise have attention drawn to you for at least 1 minute, creatures nearby have trouble remembering you are even in the room. Until you speak, perform a visible action, or have someone draw attention to you, creatures must succeed on a Wisdom (Perception) check (DC equal to 8 + your Charisma modifier + your proficiency bonus) to notice you. Otherwise, they conduct themselves as though you aren't present until either attention is drawn to you or one of their actions would take them into or within 5 feet of the space you occupy.",
        "suggested-characteristics": "Court servants tend to be outwardly quiet and soft-spoken, but their insight into the nuances of conversation and societal happenings is unparalleled. When in crowds or around strangers, most court servants keep to themselves, quietly observing their surroundings and later sharing such observations with those they trust.\n\n        | d8 | Personality Trait                                                                                          |\n|----|------------------------------------------------------------------------------------------------------------|\n| 1  | Unless I must speak, I hold my breath while serving others.                                                |\n| 2  | It takes all my effort not to show the effusive emotions I feel when I help others. Best to quietly serve. |\n| 3  | It's getting harder to tolerate the prejudices of those I serve daily.                                     |\n| 4  | Though the old ways are hard to give up, I want to be my own boss. I'll decide my path.                    |\n        | 5  | Serving my family and friends is the only thing I truly care about.                                        |\n| 6  | City life is killing my soul. I long for the old courtly ways.                                             |\n| 7  | It's time for my fellows to wake up and be taken advantage of no longer.                                   |\n| 8  | It's the small things that make it all worthwhile. I try to be present in every moment.                    |\n\n| d6 | Ideal                                                                                                                     |\n|----|---------------------------------------------------------------------------------------------------------------------------|\n| 1  | **Family.** My family, whether the one I come from or the one I make, is the thing in this world most worth protecting. (Any) |\n| 2  | **Service.** I am most rewarded when I know I have performed a valuable service for another. (Good)                           |\n| 3  | **Sloth.** What's the point of helping anyone now that I've been discarded? (Chaotic)                                         |\n| 4  | **Compassion.** I can't resist helping anyone in need. (Good)                                                                 |\n| 5  | **Tradition.** Life under my master's rule was best, and things should be kept as close to their ideals as possible. (Lawful) |\n| 6  | **Joy.** The pursuit of happiness is the only thing worth serving anymore. (Neutral)                                          |\n\n| d6 | Bond                                                                                                                                                     |\n|----|----------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | My family needs me to provide for them. They mean everything to me, which means I'll do whatever it takes.                                               |\n| 2  | My kin have served this holding and its lords and ladies for generations. I serve them faithfully to make my lineage proud.                              |\n| 3  | I can't read the inscriptions on this odd ring, but it's all I have left of my family and our history of loyal service.                                  |\n| 4  | I'm with the best friends a person can ask for, so why do I feel so lonesome and homesick?                                                               |\n| 5  | I've found a profession where my skills are put to good use, and I won't let anyone bring me down.                                                       |\n| 6  | I found peace in a special garden filled with beautiful life, but I only have this flower to remind me. Someday I'll remember where to find that garden. |\n\n| d6 | Flaw                                                                                             |\n|----|--------------------------------------------------------------------------------------------------|\n        | 1  | I would rather serve darkness than serve no one.                                                 |\n| 2  | I'm afraid of taking risks that might be good for me.                                            |\n| 3  | I believe my master's people are superior to all others, and I'm not afraid to share that truth. |\n| 4  | I always do as I'm told, even though sometimes I don't think I should.                           |\n| 5  | I know what's best for everyone, and they'd all be better off if they'd follow my advice.        |\n| 6  | I can't stand seeing ugly or depressing things. I'd much rather think happy thoughts.            |"
    },
    {
        "name": "Desert Runner",
        "desc": "You grew up in the desert. As a nomad, you moved from place to place, following the caravan trails. Your upbringing makes you more than just accustomed to desert living—you thrive there. Your family has lived in the desert for centuries, and you know more about desert survival than life in the towns and cities.",
        "skill-proficiencies": "Perception, Survival",
        "tool-proficiencies": "Herbalist kit",
        "languages": "One of your choice",
        "equipment": "Traveler's clothes, herbalist kit, waterskin, pouch with 10 gp",
        "feature-name": "Nomad",
        "feature-desc": "Living in the open desert has allowed your body to adapt to a range of environmental conditions. You can survive on 1 gallon of water in hot conditions (or 1/2 gallon in normal conditions) without being forced to make Constitution saving throws, and you are considered naturally adapted to hot climates. While in a desert, you can read the environment to predict natural weather patterns and temperatures for the next 24 hours, allowing you to cross dangerous terrain at the best times. The accuracy of your predictions is up to the GM, but they should be reliable unless affected by magic or unforeseeable events, such as distant earthquakes or volcanic eruptions.",
        "suggested-characteristics": "Those raised in the desert can be the friendliest of humanoids—knowing allies are better than enemies in that harsh environment—or territorial and warlike, believing that protecting food and water sources by force is the only way to survive.\n\n| d8 | Personality Trait |\n|----|--------------------------------------------------------------------------------------------|\n| 1  | I'm much happier sleeping under the stars than in a bed in a stuffy caravanserai.          |\n| 2  | It's always best to help a traveler in need; one day it might be you.                      |\n| 3  | I am slow to trust strangers, but I'm extremely loyal to my friends.                       |\n| 4  | If there's a camel race, I'm the first to saddle up!                                       |\n| 5  | I always have a tale or poem to share at the campfire.                                     |\n| 6  | I don't like sleeping in the same place more than two nights in a row.                     |\n| 7  | I've been troubled by dreams for the last month. I am determined to uncover their meaning. |\n| 8  | I feel lonelier in a crowded city than I do out on the empty desert sands.                 |\n\n| d6 | Ideal                                                                                                       |\n|----|-------------------------------------------------------------------------------------------------------------|\n| 1  | **Greater Good.** The needs of the whole tribe outweigh those of the individuals who are part of it. (Good)     |\n| 2  | **Nature.** I must do what I can to protect the beautiful wilderness from those who would do it harm. (Neutral) |\n| 3  | **Tradition.** I am duty-bound to follow my tribe's age-old route through the desert. (Lawful)                  |\n| 4  | **Change.** Things seldom stay the same and we must always be prepared to go with the flow. (Chaotic)           |\n| 5  | **Honor.** If I behave dishonorably, my actions will bring shame upon the entire tribe. (Lawful)                |\n| 6  | **Greed.** Seize what you want if no one gives it to you freely. (Evil)                                         |\n\n| d6 | Bond                                                                                                                       |\n|----|----------------------------------------------------------------------------------------------------------------------------|\n| 1  | I am the last living member of my tribe, and I cannot let their deaths go unavenged.                                       |\n| 2  | I follow the spiritual path of my tribe; it will bring me to the best afterlife when the time comes.                       |\n| 3  | My best friend has been sold into slavery to devils, and I need to rescue them before it is too late.                      |\n| 4  | A nature spirit saved my life when I was dying of thirst in the desert.                                                    |\n| 5  | My takoba sword is my most prized possession; for over two centuries, it's been handed down from generation to generation. |\n| 6  | I have sworn revenge on the sheikh who unjustly banished me from the tribe.                                                |\n\n| d6 | Flaw                                                                  |\n|----|-----------------------------------------------------------------------|\n| 1  | I enjoy the company of camels more than people.                       |\n| 2  | I can be loud and boorish after a few wineskins.                      |\n| 3  | If I feel insulted, I'll refuse to speak to anyone for several hours. |\n| 4  | I enjoy violence and mayhem a bit too much.                           |\n| 5  | You can't rely on me in a crisis.                                     |\n| 6  | I betrayed my brother to cultists to save my own skin.                |"
    },
    {
        "name": "Destined",
        "desc": "Duty is a complicated, tangled affair, be it filial, political, or civil. Sometimes, there's wealth and intrigue involved, but more often than not, there's also obligation and responsibility. You are a person with just such a responsibility. This could involve a noble title, an arranged marriage, a family business you're expected to administer, or an inherited civil office. You promised to fulfill this responsibility, you are desperately trying to avoid this duty, or you might even be seeking the person intended to be at your side. Regardless of the reason, you're on the road, heading toward or away from your destiny.\n\n***Destiny***\nYou're a person who's running from something or hurtling headfirst towards something, but just what is it? The responsibility or event might be happily anticipated or simply dreaded; either way, you're committed to the path. Choose a destiny or roll a d8 and consult the table below.\n\n| d8 | Destiny                                                                                |\n|----|---------------------------------------------------------------------------------------------------------------------------|\n| 1  | You are running away from a marriage.                                                                                     |\n| 2  | You are seeking your runaway betrothed.                                                                                   |\n| 3  | You don't want to take over your famous family business.                                                                  |\n| 4  | You need to arrive at a religious site at a specific time to complete an event or prophecy.                               |\n| 5  | Your noble relative died, and you're required to take their vacant position.                                              |\n| 6  | You are the reincarnation of a famous figure, and you're expected to live in an isolated temple.                          |\n| 7  | You were supposed to serve an honorary but dangerous position in your people's military.                                  |\n| 8  | Members of your family have occupied a civil office (court scribe, sheriff, census official, or similar) for generations. |",
        "skill-proficiencies": "History, Insight",
        "tool-proficiencies": "No additional tool proficiencies",
        "languages": "One of your choice",
        "equipment": "A dagger, quarterstaff, or spear, a set of traveler's clothes, a memento of your destiny (a keepsake from your betrothed, the seal of your destined office, your family signet ring, or similar), a belt pouch containing 15 gp",
        "feature-name": "Reputation of Opportunity",
        "feature-desc": "Your story precedes you, as does your quest to claim—or run away from—your destiny. Those in positions of power, such as nobles, bureaucrats, rich merchants, and even mercenaries and brigands, all look to either help or hinder you, based on what they think they may get out of it. They're always willing to meet with you briefly to see just how worthwhile such aid or interference might be. This might mean a traveler pays for your passage on a ferry, a generous benefactor covers your group's meals at a tavern, or a local governor invites your adventuring entourage to enjoy a night's stay in their guest quarters. However, the aid often includes an implied threat or request. Some might consider delaying you as long as politely possible, some might consider taking you prisoner for ransom or to do “what's best” for you, and others might decide to help you on your quest in exchange for some future assistance. You're never exactly sure of the associated “cost” of the person's aid until the moment arrives. In the meantime, the open road awaits.",
        "suggested-characteristics": "Destined characters might be running toward or away from destiny, but whatever the case, their destiny has shaped them. Think about the impact of your destiny on you and the kind of relationship you have with your destiny. Do you embrace it? Accept it as inevitable? Or do you fight it every step of the way?\n\n| d8 | Personality Trait                                                                                                                            |\n|----|----------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | I'm eager to find this destiny and move on with the next stage in my life.                                                                   |\n| 2  | I keep the fire of my hope burning bright. I'm sure this will work out for the best.                                                         |\n| 3  | Fate has a way of finding you no matter what you do. I'm resigned to whatever they have planned for me, but I'll enjoy my time on the way.   |\n| 4  | I owe it to myself or to those who helped establish this destiny. I'm determined to follow this through to the end.                          |\n| 5  | I don't know what this path means for me or my future. I'm more afraid of going back to that destiny than of seeing what's out in the world. |\n| 6  | I didn't ask for this, and I don't want it. I'm bitter that I must change my life for it.                                                    |\n| 7  | Few have been chosen to complete this lifepath, and I'm proud to be one of them.                                                             |\n| 8  | Who can say how this will work out? The world is an uncertain place, and I'll find my destiny when it finds me.                              |\n\n| d6 | Ideal                                                                                                          |\n|----|----------------------------------------------------------------------------------------------------------------|\n| 1  | **Inevitability.** What's coming can't be stopped, and I'm dedicated to making it happen. (Evil)               |\n| 2  | **Tradition.** I'm part of a cycle that has repeated for generations. I can't deny that. (Any)                 |\n| 3  | **Defiance.** No one can make me be something I don't want to be. (Any)                                        |\n| 4  | **Greater Good.** Completing my duty ensures the betterment of my family, community, or region. (Good)         |\n| 5  | **Power.** If I can take this role and be successful, I'll have opportunities to do whatever I want. (Chaotic) |\n| 6  | **Responsibility.** It doesn't matter if I want it or not; it's what I'm supposed to do. (Lawful)              |\n\n| d6 | Bond                                                                                                                  |\n|----|-----------------------------------------------------------------------------------------------------------------------|\n| 1  | The true gift of my destiny is the friendships I make along the way to it.                                            |\n| 2  | The benefits of completing this destiny will strengthen my family for years to come.                                  |\n| 3  | Trying to alter my decision regarding my destiny is an unthinkable affront to me.                                     |\n| 4  | How I reach my destiny is just as important as how I accomplish my destiny.                                           |\n| 5  | People expect me to complete this task. I don't know how I feel about succeeding or failing, but I'm committed to it. |\n| 6  | Without this role fulfilled, the people of my home region will suffer, and that's not acceptable.                     |\n\n| d6 | Flaw                                                                                          |\n|----|-----------------------------------------------------------------------------------------------|\n| 1  | If you don't have a destiny, are you really special?                                          |\n| 2  | But I am the “Chosen One.”                                                                    |\n| 3  | I fear commitment; that's what this boils down to in the end.                                 |\n| 4  | What if I follow through with this and I fail?                                                |\n| 5  | It doesn't matter what someone else sacrificed for this. I only care about my feelings.       |\n| 6  | Occasionally—ok, maybe “often”—I make poor decisions in life, like running from this destiny. |"
    },
    {
        "name": "Diplomat",
        "desc": "You have always found harmonious solutions to conflict. You might have started mediating family conflicts as a child. When you were old enough to recognize aggression, you sought to defuse it. You often resolved disputes among neighbors, arriving at a fair middle ground satisfactory to all parties.",
        "skill-proficiencies": "Insight, Persuasion",
        "tool-proficiencies": "No additional tool proficiencies",
        "languages": "Two of your choice",
        "equipment": "A set of fine clothes, a letter of passage from a local minor authority or traveling papers that signify you as a traveling diplomat, and a belt pouch containing 20 gp",
        "feature-name": "A Friend in Every Port",
        "feature-desc": "Your reputation as a peacemaker precedes you, or people recognize your easy demeanor, typically allowing you to attain food and lodging at a discount. In addition, people are predisposed to warn you about dangers in a location, alert you when a threat approaches you, or seek out your help for resolving conflicts between locals.",
        "suggested-characteristics": "Diplomats always have kind words and encourage their companions to think positively when encountering upsetting situations or people. Diplomats have their limits, however, and are quick to discover when someone is negotiating in bad faith.\n\n| d8 | Personality Trait                                                                                             |\n|----|---------------------------------------------------------------------------------------------------------------|\n| 1  | I like to travel, meet new people, and learn about different customs.                                         |\n| 2  | I intercede in minor squabbles to find common ground on all sides.                                            |\n| 3  | I never disparage others, even when they might deserve such treatment.                                        |\n| 4  | I always try to make a new friend wherever I travel, and when I return to those areas, I seek out my friends. |\n| 5  | I have learned how to damn with faint praise, but I only use it when someone has irked me.                    |\n| 6  | I am not opposed to throwing a bit of coin around to ensure a good first impression.                          |\n| 7  | Even when words fail at the outset, I still try to calm tempers.                                              |\n| 8  | I treat everyone as an equal, and I encourage others to do likewise.                                          |\n\n| d6 | Ideal                                                                                                                              |\n|----|------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | **Harmony.** I want everyone to get along. (Good)                                                                                      |\n| 2  | **Contractual.** When I resolve a conflict, I ensure all parties formally acknowledge the resolution. (Lawful)                         |\n| 3  | **Selfishness.** I use my way with words to benefit myself the most. (Evil) 4 Freedom. Tyranny is a roadblock to compromise. (Chaotic) |\n| 4  | **Freedom.** Tyranny is a roadblock to compromise. (Chaotic)                                                                           |\n| 5  | **Avoidance.** A kind word is preferable to the drawing of a sword. (Any)                                                              |\n| 6  | **Unity.** It is possible to achieve a world without borders and without conflict. (Any)                                               |\n\n| d6 | Bond |\n|----|------|\n| 1  | I want to engineer a treaty with far-reaching effects in the world. |\n| 2  | I am carrying out someone else's agenda and making favorable arrangements for my benefactor. |\n| 3  | A deal I brokered went sour, and I am trying to make amends for my mistake. |\n| 4  | My nation treats everyone equitably, and I'd like to bring that enlightenment to other nations. |\n| 5  | A traveling orator taught me the power of words, and I want to emulate that person. |\n| 6  | I fear a worldwide conflict is imminent, and I want to do all I can to stop it. |\n\n| d6 | Flaw |\n|----|------|\n| 1  | I always start by appealing to a better nature from those I face, regardless of their apparent hostility. |\n| 2  | I assume the best in everyone, even if I have been betrayed by that trust in the past. |\n| 3  | I will stand in the way of an ally to ensure conflicts don't start. |\n| 4  | I believe I can always talk my way out of a problem. |\n| 5  | I chastise those who are rude or use vulgar language. |\n| 6  | When I feel I am on the verge of a successful negotiation, I often push my luck to obtain further concessions. |"
    },
    {
        "name": "Forest Dweller",
        "desc": "You are a creature of the forest, born and reared under a canopy of green. You expected to live all your days in the forest, at one with the green things of the world, until an unforeseen occurrence, traumatic or transformative, drove you from your familiar home and into the larger world. Civilization is strange to you, the open sky unfamiliar, and the bizarre ways of the so-called civilized world run counter to the truths of the natural world.",
        "skill-proficiencies": "Nature, Survival",
        "tool-proficiencies": "Woodcarver's tools, Herbalism kit",
        "languages": "Sylvan",
        "equipment": "A set of common clothes, a hunting trap, a wood staff, a whetstone, an explorer's pack, and a pouch containing 5 gp",
        "feature-name": "Forester",
        "feature-desc": "Your experience living, hunting, and foraging in the woods gives you a wealth of experience to draw upon when you are traveling within a forest. If you spend 1 hour observing, examining, and exploring your surroundings while in a forest, you are able to identify a safe location to rest. The area is protected from all but the most extreme elements and from the nonmagical native beasts of the forest. In addition, you are able to find sufficient kindling for a small fire throughout the night.\n\n ***Life-Changing Event***\nYou have lived a simple life deep in the sheltering boughs of the forest, be it as a trapper, farmer, or villager eking out a simple existence in the forest. But something happened that set you on a different path and marked you for greater things. Choose or randomly determine a defining event that caused you to leave your home for the wider world. \n\n**Event Options (table)**\n\n| d8 | Event                                                                                                                                                                                                                                                       |\n|----|------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | You were living within the forest when cesspools of magical refuse from a nearby city expanded and drove away the game that sustained you. You had to move to avoid the prospect of a long, slow demise via starvation.                                    |\n| 2  | Your village was razed by a contingent of undead. For reasons of its own, the forest and its denizens protected and hid you from their raid.                                                                                                               |\n| 3  | A roving band of skeletons and zombies attacked your family while you were hunting.                                                                                                                                                                        |\n| 4  | You are an ardent believer in the preservation of the forest and the natural world. When the people of your village abandoned those beliefs, you were cast out and expelled into the forest.                                                               |\n| 5  | You wandered into the forest as a child and became lost. For inexplicable reasons, the forest took an interest in you. You have faint memories of a village and have had no contact with civilization in many years.                                       |\n| 6  | You were your village's premier hunter. They relied on you for game and without your contributions their survival in the winter was questionable. Upon returning from your last hunt, you found your village in ruins, as if decades had passed overnight. |\n| 7  | Your quiet, peaceful, and solitary existence has been interrupted with dreams of the forest's destruction, and the urge to leave your home compels you to seek answers.                                                                                    |\n| 8  | Once in a hidden glen, you danced with golden fey and forgotten gods. Nothing in your life since approaches that transcendent moment, cursing you with a wanderlust to seek something that could.                                                          |",
        "suggested-characteristics": "Forest dwellers tend toward solitude, introspection, and self-sufficiency. You keep your own council, and you are more likely to watch from a distance than get involved in the affairs of others. You are wary, slow to trust, and cautious of depending on outsiders.\n\n| d8 | Personality Trait                                                                                                                                                                                 |\n|----|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | I will never forget being hungry in the winter. I field dress beasts that fall to blade or arrow so that I am never hungry again.                                                                 |\n| 2  | I may be alone in the forest, but I am only ever lonely in cities.                                                                                                                                |\n| 3  | Walking barefoot allows me to interact more intuitively with the natural world.                                                                                                                   |\n| 4  | The road is just another kind of wall. I make my own paths and go where I will.                                                                                                                   |\n| 5  | Others seek the gods in temples and shrines, but I know their will is only revealed in the natural world, not an edifice constructed by socalled worshippers. I pray in the woods, never indoors. |\n| 6  | What you call personal hygiene, I call an artificially imposed distraction from natural living.                                                                                                   |\n| 7  | No forged weapon can replace the sheer joy of a kill accomplished only with hands and teeth.                                                                                                      |\n| 8  | Time lived alone has made me accustomed to talking loudly to myself, something I still do even when others are present.                                                                           |\n\n| d6 | Ideal                                                                                                                                                                                          |\n|----|------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | Change. As the seasons shift, so too does the world around us. To resist is futile and anathema to the natural order. (Chaotic)                                                                |\n| 2  | Conservation. All life should be preserved and, if needed, protected. (Good)                                                                                                                   |\n| 3  | Acceptance. I am a part of my forest, no different from any other flora and fauna. To think otherwise is arrogance and folly. When I die, it will be as a leaf falling in the woods. (Neutral) |\n| 4  | Cull. The weak must be removed for the strong to thrive. (Evil)                                                                                                                                |\n| 5  | Candor. I am open, plain, and simple in life, word, and actions. (Any)                                                                                                                         |\n| 6  | Balance. The forest does not lie. The beasts do not create war. Equity in all things is the way of nature. (Neutral)                                                                           |\n\n| d6 | Bond                                                                                                   |\n|----|--------------------------------------------------------------------------------------------------------|\n| 1  | When I lose a trusted friend or companion, I plant a tree upon their grave.                            |\n| 2  | The voice of the forest guides me, comforts me, and protects me.                                       |\n| 3  | The hermit who raised me and taught me the ways of the forest is the most important person in my life. |\n| 4  | I have a wooden doll, a tiny wickerman, that I made as a child and carry with me at all times.         |\n| 5  | I know the ways of civilizations rise and fall. The forest and the Old Ways are eternal.               |\n| 6  | I am driven to protect the natural order from those that would disrupt it.                             |\n\n| d6 | Flaw                                                                                                                                                                   |\n|----|------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | I am accustomed to doing what I like when I like. I'm bad at compromising, and I must exert real effort to make even basic conversation with other people.             |\n| 2  | I won't harm a beast without just cause or provocation.                                                                                                                |\n| 3  | Years of isolated living has left me blind to the nuances of social interaction. It is a struggle not to view every new encounter through the lens of fight or flight. |\n| 4  | The decay after death is merely the loam from which new growth springs—and I enjoy nurturing new growth.                                                               |\n| 5  | An accident that I caused incurred great damage upon my forest, and, as penance, I have placed myself in self-imposed exile.                                           |\n| 6  | I distrust the undead and the unliving, and I refuse to work with them.                                                                                                |"
    },
    {
        "name": "Former Adventurer",
        "desc": "As you belted on your weapons and hoisted the pack onto your back, you never thought you'd become an adventurer again. But the heroic call couldn't be ignored. You've tried this once before—perhaps it showered you in wealth and glory or perhaps it ended with sorrow and regret. No one ever said adventuring came with a guarantee of success.\n  Now, the time has come to set off toward danger once again. The reasons for picking up adventuring again vary. Could it be a calamitous threat to the town? The region? The world? Was the settled life not what you expected? Or did your past finally catch up to you? In the end, all that matters is diving back into danger. And it's time to show these new folks how it's done.\n\n***Reason for Retirement***\nGiving up your first adventuring career was a turning point in your life. Triumph or tragedy, the reason why you gave it up might still haunt you and may shape your actions as you reenter the adventuring life. Choose the event that led you to stop adventuring or roll a d12 and consult the table below.\n\n| d12  | Event                                                                                                      |\n|------|------------------------------------------------------------------------------------------------------------|\n| 1    | Your love perished on one of your adventures, and you quit in despair.                                     |\n| 2    | You were the only survivor after an ambush by a hideous beast.                                             |\n| 3    | Legal entanglements forced you to quit, and they may cause you trouble again.                              |\n| 4    | A death in the family required you to return home.                                                         |\n| 5    | Your old group disowned you for some reason.                                                               |\n| 6    | A fabulous treasure allowed you to have a life of luxury, until the money ran out.                         |\n| 7    | An injury forced you to give up adventuring.                                                               |\n| 8    | You suffered a curse which doomed your former group, but the curse has finally faded away.                 |\n| 9    | You rescued a young child or creature and promised to care for them. They have since grown up and left.    |\n| 10   | You couldn't master your fear and fled from a dangerous encounter, never to return.                        |\n| 11   | As a reward for helping an area, you were offered a position with the local authorities, and you accepted. |\n| 12   | You killed or defeated your nemesis. Now they are back, and you must finish the job.                       |",
        "skill-proficiencies": "Perception, Survival",
        "tool-proficiencies": "No additional tool proficiencies",
        "languages": "One of your choice",
        "equipment": "A dagger, quarterstaff, or shortsword (if proficient), an old souvenir from your previous adventuring days, a set of traveler's clothes, 50 feet of hempen rope, and a belt pouch containing 15 gp",
        "feature-name": "Old Friends and Enemies",
        "feature-desc": "Your previous career as an adventurer might have been brief or long. Either way, you certainly journeyed far and met people along the way. Some of these acquaintances might remember you fondly for aiding them in their time of need. On the other hand, others may be suspicious, or even hostile, because of your past actions. When you least expect it, or maybe just when you need it, you might encounter someone who knows you from your previous adventuring career. These people work in places high and low, their fortunes varying widely. The individual responds appropriately based on your mutual history, helping or hindering you at the GM's discretion.",
        "suggested-characteristics": "Former adventurers bring a level of practical experience that fledgling heroes can't match. However, the decisions, outcomes, successes, and failures of your previous career often weigh heavily on your mind. The past seldom remains in the past. How you rise to these new (or old) challenges determines the outcome of your new career.\n\n| d8 | Personality Trait                                                               |\n|----|---------------------------------------------------------------------------------|\n| 1  | I have a thousand stories about every aspect of the adventuring life.           |\n| 2  | My past is my own, and to the pit with anyone who pushes me about it.           |\n| 3  | I can endure any hardship without complaint.                                    |\n| 4  | I have a list of rules for surviving adventures, and I refer to them often.     |\n| 5  | It's a dangerous job, and I take my pleasures when I can.                       |\n| 6  | I can't help mentioning all the famous friends I've met before.                 |\n| 7  | Anyone who doesn't recognize me is clearly not someone worth knowing.           |\n| 8  | I've seen it all. If you don't listen to me, you're going to get us all killed. |\n\n| d6 | Ideal                                                                                       |\n|----|---------------------------------------------------------------------------------------------|\n| 1  | **Strength.** Experience tells me there are no rules to war. Only victory matters. (Evil)       |\n| 2  | **Growth.** I strive to improve myself and prove my worth to my companions—and to myself. (Any) |\n| 3  | **Thrill.** I am only happy when I am facing danger with my life on the line. (Any)             |\n| 4  | **Generous.** If I can help someone in danger, I will. (Good)                                   |\n| 5  | **Ambition.** I may have lost my renown, but nothing will stop me from reclaiming it. (Chaotic) |\n| 6  | **Responsibility.** Any cost to myself is far less than the price of doing nothing. (Lawful)    |\n\n| d6 | Bond                                                                                                                                                          |\n|----|---------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | I will end the monsters who killed my family and pulled me back into the adventuring life.                                                                    |\n| 2  | A disaster made me retire once. Now I will stop it from happening to anyone else.                                                                             |\n| 3  | My old weapon has been my trusted companion for years. It's my lucky charm.                                                                                   |\n| 4  | My family doesn't understand why I became an adventurer again, which is why I send them souvenirs, letters, or sketches of exciting encounters in my travels. |\n| 5  | I was a famous adventurer once. This time, I will be even more famous, or die trying.                                                                         |\n| 6  | Someone is impersonating me. I will hunt them down and restore my reputation.                                                                                 |\n\n| d6 | Flaw                                                                                |\n|----|-------------------------------------------------------------------------------------|\n| 1  | It's all about me! Haven't you learned that by now?                                 |\n| 2  | I can identify every weapon and item with a look.                                   |\n| 3  | You think this is bad? Let me tell you about something really frightening.          |\n| 4  | Sure, I have old foes around every corner, but who doesn't?                         |\n| 5  | I'm getting too old for this.                                                       |\n| 6  | Seeing the bad side in everything just protects you from inevitable disappointment. |"
    },
    {
        "name": "Freebooter",
        "desc": "You sailed the seas as a freebooter, part of a pirate crew. You should come up with a name for your former ship and its captain, as well as its hunting ground and the type of ships you preyed on. Did you sail under the flag of a bloodthirsty captain, raiding coastal communities and putting everyone to the sword? Or were you part of a group of former slaves turned pirates, who battle to end the vile slave trade? Whatever ship you sailed on, you feel at home on board a seafaring vessel, and you have difficulty adjusting to long periods on dry land.",
        "skill-proficiencies": "Athletics, Survival",
        "tool-proficiencies": "Navigator's tools, vehicles (water)",
        "languages": "No additional languages",
        "equipment": "A pirate flag from your ship, several tattoos, 50 feet of rope, a set of traveler's clothes, and a belt pouch containing 10 gp",
        "feature-name": "A Friendly Face in Every Port",
        "feature-desc": "Your reputation precedes you. Whenever you visit a port city, you can always find someone who knows of (or has sailed on) your former ship and is familiar with its captain and crew. They are willing to provide you and your traveling companions with a roof over your head, a bed for the night, and a decent meal. If you have a reputation for cruelty and savagery, your host is probably afraid of you and will be keen for you to leave as soon as possible. Otherwise, you receive a warm welcome, and your host keeps your presence a secret, if needed. They may also provide you with useful information about recent goings-on in the city, including which ships have been in and out of port.",
        "suggested-characteristics": "Freebooters are a boisterous lot, but their personalities include freedom-loving mavericks and mindless thugs. Nonetheless, sailing a ship requires discipline, and freebooters tend to be reliable and aware of their role on board, even if they do their own thing once fighting breaks out. Most still yearn for the sea, and some feel shame or regret for past deeds.\n\n| d8 | Personality Trait                                                                                                                      |\n|----|----------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | I'm happiest when I'm on a gently rocking vessel, staring at the distant horizon.                                                      |\n| 2  | Every time we hoisted the mainsail and raised the pirate flag, I felt butterflies in my stomach.                                       |\n| 3  | I have lovers in a dozen different ports. Most of them don't know about the others.                                                    |\n| 4  | Being a pirate has taught me more swear words and bawdy jokes than I ever knew existed. I like to try them out when I meet new people. |\n| 5  | One day I hope to have enough gold to fill a tub so I can bathe in it.                                                                 |\n| 6  | There's nothing I enjoy more than a good scrap—the bloodier, the better.                                                               |\n| 7  | When a storm is blowing and the rain is lashing the deck, I'll be out there getting drenched. It makes me feel so alive!               |\n| 8  | Nothing makes me more annoyed than a badly tied knot.                                                                                  |\n\n| d6 | Ideal                                                                                                 |\n|----|-------------------------------------------------------------------------------------------------------|\n| 1  | **Freedom.** No one tells me what to do or where to go. Apart from the captain. (Chaotic)                 |\n| 2  | **Greed.** I'm only in it for the booty. I'll gladly stab anyone stupid enough to stand in my way. (Evil) |\n| 3  | **Comradery.** My former shipmates are my family. I'll do anything for them. (Neutral)                    |\n| 4  | **Greater Good.** No man has the right to enslave another, or to profit from slavery. (Good)              |\n| 5  | **Code.** I may be on dry land now, but I still stick to the Freebooter's Code. (Lawful)                  |\n| 6  | **Aspiration.** One day I'll return to the sea as the captain of my own ship. (Any)                       |\n\n| d6 | Bond                                                                                                                                                                                                            |\n|----|-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | Anti-slavery pirates rescued me from a slave ship. I owe them my life.                                                                                                                                          |\n| 2  | I still feel a deep attachment to my ship. Some nights I dream her figurehead is talking to me.                                                                                                                 |\n| 3  | I was the ship's captain until the crew mutinied and threw me overboard to feed the sharks. I swam to a small island and survived. Vengeance will be mine!                                                      |\n| 4  | Years ago, when my city was attacked, I fled the city on a small fleet bound for a neighboring city. I arrived back in the ruined city a few weeks ago on the same ship and can remember nothing of the voyage. |\n| 5  | I fell asleep when I was supposed to be on watch, allowing our ship to be taken by surprise. I still have nightmares about my shipmates who died in the fighting.                                               |\n| 6  | One of my shipmates was captured and sold into slavery. I need to rescue them.                                                                                                                                  |\n\n| d6 | Flaw                                                              |\n|----|-------------------------------------------------------------------|\n| 1  | I'm terrified by the desert. Not enough water, far too much sand. |\n| 2  | I drink too much and end up starting barroom brawls.              |\n| 3  | I killed one of my shipmates and took his share of the loot.      |\n| 4  | I take unnecessary risks and often put my friends in danger.      |\n| 5  | I sold captives taken at sea to traders.                          |\n| 6  | Most of the time, I find it impossible to tell the truth.         |"
    },
    {
        "name": "Gamekeeper",
        "desc": "You are at home in natural environments, chasing prey or directing less skilled hunters in the best ways to track game through the brush. You know the requirements for encouraging a herd to grow, and you know what sustainable harvesting from a herd involves. You can train a hunting beast to recognize an owner and perform a half-dozen commands, given the time. You also know the etiquette for engaging nobility or other members of the upper classes, as they regularly seek your services, and you can carry yourself in a professional manner in such social circles.",
        "skill-proficiencies": "Animal Handling, Persuasion",
        "tool-proficiencies": "Leatherworker's tools",
        "languages": "One of your choice",
        "equipment": "A set of leatherworker's tools, a hunting trap, fishing tackle, a set of traveler's clothes, and a belt pouch containing 10 gp",
        "feature-name": "Confirmed Guildmember",
        "feature-desc": "As a recognized member of the Gamekeepers' Guild, you are knowledgeable in the care, training, and habits of animals used for hunting. With 30 days' of work and at least 2 gp for each day, you can train a raptor, such as a hawk, falcon, or owl, or a hunting dog, such as a hound, terrier, or cur, to become a hunting companion. Use the statistics of an owl for the raptor and the statistics of a jackal for the hunting dog.\n  A hunting companion is trained to obey and respond to a series of one-word commands or signals, communicating basic concepts such as “attack,” “protect,” “retrieve,” “find,” “hide,” or similar. The companion can know up to six such commands and can be trained to obey a number of creatures, other than you, equal to your proficiency bonus. A hunting companion travels with you wherever you go, unless you enter a particularly dangerous environment (such as a poisonous swamp), or you command the companion to stay elsewhere. A hunting companion doesn't join you in combat and stays on the edge of any conflict until it is safe to return to your side.\n  When traveling overland with a hunting companion, you can use the companion to find sufficient food to sustain yourself and up to five other people each day. You can have only one hunting companion at a time.",
        "suggested-characteristics": "You are one of the capable people who maintains hunting preserves, trains coursing hounds and circling raptors, and plans the safe outings that allow fair nobles, rich merchants, visiting dignitaries, and their entourages to venture into preserves and forests to seek their quarry. You are as comfortable hunting quarry in the forest as you are conversing with members of the elite who have an interest in hunting.\n\n| d8 | Personality Trait |\n|----|---------------------------------------------------------------------------------------------------------------------------------|\n| 1  | Nature has lessons to teach us all, and I'm always happy to share them.                                                         |\n| 2  | Once while out on a hunt, something happened which was very relatable to our current situation. Let me tell you about it.       |\n| 3  | My friends are my new charges, and I'll make sure they thrive.                                                                  |\n| 4  | Preparation and knowledge are the key to any success.                                                                           |\n| 5  | I've dealt with all sorts of wealthy and noble folk, and I've seen just how spoiled they can be.                                |\n| 6  | I feel like my animals are the only ones who really understand me.                                                              |\n| 7  | You can train yourself to accomplish anything you put your mind to accomplishing.                                               |\n| 8  | The world shows you everything you need to know to understand a situation. You just have to be paying attention to the details. |\n\n| d6 | Ideal                                                                                                        |\n|----|--------------------------------------------------------------------------------------------------------------|\n| 1  | Dedication. Your willingness to get the job done, no matter what the cost, is what is most important. (Evil) |\n| 2  | Training. You sink to the level of your training more often than you rise to the occasion. (Any)             |\n| 3  | Prestige. Pride in your training, your work, and your results is what is best in life. (Any)                 |\n| 4  | Diligent. Hard work and attention to detail bring success more often than failure. (Good)                    |\n| 5  | Nature. The glory and majesty of the wild world outshine anything mortals create. (Chaotic)                  |\n| 6  | Responsibility. When you take an oath to protect and shepherd something, that oath is for life. (Lawful)     |\n\n| d6 | Bond                                                                                   |\n|----|----------------------------------------------------------------------------------------|\n| 1  | I understand animals better than people, and the way of the hunter just makes sense.   |\n| 2  | I take great pride in providing my services to the wealthy and influential.            |\n| 3  | Natural spaces need to be tended and preserved, and I take joy in doing it when I can. |\n| 4  | I need to ensure people know how to manage nature rather than live in ignorance.       |\n| 5  | Laws are important to prevent nature's overexploitation.                               |\n| 6  | I can be alone in the wilderness and not feel lonely.                                  |\n\n| d6 | Flaw                                                                        |\n|----|-----------------------------------------------------------------------------|\n| 1  | Individuals can be all right, but civilization is the worst.                |\n| 2  | The wealthy and nobility are a rot in society.                              |\n| 3  | Things die, either by predators or nature; get used to it.                  |\n| 4  | Everything can be managed if you want it badly enough.                      |\n| 5  | When you make exceptions, you allow unworthy or wasteful things to survive. |\n| 6  | If you don't work hard for something, is it worth anything?                 |"
    },
    {
        "name": "Innkeeper",
        "desc": "You spent some time as an innkeeper, tavern keeper, or perhaps a bartender. It might have been in a small crossroads town, a fishing community, a fine caravanserai, or a large cosmopolitan community. You did it all; preparing food, tracking supplies, tapping kegs, and everything in between. All the while, you listened to the adventurers plan their quests, heard their tales, saw their amazing trophies, marveled at their terrible scars, and eyed their full purses. You watched them come and go, thinking, “one day, I will have my chance.” Your time is now.\n\n***Place of Employment***\nWhere did you work before turning to the adventuring life? Choose an establishment or roll a d6 and consult the table below. Once you have this information, think about who worked with you, what sort of customers you served, and what sort of reputation your establishment had.\n\n| d6 | Establishment                                              |\n|----|------------------------------------------------------------|\n| 1  | Busy crossroads inn                                        |\n| 2  | Disreputable tavern full of scum and villainy              |\n| 3  | Caravanserai on a wide-ranging trade route                 |\n| 4  | Rough seaside pub                                          |\n| 5  | Hostel serving only the wealthiest clientele               |\n| 6  | Saloon catering to expensive and sometimes dangerous tastes|",
        "skill-proficiencies": "Insight plus one of your choice from among Intimidation or Persuasion",
        "tool-proficiencies": "No additional tool proficiencies",
        "languages": "Two of your choice",
        "equipment": "A set of either brewer's supplies or cook's utensils, a dagger or light hammer, traveler's clothes, and a pouch containing 20 gp",
        "feature-name": "I Know Someone",
        "feature-desc": "In interacting with the wide variety of people who graced the tables and bars of your previous life, you gained an excellent knowledge of who might be able to perform a particular task, provide the right service, sell the perfect item, or be able to connect you with someone who can. You can spend a couple of hours in a town or city and identify a person or place of business capable of selling the product or service you seek, provided the product is nonmagical and isn't worth more than 250 gp. At the GM's discretion, these restrictions can be lifted in certain locations. The price might not always be what you hoped, the quality might not necessarily be the best, or the person's demeanor may be grating, but you can find the product or service. In addition, you know within the first hour if the product or service you desire doesn't exist in the community, such as a coldweather outfit in a tropical fishing village.",
        "suggested-characteristics": "The day-to-day operation of a tavern or inn teaches many lessons about people and how they interact. The nose for trouble, the keen eye on the kegs, and the ready hand on a truncheon translates well to the life of an adventurer.\n\n**Suggested Acolyte Characteristics (table)**\n\n| d8 | Personality Trait                                                                                                            |\n|----|------------------------------------------------------------------------------------------------------------------------------|\n| 1  | I insist on doing all the cooking, and I plan strategies like I cook—with proper measurements and all the right ingredients. |\n| 2  | Lending a sympathetic ear or a shoulder to cry on often yields unexpected benefits.                                          |\n| 3  | I always have a story or tale to relate to any situation.                                                                    |\n| 4  | There is a world of tastes and flavors to explore.                                                                           |\n| 5  | Few problems can't be solved with judicious application of a stout cudgel.                                                   |\n| 6  | I never pass up the chance to bargain. Never.                                                                                |\n| 7  | I demand the finest accommodations; I know what they're worth.                                                               |\n| 8  | I can defuse a situation with a joke, cutting remark, or arched eyebrow.                                                     |\n\n| d6 | Ideal                                                                                                                       |\n|----|-----------------------------------------------------------------------------------------------------------------------------|\n| 1  | **Service.** If we serve others, they will serve us in turn. (Lawful)                                                           |\n| 2  | **Perspective.** People will tell you a great deal about themselves, their situations, and their desires, if you listen. (Any)  |\n| 3  | **Determination.** Giving up is not in my nature. (Any)                                                                         |\n| 4  | **Charity.** I try to have extra coins to buy a meal for someone in need. (Good)                                                |\n| 5  | **Curiosity.** Staying safe never allows you to see the wonders of the world. (Chaotic)                                         |\n| 6  | **Selfish.** We must make sure we bargain for what our skills are worth; people don't value what you give away for free. (Evil) |\n\n| d6 | Bond                                                                                 |\n|----|--------------------------------------------------------------------------------------|\n| 1  | I started my career in a tavern, and I'll end it running one of my very own.         |\n| 2  | I try to ensure stories of my companions will live on forever.                       |\n| 3  | You want to take the measure of a person? Have a meal or drink with them.            |\n| 4  | I've seen the dregs of life pass through my door, and I will never end up like them. |\n| 5  | A mysterious foe burned down my inn, and I will have my revenge.                     |\n| 6  | One day, I want my story to be sung in all the taverns of my home city.              |\n\n| d6 | Flaw                                                                                                |\n|----|-----------------------------------------------------------------------------------------------------|\n| 1  | I can't help teasing or criticizing those less intelligent than I.                                  |\n| 2  | I love rich food and drink, and I never miss a chance at a good meal.                               |\n| 3  | I never trust anyone who won't drink with me.                                                       |\n| 4  | I hate it when people start fights in bars; they never consider the consequences.                   |\n| 5  | I can't stand to see someone go hungry or sleep in the cold if I can help it.                       |\n| 6  | I am quick to anger if anyone doesn't like my meals or brews. If you don't like it, do it yourself. |"
    },
    {
        "name": "Mercenary Company Scion",
        "desc": "You descend from a famous line of free company veterans, and your first memory is playing among the tents, training yards, and war rooms of one campaign or another. Adored or perhaps ignored by your parents, you spent your formative years learning weapons and armor skills from brave captains, camp discipline from burly sergeants, and a host of virtues and vices from the common foot soldiers. You've always been told you are special and destined to glory. The weight of your family's legacy, honor, or reputation can weigh heavily, inspiring you to great deeds, or it can be a factor you try to leave behind.\n\n***Mercenary Company Reputation***\nYour family is part of or associated with a mercenary company. The company has a certain reputation that may or may not continue to impact your life. Roll a d8 or choose from the options in the Mercenary Company Reputation table to determine the reputation of this free company.\n\n| d8 | Mercenary Company Reputation                                                               |\n|----|--------------------------------------------------------------------------------------------|\n| 1  | Infamous. The company's evil deeds follow any who are known to consort with them.          |\n| 2  | Honest. An upstanding company whose words and oaths are trusted.                           |\n| 3  | Unknown. Few know of this company. Its deeds have yet to be written.                       |\n| 4  | Feared. For good or ill, this company is generally feared on the battlefield.              |\n| 5  | Mocked. Though it tries hard, the company is the butt of many jokes and derision.          |\n| 6  | Specialized. This company is known for a specific type of skill on or off the battlefield. |\n| 7  | Disliked. For well-known reasons, this company has a bad reputation.                       |\n| 8  | Famous. The company's great feats and accomplishments are known far and wide.              |",
        "skill-proficiencies": "Athletics, History",
        "tool-proficiencies": "One type of gaming set, one musical instrument",
        "languages": "One of your choice",
        "equipment": "A backpack, a signet ring emblazoned with the symbol of your family's free company, a musical instrument of your choice, a mess kit, a set of traveler's clothes, and a belt pouch containing 20 gp",
        "feature-name": "The Family Name",
        "feature-desc": "Your family name is well known in the closeknit world of mercenary companies. Members of mercenary companies readily recognize your name and will provide food, drink, and shelter with pleasure or out of fear, depending upon your family's reputation. You can also gain access to friendly military encampments, fortresses, or powerful political figures through your contacts among the mercenaries. Utilizing such connections might require the donation of money, magic items, or a great deal of drink.",
        "suggested-characteristics": "The turmoil of war, the drudgery of the camp, long days on the road, and the thrill of battle shape a Mercenary Company Scion to create strong bonds of loyalty, military discipline, and a practical mind. Yet this history can scar as well, leaving the scion open to guilt, pride, resentment, and hatred.\n\n| d8 | Personality Trait                                                                    |\n|----|--------------------------------------------------------------------------------------|\n| 1  | I am ashamed of my family's reputation and seek to distance myself from their deeds. |\n| 2  | I have seen the world and know people everywhere.                                    |\n| 3  | I expect the best life has to offer and won't settle for less.                       |\n| 4  | I know stories from a thousand campaigns and can apply them to any situation.        |\n| 5  | After too many betrayals, I don't trust anyone.                                      |\n| 6  | My parents were heroes, and I try to live up to their example.                       |\n| 7  | I have seen the horrors of war; nothing dis'turbs me anymore.                         |\n| 8  | I truly believe I have a destiny of glory and fame awaiting me.                      |\n\n| d6 | Ideal                                                                                      |\n|----|--------------------------------------------------------------------------------------------|\n| 1  | **Glory.** Only by fighting for the right causes can I achieve true fame and honor. (Good)     |\n| 2  | **Dependable.** Once my oath is given, it cannot be broken. (Lawful)                           |\n| 3  | **Seeker.** Life can be short, so I will live it to the fullest before I die. (Chaotic)        |\n| 4  | **Ruthless.** Only the strong survive. (Evil)                                                  |\n| 5  | **Mercenary.** If you have gold, I'm your blade. (Neutral)                                     |\n| 6  | **Challenge.** Life is a test, and only by meeting life head on can I prove I am worthy. (Any) |\n\n| d6 | Bond                                                                                    |\n|----|-----------------------------------------------------------------------------------------|\n| 1  | My parent's legacy is a tissue of lies. I will never stop until I uncover the truth.    |\n| 2  | I am the only one who can uphold the family name.                                       |\n| 3  | My companions are my life, and I would do anything to protect them.                     |\n| 4  | I will never forget the betrayal leading to my parent's murder, but I will avenge them. |\n| 5  | My honor and reputation are all that matter in life.                                    |\n| 6  | I betrayed my family to protect my friend who was a soldier in another free company.    |\n\n| d6 | Flaw                                                                                              |\n|----|---------------------------------------------------------------------------------------------------|\n| 1  | I have no respect for those who never signed on to a mercenary company or walked the battlefield. |\n| 2  | I cannot bear losing anyone close to me, so I keep everyone at a distance.                        |\n| 3  | Bloody violence is the only way to solve problems.                                                |\n| 4  | I caused the downfall of my family's mercenary company.                                           |\n| 5  | I am hiding a horrible secret about one of my family's patrons.                                   |\n| 6  | I see insults to my honor or reputation in every whisper, veiled glance, and knowing look.        |"
    },
    {
        "name": "Mercenary Recruit",
        "desc": "Every year, the hopeful strive to earn a place in one of the great mercenary companies. Some of these would-be heroes received training from a mercenary company but needed more training before gaining membership. Others are full members but were selected to venture abroad to gain more experience before gaining a rank. You are one of these hopeful warriors, just beginning to carve your place in the world with blade, spell, or skill.",
        "skill-proficiencies": "Athletics, Persuasion",
        "tool-proficiencies": "One type of gaming set",
        "languages": "No additional languages",
        "equipment": "A letter of introduction from an old teacher, a gaming set of your choice, traveling clothes, and a pouch containing 10 gp",
        "feature-name": "Theoretical Experience",
        "feature-desc": "You have an encyclopedic knowledge of stories, myths, and legends of famous soldiers, mercenaries, and generals. Telling these stories can earn you a bed and food for the evening in taverns, inns, and alehouses. Your age or inexperience is endearing, making commoners more comfortable with sharing local rumors, news, and information with you.",
        "suggested-characteristics": "Recruits are eager to earn their place in the world of mercenaries. Sometimes humble, other times filled with false bravado, they are still untested by the joys and horrors awaiting them. Meaning well and driven to learn, recruits are generally plagued by their own fears, ignorance, and inexperience.\n\n| d8 | Personality Trait |\n|----|----------------------------------------------------------------------------------------------|\n| 1  | I am thrilled by the thought of an upcoming fight.                                           |\n| 2  | Why wait until I'm famous to have songs written about me? I can write my own right now!      |\n| 3  | I know many stories and legends of famous adventurers and compare everything to these tales. |\n| 4  | Humor is how I deal with fear.                                                               |\n| 5  | I always seek to learn new ways to use my weapons and love sharing my knowledge.             |\n| 6  | The only way I can prove myself is to work hard and take risks.                              |\n| 7  | When you stop training, you sign your own death notice.                                      |\n| 8  | I try to act braver than I actually am.                                                      |\n\n| d6 | Ideal                                                                                                  |\n|----|--------------------------------------------------------------------------------------------------------|\n| 1  | **Respect.** To be treated with honor and trust, I must honor and trust people first. (Good)               |\n| 2  | **Discipline.** A good soldier obeys orders. (Lawful)                                                      |\n| 3  | **Courage.** Sometimes doing the right thing means breaking the law. (Chaotic)                             |\n| 4  | **Excitement.** I live for the thrill of battle, the rush of the duel, and the glory of victory. (Neutral) |\n| 5  | **Power.** When I achieve fame and power, no one will give me orders anymore! (Evil)                       |\n| 6  | **Ambition.** I will make something of myself no matter what. (Any)                                        |\n\n| d6 | Bond                                                                                                     |\n|----|----------------------------------------------------------------------------------------------------------|\n| 1  | My first mentor was murdered, and I seek the skills to avenge that crime.                                |\n| 2  | I will become the greatest mercenary warrior ever.                                                       |\n| 3  | I value the lessons from my teachers and trust them implicitly.                                          |\n| 4  | My family has sacrificed much to get me this far. I must repay their faith in me.                        |\n| 5  | I will face any danger to win the respect of my companions.                                              |\n| 6  | I have hidden a map to an amazing and powerful magical treasure until I grow strong enough to follow it. |\n\n| d6 | Flaw                                                                                      |\n|----|-------------------------------------------------------------------------------------------|\n| 1  | I do not trust easily and question anyone who attempts to give me orders.                 |\n| 2  | I ridicule others to hide my insecurities.                                                |\n| 3  | To seem brave and competent, I refuse to allow anyone to doubt my courage.                |\n| 4  | I survived an attack by a monster as a child, and I have feared that creature ever since. |\n| 5  | I have a hard time thinking before I act.                                                 |\n| 6  | I hide my laziness by tricking others into doing my work for me.                          |"
    },
    {
        "name": "Monstrous Adoptee",
        "desc": "Songs and sagas tell of heroes who, as children, were raised by creatures most view as monsters. You were one such child. Found, taken, left, or otherwise given to your monstrous parents, you were raised as one of their own species. Life with your adopted family could not have been easy for you, but the adversity and hardships you experienced only made you stronger. Perhaps you were “rescued” from your adopted family after only a short time with them, or perhaps only now have you realized the truth of your heritage. Maybe you've since learned enough civilized behavior to get by, or perhaps your “monstrous” tendencies are more evident. As you set out to make your way in the world, the time you spent with your adopted parents continues to shape your present and your future.\n\n***Adopted***\nPrior to becoming an adventurer, you defined your history by the creatures who raised you. Choose a type of creature for your adopted parents or roll a d10 and consult the table below. Work with your GM to determine which specific creature of that type adopted you. If you are of a particular race or species that matches a result on the table, your adopted parent can't be of the same race or species as you, as this background represents an individual raised by a creature or in a culture vastly different or even alien to their birth parents.\n\n| d10 | Creature Type                                                                 |\n|-----|-------------------------------------------------------------------------------|\n| 1   | Humanoid (such as gnoll, goblin, kobold, or merfolk)                          |\n| 2   | Aberration (such as aboleth, chuul, cloaker, or otyugh)                       |\n| 3   | Beast (such as ape, bear, tyrannosaurus rex, or wolf)                         |\n| 4   | Celestial or fiend (such as balor, bearded devil, couatl, deva, or unicorn)   |\n| 5   | Dragon (such as dragon turtle, pseudodragon, red dragon, or wyvern)           |\n| 6   | Elemental (such as efreeti, gargoyle, salamander, or water elemental)         |\n| 7   | Fey (such as dryad, green hag, satyr, or sprite)                              |\n| 8   | Giant (such as ettin, fire giant, ogre, or troll)                             |\n| 9   | Plant or ooze (such as awakened shrub, gray ooze, shambling mound, or treant) |\n| 10  | Monstrosity (such as behir, chimera, griffon, mimic, or minotaur)             |\n\n",
        "skill-proficiencies": "Intimidation, Survival",
        "tool-proficiencies": "No additional tool proficiencies",
        "languages": "One language of your choice, typically your adopted parents' language (if any)",
        "equipment": "A club, handaxe, or spear, a trinket from your life before you were adopted, a set of traveler's clothes, a collection of bones, shells, or other natural objects, and a belt pouch containing 5 gp",
        "feature-name": "Abnormal Demeanor",
        "feature-desc": "Your time with your adopted parents taught you an entire lexicon of habits, behaviors, and intuitions suited to life in the wild among creatures of your parents' type. When you are in the same type of terrain your adopted parent inhabits, you can find food and fresh water for yourself and up to five other people each day. In addition, when you encounter a creature like your adopted parent or parents, the creature is disposed to hear your words instead of leaping directly into battle. Mindless or simple creatures might not respond to your overtures, but more intelligent creatures may be willing to treat instead of fight, if you approach them in an appropriate manner. For example, if your adopted parent was a cloaker, when you encounter a cloaker years later, you understand the appropriate words, body language, and motions for approaching the cloaker respectfully and peacefully.",
        "suggested-characteristics": "When monstrous adoptees leave their adopted parents for the wider world, they often have a hard time adapting. What is common or usual for many humanoids strikes them as surprising, frightening, or infuriating, depending on the individual. Most make an effort to adjust their habits and imitate those around them, but not all. Some lean into their differences, reveling in shocking those around them.\n  When you choose a creature to be your character's adopted parent, think about how that might affect your character. Was your character treated kindly? Was your character traded by their birth parents to their adopted parents as part of some mysterious bargain? Did your character seek constant escape or do they miss their adopted parents?\n\n| d8 | Personality Trait                                                                            |\n|----|----------------------------------------------------------------------------------------------|\n| 1  | I don't eat my friends (at least not while they are alive). My foes, on the other hand . . . |\n| 2  | Meeting another's gaze is a challenge for dominance that I never fail to answer.             |\n| 3  | Monsters I understand; people are confusing.                                                 |\n| 4  | There are two types of creatures in life: prey or not-prey.                                  |\n| 5  | I often use the growls, sounds, or calls of my adopted parents instead of words.             |\n| 6  | Inconsequential items fascinate me.                                                          |\n| 7  | It's not my fault, I was raised by [insert parent's type here].                              |\n| 8  | I may look fine, but I behave like a monster.                                                |\n\n| d6 | Ideal                                                                                                                                  |\n|----|----------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | **Wild.** After seeing the wider world, I want to be the monster that strikes fear in the hearts of people. (Evil)                         |\n| 2  | **Insight.** I want to understand the world of my adopted parents. (Neutral)                                                               |\n| 3  | **Revenge.** I want revenge for my lost childhood. Monsters must die! (Any)                                                                |\n| 4  | **Harmony.** With my unique perspective and upbringing, I hope to bring understanding between the different creatures of the world. (Good) |\n| 5  | **Freedom.** My past away from law-abiding society has shown me the ridiculousness of those laws. (Chaotic)                                |\n| 6  | **Redemption.** I will rise above the cruelty of my adopted parent and embrace the wider world. (Lawful)                                   |\n\n| d6 | Bond                                                                                                                    |\n|----|-------------------------------------------------------------------------------------------------------------------------|\n| 1  | I want to experience every single aspect of the world.                                                                  |\n| 2  | I rely on my companions to teach me how to behave appropriately in their society.                                       |\n| 3  | I have a “sibling,” a child of my adopted parent that was raised alongside me, and now that sibling has been kidnapped! |\n| 4  | My monstrous family deserves a place in this world, too.                                                                |\n| 5  | I'm hiding from my monstrous family. They want me back!                                                                 |\n| 6  | An old enemy of my adopted parents is on my trail.                                                                      |\n\n| d6 | Flaw                                                                                                      |\n|----|-----------------------------------------------------------------------------------------------------------|\n| 1  | What? I like my meat raw. Is that so strange?                                                             |\n| 2  | I like to collect trophies from my defeated foes (ears, teeth, bones, or similar). It's how I keep score. |\n| 3  | I usually forget about pesky social conventions like “personal property” or “laws.”                       |\n| 4  | I am easily startled by loud noises or bright lights.                                                     |\n| 5  | I have trouble respecting anyone who can't best me in a fight.                                            |\n| 6  | Kindness is for the weak.                                                                                 |"
    },
    {
        "name": "Mysterious Origins",
        "desc": "Your origins are a mystery even to you. You might recall fragments of your previous life, or you might dream of events that could be memories, but you can't be sure of what is remembered and what is imagined. You recall practical information and facts about the world and perhaps even your name, but your upbringing and life before you lost your memories now exist only in dreams or sudden flashes of familiarity.\n  You can leave the details of your character's past up to your GM or give the GM a specific backstory that your character can't remember. Were you the victim of a spell gone awry, or did you voluntarily sacrifice your memories in exchange for power? Is your amnesia the result of a natural accident, or did you purposefully have your mind wiped in order to forget a memory you couldn't live with? Perhaps you have family or friends that are searching for you or enemies you can't even remember.",
        "skill-proficiencies": "Deception, Survival",
        "tool-proficiencies": "One type of artisan's tools or one type of musical instrument",
        "languages": "One of your choice",
        "equipment": "A mysterious trinket from your past life, a set of artisan's tools or a musical instrument (one of your choice), a set of common clothes, and a belt pouch containing 5 gp",
        "feature-name": "Unexpected Acquaintance",
        "feature-desc": "Even though you can't recall them, someone from your past will recognize you and offer to aid you—or to impede you. The person and their relationship to you depend on the truth of your backstory. They might be a childhood friend, a former rival, or even your child who's grown up with dreams of finding their missing parent. They may want you to return to your former life even if it means abandoning your current goals and companions. Work with your GM to determine the details of this character and your history with them.",
        "suggested-characteristics": "You may be bothered by your lack of memories and driven to recover them or reclaim the secrets of your past, or you can use your anonymity to your advantage.\n\n| d8 | Personality Trait                                                              |\n|----|--------------------------------------------------------------------------------|\n| 1  | I'm always humming a song, but I can't remember the words.                     |\n| 2  | I love learning new things and meeting new people.                             |\n| 3  | I want to prove my worth and have people know my name.                         |\n| 4  | I don't like places that are crowded or noisy.                                 |\n| 5  | I'm mistrustful of mages and magic in general.                                 |\n| 6  | I like to keep everything tidy and organized so that I can find things easily. |\n| 7  | Every night I record my day in a detailed journal.                             |\n| 8  | I live in the present. The future will come as it may.                         |\n\n| d6 | Ideal                                                                                           |\n|----|-------------------------------------------------------------------------------------------------|\n| 1  | **Redemption.** Whatever I did in the past, I'm determined to make the world a better place. (Good) |\n| 2  | **Independence.** I'm beholden to no one, so I can do whatever I want. (Chaotic)                    |\n| 3  | **Cunning.** Since I have no past, no one can use it to thwart my rise to power. (Evil)             |\n| 4  | **Community.** I believe in a just society that takes care of people in need. (Lawful)              |\n| 5  | **Fairness.** I judge others by who they are now, not by what they've done in the past. (Neutral)   |\n| 6  | **Friendship.** The people in my life now are more important than any ideal. (Any)                  |\n\n| d6 | Bond                                                                                                    |\n|----|---------------------------------------------------------------------------------------------------------|\n| 1  | I have dreams where I see a loved one's face, but I can't remember their name or who they are.          |\n| 2  | I wear a wedding ring, so I must have been married before I lost my memories.                           |\n| 3  | My mentor raised me; they told me that I lost my memories in a terrible accident that killed my family. |\n| 4  | I have an enemy who wants to kill me, but I don't know what I did to earn their hatred.                 |\n| 5  | I know there's an important memory attached to the scar I bear on my body.                              |\n| 6  | I can never repay the debt I owe to the person who cared for me after I lost my memories.               |\n\n| d6 | Flaw                                                                                                                |\n|----|---------------------------------------------------------------------------------------------------------------------|\n| 1  | I am jealous of those who have memories of a happy childhood.                                                       |\n| 2  | I'm desperate for knowledge about my past, and I'll do anything to obtain that information.                         |\n| 3  | I'm terrified of meeting someone from my past, so I avoid strangers as much as possible.                            |\n| 4  | Only the present matters. I can't bring myself to care about the future.                                            |\n| 5  | I'm convinced that I was powerful and rich before I lost my memories—and I expect everyone to treat me accordingly. |\n| 6  | Anyone who shows me pity is subjected to my biting scorn.                                                           |"
    },
    {
        "name": "Northern Minstrel",
        "desc": "While the tribal warriors residing in other parts of the wintry north consider you to be soft and cowardly, you know the truth: life in northern cities and mead halls is not for the faint of heart. Whether you are a larger-than-life performer hailing from one of the skaldic schools, a contemplative scholar attempting to puzzle out the mysteries of the north, or a doughty warrior hoping to stave off the bleakness of the north, you have successfully navigated alleys and stages as treacherous as any ice-slicked ruin. You adventure for the thrill of adding new songs to your repertoire, adding new lore to your catalog, and proving false the claims of those so-called true northerners.\n\n***Skaldic Specialty***\nEvery minstrel excels at certain types of performance. Choose one specialty or roll a d8 and consult the table below to determine your preferred type of performance.\n\n| d8 | Specialty                       |\n|----|---------------------------------|\n| 1  | Recitation of epic poetry       |\n| 2  | Singing                         |\n| 3  | Tale-telling                    |\n| 4  | Flyting (insult flinging)       |\n| 5  | Yodeling                        |\n| 6  | Axe throwing                    |\n| 7  | Playing an instrument           |\n| 8  | Fire eating or sword swallowing |",
        "skill-proficiencies": "Perception plus one of your choice from among History or Performance",
        "tool-proficiencies": "One type of musical instrument",
        "languages": "One of your choice",
        "equipment": "A book collecting all the songs, poems, or stories you know, a pair of snowshoes, one musical instrument of your choice, a heavy fur-lined cloak, and a belt pouch containing 10 gp",
        "feature-name": "Northern Historian",
        "feature-desc": "Your education and experience have taught you how to determine the provenance of ruins, monuments, and other structures within the north. When you spend at least 1 hour examining a structure or non-natural feature of the terrain, you can determine if it was built by humans, dwarves, elves, goblins, giants, trolls, or fey. You can also determine the approximate age (within 500 years) of the construction based on its features and embellishments.",
        "suggested-characteristics": "Northern minstrels tend to either be boisterous and loud or pensive and watchful with few falling between these extremes. Many exude both qualities at different times, and they have learned how and when to turn their skald persona on and off. Like other northerners, they place a lot of stock in appearing brave and tough, which can lead them unwittingly into conflict.\n\n| d8 | Personality Trait |\n|----|-------------------------------------------------------------------------------------------------------------------------------|\n| 1  | I will accept any dare and expect accolades when I complete it.                                                               |\n| 2  | Revelry and boisterousness are for foolish children. I prefer to quietly wait and watch.                                      |\n| 3  | I am more than a match for any northern reaver. If they believe that is not so, let them show me what stuff they are made of. |\n| 4  | I yearn for the raiding season and the tales of blood and butchery I can use to draw the crowds.                              |\n| 5  | Ragnarok is nigh. I will bear witness to the end of all things and leave a record should there be any who survive it.         |\n| 6  | There is nothing better than mutton, honeyed mead, and a crowd in thrall to my words.                                         |\n| 7  | The gods weave our fates. There is nothing to do but accept this and live as we will.                                         |\n| 8  | All life is artifice. I lie better than most and I am not ashamed to reap the rewards.                                        |\n\n| d6 | Ideal                                                                                                                                                                              |\n|----|------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | **Valor.** Stories and songs should inspire others—and me—to perform great deeds that benefit us all. (Good)                                                                           |\n| 2  | **Greed.** There is little point in taking action if it leads to living in squalor. I will take what I want and dare any who disagree to oppose me. (Evil)                             |\n| 3  | **Perfection.** I will not let the threat of failure deter me. Every deed I attempt, even those I do not succeed at, serve to improve me and prepare me for future endeavors. (Lawful) |\n| 4  | **Anarchy.** If Ragnarok is coming to end all that is, I must do what I want and damn the consequences. (Chaotic)                                                                      |\n| 5  | **Knowledge.** The north is full of ancient ruins and monuments. If I can glean their meaning, I may understand fate as well as the gods. (Any)                                        |\n| 6  | **Pleasure.** I will eat the richest food, sleep in the softest bed, enjoy the finest company, and allow no one to stand in the way of my delight and contentment. (Any)               |\n\n| d6 | Bond                                                                                                                                  |\n|----|---------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | I have the support of my peers from the skaldic school I attended, and they have mine.                                                |\n| 2  | I will find and answer the Unanswerable Riddle and gain infamy.                                                                       |\n| 3  | I will craft an epic of such renown it will be recited the world over.                                                                |\n| 4  | All my companions were slain in an ambush laid by cowardly trolls. At least I snatched up my tagelharpa before I escaped the carnage. |\n| 5  | The cold waves call to me even across great distances. I must never stray too far from the ocean's embrace.                           |\n| 6  | It is inevitable that people fail me. Mead, on the other hand, never fails to slake my thirst.                                        |\n\n| d6 | Flaw                                                                                  |\n|----|---------------------------------------------------------------------------------------|\n| 1  | Only a coward retreats. The valiant press forward to victory or death.                |\n| 2  | All the tales I tell of my experiences are lies.                                      |\n| 3  | Critics and hecklers will suffer my wrath once the performance is over.               |\n| 4  | Companions and friends cease to be valuable if their accomplishments outshine my own. |\n| 5  | I once burned down a tavern where I was poorly received. I would do it again.         |\n| 6  | I cannot bear to be gainsaid and fall into a bitter melancholy when I am.             |"
    },
    {
        "name": "Occultist",
        "desc": "At your core, you are a believer in things others dismiss. The signs abound if you know where to look. Questions beget answers that spur further questions. The cycle is endless as you uncover layer after layer of mystery and secrets.\n  Piercing the veil hiding beyond the surface of reality is an irresistible lure spurring you to delve into forgotten and dangerous places in the world. Perhaps you've always yearned toward the occult, or it could be that you encountered something or someone who opened your eyes to the possibilities. You may belong to some esoteric organization determined to uncover the mystery, a cult bent on using the secrets for a dark purpose, or you may be searching for answers on your own. As an occultist, you ask the questions reality doesn't want to answer.",
        "skill-proficiencies": "Arcana, Religion",
        "tool-proficiencies": "Thieves' tools",
        "languages": "Two of your choice",
        "equipment": "A book of obscure lore holding clues to an occult location, a bottle of black ink, a quill, a leather-bound journal in which you record your secrets, a bullseye lantern, a set of common clothes, and a belt pouch containing 5 gp",
        "feature-name": "Strange Lore",
        "feature-desc": "Your passions for forbidden knowledge, esoteric religions, secretive cults, and terrible histories brought you into contact with a wide variety of interesting and unique individuals operating on the fringes of polite society. When you're trying to find something that pertains to eldritch secrets or dark knowledge, you have a good idea of where to start looking. Usually, this information comes from information brokers, disgraced scholars, chaotic mages, dangerous cults, or insane priests. Your GM might rule that the knowledge you seek isn't found with just one contact, but this feature provides a starting point.",
        "suggested-characteristics": "Occultists can't resist the lure of an ancient ruin, forgotten dungeon, or the lair of some mysterious cult. They eagerly follow odd rumors, folktales, and obscure clues found in dusty tomes. Some adventure with the hope of turning their discoveries into fame and fortune, while others consider the answers they uncover to be the true reward. Whatever their motivations, occultists combine elements of archaeologist, scholar, and fanatic.\n\n| d8 | Personality Trait                                                                             |\n|----|-----------------------------------------------------------------------------------------------|\n| 1  | I always ask questions, especially if I think I can learn something new.                      |\n| 2  | I believe every superstition I hear and follow their rules fanatically.                       |\n| 3  | The things I know give me nightmares, and not only when I sleep.                              |\n| 4  | Nothing makes me happier than explaining some obscure lore to my friends.                     |\n| 5  | I startle easily.                                                                             |\n| 6  | I perform a host of rituals throughout the day that I believe protect me from occult threats. |\n| 7  | I never know when to give up.                                                                 |\n| 8  | The more someone refuses to believe me, the more I am determined to convince them.            |\n\n| d6 | Ideal                                                                                             |\n|----|---------------------------------------------------------------------------------------------------|\n| 1  | **Domination.** With the power I will unearth, I will take my revenge on those who wronged me. (Evil) |\n| 2  | **Mettle.** Each nugget of hidden knowledge I uncover proves my worth. (Any)                          |\n| 3  | **Lore.** Knowledge is never good or evil; it is simply knowledge. (Neutral)                          |\n| 4  | **Redemption.** This dark knowledge can be made good if it is used properly. (Good)                   |\n| 5  | **Truth.** Nothing should be hidden. Truth is all that matters, no matter who it hurts. (Chaotic)     |\n| 6  | **Responsibility.** Only by bringing dark lore into the light can we eliminate its threat. (Lawful)   |\n\n| d6 | Bond                                                                                              |\n|----|---------------------------------------------------------------------------------------------------|\n| 1  | One or more secret organizations are trying to stop me, which means I must be close to the truth. |\n| 2  | My studies come before anything else.                                                             |\n| 3  | No theory, however unbelievable, is worth abandoning without investigation.                       |\n| 4  | I must uncover the truth behind a particular mystery, one my father died to protect.              |\n| 5  | I travel with my companions because I have reason to believe they are crucial to the future.      |\n| 6  | I once had a partner in my occult searches who vanished. I am determined to find them.            |\n\n| d6 | Flaw                                                                                                                                        |\n|----|---------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | When stressed, I mutter theories to myself, sometimes connecting seemingly unconnected or random events, to explain my current predicament. |\n| 2  | It's not paranoia if they really are out to get me.                                                                                         |\n| 3  | I have a habit of lying to hide my theories and discoveries.                                                                                |\n| 4  | I see secrets and mysteries in everything and everyone.                                                                                     |\n| 5  | The world is full of dark secrets, and I'm the only one who can safely unearth them.                                                        |\n| 6  | There is no law or social convention I won't break to further my goals.                                                                     |"
    },
    {
        "name": "Parfumier",
        "desc": "You are educated and ambitious. You spent your youth apprenticed among a city's more reputable greenhouses, laboratories, and perfumeries. There, you studied botany and chemistry and explored properties and interactions with fine crystal, rare metals, and magic. You quickly mastered the skills to identify and process rare and complex botanical and alchemical samples and the proper extractions and infusions of essential oils, pollens, and other fragrant chemical compounds—natural or otherwise.\n  Not all (dramatic) changes to one's lifestyle, calling, or ambitions are a result of social or financial decline. Some are simply decided upon. Regardless of your motivation or incentive for change, you have accepted that a comfortable life of research, science and business is—at least for now—a part of your past.",
        "skill-proficiencies": "Nature, Investigation",
        "tool-proficiencies": "Alchemist's supplies, herbalism kit",
        "languages": "No additional languages",
        "equipment": "Herbalism kit, a leather satchel containing perfume recipes, research notes, and chemical and botanical samples; 1d4 metal or crystal (shatter-proof) perfume bottles, a set of fine clothes, and a silk purse containing 10 gp",
        "feature-name": "Aromas and Odors and Airs, Oh My",
        "feature-desc": "Before you became an adventurer, you crafted perfumes for customers in your home town or city. When not out adventuring, you can fall back on that trade to make a living. For each week you spend practicing your profession, you can craft one of the following at half the normal cost in time and resources: 5 samples of fine perfume worth 10 gp each, 2 vials of acid, or 1 vial of parfum toxique worth 50 gp. As an action, you can throw a vial of parfum toxique up to 20 feet, shattering it on impact. Make a ranged attack against a creature or object, treating the parfum as an improvised weapon. On a hit, the target takes 1d6 poison damage and is poisoned until the end of its next turn.",
        "suggested-characteristics": "As with many parfumiers with the extensive training you received, you are well spoken, stately of bearing, and possessed of a self-assuredness that sometimes is found imposing. You are not easily impressed and rarely subscribe to notions like “insurmountable” or “unavoidable.” Every problem has a solution.\n\n| d8 | Personality Trait                                                                                                                                       |\n|----|---------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | I do not deal in absolutes. There is a solution to every problem, an answer for every riddle.                                                           |\n| 2  | I am used to associating with educated and “elevated” society. I find rough living and rough manners unpalatable.                                       |\n| 3  | Years spent witnessing the dealings, intrigues, and industrial espionage of the Bouquet Districts' mercantile-elite have left me secretive and guarded. |\n| 4  | I have a strong interest and sense for fashion and current trends.                                                                                      |\n| 5  | I eagerly discuss the minutiae, subtleties, and nuances of my profession to any who will listen.                                                        |\n| 6  | I am easily distracted by unusual or exceptional botanical specimens.                                                                                   |\n| 7  | I can seem distant and introverted. I listen more than I speak.                                                                                         |\n| 8  | I always strive to make allies, not enemies.                                                                                                            |\n\n| d6 | Ideal                                                                                                                                                                     |\n|----|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | **Responsibility.** It is my duty to share my exceptional gifts and knowledge for the betterment of all. (Good)                                                               |\n| 2  | **Pragmatism.** I never let passion, preference, or emotion influence my decision-making or clear headedness. (Lawful)                                                        |\n| 3  | **Freedom.** Rules, particularly those imposed by others, were meant to be broken. (Chaotic)                                                                                  |\n| 4  | **Deep Science.** I live a life based on facts, logic, probability, and common sense. (Lawful)                                                                                |\n| 5  | **Notoriety.** I will do whatever it takes to become the elite that I was witness to during my time among the boutiques, salons, and workshops of the noble's district. (Any) |\n| 6  | **Profit.** I will utilize my talents to harvest, synthesize, concoct, and brew almost anything for almost anyone. As long as the profit margin is right. (Evil)              |\n\n| d6 | Bond                                                                                                                                                                      |\n|----|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | I will return to my home city someday and have revenge upon the elitist perfume consortium and corrupt shipping magnates who drove my dreams to ruin.                     |\n| 2  | I have been experimenting and searching my whole career for the ultimate aromatic aphrodisiac. The “alchemists' stone” of perfumery.                                      |\n| 3  | My home is safely far behind me now. With it go the unfounded accusations, spiteful rumors, and perhaps some potential links to a string of corporate assassinations.     |\n| 4  | I am cataloging an encyclopedia of flora and their various chemical, magical, and alchemical properties and applications. It is my life's work.                           |\n| 5  | I am dedicated to my craft, always seeking to expand my knowledge and hone my skills in the science and business of aromatics.                                            |\n| 6  | I have a loved one who is threatened (held hostage?) by an organized gang of vicious halfling thugs who control many of the “rackets” in the perfumeries in my home city. |\n\n| d6 | Flaw                                                                                                                                                                                                                      |\n|----|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | I am driven to reclaim the status and respect of the socially and scientifically elite and will sacrifice much to gain it.                                                                                                |\n| 2  | I am highly competitive and not above plagiarizing or stealing the occasional recipe, idea, formula, or sample.                                                                                                           |\n| 3  | I am hard-pressed to treat anyone who is not (by my standards) “well schooled” or “well heeled” as little more than lab assistants and house servants.                                                                    |\n| 4  | A pretty face is always able to lead me astray.                                                                                                                                                                           |\n| 5  | I am secretly addicted to a special perfume that only I can reproduce.                                                                                                                                                    |\n| 6  | *On a stormy night, I heard a voice in the wind, which led me to a mysterious plant. Its scent was intoxicating, and I consumed it. Now, that voice occasionally whispers in my dreams, urging me to some unknown destiny.* |"
    },
    {
        "name": "Scoundrel",
        "desc": "You were brought up in a poor neighborhood in a crowded town or city. You may have been lucky enough to have a leaky roof over your head, or perhaps you grew up sleeping in doorways or on the rooftops. Either way, you didn't have it easy, and you lived by your wits. While never a hardened criminal, you fell in with the wrong crowd, or you ended up in trouble for stealing food from an orange cart or clean clothes from a washing line. You're no stranger to the city watch in your hometown and have outwitted or outrun them many times.",
        "skill-proficiencies": "Athletics, Sleight of Hand",
        "tool-proficiencies": "One type of gaming set, thieves' tools",
        "languages": "No additional languages",
        "equipment": "A bag of 1,000 ball bearings, a pet monkey wearing a tiny fez, a set of common clothes, and a pouch containing 10 gp",
        "feature-name": "Urban Explorer",
        "feature-desc": "You are familiar with the layout and rhythms of towns and cities. When you arrive in a new city, you can quickly locate places to stay, where to buy good quality gear, and other facilities. You can shake off pursuers when you are being chased through the streets or across the rooftops. You have a knack for leading pursuers into a crowded market filled with stalls piled high with breakable merchandise, or down a narrow alley just as a dung cart is coming in the other direction.",
        "suggested-characteristics": "Despite their poor upbringing, scoundrels tend to live a charmed life—never far from trouble, but usually coming out on top. Many are thrill-seekers who delight in taunting their opponents before making a flashy and daring escape. Most are generally good-hearted, but some are self-centered to the point of arrogance. Quieter, introverted types and the lawfully-inclined can find them very annoying.\n\n| d8 | Personality Trait                                                     |\n|----|-----------------------------------------------------------------------|\n| 1  | Flashing a big smile often gets me out of trouble.                    |\n| 2  | If I can just keep them talking, it will give me time to escape.      |\n| 3  | I get fidgety if I have to sit still for more than ten minutes or so. |\n| 4  | Whatever I do, I try to do it with style and panache.                 |\n| 5  | I don't hold back when there's free food and drink on offer.          |\n| 6  | Nothing gets me more annoyed than being ignored.                      |\n| 7  | I always sit with my back to the wall and my eyes on the exits.       |\n| 8  | Why walk down the street when you can run across the rooftops?        |\n\n| d6 | Ideal                                                                                                                 |\n|----|-----------------------------------------------------------------------------------------------------------------------|\n| 1  | **Freedom.** Ropes and chains are made to be broken. Locks are made to be picked. Doors are meant to be opened. (Chaotic) |\n| 2  | **Community.** We need to look out for one another and keep everyone safe. (Lawful)                                       |\n| 3  | **Charity.** I share my wealth with those who need it the most. (Good)                                                    |\n| 4  | **Friendship.** My friends matter more to me than lofty ideals. (Neutral)                                                 |\n| 5  | **Aspiration.** One day my wondrous deeds will be known across the world. (Any)                                           |\n| 6  | **Greed.** I'll stop at nothing to get what I want. (Evil)                                                                |\n\n| d6 | Bond                                                                                                                                |\n|----|-------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | My elder sibling taught me how to find a safe hiding place in the city. This saved my life at least once.                           |\n| 2  | I stole money from someone who couldn't afford to lose it and now they're destitute. One day I'll make it up to them.               |\n| 3  | The street kids in my town are my true family.                                                                                      |\n| 4  | My mother gave me an old brass lamp. I polish it every night before going to sleep.                                                 |\n| 5  | When I was young, I was too scared to leap from the tallest tower in my hometown onto the hay cart beneath. I'll try again someday. |\n| 6  | A city guardsman let me go when they should have arrested me for stealing. I am forever in their debt.                              |\n\n| d6 | Flaw                                                                    |\n|----|-------------------------------------------------------------------------|\n| 1  | If there's a lever to pull, I'll pull it.                               |\n| 2  | It's not stealing if nobody realizes it's gone.                         |\n| 3  | If I don't like the odds, I'm out of there.                             |\n| 4  | I often don't know when to shut up.                                     |\n| 5  | I once filched a pipe from a priest. Now I think the god has cursed me. |\n| 6  | I grow angry when someone else steals the limelight.                    |"
    },
    {
        "name": "Sentry",
        "desc": "In your youth, the defense of the city, the community, the caravan, or your patron was how you earned your coin. You might have been trained by an old, grizzled city watchman, or you might have been pressed into service by the local magistrate for your superior skills, size, or intellect. However you came to the role, you excelled at defending others.\n  You have a nose for trouble, a keen eye for spotting threats, a strong arm to back it up, and you are canny enough to know when to act. Most importantly, though, you were a peace officer or a protector and not a member of an army which might march to war.\n\n***Specialization***\nEach person or location that hires a sentry comes with its own set of unique needs and responsibilities. As a sentry, you fulfilled one of these unique roles. Choose a specialization or roll a d6 and consult the table below to define your expertise as a sentry.\n\n| d6 | Specialization                 |\n|----|--------------------------------|\n| 1  | City or gate watch             |\n| 2  | Bodyguard or jailor            |\n| 3  | Caravan guard                  |\n| 4  | Palace or judicial sentry      |\n| 5  | Shop guard                     |\n| 6  | Ecclesiastical or temple guard |",
        "skill-proficiencies": "Insight, Perception",
        "tool-proficiencies": "One type of gaming set",
        "languages": "One language of your choice",
        "equipment": "A set of dice or deck of cards, a shield bearing your previous employer's symbol, a set of common clothes, a hooded lantern, a signal whistle, and a belt pouch containing 10 gp",
        "feature-name": "Comrades in Arms",
        "feature-desc": "The knowing look from the caravan guard to the city gatekeeper or the nod of recognition between the noble's bodyguard and the district watchman—no matter the community, city, or town, the guards share a commonality of purpose. When you arrive in a new location, you can speak briefly with the gate guards, local watch, or other community guardians to gain local knowledge. This knowledge could be information, such as the most efficient routes through the city, primary vendors for a variety of luxury goods, the best (or worst) inns and taverns, the primary criminal elements in town, or the current conflicts in the community.",
        "suggested-characteristics": "You're a person who understands both patience and boredom, as a guard is always waiting for something to happen. More often than not, sentries hope nothing happens because something happening usually means something has gone wrong. A life spent watching and protecting, acting in critical moments, and learning the details of places and behaviors; all of these help shape the personality of the former sentry. Some claim you never stop being a guard, you just change what you protect.\n\n| d8 | Personality Trait                                                                                                      |\n|----|------------------------------------------------------------------------------------------------------------------------|\n| 1  | I've seen the dregs of society and nothing surprises me anymore.                                                       |\n| 2  | I know where to look to spot threats lurking around a corner, in a glance, and even in a bite of food or cup of drink. |\n| 3  | I hate standing still and always keep moving.                                                                          |\n| 4  | My friends know they can rely on me to stand and protect them.                                                         |\n| 5  | I resent the rich and powerful; they think they can get away with anything.                                            |\n| 6  | A deception of any sort marks you as untrustworthy in my mind.                                                         |\n| 7  | Stopping lawbreakers taught me the best ways to skirt the law.                                                         |\n| 8  | I never take anything at face-value.                                                                                   |\n\n| d6 | Ideal                                                                                      |\n|----|--------------------------------------------------------------------------------------------|\n| 1  | **Greed.** Threats to my companions only increase my glory when I protect them from it. (Evil) |\n| 2  | **Perception.** I watch everyone, for threats come from every rank or station. (Neutral)       |\n| 3  | **Duty.** The laws of the community must be followed to keep everyone safe. (Lawful)           |\n| 4  | **Community.** I am all that stands between my companions and certain doom. (Good)             |\n| 5  | **Determination.** To truly protect others, you must sometimes break the law. (Chaotic)        |\n| 6  | **Practicality.** I require payment for the protection or service I provide. (Any)             |\n\n| d6 | Bond                                                                                                             |\n|----|------------------------------------------------------------------------------------------------------------------|\n| 1  | My charge is paramount; if you can't protect your charge, you've failed.                                         |\n| 2  | I was once saved by one of my fellow guards. Now I always come to my companions' aid, no matter what the threat. |\n| 3  | My oath is unbreakable; I'd rather die first.                                                                    |\n| 4  | There is no pride equal to the accomplishment of a successful mission.                                           |\n| 5  | I stand as a bulwark against those who would damage or destroy society, and society is worth protecting.         |\n| 6  | I know that as long as I stand with my companions, things can be made right.                                     |\n\n| d6 | Flaw                                                                                                                                                 |\n|----|------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | Sometimes I may overindulge in a guilty pleasure, but you need something to pass time.                                                               |\n| 2  | I can't just sit quietly next to someone. I've got to fill the silence with conversation to make good company.                                       |\n| 3  | I'm not very capable in social situations. I'd rather sit on the sidelines and observe. People make me nervous.                                      |\n| 4  | I have a tough time trusting strangers and new people. You don't know their habits and behaviors; therefore, you don't know their risk.              |\n| 5  | There is danger all around us, and only the foolish let their guard down. I am no fool, and I will spot the danger.                                  |\n| 6  | I believe there's a firm separation between task and personal time. I don't do other people's work when I'm on my own time. If you want me, hire me. |"
    },
    {
        "name": "Trophy Hunter",
        "desc": "You hunt the mightiest beasts in the harshest environments, claiming their pelts as trophies and returning them to settled lands for a profit or to decorate your abode. You likely were set on this path since birth, following your parents on safaris and learning from their actions, but you may have instead come to this path as an adult after being swept away by the thrill of dominating the natural world.\n  Many big game hunters pursue their quarry purely for pleasure, as a calming avocation, but others sell their skills to the highest bidder to amass wealth and reputation as a trophy hunter.",
        "skill-proficiencies": "Nature, Survival",
        "tool-proficiencies": "Leatherworker's tools, vehicles (land)",
        "languages": "No additional languages",
        "equipment": "A donkey or mule with bit and bridle, a set of cold-weather or warm-weather clothes, and a belt pouch containing 5 gp",
        "feature-name": "Shelter from the Storm",
        "feature-desc": "You have spent years hunting in the harshest environments of the world and have seen tents blown away by gales, food stolen by hungry bears, and equipment destroyed by the elements. While traveling in the wilderness, you can find a natural location suitable to make camp by spending 1 hour searching. This location provides cover from the elements and is in some way naturally defensible, at the GM's discretion.",
        "suggested-characteristics": "Most trophy hunters are skilled hobbyists and find strange relaxation in the tension of the hunt and revel in the glory of a kill. You may find great personal joy in hunting, in the adoration of peers, or simply in earning gold by selling pelts, scales, and horns.\n\n| d8 | Personality Trait                                                                                                                           |\n|----|---------------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | Nothing gets my blood pumping like stalking a wild animal.                                                                                  |\n| 2  | I like things big! Trophies, big! Food, big! Money, houses, weapons, possessions, I want ‘em big, big, BIG!                                 |\n| 3  | When hunting, it's almost as if I become a different person. Focused. Confident. Ruthless.                                                  |\n| 4  | The only way to kill a beast is to be patient and find the perfect moment to strike. The same is true for all the important things in life. |\n| 5  | Bathing is for novices. I know that to catch my smelly, filthy prey, I must smell like them to throw off their scent.                       |\n| 6  | I eat only raw meat. It gets me more in tune with my prey.                                                                                  |\n| 7  | I'm a connoisseur of killing implements; I only use the best, because I am the best.                                                        |\n| 8  | I thank the natural world for its bounty after every kill.                                                                                  |\n\n| d6 | Ideal                                                                                                                             |\n|----|-----------------------------------------------------------------------------------------------------------------------------------|\n| 1  | **Ambition.** It is my divine calling to become better than my rivals by any means necessary. (Chaotic)                               |\n| 2  | **Altruism.** I hunt only to protect those who cannot protect themselves. (Good)                                                      |\n| 3  | **Determination.** No matter what the laws say, I will kill that beast! (Chaotic)                                                     |\n| 4  | **Cruelty.** My prey lives only for my pleasure. It will die exactly as quickly or as slowly as I desire. (Evil)                      |\n| 5  | **Sport.** We're just here to have fun. (Neutral)                                                                                     |\n| 6  | **Family.** I follow in my family's footsteps. I will not tarnish their legacy. (Any)                                                 |\n\n| d6 | Bond                                                                                                              |\n|----|-------------------------------------------------------------------------------------------------------------------|\n| 1  | I like hunting because I like feeling big and powerful.                                                           |\n| 2  | I hunt because my parents think I'm a worthless runt. I need to make them proud.                                  |\n| 3  | I was mauled by a beast on my first hunting trip. I've spent my life searching for that monster.                  |\n| 4  | The first time I drew blood, something awoke within me. Every hunt is a search for the original ecstasy of blood. |\n| 5  | My hunting companions used to laugh at me behind my back. They aren't laughing anymore.                           |\n| 6  | A close friend funded my first hunting expedition. I am forever in their debt.                                    |\n\n| d6 | Flaw                                                                                                      |\n|----|-----------------------------------------------------------------------------------------------------------|\n| 1  | I'm actually a sham. All of my trophies were bagged by someone else. I just followed along and watched.   |\n| 2  | I'm terrified of anything larger than myself.                                                             |\n| 3  | I can't express anger without lashing out at something.                                                   |\n| 4  | I need money. I don't care how much or how little I have; I need more. And I would do anything to get it. |\n| 5  | I am obsessed with beauty in animals, art, and people.                                                    |\n| 6  | I don't trust my hunting partners, whom I know are here to steal my glory!                                |"
    }
]