[
    {
        "name": "Barbarian",
        "features": {
            "hit-dice": "1d12",
            "hp-at-1st-level": "12 + your Constitution modifier",
            "hp-at-higher-levels": "1d12 (or 7) + your Constitution modifier per barbarian level after 1st",
            "prof-armor": "Light armor, medium armor, shields",
            "prof-weapons": "Simple weapons, martial weapons",
            "prof-tools": "None",
            "prof-saving-throws": "Strength, Constitution",
            "prof-skills": "Choose two from Animal Handling, Athletics, Intimidation, Nature, Perception, and Survival",
            "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n \n* (*a*) a greataxe or (*b*) any martial melee weapon \n* (*a*) two handaxes or (*b*) any simple weapon \n* An explorer's pack and four javelins",
            "table": "| Level  | Proficiency Bonus | Features                      | Rages     | Rage Damage | \n|--------|-------------------|-------------------------------|-----------|-------------| \n| 1st    | +2                | Rage, Unarmored Defense       | 2         | +2          | \n| 2nd    | +2                | Reckless Attack, Danger Sense | 2         | +2          | \n| 3rd    | +2                | Primal Path                   | 3         | +2          | \n| 4th    | +2                | Ability Score Improvement     | 3         | +2          | \n| 5th    | +3                | Extra Attack, Fast Movement   | 3         | +2          | \n| 6th    | +3                | Path feature                  | 4         | +2          | \n| 7th    | +3                | Feral Instinct                | 4         | +2          | \n| 8th    | +3                | Ability Score Improvement     | 4         | +2          | \n| 9th    | +4                | Brutal Critical (1 die)       | 4         | +3          | \n| 10th   | +4                | Path feature                  | 4         | +3          | \n| 11th   | +4                | Relentless                    | 4         | +3          | \n| 12th   | +4                | Ability Score Improvement     | 5         | +3          | \n| 13th   | +5                | Brutal Critical (2 dice)      | 5         | +3          | \n| 14th   | +5                | Path feature                  | 5         | +3          | \n| 15th   | +5                | Persistent Rage               | 5         | +3          | \n| 16th   | +5                | Ability Score Improvement     | 5         | +4          | \n| 17th   | +6                | Brutal Critical (3 dice)      | 6         | +4          | \n| 18th   | +6                | Indomitable Might             | 6         | +4          | \n| 19th   | +6                | Ability Score Improvement     | 6         | +4          | \n| 20th   | +6                | Primal Champion               | Unlimited | +4          | ",
            "desc": "### Rage \n \nIn battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. \n \nWhile raging, you gain the following benefits if you aren't wearing heavy armor: \n \n* You have advantage on Strength checks and Strength saving throws. \n* When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table. \n* You have resistance to bludgeoning, piercing, and slashing damage. \n \nIf you are able to cast spells, you can't cast them or concentrate on them while raging. \n \nYour rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action. \n \nOnce you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again. \n \n### Unarmored Defense \n \nWhile you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit. \n \n### Reckless Attack \n \nStarting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn. \n \n### Danger Sense \n \nAt 2nd level, you gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. \n \nYou have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be blinded, deafened, or incapacitated. \n \n### Primal Path \n \nAt 3rd level, you choose a path that shapes the nature of your rage. Choose the Path of the Berserker or the Path of the Totem Warrior, both detailed at the end of the class description. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Extra Attack \n \nBeginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. \n \n### Fast Movement \n \nStarting at 5th level, your speed increases by 10 feet while you aren't wearing heavy armor. \n \n### Feral Instinct \n \nBy 7th level, your instincts are so honed that you have advantage on initiative rolls. \n \nAdditionally, if you are surprised at the beginning of combat and aren't incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn. \n \n### Brutal Critical \n \nBeginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack. \n \nThis increases to two additional dice at 13th level and three additional dice at 17th level. \n \n### Relentless Rage \n \nStarting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead. \n \nEach time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10. \n \n### Persistent Rage \n \nBeginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it. \n \n### Indomitable Might \n \nBeginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total. \n \n### Primal Champion \n \nAt 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24.",
            "spellcasting-ability": ""
        },
        "subtypes-name": "Paths",
        "subtypes": [
            {
                "name": "Path of the Berserker",
                "desc": "For some barbarians, rage is a means to an end- that end being violence. The Path of the Berserker is a path of untrammeled fury, slick with blood. As you enter the berserker's rage, you thrill in the chaos of battle, heedless of your own health or well-being. \n \n##### Frenzy \n \nStarting when you choose this path at 3rd level, you can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion (as described in appendix A). \n \n##### Mindless Rage \n \nBeginning at 6th level, you can't be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage. \n \n##### Intimidating Presence \n \nBeginning at 10th level, you can use your action to frighten someone with your menacing presence. When you do so, choose one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you. \n \nIf the creature succeeds on its saving throw, you can't use this feature on that creature again for 24 hours. \n \n##### Retaliation \n \nStarting at 14th level, when you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature."
            },
            {
                "name": "Path of Booming Magnificence",
                "desc": "Barbarians who walk the Path of Booming Magnificence strive to be as lions among their people: symbols of vitality, majesty, and courage. They serve at the vanguard, leading their allies at each charge and drawing their opponents' attention away from more vulnerable members of their group. As they grow more experienced, members of this path often take on roles as leaders or in other integral positions. \n \n##### Roar of Defiance \n \nBeginning at 3rd level, you can announce your presence by unleashing a thunderous roar as part of the bonus action you take to enter your rage. Until the beginning of your next turn, each creature of your choice within 30 feet of you that can hear you has disadvantage on any attack roll that doesn't target you. \n \nUntil the rage ends, if a creature within 5 feet of you that heard your Roar of Defiance deals damage to you, you can use your reaction to bellow at them. Your attacker must succeed on a Constitution saving throw or take 1d6 thunder damage. The DC is equal to 8 + your proficiency bonus + your Charisma modifier. The damage you deal with this feature increases to 2d6 at 10th level. Once a creature takes damage from this feature, you can't use this feature on that creature again during this rage. \n \n##### Running Leap \n \nAt 3rd level, while you are raging, you can leap further. When you make a standing long jump, you can leap a number of feet equal to your Strength score. With a 10-foot running start, you can long jump a number of feet equal to twice your Strength score. \n \n##### Lion's Glory \n \nStarting at 6th level, when you enter your rage, you can choose a number of allies that can see you equal to your Charisma modifier (minimum 1). Until the rage ends, when a chosen ally makes a melee weapon attack, the ally gains a bonus to the damage roll equal to the Rage Damage bonus you gain, as shown in the Rage Damage column of the Barbarian table. Once used, you can't use this feature again until you finish a long rest. \n \n##### Resonant Bellow \n \nAt 10th level, your roars can pierce the fog of fear. As a bonus action, you can unleash a mighty roar, ending the frightened condition on yourself and each creature of your choice within 60 feet of you and who can hear you. Each creature that ceases to be frightened gains 1d12 + your Charisma modifier (minimum +1) temporary hit points for 1 hour. Once used, you can't use this feature again until you finish a short or long rest. \n \n##### Victorious Roar \n \nAt 14th level, you exult in your victories. When you hit with at least two attacks on the same turn, you can use a bonus action to unleash a victorious roar. One creature you can see within 30 feet of you must make a Wisdom saving throw with a DC equal to 8 + your proficiency bonus + your Charisma modifier. On a failure, the creature takes psychic damage equal to your barbarian level and is frightened until the end of its next turn. On a success, it takes half the damage and isn't frightened."
            },
            {
                "name": "Path of Hellfire",
                "desc": "Devils have long been known to grant power to mortals as part of a pact or bargain. While this may take the form of unique magic or boons, those who follow the Path of Hellfire are gifted with command over the fires of the Lower Planes, which they channel for short periods to become powerful and furious fighting machines. \n \nWhile some of these barbarians are enlisted to support the devils' interests as soldiers or enforcers, some escape their devilish fates, while others still are released after their term of service. \n \n#####Hellish Aspect \n \nBeginning at 3rd level, when you enter your rage, you take on minor fiendish aspects. The way these aspects manifest is up to you and can include sprouting horns from your head, changing the color of your skin, growing fangs or a tail, or other small physical changes. Though infused with fiendish power, you aren't a fiend. While raging, you have resistance to fire damage, and the first creature you hit on each of your turns with a weapon attack takes 1d6 extra fire damage. This damage increases to 2d6 at 10th level. \n \n#####Hell's Vengeance \n \nAt 6th level, you can use your hellfire to punish enemies. If an ally you can see within 60 feet of you takes damage while you are raging, you can use your reaction to surround the attacker with hellfire, dealing fire damage equal to your proficiency bonus to it. \n \n#####Hellfire Shield \n \nStarting at 10th level, when you enter your rage, you can surround yourself with flames. This effect works like the fire shield spell, except you are surrounded with a warm shield only and it ends when your rage ends. Once used, you can't use this feature again until you finish a short or long rest. \n \n#####Devilish Essence \n \nAt 14th level, while raging, you have advantage on saving throws against spells and other magical effects, and if you take damage from a spell, you can use your reaction to gain temporary hit points equal to your barbarian level."
            },
            {
                "name": "Path of Mistwood",
                "desc": "The first barbarians that traveled the path of mistwood were elves who expanded upon their natural gifts to become masters of the forests. Over time, members of other races who saw the need to protect and cherish the green places of the world joined and learned from them. Often these warriors haunt the woods alone, only seen when called to action by something that would despoil their home. \n \n##### Bonus Proficiency \n \nAt 3rd level, you gain proficiency in the Stealth skill. If you are already proficient in Stealth, you gain proficiency in another barbarian class skill of your choice. \n \n##### Mistwood Defender \n \nStarting at 3rd level, you can use the Reckless Attack feature on ranged weapon attacks with thrown weapons, and, while you aren't within melee range of a hostile creature that isn't incapacitated, you can draw and throw a thrown weapon as a bonus action. In addition, when you make a ranged weapon attack with a thrown weapon using Strength while raging, you can add your Rage Damage bonus to the damage you deal with the thrown weapon. \n \n##### From the Mist \n \nBeginning at 6th level, mist and fog don't hinder your vision. In addition, you can cast the misty step spell, and you can make one attack with a thrown weapon as part of the same bonus action immediately before or immediately after you cast the spell. You can cast this spell while raging. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest. \n \n##### Mist Dance \n \nStarting at 10th level, when you use the Attack action while raging, you can make one attack against each creature within 5 feet of you in place of one of your attacks. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest. \n \n##### War Band's Passage \n \nStarting at 14th level, when you use your From the Mist feature to cast misty step, you can bring up to two willing creatures within 5 feet of you along with you, as long as each creature isn't carrying more than its carrying capacity. Attacks against you and any creatures you bring with you have disadvantage until the start of your next turn."
            },
            {
                "name": "Path of the Dragon",
                "desc": "Few creatures embody the power and majesty of dragons. By walking the path of the dragon, you don't solely aspire to emulate these creatures—you seek to become one. The barbarians who follow this path often do so after surviving a dragon encounter or are raised in a culture that worships them. Dragons tend to have a mixed view of the barbarians who choose this path. Some dragons, in particular the metallic dragons, view such a transformation as a flattering act of admiration. Others may recognize or even fully embrace them as useful to their own ambitions. Still others view this path as embarrassing at best and insulting at worst, for what puny, two-legged creature can ever hope to come close to the natural ferocity of a dragon? When choosing this path, consider what experiences drove you to such a course. These experiences will help inform how you deal with the judgment of dragons you encounter in the world. \n \n##### Totem Dragon \n \nStarting when you choose this path at 3rd level, you choose which type of dragon you seek to emulate. You can speak and read Draconic, and you are resistant to the damage type of your chosen dragon.\n \n**Dragon Types (table)** \n \n| Dragon | Damage Type | \n|---------------------|-------------| \n| Black or Copper | Acid | \n| Blue or Bronze | Lightning | \n| Brass, Gold, or Red | Fire | \n| Green | Poison | \n| Silver or White | Cold | \n \n##### Wyrm Teeth \n \nAt 3rd level, your jaws extend and become dragon-like when you enter your rage. While raging, you can use a bonus action to make a melee attack with your bite against one creature you can see within 5 feet of you. You are proficient with the bite. When you hit with it, your bite deals piercing damage equal to 1d8 + your Strength modifier + damage of the type associated with your totem dragon equal to your proficiency bonus. \n \n##### Legendary Might \n \nStarting at 6th level, if you fail a saving throw, you can choose to succeed instead. Once you use this feature, you can't use it again until you finish a long rest. When you reach 14th level in this class, you can use this feature twice between long rests. \n \n##### Aspect of the Dragon \n \nAt 10th level, you take on additional draconic features while raging. When you enter your rage, choose one of the following aspects to manifest. \n \n ***Dragon Heart.*** You gain temporary hit points equal to 1d12 + your barbarian level. Once you manifest this aspect, you must finish a short or long rest before you can manifest it again. \n \n ***Dragon Hide.*** Scales sprout across your skin. Your Armor Class increases by 2. \n \n ***Dragon Sight.*** Your senses become those of a dragon. You have blindsight out to a range of 60 feet. \n \n ***Dragon Wings.*** You sprout a pair of wings that resemble those of your totem dragon. While the wings are present, you have a flying speed of 30 feet. You can't manifest your wings while wearing armor unless it is made to accommodate them, and clothing not made to accommodate your wings might be destroyed when you manifest them. \n \n##### Wyrm Lungs \n \nAt 14th level, while raging, you can use an action to make a breath weapon attack. You exhale your breath in a 60-foot cone. Each creature in the area must make a Dexterity saving throw (DC equal to 8 + your proficiency bonus + your Constitution modifier), taking 12d8 damage of the type associated with your totem dragon on a failed save, or half as much damage on a successful one. Once you use this feature, you can't use it again until you finish a long rest."
            },
            {
                "name": "Path of the Herald",
                "desc": "In northern lands, the savage warriors charge into battle behind chanting warrior-poets. These wise men and women collect the histories, traditions, and accumulated knowledge of the people to preserve and pass on. Barbarians who follow the Path of the Herald lead their people into battle, chanting the tribe's sagas and spurring them on to new victories while honoring the glory of the past. \n \n##### Oral Tradition \n \nWhen you adopt this path at 3rd level, you gain proficiency in History and Performance. If you already have proficiency in one of these skills, your proficiency bonus is doubled for ability checks you make using that skill. \n \n##### Battle Fervor \n \nStarting when you choose this path at 3rd level, when you enter a rage, you can expend one additional daily use of rage to allow a number of willing creatures equal to half your proficiency bonus (minimum of 1) within 30 feet of you to enter a rage as well. A target must be able to see and hear you to enter this rage. Each target gains the benefits and restrictions of the barbarian Rage class feature. In addition, the rage ends early on a target if it can no longer see or hear you. \n \n##### Lorekeeper \n \nAs a historian, you know how much impact the past has on the present. At 6th level, you can enter a trance and explore your people's sagas to cast the augury, comprehend languages, or identify spell, but only as a ritual. After you cast a spell in this way, you can't use this feature again until you finish a short or long rest. \n \n##### Bolstering Chant \n \nAt 10th level, when you end your rage as a bonus action, you regain a number of hit points equal to your barbarian level *x* 3. Alternatively, if you end your rage and other creatures are also raging due to your Battle Fervor feature, you and each creature affected by your Battle Fervor regains a number of hit points equal to your barbarian level + your Charisma modifier. \n \n##### Thunderous Oratory \n \nAt 14th level, while you are raging, your attacks deal an extra 2d6 thunder damage. If a creature is raging due to your Battle Fervor feature, its weapon attacks deal an extra 1d6 thunder damage. In addition, when you or a creature affected by your Battle Fervor scores a critical hit with a melee weapon attack, the target must succeed on a Strength saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be pushed up to 10 feet away and knocked prone in addition to any extra damage from the critical hit."
            },
            {
                "name": "Path of the Inner Eye",
                "desc": "The barbarians who follow the Path of the Inner Eye elevate their rage beyond anger to glimpse premonitions of the future. \n \n##### Anticipatory Stance \n \nWhen you choose this path at 3rd level, you can't be surprised unless you are incapacitated, and attacks against you before your first turn have disadvantage. If you take damage before your first turn, you can enter a rage as a reaction, gaining resistance to bludgeoning, piercing, and slashing damage from the triggering attack. \n \nWhen you reach 8th level in this class, you get 1 extra reaction on each of your turns. This extra reaction can be used only for features granted by the Path of the Inner Eye, such as Insightful Dodge or Preemptive Parry. When you reach 18th level in this class, this increases to 2 extra reactions on each of your turns. \n \n##### Insightful Dodge \n \nBeginning at 6th level, when you are hit by an attack while raging, you can use your reaction to move 5 feet. If this movement takes you beyond the range of the attack, the attack misses instead. You can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest. \n \n##### Foretelling Tactics \n \nStarting at 10th level, when you hit a creature with a weapon attack while raging, up to two creatures of your choice who can see and hear you can each use a reaction to immediately move up to half its speed toward the creature you hit and make a single melee or ranged weapon attack against that creature. This movement doesn't provoke opportunity attacks. Once you use this feature, you can't use it again until you finish a short or long rest. \n \n##### Preemptive Parry \n \nAt 14th level, if you are raging and a creature you can see within your reach hits another creature with a weapon attack, you can use your reaction to force the attacker to reroll the attack and use the lower of the two rolls. If the result is still a hit, reduce the damage dealt by your weapon damage die + your Strength modifier."
            },
            {
                "name": "Path of Thorns",
                "desc": "Path of Thorns barbarians use ancient techniques developed by the druids of old that enable them to grow thorns all over their body. The first barbarians of this path fought alongside these druids to defend the natural order. In the centuries since, the knowledge of these techniques has spread, allowing others access to this power. \n \nThough named for the thorns that covered the first barbarians to walk this path, current followers of this path can display thorns, spines, or boney growths while raging. \n \n##### Blossoming Thorns \n \nBeginning at 3rd level, when you enter your rage, hard, sharp thorns emerge over your whole body, turning your unarmed strikes into dangerous weapons. When you hit with an unarmed strike while raging, your unarmed strike deals piercing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. In addition, while raging, when you use the Attack action with an unarmed strike on your turn, you can make one unarmed strike as a bonus action. \n \nThe unarmed strike damage you deal while raging increases when you reach certain levels in this class: to 1d6 at 8th level and to 1d8 at 14th level. \n \n##### Thorned Grasp \n \nAlso at 3rd level, when you use the Attack action to grapple a creature while raging, the target takes 1d4 piercing damage if your grapple check succeeds, and it takes 1d4 piercing damage at the start of each of your turns, provided you continue to grapple the creature and are raging. When you reach 10th level in this class, this damage increases to 2d4. \n \n##### Nature's Blessing \n \nAt 6th level, the thorns you grow while raging become more powerful and count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage. When you are hit by a melee weapon attack by a creature within 5 feet of you while raging, that creature takes 1d4 piercing damage. When you reach 10th level in this class, this damage increases to 2d4. \n \nAlternatively, while raging, you can use your reaction to disarm a creature that hits you with a melee weapon while within 5 feet of you by catching its weapon in your thorns instead of the attacker taking damage from your thorns. The attacker must succeed on a Strength saving throw (DC equal to 8 + your Constitution modifier + your proficiency bonus) or drop the weapon it used to attack you. The weapon lands at its feet. The attacker must be wielding a weapon for you to use this reaction. \n \n##### Toxic Infusion \n \nStarting at 10th level, when you enter your rage or as a bonus action while raging, you can infuse your thorns with toxins for 1 minute. While your thorns are infused with toxins, the first creature you hit on each of your turns with an unarmed strike must succeed on a Constitution saving throw (DC equal to 8 + your Constitution modifier + your proficiency bonus) or be poisoned until the end of its next turn. \n \nYou can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest. \n \n##### Thorn Barrage \n \nAt 14th level, you can use an action to shoot the thorns from your body while raging. Each creature within 10 feet of you must make a Dexterity saving throw (DC equal to 8 + your Constitution modifier + your proficiency bonus), taking 4d6 piercing damage on a failed save, or half as much damage on a successful one. \n \nYou can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest."
            }
        ]
    },
    {
        "name": "Bard",
        "features": {
            "hit-dice": "1d8",
            "hp-at-1st-level": "8 + your Constitution modifier",
            "hp-at-higher-levels": "1d8 (or 5) + your Constitution modifier per bard level after 1st",
            "prof-armor": "Light armor",
            "prof-weapons": "Simple weapons, hand crossbows, longswords, rapiers, shortswords",
            "prof-tools": "Three musical instruments of your choice",
            "prof-saving-throws": "Dexterity, Charisma",
            "prof-skills": "Choose any three",
            "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n \n* (*a*) a rapier, (*b*) a longsword, or (*c*) any simple weapon \n* (*a*) a diplomat's pack or (*b*) an entertainer's pack \n* (*a*) a lute or (*b*) any other musical instrument \n* Leather armor and a dagger",
            "table": "| Level | Proficiency Bonus | Features                                             | Spells Known | Cantrips Known | 1st | 2nd | 3rd | 4th | 5th | 6th | 7th | 8th | 9th | \n|-------|------------------|------------------------------------------------------|--------------|----------------|-----|-----|-----|-----|-----|-----|-----|-----|-----| \n| 1st   | +2               | Spellcasting, Bardic Inspiration (d6)                | 2            | 4              | 2   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 2nd   | +2               | Jack of All Trades, Song of Rest (d6)                | 2            | 5              | 3   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 3rd   | +2               | Bard College, Expertise                              | 2            | 6              | 4   | 2   | -   | -   | -   | -   | -   | -   | -   | \n| 4th   | +2               | Ability Score Improvement                            | 3            | 7              | 4   | 3   | -   | -   | -   | -   | -   | -   | -   | \n| 5th   | +3               | Bardic Inspiration (d8), Font of Inspiration         | 3            | 8              | 4   | 3   | 2   | -   | -   | -   | -   | -   | -   | \n| 6th   | +3               | Countercharm, Bard College Feature                   | 3            | 9              | 4   | 3   | 3   | -   | -   | -   | -   | -   | -   | \n| 7th   | +3               | -                                                    | 3            | 10             | 4   | 3   | 3   | 1   | -   | -   | -   | -   | -   | \n| 8th   | +3               | Ability Score Improvement                            | 3            | 11             | 4   | 3   | 3   | 2   | -   | -   | -   | -   | -   | \n| 9th   | +4               | Song of Rest (d8)                                    | 3            | 12             | 4   | 3   | 3   | 3   | 1   | -   | -   | -   | -   | \n| 10th  | +4               | Bardic Inspiration (d10), Expertise, Magical Secrets | 4            | 14             | 4   | 3   | 3   | 3   | 2   | -   | -   | -   | -   | \n| 11th  | +4               | -                                                    | 4            | 15             | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 12th  | +4               | Ability Score Improvement                            | 4            | 15             | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 13th  | +5               | Song of Rest (d10)                                   | 4            | 16             | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 14th  | +5               | Magical Secrets, Bard College Feature                | 4            | 18             | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 15th  | +5               | Bardic Inspiration (d12)                             | 4            | 19             | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 16th  | +5               | Ability Score Improvement                            | 4            | 19             | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 17th  | +6               | Song of Rest (d12)                                   | 4            | 20             | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | 1   | \n| 18th  | +6               | Magical Secrets                                      | 4            | 22             | 4   | 3   | 3   | 3   | 3   | 1   | 1   | 1   | 1   | \n| 19th  | +6               | Ability Score Improvement                            | 4            | 22             | 4   | 3   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | \n| 20th  | +6               | Superior Inspiration                                 | 4            | 22             | 4   | 3   | 3   | 3   | 3   | 2   | 2   | 1   | 1   | ",
            "desc": "### Spellcasting \n \nYou have learned to untangle and reshape the fabric of reality in harmony with your wishes and music. \n \nYour spells are part of your vast repertoire, magic that you can tune to different situations. \n \n#### Cantrips \n \nYou know two cantrips of your choice from the bard spell list. You learn additional bard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Bard table. \n \n#### Spell Slots \n \nThe Bard table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. \n \nFor example, if you know the 1st-level spell *cure wounds* and have a 1st-level and a 2nd-level spell slot available, you can cast *cure wounds* using either slot. \n \n#### Spells Known of 1st Level and Higher \n \nYou know four 1st-level spells of your choice from the bard spell list. \n \nThe Spells Known column of the Bard table shows when you learn more bard spells of your choice. Each of these spells must be of a level for which you have spell slots, as shown on the table. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level. \n \nAdditionally, when you gain a level in this class, you can choose one of the bard spells you know and replace it with another spell from the bard spell list, which also must be of a level for which you have spell slots. \n \n#### Spellcasting Ability \n \nCharisma is your spellcasting ability for your bard spells. Your magic comes from the heart and soul you pour into the performance of your music or oration. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a bard spell you cast and when making an attack roll with one. \n \n**Spell save DC** = 8 + your proficiency bonus + your Charisma modifier \n \n**Spell attack modifier** = your proficiency bonus + your Charisma modifier \n \n#### Ritual Casting \n \nYou can cast any bard spell you know as a ritual if that spell has the ritual tag. \n \n#### Spellcasting Focus \n \nYou can use a musical instrument (see chapter 5, “Equipment”) as a spellcasting focus for your bard spells. \n \n### Bardic Inspiration \n \nYou can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6. \n \nOnce within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the GM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time. \n \nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest. \n \nYour Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level. \n \n### Jack of All Trades \n \nStarting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn't already include your proficiency bonus. \n \n### Song of Rest \n \nBeginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points. \n \nThe extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level. \n \n### Bard College \n \nAt 3rd level, you delve into the advanced techniques of a bard college of your choice: the College of Lore or the College of Valor, both detailed at the end of \n \nthe class description. Your choice grants you features at 3rd level and again at 6th and 14th level. \n \n### Expertise \n \nAt 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies. \n \nAt 10th level, you can choose another two skill proficiencies to gain this benefit. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Font of Inspiration \n \nBeginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest. \n \n### Countercharm \n \nAt 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required). \n \n### Magical Secrets \n \nBy 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. \n \nThe chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table. \n \nYou learn two additional spells from any class at 14th level and again at 18th level. \n \n### Superior Inspiration \n \nAt 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use.",
            "spellcasting-ability": "Charisma"
        },
        "subtypes-name": "Colleges",
        "subtypes": [
            {
                "name": "College of Lore",
                "desc": "Bards of the College of Lore know something about most things, collecting bits of knowledge from sources as diverse as scholarly tomes and peasant tales. Whether singing folk ballads in taverns or elaborate compositions in royal courts, these bards use their gifts to hold audiences spellbound. When the applause dies down, the audience members might find themselves questioning everything they held to be true, from their faith in the priesthood of the local temple to their loyalty to the king. \n \nThe loyalty of these bards lies in the pursuit of beauty and truth, not in fealty to a monarch or following the tenets of a deity. A noble who keeps such a bard as a herald or advisor knows that the bard would rather be honest than politic. \n \nThe college's members gather in libraries and sometimes in actual colleges, complete with classrooms and dormitories, to share their lore with one another. They also meet at festivals or affairs of state, where they can expose corruption, unravel lies, and poke fun at self-important figures of authority. \n \n##### Bonus Proficiencies \n \nWhen you join the College of Lore at 3rd level, you gain proficiency with three skills of your choice. \n \n##### Cutting Words \n \nAlso at 3rd level, you learn how to use your wit to distract, confuse, and otherwise sap the confidence and competence of others. When a creature that you can see within 60 feet of you makes an attack roll, an ability check, or a damage roll, you can use your reaction to expend one of your uses of Bardic Inspiration, rolling a Bardic Inspiration die and subtracting the number rolled from the creature's roll. You can choose to use this feature after the creature makes its roll, but before the GM determines whether the attack roll or ability check succeeds or fails, or before the creature deals its damage. The creature is immune if it can't hear you or if it's immune to being charmed. \n \n##### Additional Magical Secrets \n \nAt 6th level, you learn two spells of your choice from any class. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you but don't count against the number of bard spells you know. \n \n##### Peerless Skill \n \nStarting at 14th level, when you make an ability check, you can expend one use of Bardic Inspiration. Roll a Bardic Inspiration die and add the number rolled to your ability check. You can choose to do so after you roll the die for the ability check, but before the GM tells you whether you succeed or fail."
            },
            {
                "name": "College of Echoes",
                "desc": "In the caverns beneath the surface of the world, sound works differently. Your exposure to echoes has taught you about how sound changes as it moves and encounters obstacles. Inspired by the effect caves and tunnels have on sounds, you have learned to manipulate sound with your magic, curving it and altering it as it moves. You can silence the most violent explosions, you can make whispers seem to reverberate forever, and you can even change the sounds of music and words as they are created. \n \n##### Echolocation \n \nWhen you join the College of Echoes at 3rd level, you learn how to see with your ears as well as your eyes. As long as you can hear, you have blindsight out to a range of 10 feet, and you have disadvantage on saving throws against effects that would deafen you. At 14th level, your blindsight is now out to a range of 15 feet, and you no longer have disadvantage on saving throws against effects that would deafen you. \n \n##### Alter Sound\n \nAt 3rd level, you can manipulate the sounds of your speech to mimic any sounds you've heard, including voices. A creature that hears the sounds can tell they are imitations with a successful Wisdom (Insight) check contested by your Charisma (Deception) check. \n \nIn addition, you can manipulate some of the sounds around you. You can use your reaction to cause one of the following effects. \n ***Enhance.*** You can increase the volume of a sound originating within 30 feet of you, doubling the range it can be heard and granting creatures in range of the sound advantage on Wisdom (Perception) checks to detect the sound. In addition, when a hostile creature within 30 feet of you takes thunder damage, you can expend one use of Bardic Inspiration and increase the thunder damage by an amount equal to the number you roll on the Bardic Inspiration die. \n ***Dampen.*** You can decrease the volume of a sound originating within 30 feet of you, halving the range it can be heard and granting creatures in range of the sound disadvantage on Wisdom (Perception) checks to detect the sound. In addition, when a friendly creature within 30 feet of you takes thunder damage, you can expend one use of Bardic Inspiration and decrease the thunder damage by an amount equal to the number you roll on the Bardic Inspiration die. **Distort.** You can change 1 word or up to 2 notes within 30 feet of you to another word or other notes. You can expend one use of Bardic Inspiration to change a number of words within 30 feet of you equal to 1 + the number you roll on the Bardic Inspiration die, or you can change a number of notes of a melody within 30 feet of you equal to 2 + double the number you roll on the Bardic Inspiration die. A creature that can hear the sound can notice it was altered by succeeding on a Wisdom (Perception) check contested by your Charisma (Deception) check. At your GM's discretion, this effect can alter sounds that aren't words or melodies, such as altering the cries of a young animal to sound like the roars of an adult. \n ***Disrupt.*** When a spellcaster casts a spell with verbal components within 30 feet of you, you can expend one use of your Bardic Inspiration to disrupt the sounds of the verbal components. The spellcaster must succeed on a concentration check (DC 8 + the number you roll on the Bardic Inspiration die) or the spell fails and has no effect. You can disrupt a spell only if it is of a spell level you can cast. \n \n##### Resounding Strikes \n \nStarting at 6th level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal thunder damage to the target, in addition to the weapon's damage. The extra damage is 1d6 for a 1st-level spell slot, plus 1d6 for each spell level higher than 1st, to a maximum of 6d6. The damage increases by 1d6 if the target is made of inorganic material such as stone, crystal, or metal. \n \n##### Reverberating Strikes \n \nAt 14th level, your Bardic Inspiration infuses your allies' weapon attacks with sonic power. A creature that has a Bardic Inspiration die from you can roll that die and add the number rolled to a weapon damage roll it just made, and all of the damage from that attack becomes thunder damage. The target of the attack must succeed on a Strength saving throw against your spell save DC or be knocked prone."
            },
            {
                "name": "College of Investigation",
                "desc": "Bards pick up all sorts of information as they travel the land. Some bards focus on a certain type of information, like epic poetry, love ballads, or bawdy drinking songs. Others, however, turn to the shadowy occupation of investigating crimes. These bards use their knack for gathering information to learn about criminals and vigilantes, their tactics, and their weaknesses. Some work with agents of the law to catch criminals, but shadier members of this college use their dark knowledge to emulate the malefactors they have studied for so long. \n \n##### Bonus Proficiencies \n \nWhen you join the College of Investigation at 3rd level, you gain proficiency in the Insight skill and in two of the following skills of your choice: Acrobatics, Deception, Investigation, Performance, Sleight of Hand, or Stealth. \n \n##### Quick Read \n \nAt 3rd level, your knowledge of underhanded tactics allows you to gain insight into your foes' strategies. As a bonus action, you can expend one use of Bardic Inspiration to make a Wisdom (Insight) check against one creature you can see within 30 feet contested by the creature's Charisma (Deception) check. Add the number you roll on the Bardic Inspiration die to the result of your check. You have disadvantage on this check if the target is not a humanoid, and the check automatically fails against creatures with an Intelligence score of 3 or lower. On a success, you gain one of the following benefits: \n* The target has disadvantage on attack rolls against you for 1 minute. \n* You have advantage on saving throws against the target's spells and magical effects for 1 minute. \n* You have advantage on attack rolls against the target for 1 minute. \n \n##### Bardic Instinct \n \nStarting at 6th level, you can extend your knowledge of criminal behavior to your companions. When a creature that has a Bardic Inspiration die from you is damaged by a hostile creature's attack, it can use its reaction to roll that die and reduce the damage by twice the number rolled. If this reduces the damage of the attack to 0, the creature you inspired can make one melee attack against its attacker as part of the same reaction. \n \n##### Hot Pursuit \n \nStarting at 14th level, when a creature fails a saving throw against one of your bard spells, you can designate it as your mark for 24 hours. You know the direction to your mark at all times unless it is within an antimagic field, it is protected by an effect that prevents scrying such as nondetection, or there is a barrier of lead at least 1 inch thick between you. \n \nIn addition, whenever your mark makes an attack roll, you can expend one use of Bardic Inspiration to subtract the number rolled from the mark's attack roll. Alternatively, whenever you make a saving throw against a spell or magical effect from your mark, you can expend one use of Bardic Inspiration to add the number rolled to your saving throw. You can choose to expend the Bardic Inspiration after the attack or saving throw is rolled but before the outcome is determined."
            },
            {
                "name": "College of Shadows",
                "desc": "Some bards are as proficient in the art of espionage as they are in poetry and song. Their primary medium is information and secrets, though they are known to slip a dagger between ribs when necessary. Masters of insight and manipulation, these bards use every tool at their disposal in pursuit of their goals, and they value knowledge above all else. The more buried a secret, the deeper they delve to uncover it. Knowledge is power; it can cement empires or topple dynasties. \n \nCollege of Shadows bards undergo careful training before they're sent out into the world. Skilled in both music and manipulation, they're the perfect blend of charm and cunning. The tricks they learn in their tutelage make them ideal for the subtle work of coaxing out secrets, entrancing audiences, and dazzling the minds of their chosen targets. \n \n##### Bonus Proficiencies \n \nWhen you join the College of Shadows at 3rd level, you gain proficiency in Stealth and in two other skills of your choice. \n \n##### Mantle of Shadows \n \nStarting at 3rd level, while you are in dim light or darkness, you can use an action to twist the shadows around you for 1 minute or until your concentration ends. For the duration, you have advantage on Dexterity (Stealth) checks, and you can take the Dash action as a bonus action on each of your turns. \n \n##### Cunning Insight \n \nStarting at 6th level, you know exactly where to hit your enemies. You can use an action to focus on a creature you can see within 60 feet of you. The target must make a Wisdom saving throw against your spell save DC. You can use this feature as a bonus action if you expend a Bardic Inspiration die. If you do, roll the die and subtract the number rolled from the target's saving throw roll. If the target fails the saving throw, choose one of the following: \n* You have advantage on your next attack roll against the target. \n* You know the target's damage vulnerabilities. \n* You know the target's damage resistances and damage immunities. \n* You know the target's condition immunities. \n* You see through any illusions obscuring or affecting the target for 1 minute. \n \n##### Shadowed Performance \n \nStarting at 14th level, you are a master at weaving stories and influencing the minds of your audience. If you perform for at least 1 minute, you can attempt to make or break a creature's reputation by relaying a tale to an audience through song, poetry, play, or other medium. At the end of the performance, choose a number of humanoids who witnessed the entire performance, up to a number equal to 1 plus your Charisma modifier. Each target must make a Wisdom saving throw against your spell save DC. On a failed save, a target suffers one of the following (your choice): \n* For 24 hours, the target believes the tale you told is true and will tell others the tale as if it were truth. \n* For 1 hour, the target believes *someone* nearby knows their darkest secret, and they have disadvantage on Charisma, Wisdom, and Intelligence ability checks and saving throws as they are distracted and overcome with paranoia. \n* The target becomes convinced that you (or one of your allies if you choose to sing the praises of another) are a fearsome opponent. For 1 minute, the target is frightened of you (or your ally), and you (or your ally) have advantage on attack rolls against the target. A *remove curse* or *greater restoration* spell ends this effect early. You can't use this feature again until you finish a short or long rest."
            },
            {
                "name": "College of Sincerity",
                "desc": "Bards of the College of Sincerity know it is easier for someone to get what they want when they mask their true intentions behind a pleasant façade. These minstrels gain a devoted following and rarely lack for company. Some of their devotees go so far as to put themselves at the service of the bard they admire. Though members of the college can be found as traveling minstrels and adventuring troubadours, they gravitate to large urban areas where their silver tongues and mind-bending performances have the greatest influence. Devious rulers sometimes seek out members of the college as counsellors, but the rulers must be wary lest they become a mere pawn of their new aide. \n \n##### Entourage \n \nWhen you join the College of Sincerity at 3rd level, you gain the service of two commoners. Your entourage is considered charmed by you and travels with you to see to your mundane needs, such as making your meals and doing your laundry. If you are in an urban area, they act as your messengers and gofers. When you put on a performance, they speak your praises and rouse the crowd to applause. In exchange for their service, you must provide your entourage a place to live and pay the costs for them to share the same lifestyle as you. Your entourage doesn't join combat or venture into obviously dangerous areas or situations. If you or your companions abuse or mistreat your entourage, they leave your service immediately. If this occurs, you can gain the service of a new entourage by traveling to a different urban area where you must perform at least 1 hour each day for one week. You gain another commoner at 6th level, and a final one at 14th level. If you prefer, instead of gaining a new commoner at 6th level, one member of your entourage can become a guard. At 14th level, if you have a guard, it can become your choice of a spy or veteran, instead of taking on a new commoner. If one member of your entourage becomes a guard, spy, or veteran, that person accompanies you into dangerous situations, but they only use the Help action to aid you, unless you use a bonus action to direct them to take a specific action. At the GM's discretion, you can replace the guard with another humanoid of CR 1/8 or lower, the spy with another humanoid of CR 1 or lower, and the veteran with another humanoid of CR 3 or lower. \n \n##### Kind-Eyed Smile \n \nAlso at 3rd level, when you cast an enchantment spell, such as *charm person*, your target remains unaware of your attempt to affect its mind, regardless of the result of its saving throw. When the duration of an enchantment spell you cast ends, your target remains unaware that you enchanted it. If the description of the spell you cast states the creature is aware you influenced it with magic, it isn't aware you enchanted it unless it succeeds on a Charisma saving throw against your spell save DC. \n \n##### Lingering Presence \n \nStarting at 6th level, if a creature fails a saving throw against an enchantment or illusion spell you cast, it has disadvantage on subsequent saving throws it makes to overcome the effects of your spell. For example, a creature affected by your *hold person* spell has disadvantage on the saving throw it makes at the end of each of its turns to end the paralyzed effect. \n \n##### Artist of Renown \n \nAt 14th level, you can expend a Bardic Inspiration die to cast an enchantment spell you don't know using one of your spell slots. When you do so, you must be able to meet all of the spell's requirements, and you must have an available spell slot of sufficient level. \n \nYou can't use your Font of Inspiration feature to regain Bardic Inspiration dice expended to cast spells with this feature after a short rest. Bardic Inspiration dice expended by this feature are regained only after you finish a long rest."
            },
            {
                "name": "College of Tactics",
                "desc": "Bards of the College of Tactics are calculating strategists who scour historical records of famous battles for tricks they can use to give their own troops, and those of their patrons, an edge on the battlefield. Members of this college travel from war zone to combat site and interview the veterans of those engagements, trying to discern how the victors won the day and leveraging that information for their personal glory. \n \n##### Combat Tactician \n \nWhen you join the College of Tactics at 3rd level, you gain proficiency with medium armor, shields, and one martial weapon of your choice. In addition, you can use Bardic Inspiration a number of times equal to your Charisma modifier (a minimum of 1) + your proficiency bonus. You regain expended uses when you finish a long rest (or short rest if you have the Font of Inspiration feature), as normal. \n \n##### Setting the Board \n \nAlso at 3rd level, you can move your allies into more advantageous positions, just as a general moves troop markers on a map. As a bonus action, you can command up to three willing allies who can see or hear you to use a reaction to move. Each target can move up to half its speed. This movement doesn't provoke opportunity attacks. \n \nYou can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest. \n \n##### Song of Strategy \n \nBeginning at 6th level, you can share your tactical knowledge with your allies in the heat of battle. A creature that has a Bardic Inspiration die from you can roll that die and perform one of the following strategies. For the purpose of these strategies, “you” refers to the creature with the Bardic Inspiration die. \n \n ***Bait and Bleed.*** If you take the Dodge action, you can make one melee attack against a creature that is within 5 feet of you, adding the number rolled to your attack roll. \n \n ***Counter Offensive.*** If you take damage from a creature, you can use your reaction to make one attack against your attacker, adding the number rolled to your attack roll. You can't use this strategy if the attacker is outside your weapon's normal range or reach. \n \n ***Distraction.*** You can take the Disengage action as a bonus action, increasing your speed by 5 feet *x* the number rolled. \n \n ***Frightening Charge.*** If you take the Dash action, you can make one melee attack at the end of the movement, adding the number rolled to your attack roll. If the attack is a critical hit, the target is frightened until the start of your next turn. \n \n ***Hold Steady.*** If you take the Ready action and the trigger for the readied action doesn't occur, you can make one weapon or spell attack roll after all other creatures have acted in the round, adding the number rolled to the attack roll. \n \n ***Indirect Approach.*** If you take the Help action to aid a friendly creature in attacking a creature within 5 feet of you, the friendly creature can add the number rolled to their attack roll against the target, and each other friendly creature within 5 feet of you has advantage on its first attack roll against the target. \n \n##### Ablative Inspiration \n \nStarting at 14th level, when you take damage from a spell or effect that affects an area, such as the *fireball* spell or a dragon's breath weapon, you can expend one use of your Bardic Inspiration as a reaction to redirect and dissipate some of the spell's power. Roll the Bardic Inspiration die and add the number rolled to your saving throw against the spell. If you succeed on the saving throw, each friendly creature within 10 feet of you is also treated as if it succeeded on the saving throw."
            },
            {
                "name": "College of the Cat",
                "desc": "Scholars and spies, heroes and hunters: whether wooing an admirer in the bright sunlight or stalking prey under the gentle rays of the moon, bards of the College of the Cat excel at diverse skills and exhibit contrary tendencies. The adventurous spirits who favor the College of the Cat let their curiosity and natural talents get them into impossible places. Most are skilled, cunning, and vicious enough to extricate themselves from even the most dangerous situations. \n \n##### Bonus Proficiencies \n \nWhen you join the College of the Cat at 3rd level, you gain proficiency with the Acrobatics and Stealth skills and with thieves' tools if you don't already have them. In addition, if you're proficient with a simple or martial melee weapon, you can use it as a spellcasting focus for your bard spells. \n \n##### Inspired Pounce \n \nAlso at 3rd level, you learn to stalk unsuspecting foes engaged in combat with your allies. When an ally you can see uses one of your Bardic Inspiration dice on a weapon attack roll against a creature, you can use your reaction to move up to half your speed and make one melee weapon attack against that creature. You gain a bonus on your attack roll equal to the result of the spent Bardic Inspiration die. \n \nWhen you reach 6th level in this class, you gain a climbing speed equal to your walking speed, and when you use Inspired Pounce, you can move up to your speed as part of the reaction. \n \n##### My Claws Are Sharp \n \nBeginning at 6th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. In addition, when you use two-weapon fighting to make an attack as a bonus action, you can give a Bardic Inspiration die to a friendly creature within 60 feet of you as part of that same bonus action. \n \n##### Catlike Tread \n \nStarting at 14th level, while a creature has one of your Bardic Inspiration dice, it has advantage on Dexterity (Stealth) checks. When you have no uses of Bardic Inspiration left, you have advantage on Dexterity (Stealth) checks."
            }
        ]
    },
    {
        "name": "Cleric",
        "features": {
            "hit-dice": "1d8",
            "hp-at-1st-level": "8 + your Constitution modifier",
            "hp-at-higher-levels": "1d8 (or 5) + your Constitution modifier per cleric level after 1st",
            "prof-armor": "Light armor, medium armor, shields",
            "prof-weapons": "Simple weapons",
            "prof-tools": "None",
            "prof-saving-throws": "Wisdom, Charisma",
            "prof-skills": "Choose two from History, Insight, Medicine, Persuasion, and Religion",
            "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n \n* (*a*) a mace or (*b*) a warhammer (if proficient) \n* (*a*) scale mail, (*b*) leather armor, or (*c*) chain mail (if proficient) \n* (*a*) a light crossbow and 20 bolts or (*b*) any simple weapon \n* (*a*) a priest's pack or (*b*) an explorer's pack \n* A shield and a holy symbol",
            "table": "| Level | Proficiency Bonus | Features                                                                | Cantrips Known | 1st | 2nd | 3rd | 4th | 5th | 6th | 7th | 8th | 9th | \n|-------|-------------------|-------------------------------------------------------------------------|----------------|-----|-----|-----|-----|-----|-----|-----|-----|-----| \n| 1st   | +2                | Spellcasting, Divine Domain                                             | 3              | 2   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 2nd   | +2                | Channel Divinity (1/rest), Divine Domain Feature                        | 3              | 3   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 3rd   | +2                | -                                                                       | 3              | 4   | 2   | -   | -   | -   | -   | -   | -   | -   | \n| 4th   | +2                | Ability Score Improvement                                               | 4              | 4   | 3   | -   | -   | -   | -   | -   | -   | -   | \n| 5th   | +3                | Destroy Undead (CR 1/2)                                                 | 4              | 4   | 3   | 2   | -   | -   | -   | -   | -   | -   | \n| 6th   | +3                | Channel Divinity (2/rest), Divine Domain Feature                        | 4              | 4   | 3   | 3   | -   | -   | -   | -   | -   | -   | \n| 7th   | +3                | -                                                                       | 4              | 4   | 3   | 3   | 1   | -   | -   | -   | -   | -   | \n| 8th   | +3                | Ability Score Improvement, Destroy Undead (CR 1), Divine Domain Feature | 4              | 4   | 3   | 3   | 2   | -   | -   | -   | -   | -   | \n| 9th   | +4                | -                                                                       | 4              | 4   | 3   | 3   | 3   | 1   | -   | -   | -   | -   | \n| 10th  | +4                | Divine Intervention                                                     | 5              | 4   | 3   | 3   | 3   | 2   | -   | -   | -   | -   | \n| 11th  | +4                | Destroy Undead (CR 2)                                                   | 5              | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 12th  | +4                | Ability Score Improvement                                               | 5              | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 13th  | +5                | -                                                                       | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 14th  | +5                | Destroy Undead (CR 3)                                                   | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 15th  | +5                | -                                                                       | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 16th  | +5                | Ability Score Improvement                                               | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 17th  | +6                | Destroy Undead (CR 4), Divine Domain Feature                            | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | 1   | \n| 18th  | +6                | Channel Divinity (3/rest)                                               | 5              | 4   | 3   | 3   | 3   | 3   | 1   | 1   | 1   | 1   | \n| 19th  | +6                | Ability Score Improvement                                               | 5              | 4   | 3   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | \n| 20th  | +6                | Divine Intervention improvement                                         | 5              | 4   | 3   | 3   | 3   | 3   | 2   | 2   | 1   | 1   |",
            "desc": "### Spellcasting \n \nAs a conduit for divine power, you can cast cleric spells. \n \n#### Cantrips \n \nAt 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table. \n \n#### Preparing and Casting Spells \n \nThe Cleric table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. \n \nYou prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots. \n \nFor example, if you are a 3rd-level cleric, you have four \n1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell *cure wounds*, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells. \n \nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list. \n \n#### Spellcasting Ability \n \nWisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one. \n \n**Spell save DC** = 8 + your proficiency bonus + your Wisdom modifier \n \n**Spell attack modifier** = your proficiency bonus + your Wisdom modifier \n \n#### Ritual Casting \n \nYou can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared. \n \n#### Spellcasting Focus \n \nYou can use a holy symbol (see chapter 5, “Equipment”) as a spellcasting focus for your cleric spells. \n \n### Divine Domain \n \nChoose one domain related to your deity: Knowledge, Life, Light, Nature, Tempest, Trickery, or War. Each domain is detailed at the end of the class description, and each one provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels. \n \n#### Domain Spells \n \nEach domain has a list of spells-its domain spells- that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. \n \nIf you have a domain spell that doesn't appear on the cleric spell list, the spell is nonetheless a cleric spell for you. \n \n### Channel Divinity \n \nAt 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description. \n \nWhen you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again. \n \nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC. \n \nBeginning at 6th level, you can use your Channel \n \nDivinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses. \n \n#### Channel Divinity: Turn Undead \n \nAs an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage. \n \nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Destroy Undead \n \nStarting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Destroy Undead table. \n \n**Destroy Undead (table)** \n \n| Cleric Level | Destroys Undead of CR... | \n|--------------|--------------------------| \n| 5th          | 1/2 or lower             | \n| 8th          | 1 or lower               | \n| 11th         | 2 or lower               | \n| 14th         | 3 or lower               | \n| 17th         | 4 or lower               | \n \n### Divine Intervention \n \nBeginning at 10th level, you can call on your deity to intervene on your behalf when your need is great. \n \nImploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The GM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. \n \nIf your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest. \n \nAt 20th level, your call for intervention succeeds automatically, no roll required.",
            "spellcasting-ability": "Wisdom"
        },
        "subtypes-name": "Domains",
        "subtypes": [
            {
                "name": "Life Domain",
                "desc": "The Life domain focuses on the vibrant positive energy-one of the fundamental forces of the universe-that sustains all life. The gods of life promote vitality and health through healing the sick and wounded, caring for those in need, and driving away the forces of death and undeath. Almost any non-evil deity can claim influence over this domain, particularly agricultural deities (such as Chauntea, Arawai, and Demeter), sun gods (such as Lathander, Pelor, and Re-Horakhty), gods of healing or endurance (such as Ilmater, Mishakal, Apollo, and Diancecht), and gods of home and community (such as Hestia, Hathor, and Boldrei). \n \n**Life Domain Spells (table)** \n \n| Cleric Level | Spells                               | \n|--------------|--------------------------------------| \n| 1st          | bless, cure wounds                   | \n| 3rd          | lesser restoration, spiritual weapon | \n| 5th          | beacon of hope, revivify             | \n| 7th          | death ward, guardian of faith        | \n| 9th          | mass cure wounds, raise dead         | \n \n##### Bonus Proficiency \n \nWhen you choose this domain at 1st level, you gain proficiency with heavy armor. \n \n##### Disciple of Life \n \nAlso starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell's level. \n \n##### Channel Divinity: Preserve Life \n \nStarting at 2nd level, you can use your Channel Divinity to heal the badly injured. \n \nAs an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can't use this feature on an undead or a construct. \n \n##### Blessed Healer \n \nBeginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell's level. \n \n##### Divine Strike \n \nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8. \n \n##### Supreme Healing \n \nStarting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12."
            },
            {
                "name": "Black Powder Domain",
                "desc": "The Black Powder domain focuses on the explosive, unpredictable, and destructive capacity of black powder. Deities with a vested interest in alchemy or deities who revel in destruction can claim influence over this domain. Deities of destruction need not be evil; such gods may represent natural chaos and destruction, reveling just as much in the unpredictable destructive capacity of black powder as in the chaotic destruction wrought by a volcanic eruption. In areas where warfare involves alchemical weapons or firearms, gods of war might also claim influence over this domain. \n **Black Powder Domain Spells (table)** \n \n| Cleric Level | Spells                       | \n|--------------|------------------------------| \n| 1st          | *fog cloud*, *thunderwave*   | \n| 3rd          | *heat metal*, *shatter*      | \n| 5th          | *fireball*, *stinking cloud* | \n| 7th          | *confusion*, *wall of fire*  | \n| 9th          | *cloudkill*, *deadly salvo*  | \n| \n \n##### Bonus Proficiencies \n \nWhen you choose this domain at 1st level, you gain proficiency with alchemist's supplies or gunsmith's tools (your choice). You also gain proficiency with all simple and martial weapons that have the gunpowder weapon property (see the Adventuring Gear chapter), and when throwing an item with the gunpowder weapon property, such as a bomb, you don't treat the item as an improvised weapon. \n \n##### Gunpowder Blessing \n \nAlso at 1st level, you can use an action to touch a weapon held by a willing creature. The weapon gains the gunpowder weapon property. This blessing lasts for 1 minute or until you use this feature again. \n \n##### Channel Divinity: Imbue/Remove Explosivity \n \nStarting at 2nd level, you can use your Channel Divinity to harness the power of black powder, infusing it into the weapons of allies to make them more deadly, or revoke your god's blessing, lessening the effects of enemy firearms. \n \nAs an action, you present your holy symbol and evoke explosive energy that instills your Gunpowder Blessing on one weapon possessed by each creature of your choice within 30 feet of you for 1 minute. \n \nAlternatively, you can curse a number of weapons with the gunpowder weapon property equal to your proficiency bonus within 30 feet of you for 1 minute. Each affected weapon loses the ability to experience a burst for the duration. A remove curse spell cast on the weapon restores its full function. \n \n##### Explosive Infusion \n \nBeginning at 6th level, you can imbue an object you are holding or carrying with explosive power. The object must be nonmagical and small enough to fit in one hand, such as a glass vial or a ball bearing. As a bonus action, you can expend a 1st-level spell slot to fill the item with explosive power for 1 minute. Before the duration ends, you can use an action to throw the object at a point you can see up to 20 feet away, where it explodes on impact. Each creature within 5 feet of that point must make a Dexterity saving throw against your spell save DC, taking 2d6 fire damage on a failed save, or half as much damage on a successful one. This damage can experience bursts, as described in the gunpowder weapon property, but this effect counts as a single effect for the purposes of determining how many times the damage can burst, regardless of the number of targets affected. \n \nIf you expend a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st. If you expend a use of your Channel Divinity as part of the action to throw the object, each creature within 20 feet of the point of impact must make the saving throw. If you don't throw the object before the duration ends, the magic fades, and the item becomes a normal object once again. \n \n##### Divine Strike \n \nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 fire damage to the target. When you reach 14th level, the extra damage increases to 2d8. \n \n##### Greater Explosive Infusion \n \nStarting at 17th level, you can imbue explosive power into larger objects with your Explosive Infusion. The target must be an object that isn't being worn or carried at the time you imbue it, must be no larger than can fit in a single 5-foot cube, and must be nonmagical. Your infusion fills the object with explosive power for 10 minutes. Before the duration ends, you can detonate the object as an action, provided you are within 100 feet of it. Alternatively, you can detonate the object as a reaction to a specific event (a particular creature or certain number of creatures move within 20 feet of the object, for example), or you can set a specific time for the object to detonate, up to 10 minutes from the time at which you infused the object. If you set the object to detonate at a specific time, you don't need to be within 100 feet of the object for it to detonate. \n \nWhen the object detonates, each creature within 20 feet of the object must make the saving throw. If you expend a use of your Channel Divinity when you first imbue the object, each creature in the area when it detonates has disadvantage on the saving throw. At any point before the object detonates, you can touch it as an action to disperse the energy and cause it to become a normal object once again, regaining the spell slot you expended to infuse the object."
            },
            {
                "name": "Hunt Domain",
                "desc": "Many terrible creatures prey on the villages, towns, and inns that dot the forests of Midgard. When such creatures become particularly aggressive or can't be dissuaded by local druids, the settlements often call on servants of gods of the hunt to solve the problem. \n \nDeities devoted to hunting value champions who aid skillful hunters or who lead hunts themselves. Similarly, deities focused on protecting outlier settlements or who promote strengthening small communities also value such clerics. While these clerics might not have the utmost capability for tracking and killing prey, their gods grant them blessings to ensure successful hunts. These clerics might use their abilities to ensure their friends and communities have sufficient food to survive difficult times, or they might enjoy the sport of pursuing and slaying intelligent prey. \n \n **Hunt Domain Spells (table)** \n \n| Cleric Level | Spells                                 | \n|--------------|----------------------------------------| \n| 1st          | *bloodbound*, *illuminate spoor*       | \n| 3rd          | *instant snare*, *mark prey*           | \n| 5th          | *going in circles*, *tracer*           | \n| 7th          | *heart-seeking arrow*, *hunting stand* | \n| 9th          | *harrying hounds*, *maim*              | \n \n##### Blessing of the Hunter \n \nAt 1st level, you gain proficiency in Survival. You can use your action to touch a willing creature other than yourself to give it advantage on Wisdom (Survival) checks. This blessing lasts for 1 hour or until you use this feature again. \n \n##### Bonus Proficiency \n \nAt 1st level, you gain proficiency with martial weapons. \n \n##### Channel Divinity: Heart Strike \n \nStarting at 2nd level, you can use your Channel Divinity to inflict grievous wounds. When you hit a creature with a weapon attack, you can use your Channel Divinity to add +5 to the attack's damage. If you score a critical hit with the attack, add +10 to the attack's damage instead. \n \n##### Pack Hunter \n \nStarting at 6th level, when an ally within 30 feet of you makes a weapon attack roll against a creature you attacked within this round, you can use your reaction to grant that ally advantage on the attack roll. \n \n##### Divine Strike \n \nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8. \n \n##### Deadly Stalker \n \nAt 17th level, you can use an action to describe or name a creature that is familiar to you or that you can see within 120 feet. For 24 hours or until the target is dead, whichever occurs first, you have advantage on Wisdom (Survival) checks to track your target and Wisdom (Perception) checks to detect your target. In addition, you have advantage on weapon attack rolls against the target. You can't use this feature again until you finish a short or long rest."
            },
            {
                "name": "Mercy Domain",
                "desc": "Mercy can mean promoting healing instead of harm, but it can also mean ending suffering with a quick death. These often-contradictory ideals are the two sides of mercy. The tenets of deities who embody mercy promote ways to end bloody conflicts or deliver healing magics to those in need. While mercy for some may be benevolent, for others it is decidedly not so. More pragmatic mercy gods teach the best method to relieve the agony and torment brought on by monsters and the forces of evil is to bring about the end of that evil. \n \n **Mercy Domain Spells (table)** \n \n| Cleric Level | Spells                              | \n|--------------|-------------------------------------| \n| 1st          | *divine favor*, *healing word*      | \n| 3rd          | *aid*, *ray of enfeeblement*        | \n| 5th          | *bardo*, *revivify*                 | \n| 7th          | *death ward*, *sacrificial healing* | \n| 9th          | *antilife shell*, *raise dead*      | \n \n##### Bonus Proficiencies \n \nWhen you choose this domain at 1st level, you take your place on the line between the two aspects of mercy: healing and killing. You gain proficiency in the Medicine skill and with the poisoner's kit. In addition, you gain proficiency with heavy armor and martial weapons. \n \n##### Threshold Guardian \n \nAlso at 1st level, when you hit a creature that doesn't have all of its hit points with a melee weapon attack, the weapon deals extra radiant or necrotic damage (your choice) equal to half your proficiency bonus. \n \n##### Channel Divinity: Involuntary Aid \n \nStarting at 2nd level, you can use your Channel Divinity to wrest the lifeforce from an injured creature and use it to heal allies. As an action, you present your holy symbol to one creature you can see within 30 feet of you that doesn't have all of its hit points. The target must make a Wisdom saving throw, taking radiant or necrotic damage (your choice) equal to three times your cleric level on a failed save, or half as much damage on a successful one. Then, one friendly creature you can see within 30 feet of you regains a number of hit points equal to the amount of damage dealt to the target. \n \n##### Bolster the Living \n \nAt 6th level, you gain the ability to manipulate a portion of the lifeforce that escapes a creature as it perishes. When a creature you can see dies within 30 feet of you, you can use your reaction to channel a portion of that energy into a friendly creature you can see within 30 feet of you. The friendly creature gains a bonus to attack and damage rolls equal to half your proficiency bonus until the end of its next turn. \n \n##### Divine Strike of Mercy \n \nAt 8th level, you gain the ability to infuse your weapon strikes with the dual nature of mercy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d6 radiant or necrotic damage (your choice) to the target. If the target dies from this attack, a friendly creature you can see within 5 feet of you regains hit points equal to half the damage dealt. If no friendly creature is within 5 feet of you, you regain the hit points instead. When you reach 14th level, the extra damage increases to 2d6. \n \n##### Hand of Grace and Execution \n \nAt 17th level, you imbue the two sides of mercy into your spellcasting. Once on each of your turns, if you cast a spell that restores hit points to one creature or deals damage to one creature, you can add your proficiency bonus to the amount of hit points restored or damage dealt."
            },
            {
                "name": "Portal Domain",
                "desc": "You have dedicated yourself to the study and protection of the doors, gateways, and rips in the boundaries between the physical world and the infinite planar multiverse. Stepping through portals is a sacred prayer and woe betide any who seek to misuse them. Domain Spells You gain domain spells at the cleric levels listed in the Portal Domain Spells table. See the Divine Domain class feature for how domain spells work. \n \n **Portal Domain Spells (table)** \n \n| Cleric Level | Spells                                    | \n|--------------|-------------------------------------------| \n| 1st          | *adjust position*, *expeditious retreat*  | \n| 3rd          | *glyph of shifting*, *misty step*         | \n| 5th          | *dimensional shove*, *portal jaunt*       | \n| 7th          | *dimension door*, *reposition*            | \n| 9th          | *pierce the veil*, *teleportation circle* | \n \n##### Bonus Proficiencies \n \nWhen you choose this domain at 1st level, you gain proficiency with heavy armor and either cartographer's tools or navigator's tools (your choice). In addition, you gain proficiency in the Arcana skill. \n \n##### Portal Magic \n \nStarting at 1st level, you gain access to spells that connect places or manipulate the space between places. Each spell with “(liminal)” listed alongside its school is a cleric spell for you, even if it doesn't appear on the cleric spell list, and you can prepare it as you would any other spell on the cleric spell list. Liminal spells include *bardo*, *devouring darkness*, *door of the far traveler*, *ethereal stairs*, *hypnagogia*, *hypnic jerk*, *mind maze*, *mirror realm*, *pierce the veil*, *reciprocating portal*, *rive*, *subliminal aversion*, and *threshold slip*. See the Magic and Spells chapter for details on these spells. \n \n##### Portal Bond \n \nAt 1st level, you learn to forge a bond between yourself and another creature. At the end of a short or long rest, you can touch one willing creature, establishing a magical bond between you. While bonded to a creature, you know the direction to the creature, though not its exact location, as long as you are both on the same plane of existence. As an action, you can teleport the bonded creature to an unoccupied space within 5 feet of you or to the nearest unoccupied space, provided the bonded creature is willing and within a number of miles of you equal to your proficiency bonus. Alternatively, you can teleport yourself to an unoccupied space within 5 feet of the bonded creature. \n \nOnce you teleport a creature in this way, you can't use this feature again until you finish a long rest. You can have only one bonded creature at a time. If you bond yourself to a new creature, the bond on the previous creature ends. Otherwise, the bond lasts until you die or dismiss it as an action. \n \n##### Channel Divinity: Dimensional Shift \n \nStarting at 2nd level, you can use your Channel Divinity to harness the magic of portals and teleportation. As an action, you teleport a willing target you can see, other than yourself, to an unoccupied space within 30 feet of you that you can see. When you reach 10th level in this class, you can teleport an unwilling target. An unwilling target that succeeds on a Wisdom saving throw is unaffected. \n \n##### Portal Touch \n \nAt 6th level, you can use a bonus action to create a small portal in a space you can see within 30 feet of you. This portal lasts for 1 minute, and it doesn't occupy the space where you create it. When you cast a spell with a range of touch, you can touch any creature within your reach or within 5 feet of the portal. While the portal is active, you can use a bonus action on each of your turns to move the portal up to 30 feet. The portal must remain within 30 feet of you. If you or the portal are ever more than 30 feet apart, the portal fades. You can have only one portal active at a time. If you create another one, the previous portal fades. \n \nYou can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest. \n \n##### Transpositional Divine Strike \n \nAt 8th level, you gain the ability to imbue your weapon strikes with portal magic. Once on each of your turns when you hit a creature with a weapon attack, you deal damage to the target as normal, and you open a brief portal next to your target or another creature you can see within 30 feet of you. That creature takes 1d8 damage of your weapon's type as a duplicate of your weapon lashes out at the creature from the portal. When you reach 14th level, you can choose two creatures, creating a portal next to each and dealing 1d8 damage of your weapon's type to each. Alternatively, you can choose one creature and deal 2d8 damage to it. \n \n##### Portal Mastery \n \nAt 17th level, when you see a creature use a magical gateway, teleport, or cast a spell that would teleport itself or another creature, you can use your reaction to reroute the effect, changing the destination to be an unoccupied space of your choice that you can see within 100 feet of you. Once you use this feature, you can't use it again until you finish a long rest, unless you expend a spell slot of 5th level or higher to use this feature again."
            },
            {
                "name": "Serpent Domain",
                "desc": "You embody the deadly, secretive, and mesmerizing nature of serpents. Others tremble at your majesty. You practice the stealth and envenomed attacks that give serpents their dreaded reputation, but you also learn the shedding of skin that has made snakes into symbols of medicine. \n \n **Serpent Domain Spells (table)** \n \n| Cleric Level | Spells                                              | \n|--------------|-----------------------------------------------------| \n| 1st          | *charm person*, *find familiar* (snakes only)       | \n| 3rd          | *enthrall*, *protection from poison*                | \n| 5th          | *conjure animals* (snakes only), *hypnotic pattern* | \n| 7th          | *freedom of movement*, *polymorph* (snakes only)    | \n| 9th          | *dominate person*, *mislead*                        | \n \n##### Envenomed \n \nWhen you choose this domain at 1st level, you learn the *poison spray* cantrip. In addition, you gain proficiency in the Deception skill, with a poisoner's kit, and with martial weapons that have the Finesse property. You can apply poison to a melee weapon or three pieces of ammunition as a bonus action. \n \n##### Ophidian Tongue \n \nAlso at 1st level, you can communicate telepathically with serpents, snakes, and reptiles within 100 feet of you. A creature's responses, if any, are limited by its intelligence and typically convey the creature's current or most recent state, such as “hungry” or “in danger.” \n \n##### Channel Divinity: Serpent Stealth \n \nBeginning at 2nd level, you can use your Channel Divinity to help your allies move undetected. As an action, choose up to five creatures you can see within 30 feet of you. You and each target have advantage on Dexterity (Stealth) checks for 10 minutes. \n \n##### Serpent's Blood \n \nStarting at 6th level, you are immune to the poisoned condition and have resistance to poison damage. \n \n##### Divine Strike \n \nBeginning at 8th level, you can infuse your weapon strikes with venom. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage. When you reach 14th level, the extra damage increases to 2d8. \n \n##### Transformative Molt \n \nBeginning at 17th level, as part of a short or long rest, you can assume a new form, your old skin crumbling to dust. You decide what your new form looks like, including height, weight, facial features, vocal tone, coloration, and distinguishing characteristics, if any. This feature works like the Change Appearance aspect of the *alter self* spell, except it lasts until you finish a short or long rest. \n \nIn addition, when you are reduced to less than half your hit point maximum, you can end this transformation as a reaction to regain hit points equal to 3 times your cleric level. Once you end the transformation in this way, you can't use this feature to change your appearance again until you finish a long rest."
            },
            {
                "name": "Shadow Domain",
                "desc": "The shadow domain embraces the darkness that surrounds all things and manipulates the transitory gray that separates light from dark. Shadow domain clerics walk a subtle path, frequently changing allegiances and preferring to operate unseen. \n \n **Shadow Domain Spells (table)** \n \n| Cleric Level | Spells                                    | \n|--------------|-------------------------------------------| \n| 1st          | *bane*, *false life*                      | \n| 3rd          | *blindness/deafness*, *darkness*          | \n| 5th          | *blink*, *fear*                           | \n| 7th          | *black tentacles*, *greater invisibility* | \n| 9th          | *cone of cold*, *dream*                   | \n \n##### Cover of Night \n \nWhen you choose this domain at 1st level, you gain proficiency in the Stealth skill and darkvision out to a range of 60 feet. If you already have darkvision, its range increases by 30 feet. In addition, when you are in dim light or darkness, you can use a bonus action to Hide. \n \n##### Lengthen Shadow \n \nStarting at 1st level, you can manipulate your own shadow to extend your reach. When you cast a cleric spell with a range of touch, your shadow can deliver the spell as if you had cast the spell. Your target must be within 15 feet of you, and you must be able to see the target. You can use this feature even if you are in an area where you cast no shadow. \n \nWhen you reach 10th level in this class, your shadow can affect any target you can see within 30 feet of you. \n \n##### Channel Divinity: Shadow Grasp \n \nStarting at 2nd level, you can use your Channel Divinity to turn a creature's shadow against them. As an action, choose one creature that you can see within 30 feet of you. That creature must make a Strength saving throw. If the creature fails the saving throw, it is restrained by its shadow until the end of your next turn. If the creature succeeds, it is grappled by its shadow until the end of your next turn. You can use this feature even if the target is in an area where it casts no shadow. \n \n##### Fade to Black \n \nAt 6th level, you can conceal yourself in shadow. As a bonus action when you are in dim light or darkness, you can magically become invisible for 1 minute. This effect ends early if you attack or cast a spell. You can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest. \n \n##### Potent Spellcasting \n \nStarting at 8th level, you add your Wisdom modifier to the damage you deal with any cleric cantrip. \n \n##### Army of Shadow \n \nAt 17th level, you can manipulate multiple shadows simultaneously. When you use Shadow Grasp, you can affect a number of creatures equal to your proficiency bonus."
            },
            {
                "name": "Vermin Domain",
                "desc": "You exemplify the cunning, stealth, and invasiveness of vermin (rodents, scorpions, spiders, ants, and other insects). As your dedication to this domain grows in strength, you realize a simple truth: vermin are everywhere, and you are legion.\n \n **Vermin Domain Spells (table)** \n \n| Cleric Level | Spells  | \n|--------------|---------| \n| 1st          | *detect poison and disease*, *speak with animals* (vermin only)  | \n| 3rd          | *spider climb*, *web*  | \n| 5th          | *conjure animals* (vermin only), *fear*  | \n| 7th          | *dominate beast* (vermin only), *giant insect*  | \n| 9th          | *contagion*, *insect plague*  | \n \n##### The Unseen \n \nWhen you choose this domain at 1st level, you gain proficiency with shortswords and hand crossbows. You also gain proficiency in Stealth and Survival. You can communicate simple ideas telepathically with vermin, such as mice, spiders, and ants, within 100 feet of you. A vermin's responses, if any, are limited by its intelligence and typically convey the creature's current or most recent state, such as “hungry” or “in danger.” \n \n##### Channel Divinity: Swarm Step \n \nStarting at 2nd level, you can use your Channel Divinity to evade attackers. As a bonus action, or as reaction when you are attacked, you transform into a swarm of vermin and move up to 30 feet to an unoccupied space that you can see. This movement doesn't provoke opportunity attacks. When you arrive at your destination, you revert to your normal form. \n \n##### Legion of Bites \n \nAt 6th level, you can send hundreds of spectral vermin to assail an enemy and aid your allies. As an action, choose a creature you can see within 30 feet of you. That creature must succeed on a Constitution saving throw against your spell save DC or be covered in spectral vermin for 1 minute. Each time one of your allies hits the target with a weapon attack, the target takes an extra 1d4 poison damage. A creature that is immune to disease is immune to this feature. \n \nYou can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a long rest. \n \n##### Divine Strike \n \nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage to the target. When you reach 14th level, the extra damage increases to 2d8. \n \n##### Verminform Blessing \n \nAt 17th level, you become a natural lycanthrope. You use the statistics of a wererat, though your form can take on insectoid aspects, such as mandibles, compound eyes, or antennae, instead of rat aspects; whichever aspects are most appropriate for your deity. Your alignment doesn't change as a result of this lycanthropy, and you can't spread the disease of lycanthropy."
            },
            {
                "name": "Wind Domain",
                "desc": "You have dedicated yourself to the service of the primordial winds. In their service, you are the gentle zephyr brushing away adversity or the vengeful storm scouring the stones from the mountainside. \n \n **Wind Domain Spells (table)** \n \n| Cleric Level | Spells                                                        | \n|--------------|---------------------------------------------------------------| \n| 1st          | *feather fall*, *thunderwave*                                 | \n| 3rd          | *gust of wind*, *misty step*                                  | \n| 5th          | *fly*, *wind wall*                                            | \n| 7th          | *conjure minor elementals* (air only), *freedom of movement*  | \n| 9th          | *cloudkill*, *conjure elemental* (air only)                   | \n \n##### Wind's Chosen \n \nWhen you choose this domain at 1st level, you learn the *mage hand* cantrip and gain proficiency in the Nature skill. When you cast *mage hand*, you can make the hand invisible, and you can control the hand as a bonus action. \n \n##### Channel Divinity: Grasp Not the Wind \n \nAt 2nd level, you can use your Channel Divinity to end the grappled condition on yourself and gain a flying speed equal to your walking speed until the end of your turn. You don't provoke opportunity attacks while flying in this way. \n \n##### Stormshield \n \nAt 6th level, when you take lightning or thunder damage, you can use your reaction to gain resistance to lightning and thunder damage, including against the triggering attack, until the start of your next turn. You can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a long rest. \n \n##### Divine Strike \n \nAt 8th level, you infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8. \n \n##### Dire Tempest \n \nAt 17th level, you can create a 20-foot-radius tornado of swirling wind and debris at a point you can see within 120 feet. The storm lasts until the start of your next turn. All Huge or smaller creatures within the area must make a Strength saving throw against your spell save DC. On a failure, a creature takes 8d6 bludgeoning damage and is thrown 1d4 *x* 10 feet into the air. On a success, a creature takes half the damage and isn't thrown into the air. Creatures thrown into the air take falling damage as normal and land prone. \n \nIn addition, each creature that starts its turn within 15 feet of the tornado must succeed on a Strength saving throw against your spell save DC or be dragged into the tornado's area. A creature that enters the tornado's area is thrown 1d4 *x* 10 feet into the air, taking falling damage as normal and landing prone. \n \nOnce you use this feature, you can't use it again until you finish a long rest."
            }
        ]
    },
    {
        "name": "Druid",
        "features": {
            "hit-dice": "1d8",
            "hp-at-1st-level": "8 + your Constitution modifier",
            "hp-at-higher-levels": "1d8 (or 5) + your Constitution modifier per druid level after 1st",
            "prof-armor": "Light armor, medium armor, shields (druids will not wear armor or use shields made of metal)",
            "prof-weapons": "Clubs, daggers, darts, javelins, maces, quarterstaffs, scimitars, sickles, slings, spears",
            "prof-tools": "Herbalism kit",
            "prof-saving-throws": "Intelligence, Wisdom",
            "prof-skills": "Choose two from Arcana, Animal Handling, Insight, Medicine, Nature, Perception, Religion, and Survival",
            "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n \n* (*a*) a wooden shield or (*b*) any simple weapon \n* (*a*) a scimitar or (*b*) any simple melee weapon \n* Leather armor, an explorer's pack, and a druidic focus",
            "table": "| Level | Proficiency Bonus | Features                                          | Cantrips Known | 1st | 2nd | 3rd | 4th | 5th | 6th | 7th | 8th | 9th | \n|-------|-------------------|---------------------------------------------------|----------------|-----|-----|-----|-----|-----|-----|-----|-----|-----| \n| 1st   | +2                | Druidic, Spellcasting                             | 2              | 2   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 2nd   | +2                | Wild Shape, Druid Circle                          | 2              | 3   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 3rd   | +2                | -                                                 | 2              | 4   | 2   | -   | -   | -   | -   | -   | -   | -   | \n| 4th   | +2                | Wild Shape Improvement, Ability Score Improvement | 3              | 4   | 3   | -   | -   | -   | -   | -   | -   | -   | \n| 5th   | +3                | -                                                 | 3              | 4   | 3   | 2   | -   | -   | -   | -   | -   | -   | \n| 6th   | +3                | Druid Circle feature                              | 3              | 4   | 3   | 3   | -   | -   | -   | -   | -   | -   | \n| 7th   | +3                | -                                                 | 3              | 4   | 3   | 3   | 1   | -   | -   | -   | -   | -   | \n| 8th   | +3                | Wild Shape Improvement, Ability Score Improvement | 3              | 4   | 3   | 3   | 2   | -   | -   | -   | -   | -   | \n| 9th   | +4                | -                                                 | 3              | 4   | 3   | 3   | 3   | 1   | -   | -   | -   | -   | \n| 10th  | +4                | Druid Circle feature                              | 4              | 4   | 3   | 3   | 3   | 2   | -   | -   | -   | -   | \n| 11th  | +4                | -                                                 | 4              | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 12th  | +4                | Ability Score Improvement                         | 4              | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 13th  | +5                | -                                                 | 4              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 14th  | +5                | Druid Circle feature                              | 4              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 15th  | +5                | -                                                 | 4              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 16th  | +5                | Ability Score Improvement                         | 4              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 17th  | +6                | -                                                 | 4              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | 1   | \n| 18th  | +6                | Timeless Body, Beast Spells                       | 4              | 4   | 3   | 3   | 3   | 3   | 1   | 1   | 1   | 1   | \n| 19th  | +6                | Ability Score Improvement                         | 4              | 4   | 3   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | \n| 20th  | +6                | Archdruid                                         | 4              | 4   | 3   | 3   | 3   | 3   | 2   | 2   | 1   | 1   | ",
            "desc": "### Druidic \n \nYou know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message's presence with a successful DC 15 Wisdom (Perception) check but can't decipher it without magic. \n \n### Spellcasting \n \nDrawing on the divine essence of nature itself, you can cast spells to shape that essence to your will. \n \n#### Cantrips \n \nAt 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Druid table. \n \n#### Preparing and Casting Spells \n \nThe Druid table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. \n \nYou prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots. \n \nFor example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell *cure wounds,* you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells. \n \nYou can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list. \n \n### Spellcasting Ability \n \nWisdom is your spellcasting ability for your druid spells, since your magic draws upon your devotion and attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a druid spell you cast and when making an attack roll with one. \n \n**Spell save DC** = 8 + your proficiency bonus + your Wisdom modifier \n \n**Spell attack modifier** = your proficiency bonus + your Wisdom modifier \n \n### Ritual Casting \n \nYou can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared. \n \n#### Spellcasting Focus \n \nYou can use a druidic focus (see chapter 5, “Equipment”) as a spellcasting focus for your druid spells. \n \n### Wild Shape \n \nStarting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest. \n \nYour druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed. \n \n**Beast Shapes (table)** \n \n| Level | Max. CR | Limitations                 | Example     | \n|-------|---------|-----------------------------|-------------| \n| 2nd   | 1/4     | No flying or swimming speed | Wolf        | \n| 4th   | 1/2     | No flying speed             | Crocodile   | \n| 8th   | 1       | -                           | Giant eagle | \n \nYou can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die. \n \nWhile you are transformed, the following rules apply: \n \n* Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them. \n* When you transform, you assume the beast's hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious. \n* You can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as *call lightning*, that you've already cast. \n* You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as darkvision, unless your new form also has that sense. \n* You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the GM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form. \n \n### Druid Circle \n \nAt 2nd level, you choose to identify with a circle of druids: the Circle of the Land or the Circle of the Moon, both detailed at the end of the class description. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Timeless Body \n \nStarting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year. \n \n### Beast Spells \n \nBeginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components. \n \n### Archdruid \n \nAt 20th level, you can use your Wild Shape an unlimited number of times. \n \nAdditionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape.",
            "spellcasting-ability": "Wisdom"
        },
        "subtypes-name": "Circles",
        "subtypes": [
            {
                "name": "Circle of the Land",
                "desc": "The Circle of the Land is made up of mystics and sages who safeguard ancient knowledge and rites through a vast oral tradition. These druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle's wisest members preside as the chief priests of communities that hold to the Old Faith and serve as advisors to the rulers of those folk. As a member of this circle, your magic is influenced by the land where you were initiated into the circle's mysterious rites. \n \n##### Bonus Cantrip \n \nWhen you choose this circle at 2nd level, you learn one additional druid cantrip of your choice. \n \n##### Natural Recovery \n \nStarting at 2nd level, you can regain some of your magical energy by sitting in meditation and communing with nature. During a short rest, you choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level \n(rounded up), and none of the slots can be 6th level or higher. You can't use this feature again until you finish a long rest. \n \nFor example, when you are a 4th-level druid, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level slot or two 1st-level slots. \n \n##### Circle Spells \n \nYour mystical connection to the land infuses you with the ability to cast certain spells. At 3rd, 5th, 7th, and 9th level you gain access to circle spells connected to the land where you became a druid. Choose that land-arctic, coast, desert, forest, grassland, mountain, or swamp-and consult the associated list of spells. \n \nOnce you gain access to a circle spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you. \n \n**Arctic (table)** \n \n| Druid Level | Circle Spells                     | \n|-------------|-----------------------------------| \n| 3rd         | hold person, spike growth         | \n| 5th         | sleet storm, slow                 | \n| 7th         | freedom of movement, ice storm    | \n| 9th         | commune with nature, cone of cold | \n \n**Coast (table)** \n \n| Druid Level | Circle Spells                      | \n|-------------|------------------------------------| \n| 3rd         | mirror image, misty step           | \n| 5th         | water breathing, water walk        | \n| 7th         | control water, freedom of movement | \n| 9th         | conjure elemental, scrying         | \n \n**Desert (table)** \n \n| Druid Level | Circle Spells                                 | \n|-------------|-----------------------------------------------| \n| 3rd         | blur, silence                                 | \n| 5th         | create food and water, protection from energy | \n| 7th         | blight, hallucinatory terrain                 | \n| 9th         | insect plague, wall of stone                  | \n \n**Forest (table)** \n \n| Druid Level | Circle Spells                    | \n|-------------|----------------------------------| \n| 3rd         | barkskin, spider climb           | \n| 5th         | call lightning, plant growth     | \n| 7th         | divination, freedom of movement  | \n| 9th         | commune with nature, tree stride | \n \n**Grassland (table)** \n \n| Druid Level | Circle Spells                    | \n|-------------|----------------------------------| \n| 3rd         | invisibility, pass without trace | \n| 5th         | daylight, haste                  | \n| 7th         | divination, freedom of movement  | \n| 9th         | dream, insect plague             | \n \n**Mountain (table)** \n \n| Druid Level | Circle Spells                   | \n|-------------|---------------------------------| \n| 3rd         | spider climb, spike growth      | \n| 5th         | lightning bolt, meld into stone | \n| 7th         | stone shape, stoneskin          | \n| 9th         | passwall, wall of stone         | \n \n**Swamp (table)** \n \n| Druid Level | Circle Spells                        | \n|-------------|--------------------------------------| \n| 3rd         | acid arrow, darkness                 | \n| 5th         | water walk, stinking cloud           | \n| 7th         | freedom of movement, locate creature | \n| 9th         | insect plague, scrying               | \n \n##### Land's Stride \n \nStarting at 6th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard. \n \nIn addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the *entangle* spell. \n \n##### Nature's Ward \n \nWhen you reach 10th level, you can't be charmed or frightened by elementals or fey, and you are immune to poison and disease. \n \n##### Nature's Sanctuary \n \nWhen you reach 14th level, creatures of the natural world sense your connection to nature and become hesitant to attack you. When a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours. \n \nThe creature is aware of this effect before it makes its attack against you. \n \n> ### Sacred Plants and Wood \n> \n> A druid holds certain plants to be sacred, particularly alder, ash, birch, elder, hazel, holly, juniper, mistletoe, oak, rowan, willow, and yew. Druids often use such plants as part of a spellcasting focus, incorporating lengths of oak or yew or sprigs of mistletoe. \n> \n> Similarly, a druid uses such woods to make other objects, such as weapons and shields. Yew is associated with death and rebirth, so weapon handles for scimitars or sickles might be fashioned from it. Ash is associated with life and oak with strength. These woods make excellent hafts or whole weapons, such as clubs or quarterstaffs, as well as shields. Alder is associated with air, and it might be used for thrown weapons, such as darts or javelins. \n> \n> Druids from regions that lack the plants described here have chosen other plants to take on similar uses. For instance, a druid of a desert region might value the yucca tree and cactus plants. \n \n> ### Druids and the Gods \n> \n> Some druids venerate the forces of nature themselves, but most druids are devoted to one of the many nature deities worshiped in the multiverse (the lists of gods in appendix B include many such deities). The worship of these deities is often considered a more ancient tradition than the faiths of clerics and urbanized peoples."
            },
            {
                "name": "Circle of Ash",
                "desc": "Druids of the Circle of Ash believe in the power of rebirth and resurrection, both physical and spiritual. The ash they take as their namesake is the result of burning and death, but it can fertilize the soil and help bring forth new life. For these druids, ash is the ultimate symbol of the elegant cycle of life and death that is the foundation of the natural world. Some such druids even use fresh ash to clean themselves, and the residue is often kept visible on their faces. \n \nDruids of this circle often use the phoenix as their symbol, an elemental creature that dies and is reborn from its own ashes. These druids aspire to the same purity and believe resurrection is possible if they are faithful to their beliefs. Others of this circle are drawn to volcanos and find volcanic eruptions and their resulting ash clouds to be auspicious events. \n \nAll Circle of Ash druids request to be cremated after death, and their ashes are often given over to others of their order. What later happens with these ashes, none outside the circle know. \n \n##### Ash Cloud \n \nAt 2nd level, you can expend one use of your Wild Shape and, rather than assuming a beast form, create a small, brief volcanic eruption beneath the ground, causing it to spew out an ash cloud. As an action, choose a point within 30 feet of you that you can see. Each creature within 5 feet of that point must make a Dexterity saving throw against your spell save DC, taking 2d8 bludgeoning damage on a failed save, or half as much damage on a successful one. \n \nThis eruption creates a 20-foot-radius sphere of ash centered on the eruption point. The cloud spreads around corners, and its area is heavily obscured. When a creature enters the cloud for the first time on a turn or starts its turn there, that creature must succeed on a Constitution saving throw against your spell save DC or have disadvantage on ability checks and saving throws until the start of its next turn. Creatures that don't need to breathe or that are immune to poison automatically succeed on this saving throw. \n \nYou automatically succeed on this saving throw while within the area of your ash cloud, but you don't automatically succeed if you are in another Circle of Ash druid's ash cloud. \n \nThe cloud lasts for 1 minute, until you use a bonus action to dismiss it, or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it. \n \n##### Firesight \n \nStarting at 2nd level, your vision can't be obscured by ash, fire, smoke, fog, or the cloud created by your Ash Cloud feature, but it can still be obscured by other effects, such as dim light, dense foliage, or rain. In addition, you have advantage on saving throws against gas or cloud-based effects, such as from the *cloudkill* or *stinking cloud* spells, a gorgon's petrifying breath, or a kraken's ink cloud. \n \n#### Covered in Ash \n \nAt 6th level, when a creature within 30 feet of you that you can see (including yourself) takes damage, you can use your reaction to cover the creature in magical ash, giving it temporary hit points equal to twice your proficiency bonus. The target gains the temporary hit points before it takes the damage. You can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest. \n \nIn addition, while your Ash Cloud feature is active and you are within 30 feet of it, you can use a bonus action to teleport to an unoccupied space you can see within the cloud. You can use this teleportation no more than once per minute. \n \n##### Feed the Earth \n \nAt 10th level, your Ash Cloud feature becomes more potent. Instead of the normal eruption effect, when you first create the ash cloud, each creature within 10 feet of the point you chose must make a Dexterity saving throw against your spell save DC, taking 2d8 bludgeoning damage and 2d8 fire damage on a failed save, or half as much damage on a successful one. \n \nIn addition, when a creature enters this more potent ash cloud for the first time on a turn or starts its turn there, that creature has disadvantage on ability checks and saving throws while it remains within the cloud. Creatures are affected even if they hold their breath or don't need to breathe, but creatures that are immune to poison are immune to this effect. \n \nIf at least one creature takes damage from the ash cloud's eruption, you can use your reaction to siphon that destructive energy into the rapid growth of vegetation. The area within the cloud becomes difficult terrain that lasts while the cloud remains. You can't cause this growth in an area that can't accommodate natural plant growth, such as the deck of a ship or inside a building. \n \nThe ash cloud now lasts for 10 minutes, until you use a bonus action to dismiss it, or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it. \n \n##### From the Ashes \n \nBeginning at 14th level, when you are reduced to 0 hit points, your body is consumed in a fiery explosion. Each creature of your choice within 30 feet of you must make a Dexterity saving throw against your spell save DC, taking 6d6 fire damage on a failed save, or half as much damage on a successful one. After the explosion, your body becomes a pile of ashes. \n \nAt the end of your next turn, you reform from the ashes with all of your equipment and half your maximum hit points. You can choose whether or not you reform prone. If your ashes are moved before you reform, you reform in the space that contains the largest pile of your ashes or in the nearest unoccupied space. After you reform, you suffer one level of exhaustion. \n \nOnce you use this feature, you can't use it again until you finish a long rest."
            },
            {
                "name": "Circle of Bees",
                "desc": "Druids of the Circle of Bees are friends to all stinging insects but focus their attention on honeybees and other pollinating insects. When not adventuring, they tend hives, either created by the insects or by themselves. They tap into the horror inherent in stinging insects to protect their allies or the fields hosting their bee friends. \n \n##### Circle Spells \n \nYour bond with bees and other stinging beasts grants you knowledge of certain spells. At 2nd level, you learn the true strike cantrip. At 3rd, 5th, 7th, and 9th levels, you gain access to the spells listed for those levels in the Circle of Bees Spells table. \n \nOnce you gain access to a circle spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you. \n \n **Circle of Bee Spells (table)** \n \n| Druid Level  | Spells                             | \n|--------------|------------------------------------| \n| 3rd          | *blur*, *bombardment of stings*    | \n| 5th          | *fly*, *haste*                     | \n| 7th          | *giant insect*, *locate creature*  | \n| 9th          | *insect plague*, *telepathic bond* | \n \n##### Bee Bond \n \nWhen you choose this circle at 2nd level, you gain proficiency in the Acrobatics or Stealth skill (your choice), and you can speak and understand Bee Dance, a language shared by bees that involves flying in dance-like patterns. Bees refuse to attack you, even with magical coercion. \n \nWhen a beast other than a bee attacks you with a weapon that deals poison damage, such as a giant spider's bite or a scorpion's sting, it must succeed on a Charisma saving throw against your spell save DC or have disadvantage on its attack rolls against you until the start of its next turn. \n \n##### Bee Stinger \n \nAlso at 2nd level, you can use an action and expend one use of your Wild Shape to grow a bee's stinger, typically growing from your wrist, which you can use to make unarmed strikes. When you hit with an unarmed strike while this stinger is active, you use Wisdom instead of Strength for the attack, and your unarmed strike deals piercing damage equal to 1d4 + your Wisdom modifier + poison damage equal to half your proficiency bonus, instead of the bludgeoning damage normal for an unarmed strike. \n \nThe stinger lasts for a number of hours equal to half your druid level (rounded down) or until you use your Wild Shape again. \n \nWhen you reach 6th level in this class, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage, and the poison damage dealt by your stinger equals your proficiency bonus. In addition, the unarmed strike damage you deal while the stringer is active increases to 1d6 at 6th level, 1d8 at 10th level, and 1d10 at 14th level. \n \n##### Bumblebee Rush \n \nAt 6th level, you can take the Dash action as a bonus action. When you do so, creatures have disadvantage on attack rolls against you until the start of your next turn. You can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest. \n \n##### Hive Mind \n \nAt 10th level, when you cast *telepathic bond*, each creature in the link has advantage on Intelligence, Wisdom, and Charisma checks if at least one creature in the link has proficiency in a skill that applies to that check. In addition, if one creature in the link succeeds on a Wisdom (Perception) check to notice a hidden creature or on a Wisdom (Insight) check, each creature in the link also succeeds on the check. Finally, when a linked creature makes an attack, it has advantage on the attack roll if another linked creature that can see it uses a reaction to assist it. \n \n##### Mantle of Bees \n \nAt 14th level, you can use an action to cover yourself in bees for 1 hour or until you dismiss them (no action required). While you are covered in a mantle of bees, you gain a +2 bonus to AC, and you have advantage on Charisma (Intimidation) checks. In addition, when a creature within 5 feet of you hits you with a melee weapon, it must make a Constitution saving throw against your spell save DC. On a failure, the attacker takes 1d8 piercing damage and 1d8 poison damage and is poisoned until the end of its next turn. On a successful save, the attacker takes half the damage and isn't poisoned. \n \nWhile the mantle is active, you can use an action to direct the bees to swarm a 10-foot-radius sphere within 60 feet of you. Each creature in the area must make a Constitution saving throw against your spell save DC. On a failure, a creature takes 4d6 piercing damage and 4d6 poison damage and is poisoned for 1 minute. On a success, a creature takes half the damage and isn't poisoned. The bees then disperse, and your mantle ends. \n \nOnce you use this feature, you can't use it again until you finish a short or long rest, unless you expend a spell slot of 5th level or higher to create the mantle again."
            },
            {
                "name": "Circle of Crystals",
                "desc": "Circle of Crystals druids first arose in subterranean environments, where they helped tend giant crystal gardens, but now they can be found most anywhere with access to underground caverns or geothermal activity. These druids view crystals as a naturally occurring form of order and perfection, and they value the crystals' slow growth cycle, as it reminds them the natural world moves gradually but eternally. This teaches young druids patience and assures elder druids their legacy will be carried on in each spire of crystal. As druids of this circle tend their crystals, they learn how to use the harmonic frequencies of different crystals to create a variety of effects, including storing magic. \n \n##### Resonant Crystal \n \nWhen you choose this circle at 2nd level, you learn to create a special crystal that can take on different harmonic frequencies and properties. It is a Tiny object and can serve as a spellcasting focus for your druid spells. As a bonus action, you can cause the crystal to shed bright light in a 10-foot radius and dim light for an additional 10 feet. You can end the light as a bonus action. \n \nWhenever you finish a long rest, you can attune your crystal to one of the following harmonic frequencies. The crystal can have only one harmonic frequency at a time, and you gain the listed benefit while you are wearing or carrying the crystal. The crystal retains the chosen frequency until you finish a long rest. \n* **Clarity.** You have advantage on saving throws against being frightened or charmed. \n* **Cleansing.** You have advantage on saving throws against being poisoned, and you have resistance to poison damage. \n* **Focus.** You have advantage on Constitution saving throws that you make to maintain concentration on a spell when you take damage. \n* **Healing.** When you cast a spell of 1st level or higher that restores hit points to a creature, the creature regains additional hit points equal to your proficiency bonus. \n* **Vitality.** Whenever you cast a spell of 1st level or higher using the resonant crystal as your focus, one creature of your choice that you can see within 30 feet of you gains temporary hit points equal to twice your proficiency bonus. The temporary hit points last for 1 minute. \n \nTo create or replace a lost resonant crystal, you must perform a 1-hour ceremony. This ceremony can be performed during a short or long rest, and it destroys the previous crystal, if one existed. If a previous crystal had a harmonic frequency, the new crystal has that frequency, unless you create the new crystal during a long rest. \n \n##### Crystalline Skin \n \nStarting at 6th level, when you take damage, you can use a reaction to cause your skin to become crystalline until the end of your next turn. While your skin is crystalline, you have resistance to cold damage, radiant damage and bludgeoning, piercing, and slashing damage from nonmagical attacks, including to the triggering damage if it is of the appropriate type. You choose the exact color and appearance of the crystalline skin. \n \nYou can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest. \n \n##### Magical Resonance \n \nAt 10th level, you can draw on stored magical energy in your resonant crystal to restore some of your spent magic. While wearing or carrying the crystal, you can use a bonus action to recover one expended spell slot of 3rd level or lower. If you do so, you can't benefit from the resonant crystal's harmonic frequency for 1 minute. \n \nOnce you use this feature, you can't use it again until you finish a long rest. \n \n##### Crystalline Form \n \nAt 14th level, as a bonus action while wearing or carrying your resonant crystal, you can expend one use of your Wild Shape feature to assume a crystalline form instead of transforming into a beast. You gain the following benefits while in this form: \n* You have resistance to cold damage, radiant damage, and bludgeoning, piercing, and slashing damage from nonmagical attacks. \n* You have advantage on saving throws against spells and other magical effects. \n* Your resonant crystal pulses with power, providing you with the benefits of all five harmonic frequencies. When you cast a spell of 1st level or higher, you can choose to activate only the Healing or Vitality harmonic frequencies or both. If you activate both, you can choose two different targets or the same target. \n \nThis feature lasts 1 minute, or until you dismiss it as a bonus action."
            },
            {
                "name": "Circle of Sand",
                "desc": "The Circle of Sand originally arose among the desert dunes, where druids forged an intimate connection with the sands that surrounded them. Now such circles gather anywhere with excess sand, including coastlines or badlands. \n \nWhile the unacquainted might view sand as lifeless and desolate, druids of this circle know the truth—there is life within the sand, as there is almost anywhere. These druids have witnessed the destructive power of sand and the sandstorm and know to fear and respect them. Underestimating the power of sand is only for the foolish. \n \n##### Sand Form \n \nWhen you join this circle at 2nd level, you learn to adopt a sandy form. You can use a bonus action to expend one use of your Wild Shape feature and transform yourself into a form made of animated sand rather than transforming into a beast form. While in your sand form, you retain your game statistics. Because your body is mostly sand, you can move through a space as narrow as 1 inch wide without squeezing, and you have advantage on ability checks and saving throws to escape a grapple or the restrained condition. \n \nYou choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the GM decides whether it is practical for the equipment to move with you if you flow through particularly narrow spaces. \n \nYou can stay in your sand form for 10 minutes, or until you dismiss it (no action required), are incapacitated, die, or use this feature again. While in your sand form, you can use a bonus action to do one of the following: \n* **Abrasive Blast.** You launch a blast of abrasive sand at a creature you can see within 30 feet of you. Make a ranged spell attack. On a hit, the creature takes slashing damage equal to 1d8 + your Wisdom modifier. \n* **Stinging Cloud.** You emit a cloud of fine sand at a creature you can see within 5 feet of you. The target must succeed on a Constitution saving throw against your spell save DC or be blinded until the end of its next turn. \n \nWhen you reach 10th level in this class, you can stay in your sand form for 1 hour or until you dismiss it. In addition, the damage of Abrasive Blast increases to 2d8, and the range of Stinging Cloud increases to 10 feet. \n \n##### Diffuse Form \n \nAlso at 2nd level, when you are hit by a weapon attack while in your Sand Form, you can use your reaction to gain resistance to nonmagical bludgeoning, piercing, and slashing damage until the start of your next turn. You can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest. \n \n##### Sand Dervish \n \nStarting at 6th level, you can use a bonus action to create a sand dervish in an unoccupied space you can see within 30 feet of you. The sand dervish is a cylinder of whirling sand that is 10 feet tall and 5 feet wide. A creature that ends its turn within 5 feet of the sand dervish must make a Strength saving throw against your spell save DC. On a failed save, the creature takes 1d8 slashing damage and is pushed 10 feet away from the dervish. On a successful save, the creature takes half as much damage and isn't pushed. \n \nAs a bonus action on your turn, you can move the sand dervish up to 30 feet in any direction. If you ram the dervish into a creature, that creature must make the saving throw against the dervish's damage, and the dervish stops moving this turn. When you move the dervish, you can direct it over barriers up to 5 feet tall and float it across pits up to 10 feet wide. \n \nThe sand dervish lasts for 1 minute or until you dismiss it as a bonus action. Once you use this feature, you can't use it again until you finish a short or long rest. \n \nWhen you reach 10th level in this class, the damage dealt by the dervish increases to 2d8. \n \n##### Echo of the Dunes \n \nAt 10th level, your connection with sand deepens, and you can call on the power of the deep dunes to do one of the following: \n* **Sand Sphere.** You can use an action to conjure a 20-foot radius sphere of thick, swirling sand at a point you can see within 90 feet. The sphere spreads around corners, and its area is heavily obscured. A creature moving through the area must spend 3 feet of movement for every 1 foot it moves. The sphere lasts for 1 minute or until you dismiss it (no action required). \n* **Whirlwind.** You can use an action to transform into a whirlwind of sand until the start of your next turn. While in this form, your movement speed is doubled, and your movement doesn't provoke opportunity attacks. While in whirlwind form, you have resistance to all damage, and you can't be grappled, petrified, knocked prone, restrained, or stunned, but you also can't cast spells, can't make attacks, and can't manipulate objects that require fine dexterity. \n \nOnce you use one of these options, you can't use this feature again until you finish a short or long rest. \n \n##### Sandstorm \n \nAt 14th level, you can use an action to create a sandstorm of swirling wind and stinging sand. The storm rages in a cylinder that is 10 feet tall with a 30-foot radius centered on a point you can see within 120 feet. The storm spreads around corners, its area is heavily obscured, and exposed flames in the area are doused. The buffeting winds and sand make the area difficult terrain. The storm lasts for 1 minute or until you dismiss it as a bonus action. \n \nWhen a creature enters the area for the first time on a turn or starts its turn there, that creature must make a Strength saving throw against your spell save DC. On a failed save, it takes 2d8 slashing damage and is knocked prone. On a successful save, it takes half as much damage and isn't knocked prone. \n \nYou are immune to the effects of the storm, and you can extend that immunity to a number of creatures that you can see within 120 feet of you equal to your proficiency bonus. \n \nOnce you use this feature, you can't use it again until you finish a long rest."
            },
            {
                "name": "Circle of the Green",
                "desc": "Druids of the Circle of the Green devote themselves to the plants and green things of the world, recognizing the role of plants in giving life. By continued communion with plant life, they believe they draw nearer to what they call “The Green,” a cosmic thread that binds all plant life. Druids of this circle believe they gain their abilities by tapping into the Green, and they use this connection to summon a spirit from it. \n \n##### Circle Spells \n \nWhen you join this circle at 2nd level, you form a bond with a plant spirit, a creature of the Green. Your link with this spirit grants you access to some spells when you reach certain levels in this class, as shown on the Circle of the Green Spells table. Once you gain access to one of these spells, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you. \n \n **Circle of the Green Spells (table)** \n \n| Druid Level  | Spells                               | \n|--------------|--------------------------------------| \n| 2nd          | *entangle*, *goodberry*              | \n| 3rd          | *barkskin*, *spike growth*           | \n| 5th          | *speak with plants*, *vine carpet*   | \n| 7th          | *dreamwine*, *hallucinatory terrain* | \n| 9th          | *enchanted bloom*, *tree stride*     | \n \n##### Summon Green Spirit \n \nStarting at 2nd level, you can summon a spirit of the Green, a manifestation of primordial plant life. As an action, you can expend one use of your Wild Shape feature to summon the Green spirit rather than assuming a beast form. \n \nThe spirit appears in an unoccupied space of your choice that you can see within 30 feet of you. When the spirit appears, the area in a 10-foot radius around it becomes tangled with vines and other plant growth, becoming difficult terrain until the start of your next turn. \n \nThe spirit is friendly to you and your companions and obeys your commands. See this creature's game statistics in the Green Spirit stat block, which uses your proficiency bonus (PB) in several places. \n \nYou determine the spirit's appearance. Some spirits take the form of a humanoid figure made of gnarled branches and leaves, while others look like creatures with leafy bodies and heads made of gourds or fruit. Some even resemble beasts, only made entirely of plant material. \n \nIn combat, the spirit shares your initiative count, but it takes its turn immediately after yours. The green spirit can move and use its reaction on its own, but, if you don't issue any commands to it, the only action it takes is the Dodge action. You can use your bonus action to direct it to take the Attack, Dash, Disengage, Help, Hide, or Search action or an action listed in its statistics. If you are incapacitated, the spirit can take any action of its choice, not just Dodge. \n \nThe spirit remains for 1 hour, until it is reduced to 0 hit points, until you use this feature to summon the spirit again, or until you die. When it manifests, the spirit bears 10 fruit that are infused with magic. Each fruit works like a berry created by the *goodberry* spell. \n \n##### Gift of the Green \n \nAt 6th level, the bond with your green spirit enhances your restorative spells and gives you the power to cast additional spells. Once before the spirit's duration ends, you can cast one of the following spells without expending a spell slot or material components: *locate animals or plants*, *pass without trace* (only in environments with ample plant life), *plant growth*, or *speak with plants*. You can't cast a spell this way again until the next time you summon your green spirit. \n \nWhenever you cast a spell that restores hit points while your green spirit is summoned, roll a d8 and add the result to the total hit points restored. \n \nIn addition, when you cast a spell with a range other than self, the spell can originate from you or your green spirit. \n \n##### Verdant Interference \n \nStarting at 10th level, when a creature you can see within 30 feet of you or your green spirit is attacked, you can use your reaction to cause vines and vegetation to burst from the ground and grasp at the attacker, giving the attacker disadvantage on attack rolls until the start of your next turn. \n \nYou can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest. \n \n##### Spirit Symbiosis \n \nAt 14th level, while your green spirit is within 30 feet of you, you can use an action to join with it, letting its plant matter grow around you. While so joined, you gain the following benefits: \n* You gain temporary hit points equal to your green spirit's current hit points. \n* You gain a climbing speed of 30 feet. \n* You have advantage on Constitution saving throws. \n* The ground within 10 feet of you is difficult terrain for creatures hostile to you. \n* You can use a bonus action on each of your turns to make a tendril attack against one creature within 10 feet of you that you can see. Make a melee spell attack. On a hit, the target takes bludgeoning damage equal to 2d8 + your Wisdom modifier. \n \nThis feature lasts until the temporary hit points you gained from this feature are reduced to 0, until the spirit's duration ends, or until you use an action to separate. If you separate, the green spirit has as many hit points as you had temporary hit points remaining. If this effect ends because your temporary hit points are reduced to 0, the green spirit disappears until you summon it again."
            },
            {
                "name": "Circle of the Shapeless",
                "desc": "Druids of the Circle of the Shapeless believe that oozes, puddings, and jellies serve an important and integral role in the natural world, particularly in decomposition and in clearing detritus. Druids of this circle also admire the adaptability of these gelatinous creatures and study them to learn how to duplicate some of their abilities. \n \nThe sworn enemies of Circle of the Shapeless druids are the so-called ooze lords and their servants who pervert the natural order by controlling and weaponizing such creatures. \n \n##### Circle Spells \n \nWhen you join this circle at 2nd level, your connection with oozes grants you access to certain spells. At 2nd level, you learn the *acid splash* cantrip. At 3rd, 5th, 7th, and 9th level you gain access to the spells listed for that level in the Circle of the Shapeless Spells table. Once you gain access to one of these spells, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you. \n \n **Circle of  Spells (table)** \n \n| Druid Level  | Spells                           | \n|--------------|----------------------------------| \n| 3rd          | *enlarge/reduce*, *spider climb* | \n| 5th          | *iron gut*, *meld into stone*    | \n| 7th          | *blight*, *freedom of movement*  | \n| 9th          | *contagion*, *seeming*           | \n \n##### Ooze Form \n \nStarting at 2nd level, you learn to adopt an ooze form. You can use a bonus action to expend one use of your Wild Shape feature to take on an ooze-like form rather than transforming into a beast. \n \nWhile in your ooze form, you retain your game statistics, but your body becomes less substantial and appears wet and slimy. Your skin may change in color and appearance, resembling other forms of ooze like black pudding, ochre jelly, gray ooze, or even translucent, like a gelatinous cube. \n \nYou choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the GM decides whether it is practical for the equipment to move with you if you flow through particularly narrow spaces. \n \nYour ooze form lasts for 10 minutes or until you dismiss it (no action required), are incapacitated, die, or use this feature again. \n \nWhile in ooze form, you gain the following benefits: \n* **Acid Weapons.** Your melee weapon attacks deal an extra 1d6 acid damage on a hit. \n* **Amorphous.** You can move through a space as narrow as 1 inch wide without squeezing. \n* **Climber.** You have a climbing speed of 20 feet. \n* **Oozing Form.** When a creature touches you or hits you with a melee attack while within 5 feet of you, you can use your reaction to deal 1d6 acid damage to that creature. \n \n##### Slimy Pseudopod \n \nAt 6th level, you can use a bonus action to cause an oozing pseudopod to erupt from your body for 1 minute or until you dismiss it as a bonus action. On the turn you activate this feature, and as a bonus action on each of your subsequent turns, you can make a melee spell attack with the pseudopod against a creature within 5 feet of you. On a hit, the target takes 1d6 acid damage. \n \nYou can use this feature a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest. When you reach 10th level in this class, the acid damage dealt by your pseudopod increases to 2d6. \n \n##### Improved Ooze Form \n \nAt 10th level, your ooze form becomes more powerful. It now lasts 1 hour, and the acid damage dealt by your Acid Weapons and Oozing Form increases to 2d6. \n \n##### Engulfing Embrace \n \nAt 14th level, while in your ooze form, you can use an action to move into the space of a creature within 5 feet of you that is your size or smaller and try to engulf it. The target creature must make a Dexterity saving throw against your spell save DC. \n \nOn a successful save, the creature can choose to be pushed 5 feet away from you or to an unoccupied space within 5 feet of you. A creature that chooses not to be pushed suffers the consequences of a failed saving throw. \n \nOn a failed save, you enter the creature's space, and the creature takes 2d6 acid damage and is engulfed. The engulfed creature is restrained and has total cover against attacks and other effects outside of your body. The engulfed creature takes 4d6 acid damage at the start of each of your subsequent turns. When you move, the engulfed creature moves with you. \n \nAn engulfed creature can attempt to escape by taking an action to make a Strength (Athletics) check against your spell save DC. On a success, the creature escapes and enters a space of its choice within 5 feet of you. \n \nOnce you use this feature, you can't use it again until you finish a long rest, unless you expend a spell slot of 5th level or higher to try to engulf another creature."
            },
            {
                "name": "Circle of Wind",
                "desc": "Founded in deserts, badlands, and grasslands, where wind dominates and controls the landscape, the teachings of the Circle of Wind have spread far and wide, like a mighty storm. Druids who follow this circle's teachings embrace the mercurial winds to create several effects. \n \n##### Bonus Cantrip \n \nAt 2nd level when you choose this circle, you learn the *message* cantrip. \n \n##### Circle Spells \n \nThe magic of the wind flows through you, granting access to certain spells. At 3rd, 5th, 7th, and 9th level, you gain access to the spells listed for that level in the Circle of Wind Spells table. \n \nOnce you gain access to one of these spells, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you. \n \n **Circle of Wind Spells (table)** \n \n| Druid Level  | Spells                                                | \n|--------------|-------------------------------------------------------| \n| 3rd          | *blur*, *gust of wind*                                | \n| 5th          | *fly*, *lightning bolt*                               | \n| 7th          | *conjure minor elementals*, *freedom of movement*     | \n| 9th          | *cloudkill*, *conjure elemental* (air elemental only) | \n \n##### Feathered Form \n \nStarting at 2nd level, when you use your Wild Shape to magically assume the shape of a beast, it can have a flying speed (you ignore “no flying speed” in the Limitations column of the Beast Shapes table but must abide by the other limitations there). \n \n##### Comforting Breezes \n \nBeginning at 6th level, as an action, you can summon a gentle breeze that extends in a 30-foot cone from you. Choose a number of targets in the area equal to your Wisdom modifier (minimum of 1). You end one disease or the blinded, deafened, paralyzed, or poisoned condition on each target. Once you use this feature, you can't use it again until you finish a long rest. \n \n##### Updraft \n \nAlso at 6th level, you can expend one use of Wild Shape as a bonus action to summon a powerful wind. You and each creature of your choice within 10 feet of you end the grappled or restrained conditions. You can fly up to 30 feet as part of this bonus action, and each creature that you affect with this wind can use a reaction to fly up to 30 feet. This movement doesn't provoke opportunity attacks. \n \n##### Vizier of the Winds \n \nStarting at 10th level, you can ask the winds one question, and they whisper secrets back to you. You can cast *commune* without preparing the spell or expending a spell slot. Once you use this feature, you can't use it again until you finish a long rest. \n \n##### Hunger of Storm's Fury \n \nBeginning at 14th level, when you succeed on a saving throw against a spell or effect that deals lightning damage, you take no damage and instead regain a number of hit points equal to the lightning damage dealt. Once you use this feature, you can't use it again until you finish a long rest."
            }
        ]
    },
    {
        "name": "Fighter",
        "features": {
            "hit-dice": "1d10",
            "hp-at-1st-level": "10 + your Constitution modifier",
            "hp-at-higher-levels": "1d10 (or 6) + your Constitution modifier per fighter level after 1st",
            "prof-armor": "All armor, shields",
            "prof-weapons": "Simple weapons, martial weapons",
            "prof-tools": "None",
            "prof-saving-throws": "Strength, Constitution",
            "prof-skills": "Choose two skills from Acrobatics, Animal, Handling, Athletics, History, Insight, Intimidation, Perception, and Survival",
            "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n \n* (*a*) chain mail or (*b*) leather armor, longbow, and 20 arrows \n* (*a*) a martial weapon and a shield or (*b*) two martial weapons \n* (*a*) a light crossbow and 20 bolts or (*b*) two handaxes \n* (*a*) a dungeoneer's pack or (*b*) an explorer's pack",
            "table": "| Level | Proficiency Bonus | Features                                          | \n|-------|-------------------|---------------------------------------------------| \n| 1st   | +2                | Fighting Style, Second Wind                       | \n| 2nd   | +2                | Action Surge (one use)                            | \n| 3rd   | +2                | Martial Archetype                                 | \n| 4th   | +2                | Ability Score Improvement                         | \n| 5th   | +3                | Extra Attack                                      | \n| 6th   | +3                | Ability Score Improvement                         | \n| 7th   | +3                | Martial Archetype Feature                         | \n| 8th   | +3                | Ability Score Improvement                         | \n| 9th   | +4                | Indomitable (one use)                             | \n| 10th  | +4                | Martial Archetype Feature                         | \n| 11th  | +4                | Extra Attack (2)                                  | \n| 12th  | +4                | Ability Score Improvement                         | \n| 13th  | +5                | Indomitable (two uses)                            | \n| 14th  | +5                | Ability Score Improvement                         | \n| 15th  | +5                | Martial Archetype Feature                         | \n| 16th  | +5                | Ability Score Improvement                         | \n| 17th  | +6                | Action Surge (two uses), Indomitable (three uses) | \n| 18th  | +6                | Martial Archetype Feature                         | \n| 19th  | +6                | Ability Score Improvement                         | \n| 20th  | +6                | Extra Attack (3)                                  | ",
            "desc": "### Fighting Style \n \nYou adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again. \n \n#### Archery \n \nYou gain a +2 bonus to attack rolls you make with ranged weapons. \n \n#### Defense \n \nWhile you are wearing armor, you gain a +1 bonus to AC. \n \n#### Dueling \n \nWhen you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon. \n \n#### Great Weapon Fighting \n \nWhen you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit. \n \n#### Protection \n \nWhen a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield. \n \n#### Two-Weapon Fighting \n \nWhen you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack. \n \n### Second Wind \n \nYou have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again. \n \n### Action Surge \n \nStarting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action and a possible bonus action. \n \nOnce you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn. \n \n### Martial Archetype \n \nAt 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques. Choose Champion, Battle Master, or Eldritch Knight, all detailed at the end of the class description. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Extra Attack \n \nBeginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. \n \nThe number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class. \n \n### Indomitable \n \nBeginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can't use this feature again until you finish a long rest. \n \nYou can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level.\n \n### Martial Archetypes \n \nDifferent fighters choose different approaches to perfecting their fighting prowess. The martial archetype you choose to emulate reflects your approach.",
            "spellcasting-ability": ""
        },
        "subtypes-name": "Martial Archetypes",
        "subtypes": [
            {
                "name": "Champion",
                "desc": "The archetypal Champion focuses on the development of raw physical power honed to deadly perfection. Those who model themselves on this archetype combine rigorous training with physical excellence to deal devastating blows. \n \n##### Improved Critical \n \nBeginning when you choose this archetype at 3rd level, your weapon attacks score a critical hit on a roll of 19 or 20. \n \n##### Remarkable Athlete \n \nStarting at 7th level, you can add half your proficiency bonus (round up) to any Strength, Dexterity, or Constitution check you make that doesn't already use your proficiency bonus. \n \nIn addition, when you make a running long jump, the distance you can cover increases by a number of feet equal to your Strength modifier. \n \n##### Additional Fighting Style \n \nAt 10th level, you can choose a second option from the Fighting Style class feature. \n \n##### Superior Critical \n \nStarting at 15th level, your weapon attacks score a critical hit on a roll of 18-20. \n \n##### Survivor \n \nAt 18th level, you attain the pinnacle of resilience in battle. At the start of each of your turns, you regain hit points equal to 5 + your Constitution modifier if you have no more than half of your hit points left. You don't gain this benefit if you have 0 hit points."
            }
        ]
    },
    {
        "name": "Monk",
        "features": {
            "hit-dice": "1d8",
            "hp-at-1st-level": "8 + your Constitution modifier",
            "hp-at-higher-levels": "1d8 (or 5) + your Constitution modifier per monk level after 1st",
            "prof-armor": "None",
            "prof-weapons": "Simple weapons, shortswords",
            "prof-tools": "Choose one type of artisan's tools or one musical instrument",
            "prof-saving-throws": "Strength, Dexterity",
            "prof-skills": "Choose two from Acrobatics, Athletics, History, Insight, Religion, and Stealth",
            "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n \n* (*a*) a shortsword or (*b*) any simple weapon \n* (*a*) a dungeoneer's pack or (*b*) an explorer's pack \n* 10 darts",
            "table": "| Level | Proficiency Bonus | Martial Arts | Ki Points | Unarmored Movement | Features                                         | \n|-------|-------------------|--------------|-----------|--------------------|--------------------------------------------------| \n| 1st   | +2                | 1d4          | -         | -                  | Unarmored Defense, Martial Arts                  | \n| 2nd   | +2                | 1d4          | 2         | +10 ft.            | Ki, Unarmored Movement                           | \n| 3rd   | +2                | 1d4          | 3         | +10 ft.            | Monastic Tradition, Deflect Missiles             | \n| 4th   | +2                | 1d4          | 4         | +10 ft.            | Ability Score Improvement, Slow Fall             | \n| 5th   | +3                | 1d6          | 5         | +10 ft.            | Extra Attack, Stunning Strike                    | \n| 6th   | +3                | 1d6          | 6         | +15 ft.            | Ki-Empowered Strikes, Monastic Tradition Feature | \n| 7th   | +3                | 1d6          | 7         | +15 ft.            | Evasion, Stillness of Mind                       | \n| 8th   | +3                | 1d6          | 8         | +15 ft.            | Ability Score Improvement                        | \n| 9th   | +4                | 1d6          | 9         | +15 ft.            | Unarmored Movement improvement                   | \n| 10th  | +4                | 1d6          | 10        | +20 ft.            | Purity of Body                                   | \n| 11th  | +4                | 1d8          | 11        | +20 ft.            | Monastic Tradition Feature                       | \n| 12th  | +4                | 1d8          | 12        | +20 ft.            | Ability Score Improvement                        | \n| 13th  | +5                | 1d8          | 13        | +20 ft.            | Tongue of the Sun and Moon                       | \n| 14th  | +5                | 1d8          | 14        | +25 ft.            | Diamond Soul                                     | \n| 15th  | +5                | 1d8          | 15        | +25 ft.            | Timeless Body                                    | \n| 16th  | +5                | 1d8          | 16        | +25 ft.            | Ability Score Improvement                        | \n| 17th  | +6                | 1d10         | 17        | +25 ft.            | Monastic Tradition Feature                       | \n| 18th  | +6                | 1d10         | 18        | +30 ft.            | Empty Body                                       | \n| 19th  | +6                | 1d10         | 19        | +30 ft.            | Ability Score Improvement                        | \n| 20th  | +6                | 1d10         | 20        | +30 ft.            | Perfect Self                                     |",
            "desc": "### Unarmored Defense \n \nBeginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier. \n \n### Martial Arts \n \nAt 1st level, your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don't have the two- handed or heavy property. \n \nYou gain the following benefits while you are unarmed or wielding only monk weapons and you aren't wearing armor or wielding a shield: \n \n* You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons. \n* You can roll a d4 in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table. \n* When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven't already taken a bonus action this turn. \n \nCertain monasteries use specialized forms of the monk weapons. For example, you might use a club that is two lengths of wood connected by a short chain (called a nunchaku) or a sickle with a shorter, straighter blade (called a kama). Whatever name you use for a monk weapon, you can use the game statistics provided for the weapon. \n \n### Ki \n \nStarting at 2nd level, your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have, as shown in the Ki Points column of the Monk table. \n \nYou can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. You learn more ki features as you gain levels in this class. \n \nWhen you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points. \n \nSome of your ki features require your target to make a saving throw to resist the feature's effects. The saving throw DC is calculated as follows: \n \n**Ki save DC** = 8 + your proficiency bonus + your Wisdom modifier \n \n#### Flurry of Blows \n \nImmediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action. \n \n#### Patient Defense \n \nYou can spend 1 ki point to take the Dodge action as a bonus action on your turn. \n \n#### Step of the Wind \n \nYou can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn. \n \n### Unarmored Movement \n \nStarting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table. \n \nAt 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move. \n \n### Monastic Tradition \n \nWhen you reach 3rd level, you commit yourself to a monastic tradition: the Way of the Open Hand, the Way of Shadow, or the Way of the Four Elements, all detailed at the end of the class description. Your tradition grants you features at 3rd level and again at 6th, 11th, and 17th level. \n \n### Deflect Missiles \n \nStarting at 3rd level, you can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level. \n \nIf you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack, which has a normal range of 20 feet and a long range of 60 feet. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Slow Fall \n \nBeginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level. \n \n### Extra Attack \n \nBeginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. \n \n### Stunning Strike \n \nStarting at 5th level, you can interfere with the flow of ki in an opponent's body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn. \n \n### Ki-Empowered Strikes \n \nStarting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage. \n \n### Evasion \n \nAt 7th level, your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon's lightning breath or a *fireball* spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail. \n \n### Stillness of Mind \n \nStarting at 7th level, you can use your action to end one effect on yourself that is causing you to be charmed or frightened. \n \n### Purity of Body \n \nAt 10th level, your mastery of the ki flowing through you makes you immune to disease and poison. \n \n### Tongue of the Sun and Moon \n \nStarting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say. \n \n### Diamond Soul \n \nBeginning at 14th level, your mastery of ki grants you proficiency in all saving throws. \n \nAdditionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result. \n \n### Timeless Body \n \nAt 15th level, your ki sustains you so that you suffer none of the frailty of old age, and you can't be aged magically. You can still die of old age, however. In addition, you no longer need food or water. \n \n### Empty Body \n \nBeginning at 18th level, you can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage. \n \nAdditionally, you can spend 8 ki points to cast the *astral projection* spell, without needing material components. When you do so, you can't take any other creatures with you. \n \n### Perfect Self \n \nAt 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points. \n \n### Monastic Traditions \n \nThree traditions of monastic pursuit are common in the monasteries scattered across the multiverse. Most monasteries practice one tradition exclusively, but a few honor the three traditions and instruct each monk according to his or her aptitude and interest. All three traditions rely on the same basic techniques, diverging as the student grows more adept. Thus, a monk need choose a tradition only upon reaching 3rd level.",
            "spellcasting-ability": ""
        },
        "subtypes-name": "Monastic Traditions",
        "subtypes": [
            {
                "name": "Way of the Open Hand",
                "desc": "Monks of the Way of the Open Hand are the ultimate masters of martial arts combat, whether armed or unarmed. They learn techniques to push and trip their opponents, manipulate ki to heal damage to their bodies, and practice advanced meditation that can protect them from harm. \n \n##### Open Hand Technique \n \nStarting when you choose this tradition at 3rd level, you can manipulate your enemy's ki when you harness your own. Whenever you hit a creature with one of the attacks granted by your Flurry of Blows, you can impose one of the following effects on that target: \n* It must succeed on a Dexterity saving throw or be knocked prone. \n* It must make a Strength saving throw. If it fails, you can push it up to 15 feet away from you. \n* It can't take reactions until the end of your next turn. \n \n##### Wholeness of Body \n \nAt 6th level, you gain the ability to heal yourself. As an action, you can regain hit points equal to three times your monk level. You must finish a long rest before you can use this feature again. \n \n##### Tranquility \n \nBeginning at 11th level, you can enter a special meditation that surrounds you with an aura of peace. At the end of a long rest, you gain the effect of a *sanctuary* spell that lasts until the start of your next long rest (the spell can end early as normal). The saving throw DC for the spell equals 8 + your Wisdom modifier + your proficiency bonus. \n \n##### Quivering Palm \n \nAt 17th level, you gain the ability to set up lethal vibrations in someone's body. When you hit a creature with an unarmed strike, you can spend 3 ki points to start these imperceptible vibrations, which last for a number of days equal to your monk level. The vibrations are harmless unless you use your action to end them. To do so, you and the target must be on the same plane of existence. When you use this action, the creature must make a Constitution saving throw. If it fails, it is reduced to 0 hit points. If it succeeds, it takes 10d10 necrotic damage. \n \nYou can have only one creature under the effect of this feature at a time. You can choose to end the vibrations harmlessly without using an action."
            }
        ]
    },
    {
        "name": "Paladin",
        "features": {
            "hit-dice": "1d10",
            "hp-at-1st-level": "10 + your Constitution modifier",
            "hp-at-higher-levels": "1d10 (or 6) + your Constitution modifier per paladin level after 1st",
            "prof-armor": "All armor, shields",
            "prof-weapons": "Simple weapons, martial weapons",
            "prof-tools": "None",
            "prof-saving-throws": "Wisdom, Charisma",
            "prof-skills": "Choose two from Athletics, Insight, Intimidation, Medicine, Persuasion, and Religion",
            "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n* (*a*) a martial weapon and a shield or (*b*) two martial weapons \n* (*a*) five javelins or (*b*) any simple melee weapon \n* (*a*) a priest's pack or (*b*) an explorer's pack \n* Chain mail and a holy symbol",
            "table": "| Level | Proficiency Bonus | Features                                   | 1st | 2nd | 3rd | 4th | 5th | \n|-------|-------------------|--------------------------------------------|-----|-----|-----|-----|-----| \n| 1st   | +2                | Divine Sense, Lay on Hands                 | -   | -   | -   | -   | -   | \n| 2nd   | +2                | Fighting Style, Spellcasting, Divine Smite | 2   | -   | -   | -   | -   | \n| 3rd   | +2                | Divine Health, Sacred Oath                 | 3   | -   | -   | -   | -   | \n| 4th   | +2                | Ability Score Improvement                  | 3   | -   | -   | -   | -   | \n| 5th   | +3                | Extra Attack                               | 4   | 2   | -   | -   | -   | \n| 6th   | +3                | Aura of Protection                         | 4   | 2   | -   | -   | -   | \n| 7th   | +3                | Sacred Oath feature                        | 4   | 3   | -   | -   | -   | \n| 8th   | +3                | Ability Score Improvement                  | 4   | 3   | -   | -   | -   | \n| 9th   | +4                | -                                          | 4   | 3   | 2   | -   | -   | \n| 10th  | +4                | Aura of Courage                            | 4   | 3   | 2   | -   | -   | \n| 11th  | +4                | Improved Divine Smite                      | 4   | 3   | 3   | -   | -   | \n| 12th  | +4                | Ability Score Improvement                  | 4   | 3   | 3   | -   | -   | \n| 13th  | +5                | -                                          | 4   | 3   | 3   | 1   | -   | \n| 14th  | +5                | Cleansing Touch                            | 4   | 3   | 3   | 1   | -   | \n| 15th  | +5                | Sacred Oath feature                        | 4   | 3   | 3   | 2   | -   | \n| 16th  | +5                | Ability Score Improvement                  | 4   | 3   | 3   | 2   | -   | \n| 17th  | +6                | -                                          | 4   | 3   | 3   | 3   | 1   | \n| 18th  | +6                | Aura improvements                          | 4   | 3   | 3   | 3   | 1   | \n| 19th  | +6                | Ability Score Improvement                  | 4   | 3   | 3   | 3   | 2   | \n| 20th  | +6                | Sacred Oath feature                        | 4   | 3   | 3   | 3   | 2   |",
            "desc": "### Divine Sense \n \nThe presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire \n \nCount Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the *hallow* spell. \n \nYou can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses. \n \n### Lay on Hands \n \nYour blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5. \n \nAs an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool. \n \nAlternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one. \n \nThis feature has no effect on undead and constructs. \n \n### Fighting Style \n \nAt 2nd level, you adopt a style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again. \n \n#### Defense \n \nWhile you are wearing armor, you gain a +1 bonus to AC. \n \n#### Dueling \n \nWhen you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon. \n \n#### Great Weapon Fighting \n \nWhen you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll. The weapon must have the two-handed or versatile property for you to gain this benefit. \n \n#### Protection \n \nWhen a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield. \n \n### Spellcasting \n \nBy 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does. \n \n#### Preparing and Casting Spells \n \nThe Paladin table shows how many spell slots you have to cast your spells. To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. \n \nYou prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots. \n \nFor example, if you are a 5th-level paladin, you have four 1st-level and two 2nd-level spell slots. With a Charisma of 14, your list of prepared spells can include four spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell *cure wounds,* you can cast it using a 1st-level or a 2nd- level slot. Casting the spell doesn't remove it from your list of prepared spells. \n \nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of paladin spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list. \n \n#### Spellcasting Ability \n \nCharisma is your spellcasting ability for your paladin spells, since their power derives from the strength of your convictions. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a paladin spell you cast and when making an attack roll with one. \n \n**Spell save DC** = 8 + your proficiency bonus + your Charisma modifier \n \n**Spell attack modifier** = your proficiency bonus + your Charisma modifier \n \n#### Spellcasting Focus \n \nYou can use a holy symbol as a spellcasting focus for your paladin spells. \n \n### Divine Smite \n \nStarting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend. \n \n### Divine Health \n \nBy 3rd level, the divine magic flowing through you makes you immune to disease. \n \n### Sacred Oath \n \nWhen you reach 3rd level, you swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Now you choose the Oath of Devotion, the Oath of the Ancients, or the Oath of Vengeance, all detailed at the end of the class description. \n \nYour choice grants you features at 3rd level and again at 7th, 15th, and 20th level. Those features include oath spells and the Channel Divinity feature. \n \n#### Oath Spells \n \nEach oath has a list of associated spells. You gain access to these spells at the levels specified in the oath description. Once you gain access to an oath spell, you always have it prepared. Oath spells don't count against the number of spells you can prepare each day. \n \nIf you gain an oath spell that doesn't appear on the paladin spell list, the spell is nonetheless a paladin spell for you. \n \n#### Channel Divinity \n \nYour oath allows you to channel divine energy to fuel magical effects. Each Channel Divinity option provided by your oath explains how to use it. \n \nWhen you use your Channel Divinity, you choose which option to use. You must then finish a short or long rest to use your Channel Divinity again. \n \nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your paladin spell save DC. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Extra Attack \n \nBeginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. \n \n### Aura of Protection \n \nStarting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus. \n \nAt 18th level, the range of this aura increases to 30 feet. \n \n### Aura of Courage \n \nStarting at 10th level, you and friendly creatures within 10 feet of you can't be frightened while you are conscious. \n \nAt 18th level, the range of this aura increases to 30 feet. \n \n### Improved Divine Smite \n \nBy 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage. If you also use your Divine Smite with an attack, you add this damage to the extra damage of your Divine Smite. \n \n### Cleansing Touch \n \nBeginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch. \n \nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest. \n \n### Sacred Oaths \n \nBecoming a paladin involves taking vows that commit the paladin to the cause of righteousness, an active path of fighting wickedness. The final oath, taken when he or she reaches 3rd level, is the culmination of all the paladin's training. Some characters with this class don't consider themselves true paladins until they have reached 3rd level and made this oath. For others, the actual swearing of the oath is a formality, an official stamp on what has always been true in the paladin's heart.  \n> ### Breaking Your Oath \n> \n> A paladin tries to hold to the highest standards of conduct, but even the most virtuous paladin is fallible. Sometimes the right path proves too demanding, sometimes a situation calls for the lesser of two evils, and sometimes the heat of emotion causes a paladin to transgress his or her oath. \n> \n> A paladin who has broken a vow typically seeks absolution from a cleric who shares his or her faith or from another paladin of the same order. The paladin might spend an all- night vigil in prayer as a sign of penitence, or undertake a fast or similar act of self-denial. After a rite of confession and forgiveness, the paladin starts fresh. \n> \n> If a paladin willfully violates his or her oath and shows no sign of repentance, the consequences can be more serious. At the GM's discretion, an impenitent paladin might be forced to abandon this class and adopt another.",
            "spellcasting-ability": "Charisma"
        },
        "subtypes": [
            {
                "name": "Oaths",
                "desc": "The Oath of Devotion binds a paladin to the loftiest ideals of justice, virtue, and order. Sometimes called cavaliers, white knights, or holy warriors, these paladins meet the ideal of the knight in shining armor, acting with honor in pursuit of justice and the greater good. They hold themselves to the highest standards of conduct, and some, for better or worse, hold the rest of the world to the same standards. Many who swear this oath are devoted to gods of law and good and use their gods' tenets as the measure of their devotion. They hold angels-the perfect servants of good-as their ideals, and incorporate images of angelic wings into their helmets or coats of arms. \n \n##### Tenets of Devotion \n \nThough the exact words and strictures of the Oath of Devotion vary, paladins of this oath share these tenets. \n \n**_Honesty._** Don't lie or cheat. Let your word be your promise. \n \n**_Courage._** Never fear to act, though caution is wise. \n \n**_Compassion._** Aid others, protect the weak, and punish those who threaten them. Show mercy to your foes, but temper it with wisdom. \n \n**_Honor._** Treat others with fairness, and let your honorable deeds be an example to them. Do as much good as possible while causing the least amount of harm. \n \n**_Duty._** Be responsible for your actions and their consequences, protect those entrusted to your care, and obey those who have just authority over you. \n \n##### Oath Spells \n \nYou gain oath spells at the paladin levels listed. \n \n**Oath of Devotion Spells (table)** \n \n| Level | Paladin Spells                           | \n|-------|------------------------------------------| \n| 3rd   | protection from evil and good, sanctuary | \n| 5th   | lesser restoration, zone of truth        | \n| 9th   | beacon of hope, dispel magic             | \n| 13th  | freedom of movement, guardian of faith   | \n| 17th  | commune, flame strike                    | \n \n##### Channel Divinity \n \nWhen you take this oath at 3rd level, you gain the following two Channel Divinity options. \n \n**_Sacred Weapon._** As an action, you can imbue one weapon that you are holding with positive energy, using your Channel Divinity. For 1 minute, you add your Charisma modifier to attack rolls made with that weapon (with a minimum bonus of +1). The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that. If the weapon is not already magical, it becomes magical for the duration. \n \nYou can end this effect on your turn as part of any other action. If you are no longer holding or carrying this weapon, or if you fall unconscious, this effect ends. \n \n**_Turn the Unholy._** As an action, you present your holy symbol and speak a prayer censuring fiends and undead, using your Channel Divinity. Each fiend or undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes damage. \n \nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action. \n \n##### Aura of Devotion \n \nStarting at 7th level, you and friendly creatures within 10 feet of you can't be charmed while you are conscious. \n \nAt 18th level, the range of this aura increases to 30 feet. \n \n##### Purity of Spirit \n \nBeginning at 15th level, you are always under the effects of a *protection from evil and good* spell. \n \n##### Holy Nimbus \n \nAt 20th level, as an action, you can emanate an aura of sunlight. For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that. \n \nWhenever an enemy creature starts its turn in the bright light, the creature takes 10 radiant damage. \n \nIn addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead. \n \nOnce you use this feature, you can't use it again until you finish a long rest."
            }
        ]
    },
    {
        "name": "Ranger",
        "features": {
            "hit-dice": "1d10",
            "hp-at-1st-level": "10 + your Constitution modifier",
            "hp-at-higher-levels": "1d10 (or 6) + your Constitution modifier per ranger level after 1st",
            "prof-armor": "Light armor, medium armor, shields",
            "prof-weapons": "Simple weapons, martial weapons",
            "prof-tools": "None",
            "prof-saving-throws": "Strength, Dexterity",
            "prof-skills": "Choose three from Animal Handling, Athletics, Insight, Investigation, Nature, Perception, Stealth, and Survival",
            "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n* (*a*) scale mail or (*b*) leather armor \n* (*a*) two shortswords or (*b*) two simple melee weapons \n* (*a*) a dungeoneer's pack or (*b*) an explorer's pack \n* A longbow and a quiver of 20 arrows",
            "table": "| Level | Proficiency Bonus | Features                                          | Spells Known | 1st | 2nd | 3rd | 4th | 5th | \n|-------|-------------------|---------------------------------------------------|--------------|-----|-----|-----|-----|-----| \n| 1st   | +2                | Favored Enemy, Natural Explorer                   | -            | -   | -   | -   | -   | -   | \n| 2nd   | +2                | Fighting Style, Spellcasting                      | 2            | 2   | -   | -   | -   | -   | \n| 3rd   | +2                | Ranger Archetype, Primeval Awareness              | 3            | 3   | -   | -   | -   | -   | \n| 4th   | +2                | Ability Score Improvement                         | 3            | 3   | -   | -   | -   | -   | \n| 5th   | +3                | Extra Attack                                      | 4            | 4   | 2   | -   | -   | -   | \n| 6th   | +3                | Favored Enemy and Natural Explorer improvements   | 4            | 4   | 2   | -   | -   | -   | \n| 7th   | +3                | Ranger Archetype feature                          | 5            | 4   | 3   | -   | -   | -   | \n| 8th   | +3                | Ability Score Improvement, Land's Stride          | 5            | 4   | 3   | -   | -   | -   | \n| 9th   | +4                | -                                                 | 6            | 4   | 3   | 2   | -   | -   | \n| 10th  | +4                | Natural Explorer improvement, Hide in Plain Sight | 6            | 4   | 3   | 2   | -   | -   | \n| 11th  | +4                | Ranger Archetype feature                          | 7            | 4   | 3   | 3   | -   | -   | \n| 12th  | +4                | Ability Score Improvement                         | 7            | 4   | 3   | 3   | -   | -   | \n| 13th  | +5                | -                                                 | 8            | 4   | 3   | 3   | 1   | -   | \n| 14th  | +5                | Favored Enemy improvement, Vanish                 | 8            | 4   | 3   | 3   | 1   | -   | \n| 15th  | +5                | Ranger Archetype feature                          | 9            | 4   | 3   | 3   | 2   | -   | \n| 16th  | +5                | Ability Score Improvement                         | 9            | 4   | 3   | 3   | 2   | -   | \n| 17th  | +6                | -                                                 | 10           | 4   | 3   | 3   | 3   | 1   | \n| 18th  | +6                | Feral Senses                                      | 10           | 4   | 3   | 3   | 3   | 1   | \n| 19th  | +6                | Ability Score Improvement                         | 11           | 4   | 3   | 3   | 3   | 2   | \n| 20th  | +6                | Foe Slayer                                        | 11           | 4   | 3   | 3   | 3   | 2   | ",
            "desc": "### Favored Enemy \n \nBeginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy. \n \nChoose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies. \n \nYou have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them. \n \nWhen you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all. \n \nYou choose one additional favored enemy, as well as an associated language, at 6th and 14th level. As you gain levels, your choices should reflect the types of monsters you have encountered on your adventures. \n \n### Natural Explorer \n \nYou are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, or swamp. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you're proficient in. \n \nWhile traveling for an hour or more in your favored terrain, you gain the following benefits: \n* Difficult terrain doesn't slow your group's travel. \n* Your group can't become lost except by magical means. \n* Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger. \n* If you are traveling alone, you can move stealthily at a normal pace. \n* When you forage, you find twice as much food as you normally would. \n* While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area. \n \nYou choose additional favored terrain types at 6th and 10th level. \n \n### Fighting Style \n \nAt 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again. \n \n#### Archery \n \nYou gain a +2 bonus to attack rolls you make with ranged weapons. \n \n#### Defense \n \nWhile you are wearing armor, you gain a +1 bonus to AC. \n \n#### Dueling \n \nWhen you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon. \n \n#### Two-Weapon Fighting \n \nWhen you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack. \n \n### Spellcasting \n \nBy the time you reach 2nd level, you have learned to use the magical essence of nature to cast spells, much as a druid does. See chapter 10 for the general rules of spellcasting and chapter 11 for the ranger spell list. \n \n#### Spell Slots \n \nThe Ranger table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. \n \nFor example, if you know the 1st-level spell *animal friendship* and have a 1st-level and a 2nd-level spell slot available, you can cast *animal friendship* using either slot. \n \n#### Spells Known of 1st Level and Higher \n \nYou know two 1st-level spells of your choice from the ranger spell list. \n \nThe Spells Known column of the Ranger table shows when you learn more ranger spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 5th level in this class, you can learn one new spell of 1st or 2nd level. \n \nAdditionally, when you gain a level in this class, you can choose one of the ranger spells you know and replace it with another spell from the ranger spell list, which also must be of a level for which you have spell slots. \n \n#### Spellcasting Ability \n \nWisdom is your spellcasting ability for your ranger spells, since your magic draws on your attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a ranger spell you cast and when making an attack roll with one. \n \n**Spell save DC** = 8 + your proficiency bonus + your Wisdom modifier \n \n**Spell attack modifier** = your proficiency bonus + your Wisdom modifier \n \n### Ranger Archetype \n \nAt 3rd level, you choose an archetype that you strive to emulate: Hunter or Beast Master, both detailed at the end of the class description. Your choice grants you features at 3rd level and again at 7th, 11th, and 15th level. \n \n### Primeval Awareness \n \nBeginning at 3rd level, you can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn't reveal the creatures' location or number. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Extra Attack \n \nBeginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. \n \n### Land's Stride \n \nStarting at 8th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard. \n \nIn addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the *entangle* spell. \n \n### Hide in Plain Sight \n \nStarting at 10th level, you can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage. \n \nOnce you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you move or take an action or a reaction, you must camouflage yourself again to gain this benefit. \n \n### Vanish \n \nStarting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can't be tracked by nonmagical means, unless you choose to leave a trail. \n \n### Feral Senses \n \nAt 18th level, you gain preternatural senses that help you fight creatures you can't see. When you attack a creature you can't see, your inability to see it doesn't impose disadvantage on your attack rolls against it. \n \nYou are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn't hidden from you and you aren't blinded or deafened. \n \n### Foe Slayer \n \nAt 20th level, you become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied.",
            "spellcasting-ability": "Wisdom"
        },
        "subtypes-name": "Archetypes",
        "subtypes": [
            {
                "name": "Hunter",
                "desc": "Emulating the Hunter archetype means accepting your place as a bulwark between civilization and the terrors of the wilderness. As you walk the Hunter's path, you learn specialized techniques for fighting the threats you face, from rampaging ogres and hordes of orcs to towering giants and terrifying dragons. \n \n##### Hunter's Prey \n \nAt 3rd level, you gain one of the following features of your choice. \n \n**_Colossus Slayer._** Your tenacity can wear down the most potent foes. When you hit a creature with a weapon attack, the creature takes an extra 1d8 damage if it's below its hit point maximum. You can deal this extra damage only once per turn. \n \n**_Giant Killer._** When a Large or larger creature within 5 feet of you hits or misses you with an attack, you can use your reaction to attack that creature immediately after its attack, provided that you can see the creature. \n \n**_Horde Breaker._** Once on each of your turns when you make a weapon attack, you can make another attack with the same weapon against a different creature that is within 5 feet of the original target and within range of your weapon. \n \n##### Defensive Tactics \n \nAt 7th level, you gain one of the following features of your choice. \n \n**_Escape the Horde._** Opportunity attacks against you are made with disadvantage. \n \n**_Multiattack Defense._** When a creature hits you with an attack, you gain a +4 bonus to AC against all subsequent attacks made by that creature for the rest of the turn. \n \n**_Steel Will._** You have advantage on saving throws against being frightened. \n \n##### Multiattack \n \nAt 11th level, you gain one of the following features of your choice. \n \n**_Volley._** You can use your action to make a ranged attack against any number of creatures within 10 feet of a point you can see within your weapon's range. You must have ammunition for each target, as normal, and you make a separate attack roll for each target. \n \n**_Whirlwind Attack._** You can use your action to make a melee attack against any number of creatures within 5 feet of you, with a separate attack roll for each target. \n \n##### Superior Hunter's Defense \n \nAt 15th level, you gain one of the following features of your choice. \n \n**_Evasion._** When you are subjected to an effect, such as a red dragon's fiery breath or a *lightning bolt* spell, that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail. \n \n**_Stand Against the Tide._** When a hostile creature misses you with a melee attack, you can use your reaction to force that creature to repeat the same attack against another creature (other than itself) of your choice. \n \n**_Uncanny Dodge._** When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you."
            }
        ]
    },
    {
        "name": "Rogue",
        "features": {
            "hit-dice": "1d8",
            "hp-at-1st-level": "8 + your Constitution modifier",
            "hp-at-higher-levels": "1d8 (or 5) + your Constitution modifier per rogue level after 1st",
            "prof-armor": "Light armor",
            "prof-weapons": "Simple weapons, hand crossbows, longswords, rapiers, shortswords",
            "prof-tools": "Thieves' tools",
            "prof-saving-throws": "Dexterity, Intelligence",
            "prof-skills": "Choose four from Acrobatics, Athletics, Deception, Insight, Intimidation, Investigation, Perception, Performance, Persuasion, Sleight of Hand, and Stealth",
            "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n* (*a*) a rapier or (*b*) a shortsword \n* (*a*) a shortbow and quiver of 20 arrows or (*b*) a shortsword \n* (*a*) a burglar's pack, (*b*) a dungeoneer's pack, or (*c*) an explorer's pack \n* (*a*) Leather armor, two daggers, and thieves' tools",
            "table": "| Level | Proficiency Bonus | Sneak Attack | Features                               | \n|-------|-------------------|--------------|----------------------------------------| \n| 1st   | +2                | 1d6          | Expertise, Sneak Attack, Thieves' Cant | \n| 2nd   | +2                | 1d6          | Cunning Action                         | \n| 3rd   | +2                | 2d6          | Roguish Archetype                      | \n| 4th   | +2                | 2d6          | Ability Score Improvement              | \n| 5th   | +3                | 3d6          | Uncanny Dodge                          | \n| 6th   | +3                | 3d6          | Expertise                              | \n| 7th   | +3                | 4d6          | Evasion                                | \n| 8th   | +3                | 4d6          | Ability Score Improvement              | \n| 9th   | +4                | 5d6          | Roguish Archetype feature              | \n| 10th  | +4                | 5d6          | Ability Score Improvement              | \n| 11th  | +4                | 6d6          | Reliable Talent                        | \n| 12th  | +4                | 6d6          | Ability Score Improvement              | \n| 13th  | +5                | 7d6          | Roguish Archetype Feature              | \n| 14th  | +5                | 7d6          | Blindsense                             | \n| 15th  | +5                | 8d6          | Slippery Mind                          | \n| 16th  | +5                | 8d6          | Ability Score Improvement              | \n| 17th  | +6                | 9d6          | Roguish Archetype Feature              | \n| 18th  | +6                | 9d6          | Elusive                                | \n| 19th  | +6                | 10d6         | Ability Score Improvement              | \n| 20th  | +6                | 10d6         | Stroke of Luck                         | ",
            "desc": "### Expertise \n \nAt 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves' tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies. \n \nAt 6th level, you can choose two more of your proficiencies (in skills or with thieves' tools) to gain this benefit. \n \n### Sneak Attack \n \nBeginning at 1st level, you know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon. \n \nYou don't need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn't incapacitated, and you don't have disadvantage on the attack roll. \n \nThe amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table. \n \n### Thieves' Cant \n \nDuring your rogue training you learned thieves' cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves' cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly. \n \nIn addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves' guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run. \n \n### Cunning Action \n \nStarting at 2nd level, your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action. \n \n### Roguish Archetype \n \nAt 3rd level, you choose an archetype that you emulate in the exercise of your rogue abilities: Thief, Assassin, or Arcane Trickster, all detailed at the end of the class description. Your archetype choice grants you features at 3rd level and then again at 9th, 13th, and 17th level. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 8th, 10th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Uncanny Dodge \n \nStarting at 5th level, when an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you. \n \n### Evasion \n \nBeginning at 7th level, you can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or an *ice storm* spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail. \n \n### Reliable Talent \n \nBy 11th level, you have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10. \n \n### Blindsense \n \nStarting at 14th level, if you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you. \n \n### Slippery Mind \n \nBy 15th level, you have acquired greater mental strength. You gain proficiency in Wisdom saving throws. \n \n### Elusive \n \nBeginning at 18th level, you are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren't incapacitated. \n \n### Stroke of Luck \n \nAt 20th level, you have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20. \n \nOnce you use this feature, you can't use it again until you finish a short or long rest. \n \n### Roguish Archetypes \n \nRogues have many features in common, including their emphasis on perfecting their skills, their precise and deadly approach to combat, and their increasingly quick reflexes. But different rogues steer those talents in varying directions, embodied by the rogue archetypes. Your choice of archetype is a reflection of your focus-not necessarily an indication of your chosen profession, but a description of your preferred techniques.",
            "spellcasting-ability": ""
        },
        "subtypes-name": "Roguish Archetypes",
        "subtypes": [
            {
                "name": "Thief",
                "desc": "You hone your skills in the larcenous arts. Burglars, bandits, cutpurses, and other criminals typically follow this archetype, but so do rogues who prefer to think of themselves as professional treasure seekers, explorers, delvers, and investigators. In addition to improving your agility and stealth, you learn skills useful for delving into ancient ruins, reading unfamiliar languages, and using magic items you normally couldn't employ. \n \n##### Fast Hands \n \nStarting at 3rd level, you can use the bonus action granted by your Cunning Action to make a Dexterity (Sleight of Hand) check, use your thieves' tools to disarm a trap or open a lock, or take the Use an Object action. \n \n##### Second-Story Work \n \nWhen you choose this archetype at 3rd level, you gain the ability to climb faster than normal; climbing no longer costs you extra movement. \n \nIn addition, when you make a running jump, the distance you cover increases by a number of feet equal to your Dexterity modifier. \n \n##### Supreme Sneak \n \nStarting at 9th level, you have advantage on a Dexterity (Stealth) check if you move no more than half your speed on the same turn. \n \n##### Use Magic Device \n \nBy 13th level, you have learned enough about the workings of magic that you can improvise the use of items even when they are not intended for you. You ignore all class, race, and level requirements on the use of magic items. \n \n##### Thief's Reflexes \n \nWhen you reach 17th level, you have become adept at laying ambushes and quickly escaping danger. You can take two turns during the first round of any combat. You take your first turn at your normal initiative and your second turn at your initiative minus 10. You can't use this feature when you are surprised."
            }
        ]
    },
    {
        "name": "Sorcerer",
        "features": {
            "hit-dice": "1d6",
            "hp-at-1st-level": "6 + your Constitution modifier",
            "hp-at-higher-levels": "1d6 (or 4) + your Constitution modifier per sorcerer level after 1st",
            "prof-armor": "None",
            "prof-weapons": "Daggers, darts, slings, quarterstaffs, light crossbows",
            "prof-tools": "None",
            "prof-saving-throws": "Constitution, Charisma",
            "prof-skills": "Choose two from Arcana, Deception, Insight, Intimidation, Persuasion, and Religion",
            "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n* (*a*) a light crossbow and 20 bolts or (*b*) any simple weapon \n* (*a*) a component pouch or (*b*) an arcane focus \n* (*a*) a dungeoneer's pack or (*b*) an explorer's pack \n* Two daggers",
            "table": "| Level | Proficiency Bonus | Sorcery Points | Features                       | Cantrips Known | Spells Known | 1st | 2nd | 3rd | 4th | 5th | 6th | 7th | 8th | 9th | \n|-------|-------------------|----------------|--------------------------------|----------------|--------------|-----|-----|-----|-----|-----|-----|-----|-----|-----| \n| 1st   | +2                | -              | Spellcasting, Sorcerous Origin | 4              | 2            | 2   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 2nd   | +2                | 2              | Font of Magic                  | 4              | 3            | 3   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 3rd   | +2                | 3              | Metamagic                      | 4              | 4            | 4   | 2   | -   | -   | -   | -   | -   | -   | -   | \n| 4th   | +2                | 4              | Ability Score Improvement      | 5              | 5            | 4   | 3   | -   | -   | -   | -   | -   | -   | -   | \n| 5th   | +3                | 5              | -                              | 5              | 6            | 4   | 3   | 2   | -   | -   | -   | -   | -   | -   | \n| 6th   | +3                | 6              | Sorcerous Origin Feature       | 5              | 7            | 4   | 3   | 3   | -   | -   | -   | -   | -   | -   | \n| 7th   | +3                | 7              | -                              | 5              | 8            | 4   | 3   | 3   | 1   | -   | -   | -   | -   | -   | \n| 8th   | +3                | 8              | Ability Score Improvement      | 5              | 9            | 4   | 3   | 3   | 2   | -   | -   | -   | -   | -   | \n| 9th   | +4                | 9              | -                              | 5              | 10           | 4   | 3   | 3   | 3   | 1   | -   | -   | -   | -   | \n| 10th  | +4                | 10             | Metamagic                      | 6              | 11           | 4   | 3   | 3   | 3   | 2   | -   | -   | -   | -   | \n| 11th  | +4                | 11             | -                              | 6              | 12           | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 12th  | +4                | 12             | Ability Score Improvement      | 6              | 12           | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 13th  | +5                | 13             | -                              | 6              | 13           | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 14th  | +5                | 14             | Sorcerous Origin Feature       | 6              | 13           | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 15th  | +5                | 15             | -                              | 6              | 14           | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 16th  | +5                | 16             | Ability Score Improvement      | 6              | 14           | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 17th  | +6                | 17             | Metamagic                      | 6              | 15           | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | 1   | \n| 18th  | +6                | 18             | Sorcerous Origin Feature       | 6              | 15           | 4   | 3   | 3   | 3   | 3   | 1   | 1   | 1   | 1   | \n| 19th  | +6                | 19             | Ability Score Improvement      | 6              | 15           | 4   | 3   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | \n| 20th  | +6                | 20             | Sorcerous Restoration          | 6              | 15           | 4   | 3   | 3   | 3   | 3   | 2   | 2   | 1   | 1   |",
            "desc": "### Spellcasting \n \nAn event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells. \n \n#### Cantrips \n \nAt 1st level, you know four cantrips of your choice from the sorcerer spell list. You learn additional sorcerer cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Sorcerer table. \n \n#### Spell Slots \n \nThe Sorcerer table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these sorcerer spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. \n \nFor example, if you know the 1st-level spell *burning hands* and have a 1st-level and a 2nd-level spell slot available, you can cast *burning hands* using either slot. \n \n#### Spells Known of 1st Level and Higher \n \nYou know two 1st-level spells of your choice from the sorcerer spell list. \n \nThe Spells Known column of the Sorcerer table shows when you learn more sorcerer spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level. \n \nAdditionally, when you gain a level in this class, you can choose one of the sorcerer spells you know and replace it with another spell from the sorcerer spell list, which also must be of a level for which you have spell slots. \n \n#### Spellcasting Ability \n \nCharisma is your spellcasting ability for your sorcerer spells, since the power of your magic relies on your ability to project your will into the world. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a sorcerer spell you cast and when making an attack roll with one. \n \n**Spell save DC** = 8 + your proficiency bonus + your Charisma modifier \n \n**Spell attack modifier** = your proficiency bonus + your Charisma modifier \n \n#### Spellcasting Focus \n \nYou can use an arcane focus as a spellcasting focus for your sorcerer spells. \n \n### Sorcerous Origin \n \nChoose a sorcerous origin, which describes the source of your innate magical power: Draconic Bloodline or Wild Magic, both detailed at the end of the class description. \n \nYour choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level. \n \n### Font of Magic \n \nAt 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects. \n \n#### Sorcery Points \n \nYou have 2 sorcery points, and you gain more as you reach higher levels, as shown in the Sorcery Points column of the Sorcerer table. You can never have more sorcery points than shown on the table for your level. You regain all spent sorcery points when you finish a long rest. \n \n#### Flexible Casting \n \nYou can use your sorcery points to gain additional spell slots, or sacrifice spell slots to gain additional sorcery points. You learn other ways to use your sorcery points as you reach higher levels. \n \n**_Creating Spell Slots._** You can transform unexpended sorcery points into one spell slot as a bonus action on your turn. The Creating Spell Slots table shows the cost of creating a spell slot of a given level. You can create spell slots no higher in level than 5th. \n \nAny spell slot you create with this feature vanishes when you finish a long rest. \n \n**Creating Spell Slots (table)** \n \n| Spell Slot Level | Sorcery Point Cost | \n|------------------|--------------------| \n| 1st              | 2                  | \n| 2nd              | 3                  | \n| 3rd              | 5                  | \n| 4th              | 6                  | \n| 5th              | 7                  | \n \n**_Converting a Spell Slot to Sorcery Points._** As a bonus action on your turn, you can expend one spell slot and gain a number of sorcery points equal to the slot's level. \n \n### Metamagic \n \nAt 3rd level, you gain the ability to twist your spells to suit your needs. You gain two of the following Metamagic options of your choice. You gain another one at 10th and 17th level. \n \nYou can use only one Metamagic option on a spell when you cast it, unless otherwise noted. \n \n#### Careful Spell \n \nWhen you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell's full force. To do so, you spend 1 sorcery point and choose a number of those creatures up to your Charisma modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell. \n \n#### Distant Spell \n \nWhen you cast a spell that has a range of 5 feet or greater, you can spend 1 sorcery point to double the range of the spell. \n \nWhen you cast a spell that has a range of touch, you can spend 1 sorcery point to make the range of the spell 30 feet. \n \n#### Empowered Spell \n \nWhen you roll damage for a spell, you can spend 1 sorcery point to reroll a number of the damage dice up to your Charisma modifier (minimum of one). You must use the new rolls. \n \nYou can use Empowered Spell even if you have already used a different Metamagic option during the casting of the spell. \n \n#### Extended Spell \n \nWhen you cast a spell that has a duration of 1 minute or longer, you can spend 1 sorcery point to double its duration, to a maximum duration of 24 hours. \n \n#### Heightened Spell \n \nWhen you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 sorcery points to give one target of the spell disadvantage on its first saving throw made against the spell. \n \n#### Quickened Spell \n \nWhen you cast a spell that has a casting time of 1 action, you can spend 2 sorcery points to change the casting time to 1 bonus action for this casting. \n \n#### Subtle Spell \n \nWhen you cast a spell, you can spend 1 sorcery point to cast it without any somatic or verbal components. \n \n#### Twinned Spell \n \nWhen you cast a spell that targets only one creature and doesn't have a range of self, you can spend a number of sorcery points equal to the spell's level to target a second creature in range with the same spell (1 sorcery point if the spell is a cantrip). \n \nTo be eligible, a spell must be incapable of targeting more than one creature at the spell's current level. For example, *magic missile* and *scorching ray* aren't eligible, but *ray of frost* and *chromatic orb* are. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Sorcerous Restoration \n \nAt 20th level, you regain 4 expended sorcery points whenever you finish a short rest. \n \n### Sorcerous Origins \n \nDifferent sorcerers claim different origins for their innate magic. Although many variations exist, most of these origins fall into two categories: a draconic bloodline and wild magic.",
            "spellcasting-ability": "Charisma"
        },
        "subtypes-name": "Sorcerous Origins",
        "subtypes": [
            {
                "name": "Draconic Bloodline",
                "desc": "Your innate magic comes from draconic magic that was mingled with your blood or that of your ancestors. Most often, sorcerers with this origin trace their descent back to a mighty sorcerer of ancient times who made a bargain with a dragon or who might even have claimed a dragon parent. Some of these bloodlines are well established in the world, but most are obscure. Any given sorcerer could be the first of a new bloodline, as a result of a pact or some other exceptional circumstance. \n \n##### Dragon Ancestor \n \nAt 1st level, you choose one type of dragon as your ancestor. The damage type associated with each dragon is used by features you gain later. \n \n**Draconic Ancestry (table)** \n \n| Dragon | Damage Type | \n|--------|-------------| \n| Black  | Acid        | \n| Blue   | Lightning   | \n| Brass  | Fire        | \n| Bronze | Lightning   | \n| Copper | Acid        | \n| Gold   | Fire        | \n| Green  | Poison      | \n| Red    | Fire        | \n| Silver | Cold        | \n| White  | Cold        | \n \nYou can speak, read, and write Draconic. Additionally, whenever you make a Charisma check when interacting with dragons, your proficiency bonus is doubled if it applies to the check. \n \n##### Draconic Resilience \n \nAs magic flows through your body, it causes physical traits of your dragon ancestors to emerge. At 1st level, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class. \n \nAdditionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren't wearing armor, your AC equals 13 + your Dexterity modifier. \n \n##### Elemental Affinity \n \nStarting at 6th level, when you cast a spell that deals damage of the type associated with your draconic ancestry, you can add your Charisma modifier to one damage roll of that spell. At the same time, you can spend 1 sorcery point to gain resistance to that damage type for 1 hour. \n \n##### Dragon Wings \n \nAt 14th level, you gain the ability to sprout a pair of dragon wings from your back, gaining a flying speed equal to your current speed. You can create these wings as a bonus action on your turn. They last until you dismiss them as a bonus action on your turn. \n \nYou can't manifest your wings while wearing armor unless the armor is made to accommodate them, and clothing not made to accommodate your wings might be destroyed when you manifest them. \n \n##### Draconic Presence \n \nBeginning at 18th level, you can channel the dread presence of your dragon ancestor, causing those around you to become awestruck or frightened. As an action, you can spend 5 sorcery points to draw on this power and exude an aura of awe or fear (your choice) to a distance of 60 feet. For 1 minute or until you lose your concentration (as if you were casting a concentration spell), each hostile creature that starts its turn in this aura must succeed on a Wisdom saving throw or be charmed (if you chose awe) or frightened (if you chose fear) until the aura ends. A creature that succeeds on this saving throw is immune to your aura for 24 hours."
            }
        ]
    },
    {
        "name": "Warlock",
        "features": {
            "hit-dice": "1d8",
            "hp-at-1st-level": "8 + your Constitution modifier",
            "hp-at-higher-levels": "1d8 (or 5) + your Constitution modifier per warlock level after 1st",
            "prof-armor": "Light armor",
            "prof-weapons": "Simple weapons",
            "prof-tools": "None",
            "prof-saving-throws": "Wisdom, Charisma",
            "prof-skills": "Choose two skills from Arcana, Deception, History, Intimidation, Investigation, Nature, and Religion",
            "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n* *(a)* a light crossbow and 20 bolts or (*b*) any simple weapon \n* *(a)* a component pouch or (*b*) an arcane focus \n* *(a)* a scholar's pack or (*b*) a dungeoneer's pack \n* Leather armor, any simple weapon, and two daggers",
            "table": "| Level | Proficiency Bonus | Features                        | Cantrips Known | Spells Known | Spell Slots | Slot Level | Invocations Known | \n|-------|-------------------|---------------------------------|----------------|--------------|-------------|------------|-------------------| \n| 1st   | +2                | Otherworldly Patron, Pact Magic | 2              | 2            | 1           | 1st        | -                 | \n| 2nd   | +2                | Eldritch Invocations            | 2              | 3            | 2           | 1st        | 2                 | \n| 3rd   | +2                | Pact Boon                       | 2              | 4            | 2           | 2nd        | 2                 | \n| 4th   | +2                | Ability Score Improvement       | 3              | 5            | 2           | 2nd        | 2                 | \n| 5th   | +3                | -                               | 3              | 6            | 2           | 3rd        | 3                 | \n| 6th   | +3                | Otherworldly Patron feature     | 3              | 7            | 2           | 3rd        | 3                 | \n| 7th   | +3                | -                               | 3              | 8            | 2           | 4th        | 4                 | \n| 8th   | +3                | Ability Score Improvement       | 3              | 9            | 2           | 4th        | 4                 | \n| 9th   | +4                | -                               | 3              | 10           | 2           | 5th        | 5                 | \n| 10th  | +4                | Otherworldly Patron feature     | 4              | 10           | 2           | 5th        | 5                 | \n| 11th  | +4                | Mystic Arcanum (6th level)      | 4              | 11           | 3           | 5th        | 5                 | \n| 12th  | +4                | Ability Score Improvement       | 4              | 11           | 3           | 5th        | 6                 | \n| 13th  | +5                | Mystic Arcanum (7th level)      | 4              | 12           | 3           | 5th        | 6                 | \n| 14th  | +5                | Otherworldly Patron feature     | 4              | 12           | 3           | 5th        | 6                 | \n| 15th  | +5                | Mystic Arcanum (8th level)      | 4              | 13           | 3           | 5th        | 7                 | \n| 16th  | +5                | Ability Score Improvement       | 4              | 13           | 3           | 5th        | 7                 | \n| 17th  | +6                | Mystic Arcanum (9th level)      | 4              | 14           | 4           | 5th        | 7                 | \n| 18th  | +6                | -                               | 4              | 14           | 4           | 5th        | 8                 | \n| 19th  | +6                | Ability Score Improvement       | 4              | 15           | 4           | 5th        | 8                 | \n| 20th  | +6                | Eldritch Master                 | 4              | 15           | 4           | 5th        | 8                 |",
            "desc": "### Otherworldly Patron \n \nAt 1st level, you have struck a bargain with an otherworldly being of your choice: the Archfey, the Fiend, or the Great Old One, each of which is detailed at the end of the class description. Your choice grants you features at 1st level and again at 6th, 10th, and 14th level. \n \n### Pact Magic \n \nYour arcane research and the magic bestowed on you by your patron have given you facility with spells. \n \n#### Cantrips \n \nYou know two cantrips of your choice from the warlock spell list. You learn additional warlock cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Warlock table. \n \n#### Spell Slots \n \nThe Warlock table shows how many spell slots you have. The table also shows what the level of those slots is; all of your spell slots are the same level. To cast one of your warlock spells of 1st level or higher, you must expend a spell slot. You regain all expended spell slots when you finish a short or long rest. \n \nFor example, when you are 5th level, you have two 3rd-level spell slots. To cast the 1st-level spell *thunderwave*, you must spend one of those slots, and you cast it as a 3rd-level spell. \n \n#### Spells Known of 1st Level and Higher \n \nAt 1st level, you know two 1st-level spells of your choice from the warlock spell list. \n \nThe Spells Known column of the Warlock table shows when you learn more warlock spells of your choice of 1st level and higher. A spell you choose must be of a level no higher than what's shown in the table's Slot Level column for your level. When you reach 6th level, for example, you learn a new warlock spell, which can be 1st, 2nd, or 3rd level. \n \nAdditionally, when you gain a level in this class, you can choose one of the warlock spells you know and replace it with another spell from the warlock spell list, which also must be of a level for which you have spell slots. \n \n#### Spellcasting Ability \n \nCharisma is your spellcasting ability for your warlock spells, so you use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a warlock spell you cast and when making an attack roll with one. \n \n**Spell save DC** = 8 + your proficiency bonus + your Charisma modifier \n \n**Spell attack modifier** = your proficiency bonus + your Charisma modifier \n \n#### Spellcasting Focus \n \nYou can use an arcane focus as a spellcasting focus for your warlock spells. \n \n### Eldritch Invocations \n \nIn your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability. \n \nAt 2nd level, you gain two eldritch invocations of your choice. Your invocation options are detailed at the end of the class description. When you gain certain warlock levels, you gain additional invocations of your choice, as shown in the Invocations Known column of the Warlock table. \n \nAdditionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level. \n \n### Pact Boon \n \nAt 3rd level, your otherworldly patron bestows a gift upon you for your loyal service. You gain one of the following features of your choice. \n \n#### Pact of the Chain \n \nYou learn the *find familiar* spell and can cast it as a ritual. The spell doesn't count against your number of spells known. \n \nWhen you cast the spell, you can choose one of the normal forms for your familiar or one of the following special forms: imp, pseudodragon, quasit, or sprite. \n \nAdditionally, when you take the Attack action, you can forgo one of your own attacks to allow your familiar to make one attack of its own with its reaction. \n \n#### Pact of the Blade \n \nYou can use your action to create a pact weapon in your empty hand. You can choose the form that this melee weapon takes each time you create it. You are proficient with it while you wield it. This weapon counts as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage. \n \nYour pact weapon disappears if it is more than 5 feet away from you for 1 minute or more. It also disappears if you use this feature again, if you dismiss the weapon (no action required), or if you die. \n \nYou can transform one magic weapon into your pact weapon by performing a special ritual while you hold the weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest. You can then dismiss the weapon, shunting it into an extradimensional space, and it appears whenever you create your pact weapon thereafter. You can't affect an artifact or a sentient weapon in this way. The weapon ceases being your pact weapon if you die, if you perform the 1-hour ritual on a different weapon, or if you use a 1-hour ritual to break your bond to it. The weapon appears at your feet if it is in the extradimensional space when the bond breaks. \n \n#### Pact of the Tome \n \nYour patron gives you a grimoire called a Book of Shadows. When you gain this feature, choose three cantrips from any class's spell list (the three needn't be from the same list). While the book is on your person, you can cast those cantrips at will. They don't count against your number of cantrips known. If they don't appear on the warlock spell list, they are nonetheless warlock spells for you. \n \nIf you lose your Book of Shadows, you can perform a 1-hour ceremony to receive a replacement from your patron. This ceremony can be performed during a short or long rest, and it destroys the previous book. The book turns to ash when you die. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Mystic Arcanum \n \nAt 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th- level spell from the warlock spell list as this arcanum. \n \nYou can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again. \n \nAt higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th- level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic Arcanum when you finish a long rest. \n \n### Eldritch Master \n \nAt 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again. \n \n### Eldritch Invocations \n \nIf an eldritch invocation has prerequisites, you must meet them to learn it. You can learn the invocation at the same time that you meet its prerequisites. A level prerequisite refers to your level in this class. \n \n#### Agonizing Blast \n \n*Prerequisite:* eldritch blast *cantrip* \n \nWhen you cast *eldritch blast*, add your Charisma modifier to the damage it deals on a hit. \n \n#### Armor of Shadows \n \nYou can cast *mage armor* on yourself at will, without expending a spell slot or material components. \n \n#### Ascendant Step \n \n*Prerequisite: 9th level* \n \nYou can cast *levitate* on yourself at will, without expending a spell slot or material components. \n \n#### Beast Speech \n \nYou can cast *speak with animals* at will, without expending a spell slot. \n \n#### Beguiling Influence \n \nYou gain proficiency in the Deception and Persuasion skills. \n \n#### Bewitching Whispers \n \n*Prerequisite: 7th level* \n \nYou can cast *compulsion* once using a warlock spell slot. You can't do so again until you finish a long rest. \n \n#### Book of Ancient Secrets \n \n*Prerequisite: Pact of the Tome feature* \n \nYou can now inscribe magical rituals in your Book of Shadows. Choose two 1st-level spells that have the ritual tag from any class's spell list (the two needn't be from the same list). The spells appear in the book and don't count against the number of spells you know. With your Book of Shadows in hand, you can cast the chosen spells as rituals. You can't cast the spells except as rituals, unless you've learned them by some other means. You can also cast a warlock spell you know as a ritual if it has the ritual tag. \n \nOn your adventures, you can add other ritual spells to your Book of Shadows. When you find such a spell, you can add it to the book if the spell's level is equal to or less than half your warlock level (rounded up) and if you can spare the time to transcribe the spell. For each level of the spell, the transcription process takes 2 hours and costs 50 gp for the rare inks needed to inscribe it. \n \n#### Chains of Carceri \n \n*Prerequisite: 15th level, Pact of the Chain feature* \n \nYou can cast *hold monster* at will-targeting a celestial, fiend, or elemental-without expending a spell slot or material components. You must finish a long rest before you can use this invocation on the same creature again. \n \n#### Devil's Sight \n \nYou can see normally in darkness, both magical and nonmagical, to a distance of 120 feet. \n \n#### Dreadful Word \n \n*Prerequisite: 7th level* \n \nYou can cast *confusion* once using a warlock spell slot. You can't do so again until you finish a long rest. \n \n#### Eldritch Sight \n \nYou can cast *detect magic* at will, without expending a spell slot. \n \n#### Eldritch Spear \n \n*Prerequisite:* eldritch blast *cantrip* \n \nWhen you cast *eldritch blast*, its range is 300 feet. \n \n#### Eyes of the Rune Keeper \n \nYou can read all writing. \n \n#### Fiendish Vigor \n \nYou can cast *false life* on yourself at will as a 1st-level spell, without expending a spell slot or material components. \n \n#### Gaze of Two Minds \n \nYou can use your action to touch a willing humanoid and perceive through its senses until the end of your next turn. As long as the creature is on the same plane of existence as you, you can use your action on subsequent turns to maintain this connection, extending the duration until the end of your next turn. While perceiving through the other creature's senses, you benefit from any special senses possessed by that creature, and you are blinded and deafened to your own surroundings. \n \n#### Lifedrinker \n \n*Prerequisite: 12th level, Pact of the Blade feature* \n \nWhen you hit a creature with your pact weapon, the creature takes extra necrotic damage equal to your Charisma modifier (minimum 1). \n \n#### Mask of Many Faces \n \nYou can cast *disguise self* at will, without expending a spell slot. \n \n#### Master of Myriad Forms \n \n*Prerequisite: 15th level* \n \nYou can cast *alter self* at will, without expending a spell slot. \n \n#### Minions of Chaos \n \n*Prerequisite: 9th level* \n \nYou can cast *conjure elemental* once using a warlock spell slot. You can't do so again until you finish a long rest. \n \n#### Mire the Mind \n \n*Prerequisite: 5th level* \n \nYou can cast *slow* once using a warlock spell slot. You can't do so again until you finish a long rest. \n \n#### Misty Visions \n \nYou can cast *silent image* at will, without expending a spell slot or material components. \n \n#### One with Shadows \n \n*Prerequisite: 5th level* \n \nWhen you are in an area of dim light or darkness, you can use your action to become invisible until you move or take an action or a reaction. \n \n#### Otherworldly Leap \n \n*Prerequisite: 9th level* \n \nYou can cast *jump* on yourself at will, without expending a spell slot or material components. \n \n#### Repelling Blast \n \n*Prerequisite:* eldritch blast *cantrip* \n \nWhen you hit a creature with *eldritch blast*, you can push the creature up to 10 feet away from you in a straight line. \n \n#### Sculptor of Flesh \n \n*Prerequisite: 7th level* \n \nYou can cast *polymorph* once using a warlock spell slot. You can't do so again until you finish a long rest. \n \n#### Sign of Ill Omen \n \n*Prerequisite: 5th level* \n \nYou can cast *bestow curse* once using a warlock spell slot. You can't do so again until you finish a long rest. \n \n#### Thief of Five Fates \n \nYou can cast *bane* once using a warlock spell slot. You can't do so again until you finish a long rest. \n \n#### Thirsting Blade \n \n*Prerequisite: 5th level, Pact of the Blade feature* \n \nYou can attack with your pact weapon twice, instead of once, whenever you take the Attack action on your turn. \n \n#### Visions of Distant Realms \n \n*Prerequisite: 15th level* \n \nYou can cast *arcane eye* at will, without expending a spell slot. \n \n#### Voice of the Chain Master \n \n*Prerequisite: Pact of the Chain feature* \n \nYou can communicate telepathically with your familiar and perceive through your familiar's senses as long as you are on the same plane of existence. Additionally, while perceiving through your familiar's senses, you can also speak through your familiar in your own voice, even if your familiar is normally incapable of speech. \n \n#### Whispers of the Grave \n \n*Prerequisite: 9th level* \n \nYou can cast *speak with dead* at will, without expending a spell slot. \n \n#### Witch Sight \n \n*Prerequisite: 15th level* \n \nYou can see the true form of any shapechanger or creature concealed by illusion or transmutation magic while the creature is within 30 feet of you and within line of sight. \n \n### Otherworldly Patrons \n \nThe beings that serve as patrons for warlocks are mighty inhabitants of other planes of existence-not gods, but almost godlike in their power. Various patrons give their warlocks access to different powers and invocations, and expect significant favors in return. \n \nSome patrons collect warlocks, doling out mystic knowledge relatively freely or boasting of their ability to bind mortals to their will. Other patrons bestow their power only grudgingly, and might make a pact with only one warlock. Warlocks who serve the same patron might view each other as allies, siblings, or rivals.",
            "spellcasting-ability": "Charisma"
        },
        "subtypes-name": "Otherworldly Patrons",
        "subtypes": [
            {
                "name": "The Fiend",
                "desc": "You have made a pact with a fiend from the lower planes of existence, a being whose aims are evil, even if you strive against those aims. Such beings desire the corruption or destruction of all things, ultimately including you. Fiends powerful enough to forge a pact include demon lords such as Demogorgon, Orcus, Fraz'Urb-luu, and Baphomet; archdevils such as Asmodeus, Dispater, Mephistopheles, and Belial; pit fiends and balors that are especially mighty; and ultroloths and other lords of the yugoloths. \n \n##### Expanded Spell List \n \nThe Fiend lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you. \n \n**Fiend Expanded Spells (table)** \n \n| Spell Level | Spells                            | \n|-------------|-----------------------------------| \n| 1st         | burning hands, command            | \n| 2nd         | blindness/deafness, scorching ray | \n| 3rd         | fireball, stinking cloud          | \n| 4th         | fire shield, wall of fire         | \n| 5th         | flame strike, hallow              | \n \n##### Dark One's Blessing \n \nStarting at 1st level, when you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum of 1). \n \n##### Dark One's Own Luck \n \nStarting at 6th level, you can call on your patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add a d10 to your roll. You can do so after seeing the initial roll but before any of the roll's effects occur. \n \nOnce you use this feature, you can't use it again until you finish a short or long rest. \n \n##### Fiendish Resilience \n \nStarting at 10th level, you can choose one damage type when you finish a short or long rest. You gain resistance to that damage type until you choose a different one with this feature. Damage from magical weapons or silver weapons ignores this resistance. \n \n##### Hurl Through Hell \n \nStarting at 14th level, when you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. The creature disappears and hurtles through a nightmare landscape. \n \nAt the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. If the target is not a fiend, it takes 10d10 psychic damage as it reels from its horrific experience. \n \nOnce you use this feature, you can't use it again until you finish a long rest. \n \n> ### Your Pact Boon \n> \n> Each Pact Boon option produces a special creature or an object that reflects your patron's nature. \n> \n> **_Pact of the Chain._** Your familiar is more cunning than a typical familiar. Its default form can be a reflection of your patron, with sprites and pseudodragons tied to the Archfey and imps and quasits tied to the Fiend. Because the Great Old One's nature is inscrutable, any familiar form is suitable for it. \n> \n> **_Pact of the Blade._** If your patron is the Archfey, your weapon might be a slender blade wrapped in leafy vines. If you serve the Fiend, your weapon could be an axe made of black metal and adorned with decorative flames. If your patron is the Great Old One, your weapon might be an ancient-looking spear, with a gemstone embedded in its head, carved to look like a terrible unblinking eye. \n> \n> **_Pact of the Tome._** Your Book of Shadows might be a fine, gilt-edged tome with spells of enchantment and illusion, gifted to you by the lordly Archfey. It could be a weighty tome bound in demon hide studded with iron, holding spells of conjuration and a wealth of forbidden lore about the sinister regions of the cosmos, a gift of the Fiend. Or it could be the tattered diary of a lunatic driven mad by contact with the Great Old One, holding scraps of spells that only your own burgeoning insanity allows you to understand and cast."
            }
        ]
    },
    {
        "name": "Wizard",
        "features": {
            "hit-dice": "1d6",
            "hp-at-1st-level": "6 + your Constitution modifier",
            "hp-at-higher-levels": "1d6 (or 4) + your Constitution modifier per wizard level after 1st",
            "prof-armor": "None",
            "prof-weapons": "Daggers, darts, slings, quarterstaffs, light crossbows",
            "prof-tools": "None",
            "prof-saving-throws": "Intelligence, Wisdom",
            "prof-skills": "Choose two from Arcana, History, Insight, Investigation, Medicine, and Religion",
            "equipment": "You start with the following equipment, in addition to the equipment granted by your background: \n* *(a)* a quarterstaff or (*b*) a dagger \n* *(a)* a component pouch or (*b*) an arcane focus \n* *(a)* a scholar's pack or (*b*) an explorer's pack \n* A spellbook",
            "table": "| Level | Proficiency Bonus | Features                       | Cantrips Known | 1st | 2nd | 3rd | 4th | 5th | 6th | 7th | 8th | 9th | \n|-------|-------------------|--------------------------------|----------------|-----|-----|-----|-----|-----|-----|-----|-----|-----| \n| 1st   | +2                | Spellcasting, Arcane Recovery  | 3              | 2   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 2nd   | +2                | Arcane Tradition               | 3              | 3   | -   | -   | -   | -   | -   | -   | -   | -   | \n| 3rd   | +2                | -                              | 3              | 4   | 2   | -   | -   | -   | -   | -   | -   | -   | \n| 4th   | +2                | Ability Score Improvement      | 4              | 4   | 3   | -   | -   | -   | -   | -   | -   | -   | \n| 5th   | +3                | -                              | 4              | 4   | 3   | 2   | -   | -   | -   | -   | -   | -   | \n| 6th   | +3                | Arcane Tradition Feature       | 4              | 4   | 3   | 3   | -   | -   | -   | -   | -   | -   | \n| 7th   | +3                | -                              | 4              | 4   | 3   | 3   | 1   | -   | -   | -   | -   | -   | \n| 8th   | +3                | Ability Score Improvement      | 4              | 4   | 3   | 3   | 2   | -   | -   | -   | -   | -   | \n| 9th   | +4                | -                              | 4              | 4   | 3   | 3   | 3   | 1   | -   | -   | -   | -   | \n| 10th  | +4                | Arcane Tradition Feature       | 5              | 4   | 3   | 3   | 3   | 2   | -   | -   | -   | -   | \n| 11th  | +4                | -                              | 5              | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 12th  | +4                | Ability Score Improvement      | 5              | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   | \n| 13th  | +5                | -                              | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 14th  | +5                | Arcane Tradition Feature       | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   | \n| 15th  | +5                | -                              | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 16th  | +5                | Ability Score Improvement      | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   | \n| 17th  | +6                | -                              | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | 1   | \n| 18th  | +6                | Spell Mastery                  | 5              | 4   | 3   | 3   | 3   | 3   | 1   | 1   | 1   | 1   | \n| 19th  | +6                | Ability Score Improvement      | 5              | 4   | 3   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | \n| 20th  | +6                | Signature Spell                | 5              | 4   | 3   | 3   | 3   | 3   | 2   | 2   | 1   | 1   |",
            "desc": "### Spellcasting \n \nAs a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power. \n \n#### Cantrips \n \nAt 1st level, you know three cantrips of your choice from the wizard spell list. You learn additional wizard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Wizard table. \n \n#### Spellbook \n \nAt 1st level, you have a spellbook containing six 1st- level wizard spells of your choice. Your spellbook is the repository of the wizard spells you know, except your cantrips, which are fixed in your mind. \n \n#### Preparing and Casting Spells \n \nThe Wizard table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest. \n \nYou prepare the list of wizard spells that are available for you to cast. To do so, choose a number of wizard spells from your spellbook equal to your Intelligence modifier + your wizard level (minimum of one spell). The spells must be of a level for which you have spell slots. \n \nFor example, if you're a 3rd-level wizard, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination, chosen from your spellbook. If you prepare the 1st-level spell *magic missile,* you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells. \n \nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of wizard spells requires time spent studying your spellbook and memorizing the incantations and gestures you must make to cast the spell: at least 1 minute per spell level for each spell on your list. \n \n#### Spellcasting Ability \n \nIntelligence is your spellcasting ability for your wizard spells, since you learn your spells through dedicated study and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a wizard spell you cast and when making an attack roll with one. \n \n**Spell save DC** = 8 + your proficiency bonus + your Intelligence modifier \n \n**Spell attack modifier** = your proficiency bonus + your Intelligence modifier \n \n#### Ritual Casting \n \nYou can cast a wizard spell as a ritual if that spell has the ritual tag and you have the spell in your spellbook. You don't need to have the spell prepared. \n \n#### Spellcasting Focus \n \nYou can use an arcane focus as a spellcasting focus for your wizard spells. \n \n#### Learning Spells of 1st Level and Higher \n \nEach time you gain a wizard level, you can add two wizard spells of your choice to your spellbook for free. Each of these spells must be of a level for which you have spell slots, as shown on the Wizard table. On your adventures, you might find other spells that you can add to your spellbook (see the “Your Spellbook” sidebar). \n \n### Arcane Recovery \n \nYou have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher. \n \nFor example, if you're a 4th-level wizard, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level spell slot or two 1st-level spell slots. \n \n### Arcane Tradition \n \nWhen you reach 2nd level, you choose an arcane tradition, shaping your practice of magic through one of eight schools: Abjuration, Conjuration, Divination, Enchantment, Evocation, Illusion, Necromancy, or Transmutation, all detailed at the end of the class description. \n \nYour choice grants you features at 2nd level and again at 6th, 10th, and 14th level. \n \n### Ability Score Improvement \n \nWhen you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature. \n \n### Spell Mastery \n \nAt 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal. \n \nBy spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels. \n \n### Signature Spells \n \nWhen you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don't count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can't do so again until you finish a short or long rest. \n \nIf you want to cast either spell at a higher level, you must expend a spell slot as normal. \n \n### Arcane Traditions \n \nThe study of wizardry is ancient, stretching back to the earliest mortal discoveries of magic. It is firmly established in fantasy gaming worlds, with various traditions dedicated to its complex study. \n \nThe most common arcane traditions in the multiverse revolve around the schools of magic. Wizards through the ages have cataloged thousands of spells, grouping them into eight categories called schools. In some places, these traditions are literally schools; a wizard might study at the School of Illusion while another studies across town at the School of Enchantment. In other institutions, the schools are more like academic departments, with rival faculties competing for students and funding. Even wizards who train apprentices in the solitude of their own towers use the division of magic into schools as a learning device, since the spells of each school require mastery of different techniques.",
            "spellcasting-ability": "Intelligence"
        },
        "subtypes-name": "Arcane Traditions",
        "subtypes": [
            {
                "name": "School of Evocation",
                "desc": "You focus your study on magic that creates powerful elemental effects such as bitter cold, searing flame, rolling thunder, crackling lightning, and burning acid. Some evokers find employment in military forces, serving as artillery to blast enemy armies from afar. Others use their spectacular power to protect the weak, while some seek their own gain as bandits, adventurers, or aspiring tyrants. \n \n##### Evocation Savant \n \nBeginning when you select this school at 2nd level, the gold and time you must spend to copy an evocation spell into your spellbook is halved. \n \n##### Sculpt Spells \n \nBeginning at 2nd level, you can create pockets of relative safety within the effects of your evocation spells. When you cast an evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 + the spell's level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage if they would normally take half damage on a successful save. \n \n##### Potent Cantrip \n \nStarting at 6th level, your damaging cantrips affect even creatures that avoid the brunt of the effect. When a creature succeeds on a saving throw against your cantrip, the creature takes half the cantrip's damage (if any) but suffers no additional effect from the cantrip. \n \n##### Empowered Evocation \n \nBeginning at 10th level, you can add your Intelligence modifier to one damage roll of any wizard evocation spell you cast. \n \n##### Overchannel \n \nStarting at 14th level, you can increase the power of your simpler spells. When you cast a wizard spell of 1st through 5th level that deals damage, you can deal maximum damage with that spell. \n \nThe first time you do so, you suffer no adverse effect. If you use this feature again before you finish a long rest, you take 2d12 necrotic damage for each level of the spell, immediately after you cast it. Each time you use this feature again before finishing a long rest, the necrotic damage per spell level increases by 1d12. This damage ignores resistance and immunity. \n \n> ### Your Spellbook \n> \n> The spells that you add to your spellbook as you gain levels reflect the arcane research you conduct on your own, as well as intellectual breakthroughs you have had about the nature of the multiverse. You might find other spells during your adventures. You could discover a spell recorded on a scroll in an evil wizard's chest, for example, or in a dusty tome in an ancient library. \n> \n> **_Copying a Spell into the Book._** When you find a wizard spell of 1st level or higher, you can add it to your spellbook if it is of a spell level you can prepare and if you can spare the time to decipher and copy it. \n> \n> Copying that spell into your spellbook involves reproducing the basic form of the spell, then deciphering the unique system of notation used by the wizard who wrote it. You must practice the spell until you understand the sounds or gestures required, then transcribe it into your spellbook using your own notation. \n> \n> For each level of the spell, the process takes 2 hours and costs 50 gp. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it. Once you have spent this time and money, you can prepare the spell just like your other spells. \n> \n> **_Replacing the Book._** You can copy a spell from your own spellbook into another book-for example, if you want to make a backup copy of your spellbook. This is just like copying a new spell into your spellbook, but faster and easier, since you understand your own notation and already know how to cast the spell. You need spend only 1 hour and 10 gp for each level of the copied spell. \n> \n> If you lose your spellbook, you can use the same procedure to transcribe the spells that you have prepared into a new spellbook. Filling out the remainder of your spellbook requires you to find new spells to do so, as normal. For this reason, many wizards keep backup spellbooks in a safe place. \n> \n> **_The Book's Appearance._** Your spellbook is a unique compilation of spells, with its own decorative flourishes and margin notes. It might be a plain, functional leather volume that you received as a gift from your master, a finely bound gilt-edged tome you found in an ancient library, or even a loose collection of notes scrounged together after you lost your previous spellbook in a mishap."
            }
        ]
    }
]