[
    {
        "name": "Boundless Reserves",
        "prerequisite": "*Wisdom 13 or higher and the Ki class feature*",
        "desc": "You have learned to harness your inner vitality to replenish your ki. You gain the following benefits:",
        "effects_desc": [
            "* Increase your Wisdom score by 1, to a maximum of 20.",
            "* When you start your turn and have no ki points remaining, you can use a reaction to spend one Hit Die. Roll the die and add your Constitution modifier to it. You regain expended ki points equal to up to half the total (minimum of 1). You can never have more ki points than the maximum for your level. Hit Dice spent using this feat can't be used to regain hit points during a short rest. You regain spent Hit Dice as normal."
        ]
    },
    {
        "name": "Diehard",
        "prerequisite": "*Constitution 13 or higher*",
        "desc": "You are difficult to wear down and kill. You gain the following benefits:",
        "effects_desc": [
            "* Increase your Constitution score by 1, up to a maximum of 20.",
            "* You have advantage on saving throws against effects that cause you to suffer a level of exhaustion.",
            "* You have advantage on death saving throws."
        ]
    },
    {
        "name": "Draconic Rune Casting",
        "prerequisite": "*The ability to cast at least one spell*",
        "desc": "The ability to cast at least one spell You have unlocked the basic tenants of draconic rune casting (see the Magic and Spells chapter). You gain the following benefits:",
        "effects_desc": [
            "* You learn two draconic runes of your choice. These runes can't be master runes.",
            "* You learn the master runes up to the highest level of spell you can currently cast. As you grow in power and increase in level, you automatically learn the master runes for each spell level you can cast.",
            "You can inscribe draconic runes you know on objects and empower those runes with your magic when you finish a long rest. You can have a number of empowered runes at one time equal to 1 + your proficiency bonus. You can use empowered runes to replicate spells, as described in the Magic and Spells chapter.",
            "* You can magically mark an inscribed rune to use as a spellcasting focus for your spells."
        ]
    },
    {
        "name": "Floriographer",
        "prerequisite": "*Proficiency in one of the following skills: Arcana, History, or Nature*",
        "desc": "You have studied the secret language of Floriography. You gain the following benefits:",
        "effects_desc": [
            "* Increase your Intelligence or Wisdom score by 1, to a maximum of 20.",
            "* You learn Floriography, the language of flowers. Similar to Druidic and Thieves' Cant, Floriography is a secret language often used to communicate subtle ideas, symbolic meaning, and even basic messages. Floriography is conveyed through the combinations of colors, styles, and even types of flowers in bouquets, floral arrangements, and floral illustrations, often with a gift-giving component.",
            "* Your fluency with the subtle messages in floral displays gives you a keen eye for discerning subtle or hidden messages elsewhere. You have advantage on Intelligence (Investigation) and Wisdom (Insight) checks to notice and discern hidden messages of a visual nature, such as the runes of a magic trap or the subtle hand signals passing between two individuals."
        ]
    },
    {
        "name": "Forest Denizen",
        "prerequisite": "*N/A*",
        "desc": "You are familiar with the ways of the forest. You gain the following benefits:",
        "effects_desc": [
            "* Increase your Wisdom score by 1, to a maximum of 20.",
            "* You can discern if a plant or fungal growth is safe to eat.",
            "* You learn to speak, read, and write Sylvan.",
            "* You have advantage on Strength (Athletics) and Dexterity (Acrobatics) checks you make to escape from being grappled or restrained as long as you are being grappled or restrained by nonmagical vegetation or a beast's action such as a giant frog's bite or a spider's web."
        ]
    },
    {
        "name": "Friend of the Forest",
        "prerequisite": "*N/A*",
        "desc": "After spending some time in forests, you have attuned yourself to the ways of the woods and the creatures in it.  ",
        "effects_desc": [
            "* You learn the *treeheal* (see the Magic and Spells chapter) cantrip and two other druid cantrips of your choice.",
            "* You also learn the *speak with animals* spell and can cast it once without expending a spell slot. Once you cast it, you must finish a short or long rest before you can cast it in this way again. Your spellcasting ability for these spells is Wisdom."
        ]
    },
    {
        "name": "Giant Foe",
        "prerequisite": "*A Small or smaller race*",
        "desc": "Your experience fighting giants, such as ogres, trolls, and frost giants, has taught you how to avoid their deadliest blows and how to wield mighty weapons to better combat them. You gain the following benefits:",
        "effects_desc": [
            "* Increase your Strength score by 1, to a maximum of 20.",
            "* If you normally have disadvantage on attack rolls made with weapons with the Heavy property due to your size, you don't have disadvantage on those attack rolls.",
            "* When a giant attacks you, any critical hit from it against you becomes a normal hit.",
            "* Whenever you make an Intelligence (History) check related to the culture or origins of a giant, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
        ]
    },
    {
        "name": "Harrier",
        "prerequisite": "*The Shadow Traveler shadow fey trait or the ability to cast the* misty step *spell*",
        "desc": "You have learned to maximize the strategic impact of your misty step. You appear in a flash and, while your foe is disoriented, attack with deadly precision. You gain the following benefits:",
        "effects_desc": [
            "* Increase your Strength or Dexterity score by 1, to a maximum of 20.",
            "* When you use your Shadow Traveler trait or cast misty step, you have advantage on the next attack you make before the end of your turn."
        ]
    },
    {
        "name": "Hedgecraft",
        "prerequisite": "*Proficiency in two of the following skills or proficiency in one of these skills and with an herbalism kit: Arcana, Medicine, Nature, or Survival*",
        "desc": "You have extensively studied the magic found in rare plants, and you have unlocked the secrets to invoking the ceremonial and cultivated worts of hedge magic (see the Magic and Spells chapter). You gain the following benefits:",
        "effects_desc": [
            "* Increase your Intelligence or Wisdom score by 1, to a maximum of 20.",
            "* You are skilled at locating and identifying magic plants. You have advantage on Intelligence and Wisdom checks to search for and identify magic plants.",
            "* When you fail to harvest a magic plant (see Hedge Magic in the Magic and Spells chapter), you can try a second time before the magic plant is destroyed. You have disadvantage on this second attempt, which destroys the plant on a failure.",
            "* You have learned how to expertly care for magic plants, and you gain two magic plants of your choice. Each plant is in a small pot, pouch, or some other portable container that you carry with you on your travels. At the end of every 7 days, roll a d4 for each magic plant that you own. The number rolled determines how many uses of that plant you have for the next 7 days. Each plant then steadily regrows, providing more uses after 7 days have passed. While caring for a plant requires work, it is considered part of your routine when you take a long rest and requires no further skill checks. You can keep and care for a number of magic plants equal to 1 + your proficiency bonus at a time."
        ]
    },
    {
        "name": "Inner Resilience",
        "prerequisite": "*Wisdom 13 or higher*",
        "desc": "Your internal discipline gives you access to a small pool of ki points. You gain the following benefits:",
        "effects_desc": [
            "* Increase your Wisdom score by 1, to a maximum of 20",
            "* You have 3 ki points, which you can spend to fuel the Patient Defense or Step of the Wind features from the monk class. When you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points",
            "* If you already have ki points, your ki point maximum increases by 3 instead."
        ]
    },
    {
        "name": "Part of the Pact",
        "prerequisite": "*Proficiency in the Animal Handling skill*",
        "desc": "Wolves are never seen to be far from your side and consider you to be a packmate. You gain the following benefits:",
        "effects_desc": [
            "* Through growls, barks, and gestures, you can communicate simple ideas with canines. For the purposes of this feat, a \"canine\" is any beast with dog or wolf-like features. You can understand them in return, though this is often limited to knowing the creature's current or most recent state, such as \"hungry\", \"content\", or \"in danger.\"",
            "* As an action, you can howl to summon a wolf to assist you. The wolf appears in 1d4 rounds and remains within 50 feet of you until 1 hour elapses or until it dies, whichever occurs first. You can't control the wolf, but it doesn't attack you or your companions. It acts on its own initiative, and it attacks creatures attacking you or your companions. If you are 5th level or higher, your howl summons a number of wolves equal to your proficiency bonus. When your howl summons multiple wolves, you have a 50 percent chance that one of the wolves is a dire wolf instead. Your summoned pack can have no more than one dire wolf. While at least one wolf is with you, you have advantage on Wisdom (Survival) checks to hunt for food or to find shelter. At the GM's discretion, you may not be able to summon a wolf or multiple wolves if you are indoors or in a region where wolves aren't native, such as the middle of the sea. Once you have howled to summon a wolf or wolves with this feat, you must finish a long rest before you can do so again."
        ]
    },
    {
        "name": "Rimecaster",
        "prerequisite": "*A race or background from a cold climate and the ability to cast at least one spell*",
        "desc": "You are from an area with a cold climate and have learned to adapt your magic to reflect your heritage. You gain the following benefits:",
        "effects_desc": [
            "* When you cast a spell that deals damage, you can use a reaction to change the type of damage the spell deals to cold damage.",
            "* When you cast a spell that deals cold damage, you gain resistance to cold damage until the start of your next turn. If you already have resistance to cold damage, you are immune to cold damage until the start of your next turn instead."
        ]
    },
    {
        "name": "Sorcerous Vigor",
        "prerequisite": "*Charisma 13 or higher and the Sorcery Points class feature*",
        "desc": "When your magical reserves are low, you can call on your lifeforce to fuel your magic.",
        "effects_desc": [
            "* Increase your Charisma score by 1, to a maximum of 20.",
            "* When you start your turn and have no sorcery points remaining, you can use a reaction to spend one Hit Die. Roll the die and add your Constitution modifier to it. You regain expended sorcery points equal to up to half the total (minimum of 1). You can never have more sorcery points than the maximum for your level. Hit Dice spent using this feat can't be used to regain hit points during a short rest. You regain spent Hit Dice as normal."
        ]
    },
    {
        "name": "Stalker",
        "prerequisite": "*N/A*",
        "desc": "You are an expert at hunting prey. You are never more at home than when on a hunt, and your quarry rarely escapes you. You gain the following benefits:",
        "effects_desc": [
            "* You gain proficiency in the Stealth and Survival skills.",
            "* You have advantage on Wisdom (Survival) checks made to track a creature you have seen in the past 24 hours."
        ]
    },
    {
        "name": "Stunning Sniper",
        "prerequisite": "*Proficiency with a ranged weapon*",
        "desc": "You have mastered the use of ranged weapons to cripple your target from a distance.",
        "effects_desc": [
            "* When you score a critical hit on a ranged attack roll, you can stun the target until the start of your next turn instead of doubling the damage."
        ]
    }
]