[
    {
        "name": "Abrupt Hug",
        "level": "1st-level",
        "level_int": "1",
        "school": "transmutation",
        "casting_time": "1 reaction, which you take when you or a creature within 30 feet of you takes an Attack action",
        "range": "30 Feet",
        "components": "V",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You or the creature taking the Attack action can immediately make an unarmed strike. In addition to dealing damage with the unarmed strike, the target can grapple the creature it hit with the unarmed strike.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Ranger"
    },
    {
        "name": "Adjust Position",
        "level": "1st-level",
        "level_int": "1",
        "school": "transmutation",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V",
        "materials": "",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You adjust the location of an ally to a better tactical position. You move one willing creature within range 5 feet. This movement does not provoke opportunity attacks. The creature moves bodily through the intervening space (as opposed to teleporting), so there can be no physical obstacle (such as a wall or a door) in the path.",
        "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, you can target an additional willing creature for each slot level above 1st.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Warlock, Wizard"
    },
    {
        "name": "Ambush",
        "level": "1st-level",
        "level_int": "1",
        "school": "illusion",
        "casting_time": "1 action",
        "range": "Self",
        "components": "S,M",
        "materials": "a raven's feather or a bit of panther fur",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "desc": "The forest floor swirls and shifts around you to welcome you into its embrace. While in a forest, you have advantage on Dexterity (Stealth) checks to Hide. While hidden in a forest, you have advantage on your next Initiative check. The spell ends if you attack or cast a spell.",
        "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, you can affect one additional creature for each slot level above 1st. The spell ends if you or any target of this spell attacks or casts a spell.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger, Sorceror, Wizard"
        
    },
    {
        "name": "Ambush Chute",
        "level": "3rd-level",
        "level_int": "3",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "desc": "You touch a wooden, plaster, or stone surface and create a passage with two trapdoors. The first trapdoor appears where you touch the surface, and the other appears at a point you can see up to 30 feet away. The two trapdoors can be wooden with a metal ring handle, or they can match the surrounding surfaces, each with a small notch for opening the door. The two trapdoors are connected by an extradimensional passage that is up to 5 feet wide, up to 5 feet tall, and up to 30 feet long. The trapdoors don't need to be on the same surface, allowing the passage to connect two separated locations, such as the two sides of a chasm or river. The passage is always straight and level for creatures inside it, and the creatures exit the tunnel in such a way that allows them to maintain the same orientation as when they entered the passage. No more than five creatures can transit the passage at the same time.\n  When the spell ends and the trapdoors disappear, any creatures or objects still in the passage created by the spell are safely ejected to an unoccupied space nearest the end of the passage closest to them.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the length of the passage and the distance you can place the second trapdoor increases by 10 feet for each slot level above 3rd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Sorceror, Warlock, Wizard"
    },
    {
        "name": "Armored Formation",
        "level": "3rd-level",
        "level_int": "3",
        "school": "abjuration",
        "casting_time": "1 bonus action",
        "range": "60 Feet",
        "components": "V,S,M",
        "materials": "a miniature shield carved from wood",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "desc": "You bolster the defenses of those nearby. Choose up to twelve willing creatures in range. When an affected creature is within 5 feet of at least one other affected creature, they create a formation. The formation must be a contiguous grouping of affected creatures, and each affected creature must be within 5 feet of at least one other affected creature within the formation. If the formation ever has less than two affected creatures, it ends, and an affected creature that moves further than 5 feet from other creatures in formation is no longer in that formation. Affected creatures don't have to all be in the same formation, and they can create or end as many formations of various sizes as they want for the duration of the spell. Each creature in a formation gains a bonus depending on how many affected creatures are in that formation.\n  ***Two or More Creatures.*** Each creature gains a +2 bonus to AC.\n  ***Four or More Creatures.*** Each creature gains a +2 bonus to AC, and when it hits with any weapon, it deals an extra 1d6 damage of the weapon's type.\n  ***Six or More Creatures.*** Each creature gains a +3 bonus to AC, and when it hits with any weapon, it deals an extra 2d6 damage of the weapon's type.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Babble",
        "level": "5th-level",
        "level_int": "5",
        "school": "enchantment",
        "sub_school": ["chaos"],
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "desc": "This spell causes the speech of affected creatures to sound like nonsense. Each creature in a 30-foot-radius sphere centered on a point you choose within range must succeed on an Intelligence saving throw when you cast this spell or be affected by it.\n  An affected creature cannot communicate in any spoken language that it knows. When it speaks, the words come out as gibberish. Spells with verbal components cannot be cast. The spell does not affect telepathic communication, nonverbal communication, or sounds emitted by any creature that does not have a spoken language. As an action, a creature under the effect of this spell can attempt another Intelligence saving throw against the effect. On a successful save, the spell ends.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror, Wizard"
    },
    {
        "name": "Bardo",
        "level": "3rd-level",
        "level_int": "3",
        "school": "necromancy",
        "sub_school": ["liminal"],
        "casting_time": "1 reaction, which you take when you see a creature within 30 feet of you die",
        "range": "30 Feet",
        "components": "V,S,M",
        "materials": "a pinch of dirt from a graveyard",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You capture some of the fading life essence of the triggering creature, drawing on the energy of the tenuous moment between life and death. You can then use this essence to immediately harm or help a different creature you can see within range. If you choose to harm, the target must make a Wisdom saving throw. The target takes psychic damage equal to 6d8 + your spellcasting ability modifier on a failed save, or half as much damage on a successful one. If you choose to help, the target regains hit points equal to 3d8 + your spellcasting ability modifier. This spell can't be triggered by the death of a construct or an undead creature, and it can't restore hit points to constructs or undead.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Paladin, Sorceror, Wizard"
    },
    {
        "name": "Battle Mind",
        "level": "5th-level",
        "level_int": "5",
        "school": "divination",
        "sub_school": ["ritual"],
        "casting_time": "1 action",
        "range": "Self",
        "components": "V,S,M",
        "materials": "a bit of spiderweb or a small crystal orb",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "desc": "You gain a preternatural sense of the surrounding area, allowing you insights you can share with comrades to provide them with an edge in combat. You gain advantage on Wisdom (Perception) checks made when determining surprise at the beginning of a combat encounter. If you are not surprised, then neither are your allies. When you are engaged in combat while the spell is active, you can use a bonus action on your turn to produce one of the following effects (allies must be able to see or hear you in order to benefit):\n* One ally gains advantage on its next attack roll, saving throw, or ability check.\n* An enemy has disadvantage on the next attack roll it makes against you or an ally.\n* You divine the location of an invisible or hidden creature and impart that knowledge to any allies who can see or hear you. This knowledge does not negate any advantages the creature has, it only allows your allies to be aware of its location at the time. If the creature moves after being detected, its new location is not imparted to your allies.\n* Three allies who can see and hear you on your turn are given the benefit of a *bless*, *guidance*, or *resistance spell* on their turns; you choose the benefit individually for each ally. An ally must use the benefit on its turn, or the benefit is lost.",
        "ritual": "yes",
        "source": "KP:ToH",
        "class": "Bard, Paladin, Sorceror, Wizard"
    },
    {
        "name": "Beast Within",
        "level": "4th-level",
        "level_int": "4",
        "school": "transmutation",
        "casting_time": "1 round",
        "range": "30 Feet",
        "components": "V,S,M",
        "materials": "fang from a lycanthrope",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "desc": "You imbue a willing creature with a touch of lycanthropy. The target gains a few bestial qualities appropriate to the type of lycanthrope you choose, such as tufts of fur, elongated claws, a fang-lined maw or tusks, and similar features. For the duration, the target has resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks that aren't silvered. In addition, the target has advantage on Wisdom (Perception) checks that rely on hearing or smell. Finally, the creature can use its new claws and jaw or tusks to make unarmed strikes. The claws deal slashing damage equal to 1d4 + the target's Strength modifier on a hit. The bite deals piercing damage equal to 1d6 + the target's Strength modifier on a hit. The target's bite doesn't inflict lycanthropy.",
        "higher_level": "When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each spell slot above 4th.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger, Warlock"
    },
    {
        "name": "Betraying Bauble",
        "level": "2nd-level",
        "level_int": "2",
        "school": "divination",
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S",
        "duration": "24 hours",
        "concentration": "no",
        "desc": "When you cast this spell, you touch a pair of objects. Each object must be small enough to fit in one hand. While holding one of the objects, you can sense the direction to the other object's location.\n  If the paired object is in motion, you know the direction and relative speed of its movement (walking, running, galloping, or similar). When the two objects are within 30 feet of each other, they vibrate faintly unless they are touching. If you aren't holding either item and the spell hasn't ended, you can sense the direction of the closest of the two objects within 1,000 feet of you, and you can sense if it is in motion. If neither object is within 1,000 feet of you, you sense the closest object as soon as you come within 1,000 feet of one of them. If an inch or more of lead blocks a direct path between you and an affected object, you can't sense that object.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Sorceror, Warlock, Wizard"
    },
    {
        "name": "Bloodhound",
        "level": "1st-level",
        "level_int": "1",
        "school": "transmutation",
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S,M",
        "materials": "a drop of ammonia",
        "duration": "8 hours",
        "concentration": "no",
        "desc": "You touch a willing creature to grant it an enhanced sense of smell. For the duration, that creature has advantage on Wisdom (Perception) checks that rely on smell and Wisdom (Survival) checks to follow tracks.",
        "higher_level": "When you cast this spell using a 3rd-level spell slot, you also grant the target blindsight out to a range of 30 feet for the duration.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger, Sorceror, Wizard"
    },
    {
        "name": "Bloodlust",
        "level": "2nd-level",
        "level_int": "2",
        "school": "enchantment",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You imbue a willing creature that you can see within range with vitality and fury. The target gains 1d6 temporary hit points, has advantage on Strength checks, and deals an extra 1d6 damage when it hits with a weapon attack. When the spell ends, the target suffers one level of exhaustion for 1 minute.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Wizard"
    },
    {
        "name": "Blunted Edge",
        "level": "3rd-level",
        "level_int": "3",
        "school": "enchantment",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "Choose a creature that you can see within range. The target must succeed on a Wisdom saving throw or have disadvantage on weapon attack rolls. In addition, when an affected creature rolls damage dice for a successful attack, it must roll the weapon's damage dice twice and use the lower total. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd. The creatures must be within 30 feet of each other when you target them.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Bolster Fortifications",
        "level": "3rd-level",
        "level_int": "3",
        "school": "abjuration",
        "casting_time": "10 minutes",
        "range": "120 Feet",
        "components": "V,S,M",
        "materials": "a piece of metal, stone, or wood",
        "duration": "8 hours",
        "concentration": "no",
        "desc": "You create a ward that bolsters a structure or a collection of structures that occupy up to 2,500 square feet of floor space. The bolstered structures can be up to 20 feet tall and shaped as you desire. You can ward several small buildings in a stronghold by dividing the area among them, as long as you can walk into each contiguous area while you are casting the spell. For the purpose of this spell, “structures” include walls, such as the palisade that might surround a small fort, provided the wall is no more than 20 feet tall.\n  For the duration, each structure you bolstered has a damage threshold of 5. If a structure already has a damage threshold, that threshold increases by 5.\n  This spell protects only the walls, support beams, roofs, and similar that make up the core components of the structure. It doesn't bolster objects within the structures, such as furniture.\n  The protected structure or structures radiate magic. A *dispel magic* cast on a structure removes the bolstering from only that structure. You can create a permanently bolstered structure or collection of structures by casting this spell there every day for one year.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the square feet of floor space you can bolster increases by 500 and the damage threshold increases by 2 for each slot level above 3rd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Wizard"
    },
    {
        "name": "Bombardment of Stings",
        "level": "2nd-level",
        "level_int": "2",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "Self (30-foot cone)",
        "components": "V,S,M",
        "materials": "a handful of bee stingers",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "Each creature in a 30-foot cone must make a Dexterity saving throw. On a failed save, a creature takes 4d6 piercing damage and is poisoned for 1 minute. On a successful save, a creature takes half as much damage and isn't poisoned. At the end of each of its turns, a poisoned target can make a Constitution saving throw. On a success, the condition ends on the target.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger, Sorceror, Wizard"
    },
    {
        "name": "Bound Haze",
        "level": "3rd-level",
        "level_int": "3",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You cause a swirling gyre of dust, small rocks, and wind to encircle a creature you can see within range. The target must succeed on a Dexterity saving throw or have disadvantage on attack rolls and on Wisdom (Perception) checks. At the end of each of its turns, the target can make a Dexterity saving throw. On a success, the spell ends.\n  In addition, if the target is within a cloud or gas, such as the area of a *fog cloud* spell or a dretch's Fetid Cloud, the affected target has disadvantage on this spell's saving throws and on any saving throws associated with being in the cloud or gas, such as the saving throw to reduce the poison damage the target might take from starting its turn in the area of a *cloudkill* spell.",
        "higher_level": "If you cast this spell using a spell slot of 4th level or higher, the duration is 1 minute, and the spell doesn't require concentration.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Sorceror, Warlock, Wizard"
    },
    {
        "name": "Burst Stone",
        "level": "3rd-level",
        "level_int": "3",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You cause the ground at a point you can see within range to explode. The ground must be sand, earth, or unworked rock. Each creature within 10 feet of that point must make a Dexterity saving throw. On a failed save, the creature takes 4d8 bludgeoning damage and is knocked prone. On a successful save, the creature takes half as much damage and isn't knocked prone. The area then becomes difficult terrain with a 5-foot-deep pit centered on the point you chose.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Butterfly Effect",
        "level": "2nd-level",
        "level_int": "2",
        "school": "enchantment",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,M",
        "materials": "a butterfly wing",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You cause a cloud of illusory butterflies to swarm around a target you can see within range. The target must succeed on a Charisma saving throw or be charmed for the duration. While charmed, the target can't take reactions and must roll a d10 at the start of each of its turns to determine its behavior for that turn.\n\n| d10  | Behavior          |\n|------|-------------------|\n| 1    | The creature uses all its movement to move in a random direction. To determine the direction, roll a d8 and assign a direction to each die face. The creature doesn't take an action this turn. |\n| 2-6  | The creature doesn't take an action this turn. |\n| 7-8  | The creature uses its action to make a melee attack against a randomly determined creature within its reach. If there is no creature within its reach, the creature does nothing this turn. |\n| 9-10 | The creature can act and move normally. |\n\nAt the end of each of its turns, and each time it takes damage, the target can make another Charisma saving throw. On a success, the spell ends on the target.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd. The creatures must be within 30 feet of each other when you target them.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Druid, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Calm Beasts",
        "level": "2nd-level",
        "level_int": "2",
        "school": "enchantment",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You attempt to calm aggressive or frightened animals. Each beast in a 20-foot-radius sphere centered on a point you choose within range must make a Charisma saving throw. If a creature fails its saving throw, choose one of the following two effects.\n  ***Suppress Hold.*** You can suppress any effect causing the target to be charmed or frightened. When this spell ends, any suppressed effect resumes, provided that its duration has not expired in the meantime.\n  ***Suppress Hostility.*** You can make a target indifferent about creatures of your choice that it is hostile toward. This indifference ends if the target is attacked or harmed by a spell or if it witnesses any of its allies being harmed. When the spell ends, the creature becomes hostile again, unless the GM rules otherwise.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger"
    },
    {
        "name": "Clear the Board",
        "level": "7th-level",
        "level_int": "7",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V,S,M",
        "materials": "obsidian or ivory chess piece",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You send your allies and your enemies to opposite sides of the battlefield. Pick a cardinal direction. With a shout and a gesture, you and up to five willing friendly creatures within range are teleported up to 90 feet in that direction to spaces you can see. At the same time, up to six hostile creatures within range must make a Wisdom saving throw. On a failed save, the hostile creature is teleported up to 90 feet in the opposite direction of where you teleport yourself and the friendly creatures to spaces you can see. You can't teleport a target into dangerous terrain, such as lava or off the edge of a cliff, and each target must be teleported to an unoccupied space that is on the ground or on a floor.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Wizard"
    },
    {
        "name": "Conjure Construct",
        "level": "6th-level",
        "level_int": "6",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,M",
        "materials": "a small metal figurine",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You summon a construct of challenge rating 5 or lower to harry your foes. It appears in an unoccupied space you can see within range. It disappears when it drops to 0 hit points or when the spell ends.\n  The construct is friendly to you and your companions for the duration. Roll initiative for the construct, which has its own turns. It obeys any verbal commands that you issue to it (no action required by you). If you don't issue any commands to the construct, it defends itself from hostile creatures but otherwise takes no actions.\n  If your concentration is broken, the construct doesn't disappear. Instead, you lose control of the construct, it becomes hostile toward you and your companions, and it might attack. An uncontrolled construct can't be dismissed by you, and it disappears 1 hour after you summoned it.\n  The construct deals double damage to objects and structures.\n  The GM has the construct's statistics.",
        "higher_level": "When you cast this spell using a spell slot of 7th level or higher, the challenge rating increases by 1 for each slot level above 6th.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Wizard"
    },
    {
        "name": "Conjure Spectral Allies",
        "level": "7th-level",
        "level_int": "7",
        "school": "necromancy",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S,M",
        "materials": "a pinch of graveyard dirt",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You sprinkle some graveyard dirt before you and call forth vengeful spirits. The spirits erupt from the ground at a point you choose within range and sweep outward. Each creature in a 30-foot-radius sphere centered on that point must make a Wisdom saving throw. On a failed save, a creature takes 6d10 necrotic damage and becomes frightened for 1 minute. On a successful save, the creature takes half as much damage and isn't frightened.\n  At the end of each of its turns, a creature frightened by this spell can make another saving throw. On a success, this spell ends on the creature.",
        "higher_level": "When you cast this spell using a spell slot of 8th level or higher, the damage increases by 1d10 for each slot level above 7th.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Warlock, Wizard"
    },
    {
        "name": "Convey Inner Peace",
        "level": "5th-level",
        "level_int": "5",
        "school": "transmutation",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S,M",
        "materials": "powdered gemstones worth at least 50 gp, which the spell consumes",
        "duration": "24 hours",
        "concentration": "no",
        "desc": "You imbue yourself and up to five willing creatures within range with the ability to enter a meditative trance like an elf. Once before the spell ends, an affected creature can complete a long rest in 4 hours, meditating as an elf does while in trance. After resting in this way, each creature gains the same benefit it would normally gain from 8 hours of rest.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Druid, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Crown of Thorns",
        "level": "4th-level",
        "level_int": "4",
        "school": "enchantment",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S,M",
        "materials": "a piece of thorned vine",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You create a psychic binding on the mind of a creature within range. Until this spell ends, the creature must make a Charisma saving throw each time it casts a spell. On a failed save, it takes 2d6 psychic damage, and it fails to cast the spell. It doesn't expend a spell slot if it fails to cast the spell.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Damaging Intel",
        "level": "1st-level",
        "level_int": "1",
        "school": "divination",
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V",
        "duration": "1 round",
        "concentration": "no",
        "desc": "You study a creature you can see within range, learning its weaknesses. The creature must make a Charisma saving throw. If it fails, you learn its damage vulnerabilities, damage resistances, and damage immunities, and the next attack one of your allies in range makes against the target before the end of your next turn has advantage.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Warlock"
    },
    {
        "name": "Dead Walking",
        "level": "2nd-level",
        "level_int": "2",
        "school": "illusion",
        "casting_time": "1 action",
        "range": "10 Feet",
        "components": "V,S,M",
        "materials": "a copper piece",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "desc": "As part of the casting of this spell, you place a copper piece under your tongue. This spell makes up to six willing creatures you can see within range invisible to undead for the duration. Anything a target is wearing or carrying is invisible as long as it is on the target's person. The spell ends for all targets if one target attacks or casts a spell.",
        "higher_level": "When you cast this spell using a 3rd-level spell slot, it lasts for 1 hour without requiring your concentration. When you cast this spell using a spell slot of 4th level or higher, the duration increases by 1 hour for each slot level above 3rd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Ranger, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Deadly Salvo",
        "level": "5th-level",
        "level_int": "5",
        "school": "transmutation",
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V,S,M",
        "materials": "five firearm paper cartridges",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "When you cast this spell, the ammunition flies from your hand with a loud bang, targeting up to five creatures or objects you can see within range. You can launch the bullets at one target or several. Make a ranged spell attack for each bullet. On a hit, the target takes 3d6 piercing damage. This damage can experience a burst, as described in the gunpowder weapon property (see the Adventuring Gear chapter), but this spell counts as a single effect for the purposes of determining how many times the damage can burst, regardless of the number of targets affected.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Sorceror, Wizard"
    },
    {
        "name": "Devouring Darkness",
        "level": "9th-level",
        "level_int": "9",
        "school": "evocation",
        "sub_school": ["liminal"],
        "casting_time": "1 action",
        "range": "300 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "Terrifying and nightmarish monsters exist within the unknown void of the in-between. Choose up to six points you can see within range. Voidlike, magical darkness spreads from each point to fill a 10-footradius sphere for the duration. The darkness spreads around corners. A creature with darkvision can't see through this darkness, and no light, magical or nonmagical, can illuminate it.\n  Each creature inside a sphere when this spell is cast must make a Dexterity saving throw. On a failed save, the creature takes 6d10 piercing damage and 5d6 psychic damage and is restrained until it breaks free as unseen entities bite and tear at it from the Void. Once a successful save, the creature takes half as much damage and isn't restrained. A restrained creature can use its action to make a Strength check against your spell save DC. If it succeeds, it is no longer restrained.\n  When a creature enters a sphere for the first time on a turn or starts its turn in a sphere, that creature must make an Intelligence saving throw. The creature takes 5d6 psychic damage on a failed save, or half as much damage on a successful one.\n  Once created, the spheres can't be moved. A creature in overlapping spheres doesn't suffer additional effects for being in more than one sphere at a time.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Sorceror, Wizard"
    },
    {
        "name": "Dimensional Shove",
        "level": "3rd-level",
        "level_int": "3",
        "school": "conjuration",
        "sub_school": ["labyrinth"],
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "This spell pushes a creature you touch through a dimensional portal, causing it to disappear and then reappear a short distance away. If the target fails a Wisdom saving throw, it disappears from its current location and reappears 30 feet away from you in a direction of your choice. This travel can take it through walls, creatures, or other solid surfaces, but the target can't reappear inside a solid object or not on solid ground; instead, it reappears in the nearest safe, unoccupied space along the path of travel.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the target is shoved an additional 30 feet for each slot level above 3rd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Warlock, Wizard"
    },
    {
        "name": "Divine Retribution",
        "level": "1st-level",
        "level_int": "1",
        "school": "evocation",
        "casting_time": "1 reaction, which you take when a weapon attack reduces you to 0 hit points",
        "range": "Self",
        "components": "V",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "With a last word before you fall unconscious, this spell inflicts radiant damage to your attacker equal to 1d8 + the amount of damage you took from the triggering attack. If the attacker is a fiend or undead, it takes an extra 1d8 radiant damage. The creature then must succeed on a Constitution saving throw or become stunned for 1 minute. At the end of each of its turns, the creature can make another Constitution saving throw. On a successful save, it is no longer stunned.",
        "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Paladin"
    },
    {
        "name": "Door of the Far Traveler",
        "level": "8th-level",
        "level_int": "8",
        "school": "conjuration",
        "sub_school": ["liminal"],
        "casting_time": "10 minutes plus 1 hour of attunement",
        "range": "10 Feet",
        "components": "V,S,M",
        "materials": "a piece of chalk and a brass, pewter, or iron doorknob",
        "duration": "6 hours",
        "concentration": "no",
        "desc": "You conjure a door to the destination of your choice that lasts for the duration or until dispelled. You sketch the outline of the door with chalk on any hard surface (a wall, a cliffside, the deck of a ship, etc.) and scribe sigils of power around its outline. The doorway must be at least 1 foot wide by 2 feet tall and can be no larger than 5 feet wide by 10 feet tall. Once the door is drawn, place the knob appropriately; it attaches magically to the surface and your drawing becomes a real door to the spell's destination. The doorway remains functional for the spell's duration. During that time, anyone can open or close the door and pass through it in either direction.\n  The destination can be on any plane of existence. It must be familiar to you, and your level of familiarity with it determines the accuracy of the spell (determined by the GM). If it's a place you've visited, you can expect 100 percent accuracy. If it's been described to you by someone who was there, you might arrive in the wrong room or even the wrong structure, depending on how detailed their description was. If you've only heard about the destination third-hand, you may end up in a similar structure that's in a very different locale.\n  *Door of the far traveler* doesn't create a doorway at the destination. It connects to an existing, working door. It can't, for example, take you to an open field or a forest with no structures (unless someone built a doorframe with a door in that spot for this specific purpose!). While the spell is in effect, the pre-existing doorway connects only to the area you occupied while casting the spell. If you connected to an existing doorway between a home's parlor and library, for example, and your door leads into the library, then people can still walk through that doorway from the parlor into the library normally. Anyone trying to go the other direction, however, arrives wherever you came from instead of in the parlor.\n  Before casting the spell, you must spend one hour etching magical symbols onto the doorknob that will serve as the spell's material component to attune it to your desired destination. Once prepared, the knob remains attuned to that destination until it's used or you spend another hour attuning it to a different location.\n  *The door of the far traveler* is dispelled if you remove the knob from the door. You can do this as a bonus action from either side of the door, provided it's shut. If the spell's duration expires naturally, the knob falls to the ground on whichever side of the door you're on. Once the spell ends, the knob loses its attunement to any location and another hour must be spent attuning it before it can be used again.",
        "higher_level": "If you cast this spell using a 9thlevel slot, the duration increases to 12 hours.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Druid, Wizard"
    },
    {
        "name": "Dreamwine",
        "level": "4th-level",
        "level_int": "4",
        "school": "divination",
        "sub_school": ["ritual"],
        "casting_time": "1 minute",
        "range": "30 Feet",
        "components": "V,S,M",
        "materials": "a bottle of elvish wine worth at least 25 gp, which the spell consumes",
        "duration": "1 hour",
        "concentration": "no",
        "desc": "You imbue a bottle of wine with fey magic. While casting this spell, you and up to seven other creatures can drink the imbued wine. At the completion of the casting, each creature that drank the wine can see invisible creatures and objects as if they were visible, can see into the Ethereal plane, and has advantage on Charisma checks and saving throws for the duration. Ethereal creatures and objects appear ghostly and translucent.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Wizard"
    },
    {
        "name": "Emerald Eyes",
        "level": "3rd-level",
        "level_int": "3",
        "school": "enchantment",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S,M",
        "materials": "emerald worth at least 25 gp",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You attempt to convince a creature to enter a paranoid, murderous rage. Choose a creature that you can see within range. The target must succeed on a Wisdom saving throw or be convinced those around it intend to steal anything and everything it possesses, from its position of employment, to the affections of its loved ones, to its monetary wealth and possessions, no matter how trusted those nearby might be or how ludicrous such a theft might seem. While affected by this spell, the target must use its action to attack the nearest creature other than itself or you. If the target starts its turn with no other creature near enough to move to and attack, the target can make another Wisdom saving throw. On a success, the target's head clears momentarily and it can act freely that turn. If the target starts its turn a second time with no other creature near enough to move to and attack, it can make another Wisdom saving throw. On a success, the spell ends on the target.\n  Each time the target takes damage, it can make another Wisdom saving throw. On a success, the spell ends on the target.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd. The creatures must be within 30 feet of each other when you target them.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Sorceror, Warlock, Wizard"
    },
    {
        "name": "Enchanted Bloom",
        "level": "5th-level",
        "level_int": "5",
        "school": "enchantment",
        "casting_time": "1 hour",
        "range": "Touch",
        "components": "V,S,M",
        "materials": "a rose cut within the past 24 hours and ritual oils worth 100 gp, which the spell consumes",
        "duration": "24 hours",
        "concentration": "no",
        "desc": "You spend an hour anointing a rose with scented oils and imbuing it with fey magic. The first creature other than you that touches the rose before the spell ends pricks itself on the thorns and must make a Charisma saving throw. On a failed save, the creature falls into a deep slumber for 24 hours, and it can be awoken only by the greater restoration spell or similar magic or if you choose to end the spell as an action. While slumbering, the creature doesn't need to eat or drink, and it doesn't age.\n  Each time the creature takes damage, it makes a new Charisma saving throw. On a success, the spell ends on the creature.",
        "higher_level": "When you cast this spell using a spell slot of a higher level, the duration of the slumber increases to 7 days with a 6th-level slot, to 30 days with a 7th-level slot, to 180 days with an 8th-level slot, and to a year with a 9th-level spell slot.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Druid, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Eruption",
        "level": "9th-level",
        "level_int": "9",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You create a furiously erupting volcano centered on a point you can see within range. The ground heaves violently as a cinder cone that is 2 feet wide and 5 feet tall bursts up from it. Each creature within 30 feet of the cinder cone when it appears must make a Strength saving throw. On a failed save, a creature takes 8d6 bludgeoning damage and is knocked prone. On a successful save, a creature takes half as much damage and isn't knocked prone.\n  Each round you maintain concentration on this spell, the cinder cone produces additional effects on your turn.\n  ***Round 2.*** Smoke pours from the cinder cone. Each creature within 10 feet of the cinder cone when the smoke appears takes 4d6 poison damage. Afterwards, each creature that enters the smoky area for the first time on a turn or starts its turn there takes 2d6 poison damage. The smoke spreads around corners, and its area is heavily obscured. A wind of moderate or greater speed (at least 10 miles per hour) disperses the smoke until the start of your next turn, when the smoke reforms.\n  ***Round 3.*** Lava bubbles out from the cinder cone, spreading out to cover the ground within 20 feet of the cinder cone. Each creature and object in the area when the lava appears takes 10d10 fire damage and is on fire. Afterwards, each creature that enters the lava for the first time on a turn or starts its turn there takes 5d10 fire damage. In addition, the smoke spreads to fill a 20-foot-radius sphere centered on the cinder cone.\n  ***Round 4.*** The lava continues spreading and covers the ground within 30 feet of the cinder cone in lava that is 1-foot-deep. The lava-covered ground becomes difficult terrain. In addition, the smoke fills a 30-footradius sphere centered on the cinder cone.\n  ***Round 5.*** The lava expands to cover the ground within 40 feet of the cinder cone, and the smoke fills a 40-foot radius sphere centered on the cinder cone. In addition, the cinder cone begins spewing hot rocks. Choose up to three creatures within 90 feet of the cinder cone. Each target must succeed on a Dexterity saving throw or take 3d6 bludgeoning damage and 3d6 fire damage.\n  ***Rounds 6-10.*** The lava and smoke continue to expand in size by 10 feet each round. In addition, each round you can direct the cinder cone to spew hot rocks at three targets, as described in Round 5.\n  When the spell ends, the volcano ceases erupting, but the smoke and lava remain for 1 minute before cooling and dispersing. The landscape is permanently altered by the spell.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Wizard"
    },
    {
        "name": "Ethereal Stairs",
        "level": "5th-level",
        "level_int": "5",
        "school": "conjuration",
        "sub_school": ["liminal"],
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You create a staircase out of the nothingness of the air. A shimmering staircase 10 feet wide appears and remains for the duration. The staircase ascends at a 45-degree angle to a point as much as 60 feet above the ground. The staircase consists only of steps with no apparent support, unless you choose to have it resemble a stone or wooden structure. Even then, its magical nature is obvious, as it has no color and is translucent, and only the steps have solidity; the rest of it is no more solid than air. The staircase can support up to 10 tons of weight. It can be straight, spiral, or switchback. Its bottom must connect to solid ground, but its top need not connect to anything.",
        "higher_level": "When you cast this spell using a spell slot of 6th level or higher, the staircase extends an additional 20 feet for each slot level above 5th.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Wizard"
    },
    {
        "name": "Feint",
        "level": "1st-level",
        "level_int": "1",
        "school": "illusion",
        "casting_time": "1 bonus action",
        "range": "30 Feet",
        "components": "V",
        "duration": "1 round",
        "concentration": "no",
        "desc": "You create a momentary, flickering duplicate of yourself just as you make an attack against a creature. You have advantage on the next attack roll you make against the target before the end of your next turn as it's distracted by your illusory copy.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Paladin, Warlock, Wizard"
    },
    {
        "name": "Fey Food",
        "level": "3rd-level",
        "level_int": "3",
        "school": "enchantment",
        "casting_time": "10 minutes",
        "range": "10 Feet",
        "components": "V,S,M",
        "materials": "a spoonful of honey",
        "duration": "8 hours",
        "concentration": "no",
        "desc": "You enchant up to 1 pound of food or 1 gallon of drink within range with fey magic. Choose one of the effects below. For the duration, any creature that consumes the enchanted food or drink, up to four creatures per pound of food or gallon of drink, must succeed on a Charisma saving throw or succumb to the chosen effect.\n  ***Slumber.*** The creature falls asleep and is unconscious for 1 hour. This effect ends for a creature if the creature takes damage or someone uses an action to wake it.\n  ***Friendly Face.*** The creature is charmed by you for 1 hour. If you or your allies do anything harmful to it, the creature can make another Charisma saving throw. On a success, the spell ends on the creature.\n  ***Muddled Memory.*** The creature remembers only fragments of the events of the past hour. A remove curse or greater restoration spell cast on the creature restores the creature's memory.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, you can enchant an additional pound of food or gallon of drink for each slot level over 3rd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Sorceror, Warlock, Wizard"
    },
    {
        "name": "Fey-Touched Blade",
        "level": "2nd-level",
        "level_int": "2",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S",
        "materials": "",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "desc": "You touch a nonmagical weapon and imbue it with the magic of the fey. Choose one of the following damage types: force, psychic, necrotic, or radiant. Until the spell ends, the weapon becomes a magic weapon and deals an extra 1d4 damage of the chosen type to any target it hits.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can imbue one additional weapon for each slot level above 2nd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror"
    },
    {
        "name": "Forced Reposition",
        "level": "4th-level",
        "level_int": "4",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "One creature of your choice that you can see within range is teleported to an unoccupied space you can see up to 60 feet above you. The space can be open air or a balcony, ledge, or other surface above you. An unwilling creature that succeeds on a Constitution saving throw is unaffected. A creature teleported to open air immediately falls, taking falling damage as normal, unless it can fly or it has some other method of catching itself or preventing a fall. A creature can't be teleported into a solid object.",
        "higher_level": "If you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The targets must be within 30 feet of each other when you target them, but they don't need to be teleported to the same locations.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Frenzied Bolt",
        "level": "2nd-level",
        "level_int": "2",
        "school": "evocation",
        "sub_school": ["chaos"],
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You direct a bolt of rainbow colors toward a creature of your choice within range. If the bolt hits, the target takes 3d8 damage, of a type determined by rolling on the Random Damage Type table. If your attack roll (not the adjusted result) was odd, the bolt leaps to a new target of your choice within range that has not already been targeted by frenzied bolt, requiring a new spell attack roll to hit. The bolt continues leaping to new targets until you roll an even number on your spell attack roll, miss a target, or run out of potential targets. You and your allies are legal targets for this spell if you are particularly lucky—or unlucky.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you create an additional bolt for each slot level above 2nd. Each potential target can be hit only once by each casting of the spell, not once per bolt.\n \n **Random Damage Type** \n \n| d10  | Damage Type | \n|--------------|---------| \n| 1          | Acid  | \n| 2          | Cold  | \n| 3          | Fire  | \n| 4          | Force  | \n| 5          | Lightning  | \n| 6          | Necrotic  | \n| 7          | Poision  | \n| 8          | Psychic | \n| 9          | Radiant | \n| 10         | Thunder  | \n \n",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror, Wizard"
    },
    {
        "name": "Furious Wail",
        "level": "9th-level",
        "level_int": "9",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You let out a scream of white-hot fury that pierces the minds of up to five creatures within range. Each target must make a Charisma saving throw. On a failed save, it takes 10d10 + 30 psychic damage and is stunned until the end of its next turn. On a success, it takes half as much damage.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Druid, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Fuse Armor",
        "level": "2nd-level",
        "level_int": "2",
        "school": "evocation",
        "casting_time": "1 bonus action",
        "range": "30 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "Choose a manufactured metal object with movable parts, such as a drawbridge pulley or winch or a suit of heavy or medium metal armor, that you can see within range. You cause the object's moveable parts to fuse together for the duration. The object's movable aspects can't be moved: a pulley's wheel won't turn and the joints of armor won't bend.\n  A creature wearing armor affected by this spell has its speed reduced by 10 feet and has disadvantage on weapon attacks and ability checks that use Strength or Dexterity. At the end of each of its turns, the creature wearing the armor can make a Strength saving throw. On a success, the spell ends on the armor.\n  A creature in physical contact with an affected object that isn't a suit of armor can use its action to make a Strength check against your spell save DC. On a success, the spell ends on the object.\n  If you target a construct with this spell, it must succeed on a Strength saving throw or have its speed reduced by 10 feet and have disadvantage on weapon attacks. At the end of each of its turns, the construct can make another Strength saving throw. On a success, the spell ends on the construct.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional object for each slot level above 2nd. The objects must be within 30 feet of each other when you target them.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Gale",
        "level": "6th-level",
        "level_int": "6",
        "school": "conjuration",
        "casting_time": "1 minute",
        "range": "1 mile",
        "components": "V,S,M",
        "materials": "a bit of driftwood",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You summon a storm to batter your oncoming enemies. Until the spell ends, freezing rain and turbulent winds fill a 20-foot-tall cylinder with a 300- foot radius centered on a point you choose within range. You must be outdoors to cast this spell. Moving to a place where you don't have a clear path to the sky ends the spell early.\n  The spell's area is heavily obscured, and exposed flames in the area are doused. The ground in the area becomes slick, difficult terrain, and a flying creature in the area must land at the end of its turn or fall. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a Constitution saving throw as the wind and rain assail it. On a failed save, the creature takes 1d6 cold damage.\n  If a creature is concentrating in the spell's area, the creature must make a successful Constitution saving throw against your spell save DC or lose concentration.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Wizard"
    },
    {
        "name": "Gird the Spirit",
        "level": "1st-level",
        "level_int": "1",
        "school": "abjuration",
        "casting_time": "1 reaction, which you take when you or a creature within 30 feet of you is hit by an attack from an undead creature",
        "range": "30 Feet",
        "components": "V,S",
        "duration": "1 minute",
        "concentration": "no",
        "desc": "Your magic protects the target creature from the lifesapping energies of the undead. For the duration, the target has immunity to effects from undead creatures that reduce its ability scores, such as a shadow's Strength Drain, or its hit point maximum, such as a specter's Life Drain. This spell doesn't prevent damage from those attacks; it prevents only the reduction in ability score or hit point maximum.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Druid, Paladin"
    },
    {
        "name": "Glare",
        "level": "1st-level",
        "level_int": "1",
        "school": "enchantment",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You cast a disdainful glare at up to two creatures you can see within range. Each target must succeed on a Wisdom saving throw or take no actions on its next turn as it reassesses its life choices. If a creature fails the saving throw by 5 or more, it can't take actions on its next two turns.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror, Warlock"
    },
    {
        "name": "Glyph of Shifting",
        "level": "2nd-level",
        "level_int": "2",
        "school": "conjuration",
        "casting_time": "10 minutes",
        "range": "Touch",
        "components": "V,S,M",
        "materials": "powdered diamond worth at least 50 gp, which the spell consumes",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You create a hidden glyph by tracing it on a surface or object that you touch. When you cast the spell, you can also choose a location that's known to you, within 5 miles, and on the same plane of existence, to serve as the destination for the glyph's shifting effect.\n  The glyph is triggered when it's touched by a creature that's not aware of its presence. The triggering creature must make a successful Wisdom saving throw or be teleported to the glyph's destination. If no destination was set, the creature takes 4d4 force damage and is knocked prone.\n  The glyph disappears after being triggered or when the spell's duration expires.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, its duration increases by 24 hours and the maximum distance to the destination increases by 5 miles for each slot level above 2nd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Wizard"
    },
    {
        "name": "Going in Circles",
        "level": "3rd-level",
        "level_int": "3",
        "school": "illusion",
        "casting_time": "10 minutes",
        "range": "Sight",
        "components": "V,S,M",
        "materials": "a piece of the target terrain",
        "duration": "24 hours",
        "concentration": "no",
        "desc": "You make natural terrain in a 1-mile cube difficult to traverse. A creature in the affected area has disadvantage on Wisdom (Survival) checks to follow tracks or travel safely through the area as paths through the terrain seem to twist and turn nonsensically. The terrain itself isn't changed, only the perception of those inside it. A creature who succeeds on two Wisdom (Survival) checks while within the terrain discerns the illusion for what it is and sees the illusory twists and turns superimposed on the terrain. A creature that reenters the area after exiting it before the spell ends is affected by the spell even if it previously succeeded in traversing the terrain. A creature with truesight can see through the illusion and is unaffected by the spell. A creature that casts find the path automatically succeeds in discovering a way out of the terrain.\n  When you cast this spell, you can designate a password. A creature that speaks the password as it enters the area automatically sees the illusion and is unaffected by the spell.\n  If you cast this spell on the same spot every day for one year, the illusion lasts until it is dispelled.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Harry",
        "level": "4th-level",
        "level_int": "4",
        "school": "enchantment",
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V,S,M",
        "materials": "bit of fur from a game animal",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You instill an irresistible sense of insecurity and terror in the target. The target must make a Wisdom saving throw. On a failed save, the target has disadvantage on Dexterity (Stealth) checks to avoid your notice and is frightened of you while you are within its line of sight. While you are within 1 mile of the target, you have advantage on Wisdom (Survival) checks to track the target, and the target can't take a long rest, terrified you are just around the corner. The target can repeat the saving throw once every 10 minutes, ending the spell on a success.\n  On a successful save, the target isn't affected, and you can't use this spell against it again for 24 hours.",
        "higher_level": "When you cast this spell with a 6th-level spell slot, the duration is concentration, up to 8 hours and the target can repeat the saving throw once each hour. When you use a spell slot of 8th level or higher, the duration is concentration, up to 24 hours, and the target can repeat the saving throw every 8 hours.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Druid, Ranger, Sorceror, Wizard"
    },
    {
        "name": "Harrying Hounds",
        "level": "5th-level",
        "level_int": "5",
        "school": "enchantment",
        "casting_time": "1 action",
        "range": "180 Feet",
        "components": "V,S,M",
        "materials": "tuft of fur from a hunting dog",
        "duration": "8 hours",
        "concentration": "no",
        "desc": "When you cast this spell, choose a direction (north, south, northeast, or the like). Each creature in a 20-foot-radius sphere centered on a point you choose within range must succeed on a Wisdom saving throw when you cast this spell or be affected by it. When an affected creature travels, it travels at a fast pace in the opposite direction of the direction you chose as it believes a pack of dogs or wolves follows it from the chosen direction.\n  When an affected creature isn't traveling, it is frightened of your chosen direction. The affected creature occasionally hears howls or sees glowing eyes in the darkness at the edge of its vision in that direction. An affected creature will not stop at a destination, instead pacing half-circles around the destination until the effect ends, terrified the pack will overcome it if it stops moving.\n  An affected creature can make a Wisdom saving throw at the end of each 4-hour period, ending the effect on itself on a success. An affected creature moves along the safest available route unless it has nowhere to move, such as if it arrives at the edge of a cliff. When an affected creature can't safely move in the opposite direction of your chosen direction, it cowers in place, defending itself from hostile creatures but otherwise taking no actions. In such circumstances, the affected creature can repeat the saving throw every minute, ending the effect on itself on a success. The spell's effect is suspended when an affected creature is engaged in combat, allowing it to move as necessary to face hostile creatures.",
        "higher_level": "When you cast this spell using a spell slot of 6th level or higher, the duration increases by 4 hours for each slot level above 5th. If an affected creature travels for more than 8 hours, it risks exhaustion as if on a forced march.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Heart to Heart",
        "level": "1st-level",
        "level_int": "1",
        "school": "necromancy",
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S,M",
        "materials": "a drop of your blood",
        "duration": "1 hour",
        "concentration": "no",
        "desc": "For the duration, you and the creature you touch remain stable and unconscious if reduced to 0 hit points while the other has 1 or more hit points. If you touch a dying creature, it becomes stable but remains unconscious while it has 0 hit points. If both of you are reduced to 0 hit points, you must both make death saving throws, as normal. If you or the target regain hit points, either of you can choose to split those hit points between the two of you if both of you are within 60 feet of each other.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Paladin, Sorceror, Wizard"
    },
    {
        "name": "Heart-Seeking Arrow",
        "level": "4th-level",
        "level_int": "4",
        "school": "transmutation",
        "casting_time": "1 bonus action",
        "range": "Self",
        "components": "V",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "The next time you make a ranged weapon attack during the spell's duration, the weapon's ammunition—or the weapon itself if it's a thrown weapon—seeks its target's vital organs. Make the attack roll as normal. On a hit, the weapon deals an extra 6d6 damage of the same type dealt by the weapon, or half as much damage on a miss as it streaks unerringly toward its target. If this attack reduces the target to 0 hit points, the target has disadvantage on its next death saving throw, and, if it dies, it can be restored to life only by means of a true resurrection or a wish spell. This spell has no effect on undead or constructs.",
        "higher_level": "When you cast this spell using a spell slot of 5th level or higher, the extra damage on a hit increases by 1d6 for each slot level above 4th.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Ranger"
    },
    {
        "name": "High Ground",
        "level": "3rd-level",
        "level_int": "3",
        "school": "transmutation",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "With a word, you gesture across an area and cause the terrain to rise up into a 10-foot-tall hillock at a point you choose within range. You must be outdoors to cast this spell. The hillock is up to 30 feet long and up to 15 feet wide, and it must be in a line. If the hillock cuts through a creature's space when it appears, the creature is pushed to one side of the hillock or to the top of the hillock (your choice). The ranged attack distance for a creature on top of the hillock is doubled, provided the target is at a lower elevation than the creature on the hillock. At the GM's discretion, creatures on top of the hillock gain any additional bonuses or penalties that higher elevation might provide, such as advantage on attacks against those on lower elevations, being easier to spot, longer sight distance, or similar.\n  The steep sides of the hillock are difficult to climb. A creature at the bottom of the hillock that attempts to move up to the top must succeed on a Strength (Athletics) or Dexterity (Acrobatics) check against your spell save DC to climb to the top of the hillock.\n  This spell can't manipulate stone construction, and rocks and structures shift to accommodate the hillock. If the hillock's formation would make a structure unstable, the hillock fails to form in the structure's spaces. Similarly, this spell doesn't directly affect plant growth. The hillock carries any plants along with it.",
        "higher_level": "When you cast this spell at 4th level or higher, you can increase the width of the hillock by 5 feet or the length by 10 feet for each slot above 3rd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Sorceror, Wizard"
    },
    {
        "name": "Hunter's Endurance",
        "level": "1st-level",
        "level_int": "1",
        "school": "enchantment",
        "casting_time": "1 minute",
        "range": "Self",
        "components": "V,S,M",
        "materials": "a fingernail, lock of hair, bit of fur, or drop of blood from the target, if unfamiliar",
        "duration": "24 hours",
        "concentration": "no",
        "desc": "You call on the land to sustain you as you hunt your quarry. Describe or name a creature that is familiar to you. If you aren't familiar with the target creature, you must use a fingernail, lock of hair, bit of fur, or drop of blood from it as a material component to target that creature with this spell. Until the spell ends, you have advantage on all Wisdom (Perception) and Wisdom (Survival) checks to find and track the target, and you must actively pursue the target as if under a geas. In addition, you don't suffer from exhaustion levels you gain from pursuing your quarry, such as from lack of rest or environmental hazards between you and the target, while the spell is active. When the spell ends, you suffer from all levels of exhaustion that were suspended by the spell. The spell ends only after 24 hours, when the target is dead, when the target is on a different plane, or when the target is restrained in your line of sight.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Ranger, Warlock"
    },
    {
        "name": "Hunting Stand",
        "level": "4th-level",
        "level_int": "4",
        "school": "conjuration",
        "casting_time": "1 minute",
        "range": "120 Feet",
        "components": "V,S,M",
        "materials": "a crude model of the stand",
        "duration": "8 hours",
        "concentration": "no",
        "desc": "You make a camouflaged shelter nestled in the branches of a tree or among a collection of stones. The shelter is a 10-foot cube centered on a point within range. It can hold as many as nine Medium or smaller creatures. The atmosphere inside the shelter is comfortable and dry, regardless of the weather outside. The shelter's camouflage provides a modicum of concealment to its inhabitants; a creature outside the shelter has disadvantage on Wisdom (Perception) and Intelligence (Investigation) checks to detect or locate a creature within the shelter.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger"
    },
    {
        "name": "Hypnagogia",
        "level": "4th-level",
        "level_int": "4",
        "school": "enchantment",
        "sub_school": ["liminal"],
        "casting_time": "1 action",
        "range": "90 Feet",
        "components": "S,M",
        "materials": "a pinch of goose down",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You alter the mental state of one creature you can see within range. The target must make an Intelligence saving throw. If it fails, choose one of the following effects. At the end of each of its turns, the target can make another Intelligence saving throw. On a success, the spell ends on the target. A creature with an Intelligence score of 4 or less isn't affected by this spell.\n  ***Sleep Paralysis.*** Overwhelming heaviness and fatigue overcome the creature, slowing it. The creature's speed is halved, and it has disadvantage on weapon attacks.\n  ***Phantasmata.*** The creature imagines vivid and terrifying hallucinations centered on a point of your choice within range. For the duration, the creature is frightened, and it must take the Dash action and move away from the point you chose by the safest available route on each of its turns, unless there is nowhere to move.\n  ***False Awakening.*** The creature enters a trancelike state of consciousness in which it's not fully aware of its surroundings. It can't take reactions, and it must roll a d4 at the beginning of its turn to determine its behavior. Each time the target takes damage, it makes a new Intelligence saving throw. On a success, the spell ends on the target.\n\n| d4  | Behavior  | \n|-----|-----------| \n| 1   | The creature takes the Dash action and uses all of its movement to move in a random direction. To determine the direction, roll a d8 and assign a direction to each die face.  | \n| 2   | The creature uses its action to pantomime preparing for its day: brushing teeth and hair, bathing, eating, or similar activity.  | \n| 3   | The creature moves up to its speed toward a randomly determined creature and uses its action to make one melee attack against that creature. If there is no creature within range, the creature does nothing this turn. | \n| 4   | The creature does nothing this turn. |",
        "higher_level": "When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Druid, Wizard"
    },
    {
        "name": "Hypnic Jerk",
        "level": "Cantrip",
        "level_int": "0",
        "school": "illusion",
        "sub_school": ["liminal"],
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "Strange things happen in the mind and body in that moment between waking and sleeping. One of the most common is being startled awake by a sudden feeling of falling. With a snap of your fingers, you trigger that sensation in a creature you can see within range. The target must succeed on a Wisdom saving throw or take 1d6 force damage. If the target fails the saving throw by 5 or more, it drops one object it is holding. A dropped object lands in the creature's space.\n  The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Wizard"
    },
    {
        "name": "Ill-Fated Word",
        "level": "1st-level",
        "level_int": "1",
        "school": "divination",
        "sub_school": ["chaos"],
        "casting_time": "1 reaction, which you take when an enemy makes an attack roll, ability check, or saving throw",
        "range": "30 Feet",
        "components": "V",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You call out a distracting epithet to a creature, worsening its chance to succeed at whatever it's doing. Roll a d4 and subtract the number rolled from an attack roll, ability check, or saving throw that the target has just made; the target uses the lowered result to determine the outcome of its roll.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror, Wizard"
    },
    {
        "name": "Illuminate Spoor",
        "level": "1st-level",
        "level_int": "1",
        "school": "divination",
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S,M",
        "materials": "a firefly",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "desc": "You touch a set of tracks created by a single creature. That set of tracks and all other tracks made by the same creature give off a faint glow. You and up to three creatures you designate when you cast this spell can see the glow. A creature that can see the glow automatically succeeds on Wisdom (Survival) checks to track that creature. If the tracks are covered by obscuring objects such as leaves or mud, you and the creatures you designate have advantage on Wisdom (Survival) checks to follow the tracks.\n  If the creature leaving the tracks changes its tracks, such as by adding or removing footwear, the glow stops where the tracks change. Until the spell ends, you can use an action to touch and illuminate a new set of tracks.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the duration is concentration, up to 8 hours. When you use a spell slot of 5th level or higher, the duration is concentration, up to 24 hours.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger"
    },
    {
        "name": "Immolating Gibbet",
        "level": "7th-level",
        "level_int": "7",
        "school": "transmutation",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S,M",
        "materials": "a small loop of burnt rope",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You cause up to three creatures you can see within range to be yanked into the air where their blood turns to fire, burning them from within. Each target must succeed on a Dexterity saving throw or be magically pulled up to 60 into the air. The creature is restrained there until the spell ends. A restrained creature must make a Constitution saving throw at the start of each of its turns. The creature takes 7d6 fire damage on a failed save, or half as much damage on a successful one.\n  At the end of each of its turns, a restrained creature can make another Dexterity saving throw. On a success, the spell ends on the creature, and the creature falls to the ground, taking falling damage as normal. Alternatively, the restrained creature or someone else who can reach it can use an action to make an Intelligence (Arcana) check against your spell save DC. On a success, the restrained effect ends, and the creature falls to the ground, taking falling damage as normal.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Warlock, Wizard"
    },
    {
        "name": "Inexorable Summons",
        "level": "3rd-level",
        "level_int": "3",
        "school": "transmutation",
        "casting_time": "1 bonus action",
        "range": "30 Feet",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You reach out toward a creature and call to it. The target teleports to an unoccupied space that you can see within 5 feet of you. An unwilling creature can make a Wisdom saving throw, and if it succeeds, it isn't affected by this spell. You can't teleport a target into dangerous terrain, such as lava, and the target must be teleported to a space on the ground or on a floor.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Inspiring Speech",
        "level": "4th-level",
        "level_int": "4",
        "school": "enchantment",
        "casting_time": "10 minutes",
        "range": "60 Feet",
        "components": "V",
        "duration": "1 hour",
        "concentration": "no",
        "desc": "The verbal component of this spell is a 10-minute-long, rousing speech. At the end of the speech, all your allies within the affected area who heard the speech gain a +1 bonus on attack rolls and advantage on saving throws for 1 hour against effects that cause the charmed or frightened condition. Additionally, each recipient gains temporary hit points equal to your spellcasting ability modifier. If you move farther than 1 mile from your allies or you die, this spell ends. A character can be affected by only one casting of this spell at a time; subsequent, overlapping castings have no additional effect and don't extend the spell's duration.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Paladin"
    },
    {
        "name": "Instant Armored Vehicle",
        "level": "6th-level",
        "level_int": "6",
        "school": "transmutation",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S,M",
        "materials": "a diamond, metal scraps, and screws worth a combined value of at least 1,000 gp, which the spell consumes",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You transform a handful of materials into a Huge armored vehicle. The vehicle can take whatever form you want, but it has AC 18 and 100 hit points. If it is reduced to 0 hit points, it is destroyed. If it is a ground vehicle, it has a speed of 90 feet. If it is an airborne vehicle, it has a flying speed of 45 feet. If it is a waterborne vehicle, it has a speed of 2 miles per hour. The vehicle can hold up to four Medium creatures within it.\n  A creature inside it has three-quarters cover from attacks outside the vehicle, which contains arrow slits, portholes, and other small openings. A creature piloting the armored vehicle can take the Careen action. To do so, the vehicle must move at least 10 feet in a straight line and enter or pass through the space of at least one Large or smaller creature. This movement doesn't provoke opportunity attacks. Each creature in the armored vehicle's path must make a Dexterity saving throw against your spell save DC. On a failed save, the creature takes 5d8 bludgeoning damage and is knocked prone. On a successful save, the creature can choose to be pushed 5 feet away from the space through which the vehicle passed. A creature that chooses not to be pushed suffers the consequences of a failed saving throw. If the creature piloting the armored vehicle isn't proficient in land, water, or air vehicles (whichever is appropriate for the vehicle's type), each target has advantage on the saving throw against the Careen action.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Wizard"
    },
    {
        "name": "Instant Snare",
        "level": "2nd-level",
        "level_int": "2",
        "school": "abjuration",
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V,S,M",
        "materials": "a loop of twine",
        "duration": "24 hours",
        "concentration": "no",
        "desc": "You create a snare on a point you can see within range. You can leave the snare as a magical trap, or you can use your reaction to trigger the trap when a Large or smaller creature you can see moves within 10 feet of the snare. If you leave the snare as a trap, a creature must succeed on an Intelligence (Investigation) or Wisdom (Perception) check against your spell save DC to find the trap.\n  When a Large or smaller creature moves within 5 feet of the snare, the trap triggers. The creature must succeed on a Dexterity saving throw or be magically pulled into the air. The creature is restrained and hangs upside down 5 feet above the snare's location for 1 minute. A restrained creature can repeat the saving throw at the end of each of its turns, escaping the snare on a success. Alternatively, a creature, including the restrained target, can use its action to make an Intelligence (Arcana) check against your spell save DC. On a success, the restrained creature is freed, and the snare resets itself 1 minute later. If the creature succeeds on the check by 5 or more, the snare is destroyed instead.\n  This spell alerts you with a ping in your mind when the trap is triggered if you are within 1 mile of the snare. This ping awakens you if you are sleeping.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can create one additional snare for each slot level above 3rd. When you receive the mental ping that a trap was triggered, you know which snare was triggered if you have more than one.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Ranger"
    },
    {
        "name": "Invested Champion",
        "level": "3rd-level",
        "level_int": "3",
        "school": "evocation",
        "sub_school": ["ritual"],
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S,M",
        "materials": "a vial of holy water",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "desc": "You touch one creature and choose either to become its champion, or for it to become yours. If you choose a creature to become your champion, it fights on your behalf. While this spell is in effect, you can cast any spell with a range of touch on your champion as if the spell had a range of 60 feet. Your champion's attacks are considered magical, and you can use a bonus action on your turn to encourage your champion, granting it advantage on its next attack roll.\n  If you become the champion of another creature, you gain advantage on all attack rolls against creatures that have attacked your charge within the last round. If you are wielding a shield, and a creature within 5 feet of you attacks your charge, you can use your reaction to impose disadvantage on the attack roll, as if you had the Protection fighting style. If you already have the Protection fighting style, then in addition to imposing disadvantage, you can also push an enemy 5 feet in any direction away from your charge when you take your reaction. You can use a bonus action on your turn to reroll the damage for any successful attack against a creature that is threatening your charge.\n  Whichever version of the spell is cast, if the distance between the champion and its designated ally increases to more than 60 feet, the spell ends.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Paladin"
    },
    {
        "name": "Iron Gut",
        "level": "3rd-level",
        "level_int": "3",
        "school": "transmutation",
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S,M",
        "materials": "a bezoar",
        "duration": "Up to 1 hour",
        "concentration": "no",
        "desc": "For the duration, one willing creature you touch has resistance to poison damage and advantage on saving throws against poison. When the affected creature makes a Constitution saving throw against an effect that deals poison damage or that would cause the creature to become poisoned, the creature can choose to succeed on the saving throw. If it does so, the spell ends on the creature.\n  While affected by this spell, a creature can't gain any benefit from consuming magical foodstuffs, such as those produced by the goodberry and heroes' feast spells, and it doesn't suffer ill effects from consuming potentially harmful, nonmagical foodstuffs, such as spoiled food or non-potable water. The creature is affected normally by other consumable magic items, such as potions. The creature can identify poisoned food by a sour taste, with deadlier poisons tasting more sour.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Sorceror, Wizard"
    },
    {
        "name": "Jagged Forcelance",
        "level": "3rd-level",
        "level_int": "3",
        "school": "transmutation",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S,M",
        "materials": "a strand of gold wire",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You create a magical tether of pulsing, golden force between two willing creatures you can see within range. The two creatures must be within 15 feet of each other. The tether remains as long as each tethered creature ends its turn within 15 feet of the other tethered creature. If a tethered creature ends its turn more than 15 feet away from its tethered partner, the spell ends. Though the tether appears as a thin line, its effect extends the full height of the tethered creatures and can affect prone or hovering creatures, provided the hovering creature hovers no higher than the tallest tethered creature.\n  Any creature that touches the tether or ends its turn in a space the tether passes through must make a Strength saving throw. On a failure, a creature takes 3d6 force damage and is knocked prone. On a success, a creature takes half as much damage and isn't knocked prone. A creature that makes this saving throw, whether it succeeds or fails, can't be affected by the tether again until the start of your next turn.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the maximum distance between the tethered creatures increases by 5 feet, and the damage increases by 1d6 for each slot level above 3rd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Jarring Growl",
        "level": "1st-level",
        "level_int": "1",
        "school": "enchantment",
        "casting_time": "1 bonus action",
        "range": "Self",
        "components": "V",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You loose a growl from deep within the pit of your stomach, causing others who can hear it to become unnerved. You have advantage on Charisma (Intimidation) checks you make before the beginning of your next turn. In addition, each creature within 5 feet of you must make a Wisdom saving throw. On a failure, you have advantage on attack rolls against that creature until the end of your turn. You are aware of which creatures failed their saving throws.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Ranger, Warlock"
    },
    {
        "name": "Killing Fields",
        "level": "5th-level",
        "level_int": "5",
        "school": "transmutation",
        "casting_time": "10 minutes",
        "range": "300 Feet",
        "components": "V,S,M",
        "materials": "a game animal, which must be sacrificed as part of casting the spell",
        "duration": "24 hours",
        "concentration": "no",
        "desc": "You invoke primal spirits of nature to transform natural terrain in a 100-foot cube in range into a private hunting preserve. The area can't include manufactured structures and if such a structure exists in the area, the spell ends.\n  While you are conscious and within the area, you are aware of the presence and direction, though not exact location, of each beast and monstrosity with an Intelligence of 3 or lower in the area. When a beast or monstrosity with an Intelligence of 3 or lower tries to leave the area, it must make a Wisdom saving throw. On a failure, it is disoriented, uncertain of its surroundings or direction, and remains within the area for 1 hour. On a success, it leaves the area.\n  When you cast this spell, you can specify individuals that are helped by the area's effects. All other creatures in the area are hindered by the area's effects. You can also specify a password that, when spoken aloud, gives the speaker the benefits of being helped by the area's effects.\n  *Killing fields* creates the following effects within the area.\n   ***Pack Hunters.*** A helped creature has advantage on attack rolls against a hindered creature if at least one helped ally is within 5 feet of the hindered creature and the helped ally isn't incapacitated. Slaying. Once per turn, when a helped creature hits with any weapon, the weapon deals an extra 1d6 damage of its type to a hindered creature. Tracking. A helped creature has advantage on Wisdom (Survival) and Dexterity (Stealth) checks against a hindered creature.\n  You can create a permanent killing field by casting this spell in the same location every day for one year. Structures built in the area after the killing field is permanent don't end the spell.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Ranger"
    },
    {
        "name": "Lance",
        "level": "2nd-level",
        "level_int": "2",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You create a shimmering lance of force and hurl it toward a creature you can see within range. Make a ranged spell attack against the target. On a hit, the target takes 5d6 force damage, and it is restrained by the lance until the end of its next turn.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Paladin, Wizard"
    },
    {
        "name": "Lay to Rest",
        "level": "5th-level",
        "level_int": "5",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "Self (15-foot-radius sphere)",
        "components": "V,S,M",
        "materials": "a pinch of grave dirt",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "A pulse of searing light rushes out from you. Each undead creature within 15 feet of you must make a Constitution saving throw. A target takes 8d6 radiant damage on a failed save, or half as much damage on a successful one.\n  An undead creature reduced to 0 hit points by this spell disintegrates in a burst of radiant motes, leaving anything it was wearing or carrying in a space it formerly occupied.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Paladin"
    },
    {
        "name": "Less Fool, I",
        "level": "1st-level",
        "level_int": "1",
        "school": "divination",
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "desc": "A creature you touch becomes less susceptible to lies and magical influence. For the duration, other creatures have disadvantage on Charisma checks to influence the protected creature, and the creature has advantage on spells that cause it to become charmed or frightened.",
        "higher_level": "If you cast this spell using a spell slot of 3rd level or higher, the duration is concentration, up to 1 hour. If you use a spell slot of 5th level or higher, the duration is 8 hours. If you use a spell slot of 7th level or higher, the duration is 24 hours. If you use a 9th level spell slot, the duration is 1 year. Using a spell slot of 5th level or higher grants a duration that doesn't require concentration.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric"
    },
    {
        "name": "Life Burst",
        "level": "5th-level",
        "level_int": "5",
        "school": "evocation",
        "casting_time": "1 reaction, which you take when you are reduced to 0 hit points",
        "range": "Self (30-foot radius)",
        "components": "V",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You make a jubilant shout when you cast this spell, releasing your stores of divine energy in a wave of healing. You distribute the remaining power of your Lay on Hands to allies within 30 feet of you, restoring hit points and curing diseases and poisons. This healing energy removes diseases and poisons first (starting with the nearest ally), removing 5 hit points from the hit point total for each disease or poison cured, until all the points are spent or all diseases and poisons are cured. If any hit points remain, you regain hit points equal to that amount.\n  This spell expends all of the healing energy in your Lay on Hands, which replenishes, as normal, when you finish a long rest.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Paladin"
    },
    {
        "name": "Life from Death",
        "level": "3rd-level",
        "level_int": "3",
        "school": "necromancy",
        "casting_time": "1 action",
        "range": "Self",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "Your touch can siphon energy from undead to heal your wounds. Make a melee spell attack against an undead creature within your reach. On a hit, the target takes 2d6 radiant damage, and you or an ally within 30 feet of you regains hit points equal to half the amount of radiant damage dealt. If used on an ally, this effect can restore the ally to no more than half of the ally's hit point maximum. This effect can't heal an undead or a construct. Until the spell ends, you can make the attack again on each of your turns as an action.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Paladin"
    },
    {
        "name": "Lightless Torch",
        "level": "1st-level",
        "level_int": "1",
        "school": "transmutation",
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S",
        "duration": "1 hour",
        "concentration": "no",
        "desc": "You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds a shadowy miasma in a 30-foot radius. A creature with darkvision inside the radius sees the area as if it were filled with bright light. The miasma doesn't shed light, and a creature with darkvision inside the radius can still see outside the radius as normal. A creature with darkvision outside the radius or a creature without darkvision sees only that the object is surrounded by wisps of shadow.\n  Completely covering the affected object with an opaque object, such as a bowl or a helm, blocks the effect. Though the effect doesn't shed light, it can be dispelled if the area of a darkness spell overlaps the area of this spell.\n  If you target an object held or worn by a hostile creature, that creature must succeed on a Dexterity saving throw to avoid the spell.",
        "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, the duration increases by 2 hours for each slot level above 1st.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Litany of Sure Hands",
        "level": "1st-level",
        "level_int": "1",
        "school": "divination",
        "casting_time": "1 bonus action",
        "range": "30 Feet",
        "components": "V,S",
        "duration": "1 minute",
        "concentration": "no",
        "desc": "This spell allows a creature within range to quickly perform a simple task (other than attacking or casting a spell) as a bonus action on its turn. Examples include finding an item in a backpack, drinking a potion, and pulling a rope. Other actions may also fall into this category, depending on the GM's ruling. The target also ignores the loading property of weapons.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Paladin"
    },
    {
        "name": "Long Game",
        "level": "7th-level",
        "level_int": "7",
        "school": "enchantment",
        "casting_time": "1 minute",
        "range": "30 Feet",
        "components": "V",
        "duration": "7 days",
        "concentration": "no",
        "desc": "While casting this spell, you must engage your target in conversation. At the completion of the casting, the target must make a Charisma saving throw. If it fails, you place a latent magical effect in the target's mind for the duration. If the target succeeds on the saving throw, it realizes that you used magic to affect its mind and might become hostile toward you, at the GM's discretion.\n  Once before the spell ends, you can use an action to trigger the magical effect in the target's mind, provided you are on the same plane of existence as the target. When the effect is triggered, the target takes 5d8 psychic damage plus an extra 1d8 psychic damage for every 24 hours that has passed since you cast the spell, up to a total of 12d8 psychic damage. The spell has no effect on the target if it ends before you trigger the magical effect.\n  *A greater restoration* or *wish* spell cast on the target ends the spell early. You know if the spell is ended early, provided you are on the same plane of existence as the target.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Magma Spray",
        "level": "2nd-level",
        "level_int": "2",
        "school": "transmutation",
        "sub_school": ["apocalypse"],
        "casting_time": "1 action",
        "range": "40 Feet",
        "components": "V,S,M",
        "materials": "a pinch of sulfur or a piece of brimstone",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "A 5-foot-diameter, 5-foot-tall cylindrical fountain of magma erupts from the ground in a space of your choice within range. A creature in that space takes 3d8 fire damage, or half as much damage with a successful Dexterity saving throw. A creature that enters the area on its turn or ends its turn there also takes 3d8 fire damage, or half as much damage with a successful Dexterity saving throw. A creature can take this damage only once per turn.\n  A creature killed by this spell is reduced to ash.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Maim",
        "level": "5th-level",
        "level_int": "5",
        "school": "necromancy",
        "casting_time": "1 action",
        "range": "Self",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "Your hands become claws bathed in necrotic energy. Make a melee spell attack against a creature you can reach. On a hit, the target takes 4d6 necrotic damage and a section of its body of your choosing withers:\n   ***Upper Limb.*** The target has disadvantage on Strength checks, and, if it has the Multiattack action, it has disadvantage on its first attack roll each round.\n   ***Lower Limb.*** The target's speed is reduced by 10 feet, and it has disadvantage on Dexterity checks.\n   ***Body.*** Choose one damage type: bludgeoning, piercing, or slashing. The target loses its resistance to that damage type. If the target doesn't have resistance to the chosen damage type, it is vulnerable to that damage type instead.\n  The effect is permanent until removed by *remove curse*, *greater restoration*, or similar magic.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Druid, Sorceror, Wizard"
    },
    {
        "name": "Mantle of the Brave",
        "level": "2nd-level",
        "level_int": "2",
        "school": "abjuration",
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S",
        "duration": "1 hour",
        "concentration": "no",
        "desc": "You touch up to four individuals, bolstering their courage. The next time a creature affected by this spell must make a saving throw against a spell or effect that would cause the frightened condition, it has advantage on the roll. Once a creature has received this benefit, the spell ends for that creature.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Paladin"
    },
    {
        "name": "Mark Prey",
        "level": "2nd-level",
        "level_int": "2",
        "school": "divination",
        "casting_time": "1 bonus action",
        "range": "120 Feet",
        "components": "V",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "desc": "You choose a creature you can see within range as your prey. Until the spell ends, you have advantage on Wisdom (Perception) and Wisdom (Survival) checks to find or track your prey. In addition, the target is outlined in light that only you can see. Any attack roll you make against your prey has advantage if you can see it, and your prey can't benefit from being invisible against you. If the target drops to 0 hit points before this spell ends, you can use a bonus action on a subsequent turn to mark a new target as your prey.",
        "higher_level": "When you cast this spell using a spell slot of 4th level, you can maintain your concentration on the spell for up to 8 hours. When you use a spell slot of 5th level or higher, you can maintain your concentration on the spell for up to 24 hours.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger"
    },
    {
        "name": "Martyr's Rally",
        "level": "3rd-level",
        "level_int": "3",
        "school": "enchantment",
        "casting_time": "1 reaction, which you take when you are reduced to 0 hit points",
        "range": "Self (60-foot radius)",
        "components": "V",
        "duration": "1 minute",
        "concentration": "no",
        "desc": "With a hopeful rallying cry just as you fall unconscious, you rouse your allies to action. Each ally within 60 feet of you that can see and hear you has advantage on attack rolls for the duration. If you regain hit points, the spell immediately ends.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Paladin"
    },
    {
        "name": "Mass Faerie Fire",
        "level": "4th-level",
        "level_int": "4",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "90 Feet",
        "components": "V",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You can place up to three 20-foot cubes each centered on a point you can see within range. Each object in a cube is outlined in blue, green, or violet light (your choice). Any creature in a cube when the spell is cast is also outlined in light if it fails a Dexterity saving throw. A creature in the area of more than one cube is affected only once. Each affected object and creature sheds dim light in a 10-foot radius for the duration.\n  Any attack roll against an affected object or creature has advantage if the attacker can see it, and the affected creature or object can't benefit from being invisible.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Druid"
    },
    {
        "name": "Mind Maze",
        "level": "6th-level",
        "level_int": "6",
        "school": "evocation",
        "sub_school": ["liminal"],
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S,M",
        "materials": "a shard of silvered glass",
        "duration": "Up to 1 minute",
        "concentration": "no",
        "desc": "Choose a creature you can see within range. It must succeed on an Intelligence saving throw or be mentally trapped in an imagined maze of mirrors for the duration. While trapped in this way, the creature is incapacitated, but it imagines itself alone and wandering through the maze. Externally, it appears dazed as it turns in place and reaches out at nonexistent barriers. Each time the target takes damage, it makes another Intelligence saving throw. On a success, the spell ends.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Wizard"
    },
    {
        "name": "Mirror Realm",
        "level": "7th-level",
        "level_int": "7",
        "school": "conjuration",
        "sub_school": ["ritual","liminal"],
        "casting_time": "1 action",
        "range": "90 Feet",
        "components": "S,M",
        "materials": "framed mirror at least 5 feet tall",
        "duration": "24 hours",
        "concentration": "no",
        "desc": "You transform a mirror into a magical doorway to an extradimensional realm. You and any creatures you designate when you cast the spell can move through the doorway into the realm beyond. For the spell's duration, the mirror remains anchored in the plane of origin, where it can't be broken or otherwise damaged by any mundane means. No creatures other than those you designate can pass through the mirror or see into the mirror realm.\n  The realm within the mirror is an exact reflection of the location you left. The temperature is comfortable, and any environmental threats (lava, poisonous gas, or similar) are inert, harmless facsimiles of the real thing. Likewise, magic items reflected in the mirror realm have no magical properties, but those carried into it work normally. Food, drink, and other beneficial items within the mirror realm (reflections of originals in the real world) function as normal, real items; food can be eaten, wine can be drunk, and so on. Only items that were reflected in the mirror at the moment the spell was cast exist inside the mirror realm. Items placed in front of the mirror afterward don't appear in the mirror realm, and creatures never do unless they are allowed in by you. Items found in the mirror realm dissolve into nothingness when they leave it, but the effects of food and drink remain.\n  Sound passes through the mirror in both directions. Creatures in the mirror realm can see what's happening in the world, but creatures in the world see only what the mirror reflects. Objects can cross the mirror boundary only while worn or carried by a creature, and spells can't cross it at all. You can't stand in the mirror realm and shoot arrows or cast spells at targets in the world or vice versa.\n  The boundaries of the mirror realm are the same as the room or location in the plane of origin, but the mirror realm can't exceed 50,000 square feet (for simplicity, imagine 50 cubes, each cube being 10 feet on a side). If the original space is larger than this, such as an open field or a forest, the boundary is demarcated with an impenetrable, gray fog.\n  Any creature still inside the mirror realm when the spell ends is expelled through the mirror into the nearest empty space.\n  If this spell is cast in the same spot every day for a year, it becomes permanent. Once permanent, the mirror can't be moved or destroyed through mundane means. You can allow new creatures into the mirror realm (and disallow previous creatures) by recasting the spell within range of the permanent mirror. Casting the spell elsewhere doesn't affect the creation or the existence of a permanent mirror realm; a determined spellcaster could have multiple permanent mirror realms to use as storage spaces, hiding spots, and spy vantages.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror, Wizard"
    },
    {
        "name": "Misdirection",
        "level": "1st-level",
        "level_int": "1",
        "school": "illusion",
        "casting_time": "1 reaction, which you take when you see a creature within 30 feet of you make an attack",
        "range": "30 Feet",
        "components": "S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You create a brief flash of light, loud sound, or other distraction that interrupts a creature's attack. When a creature you can see within range makes an attack, you can impose disadvantage on its attack roll.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Wizard"
    },
    {
        "name": "Mud",
        "level": "2nd-level",
        "level_int": "2",
        "school": "transmutation",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S,M",
        "materials": "a dollop of mud",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "The ground in a 20-foot radius centered on a point within range becomes thick, viscous mud. The area becomes difficult terrain for the duration. When a creature enters the affected area for the first time on a turn or starts its turn there, the creature must make a Strength saving throw. On a failed save, its movement speed is reduced to 0 until the start of its next turn.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Wizard"
    },
    {
        "name": "Muted Foe",
        "level": "1st-level",
        "level_int": "1",
        "school": "abjuration",
        "casting_time": "1 bonus action",
        "range": "Touch",
        "components": "V,S",
        "duration": "1 minute",
        "concentration": "no",
        "desc": "You touch a nonmagical weapon. The next time a creature hits with the affected weapon before the spell ends, the weapon booms with a thunderous peal as the weapon strikes. The attack deals an extra 1d6 thunder damage to the target, and the target becomes deafened, immune to thunder damage, and unable to cast spells with verbal components for 1 minute. At the end of each of its turns, the target can make a Wisdom saving throw. On a success, the effect ends.",
        "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, the extra damage increases by 1d6 for each slot level above 1st.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Never Surrender",
        "level": "3rd-level",
        "level_int": "3",
        "school": "abjuration",
        "casting_time": "1 reaction, which you take when you or a creature within 60 feet of you drops to 0 hit points.",
        "range": "60 Feet",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "When the target is reduced to 0 hit points, it can fight looming death to stay in the fight. The target doesn't fall unconscious but must still make death saving throws, as normal. The target doesn't need to make a death saving throw until the end of its next turn, but it has disadvantage on that first death saving throw. In addition, massive damage required to kill the target outright must equal or exceed twice the target's hit point maximum instead. If the target regains 1 or more hit points, this spell ends.",
        "higher_level": "If you cast this spell using a spell slot of 6th level or higher, the target doesn't have disadvantage on its first death saving throw.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Paladin, Ranger"
    },
    {
        "name": "Oathbound Implement",
        "level": "3rd-level",
        "level_int": "3",
        "school": "enchantment",
        "sub_school": ["ritual"],
        "casting_time": "1 minute",
        "range": "30 Feet",
        "components": "V",
        "duration": "10 days",
        "concentration": "no",
        "desc": "You place a magical oath upon a creature you can see within range, compelling it to complete a specific task or service that involves using a weapon as you decide. If the creature can understand you, it must succeed on a Wisdom saving throw or become bound by the task. When acting to complete the directed task, the target has advantage on the first attack roll it makes on each of its turns using a weapon. If the target attempts to use a weapon for a purpose other than completing the specific task or service, it has disadvantage on attack rolls with a weapon and must roll the weapon's damage dice twice, using the lower total.\n  Completing the task ends the spell early. Should you issue a suicidal task, the spell ends. You can end the spell early by using an action to dismiss it. A *remove curse*, *greater restoration*, or *wish* spell also ends it.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric"
    },
    {
        "name": "Outmaneuver",
        "level": "1st-level",
        "level_int": "1",
        "school": "enchantment",
        "casting_time": "1 reaction, which you take when a creature within 30 feet of you provokes an opportunity attack",
        "range": "30 Feet",
        "components": "S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "When a creature provokes an opportunity attack from an ally you can see within range, you can force the creature to make a Wisdom saving throw. On a failed save, the creature's movement is reduced to 0, and you can move up to your speed toward the creature without provoking opportunity attacks. This spell doesn't interrupt your ally's opportunity attack, which happens before the effects of this spell.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Paladin, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Oversized Paws",
        "level": "2nd-level",
        "level_int": "2",
        "school": "transmutation",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S,M",
        "materials": "claw or talon from a bear or other large animal",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "Until this spell ends, the hands and feet of one willing creature within range become oversized and more powerful. For the duration, the creature adds 1d4 to damage it deals with its unarmed strike.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each spell slot above 2nd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger"
    },
    {
        "name": "Pierce the Veil",
        "level": "5th-level",
        "level_int": "5",
        "school": "divination",
        "sub_school": ["ritual","liminal"],
        "casting_time": "1 minute",
        "range": "30 Feet",
        "components": "V,S,M",
        "materials": "a few inches of rope from a crossroads gallows",
        "duration": "10 minutes",
        "concentration": "no",
        "desc": "By sketching a shimmering, ethereal doorway in the air and knocking three times, you call forth an otherworldly entity to provide insight or advice. The door swings open and the entity, wreathed in shadow or otherwise obscured, appears at the threshold. It answers up to five questions truthfully and to the best of its ability, but its answers aren't necessarily clear or direct. The entity can't pass through the doorway or interact with anything on your side of the doorway other than by speaking its responses.\n  Likewise, creatures on your side of the doorway can't pass through it to the other side or interact with the other side in any way other than asking questions. In addition, the spell allows you and the creature to understand each other's words even if you have no language in common, the same as if you were both under the effects of the comprehend languages spell.\n  When you cast this spell, you must request a specific, named entity, a specific type of creature, or a creature from a specific plane of existence. The target creature can't be native to the plane you are on when you cast the spell. After making this request, make an ability check using your spellcasting ability. The DC is 12 if you request a creature from a specific plane; 16 if you request a specific type of creature; or 20 if you request a specific entity. (The GM can choose to make this check for you secretly.) If the spellcasting check fails, the creature that responds to your summons is any entity of the GM's choosing, from any plane. No matter what, the creature is always of a type with an Intelligence of at least 8 and the ability to speak and to hear.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Paladin, Warlock, Wizard"
    },
    {
        "name": "Pincer",
        "level": "6th-level",
        "level_int": "6",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You force your enemies into a tight spot. Choose two points you can see within range. The points must be at least 30 feet apart from each other. Each point then emits a thunderous boom in a 30-foot cone in the direction of the other point. The boom is audible out to 300 feet.\n  Each creature within a cone must make a Constitution saving throw. On a failed save, a creature takes 5d10 thunder damage and is pushed up to 10 feet away from the point that emitted the cone. On a successful save, the creature takes half as much damage and isn't pushed. Objects that aren't being worn or carried within each cone are automatically pushed.",
        "higher_level": "When you cast this spell using a spell slot of 7th level or higher, the damage increases by 1d10 for each slot level above 6th.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Wizard"
    },
    {
        "name": "Piper's Lure",
        "level": "3rd-level",
        "level_int": "3",
        "school": "enchantment",
        "casting_time": "1 minute",
        "range": "Touch",
        "components": "V,S,M",
        "materials": "a pipe or horn",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "desc": "You touch a nonmagical pipe or horn instrument and imbue it with magic that lures creatures toward it. Each creature that enters or starts its turn within 150 feet of the affected object must succeed on a Wisdom saving throw or be charmed for 10 minutes. A creature charmed by this spell must take the Dash action and move toward the affected object by the safest available route on each of its turns. Once a charmed creature moves within 5 feet of the object, it is also incapacitated as it stares at the object and sways in place to a mesmerizing tune only it can hear. If the object is moved, the charmed creature attempts to follow it.\n  For every 10 minutes that elapse, the creature can make a new Wisdom saving throw. On a success, the spell ends on that creature. If a charmed creature is attacked, the spell ends immediately on that creature. Once a creature has been charmed by this spell, it can't be charmed by it again for 24 hours.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Ranger, Sorceror, Wizard"
    },
    {
        "name": "Portal Jaunt",
        "level": "3rd-level",
        "level_int": "3",
        "school": "conjuration",
        "sub_school": ["ritual"],
        "casting_time": "1 action",
        "range": "300 Feet",
        "components": "V,S,M",
        "materials": "a small brass key",
        "duration": "1 round",
        "concentration": "no",
        "desc": "You touch a specially prepared key to a door or gate, turning it into a one-way portal to another such door within range. This spell works with any crafted door, doorway, archway, or any other artificial opening, but not natural or accidental openings such as cave entrances or cracks in walls. You must be aware of your destination or be able to see it from where you cast the spell.\n  On completing the spell, the touched door opens, revealing a shimmering image of the location beyond the destination door. You can move through the door, emerging instantly out of the destination door. You can also allow one other willing creature to pass through the portal instead. Anything you carry moves through the door with you, including other creatures, willing or unwilling.\n  For the purpose of this spell, any locks, bars, or magical effects such as arcane lock are ineffectual for the spell's duration. You can travel only to a side of the door you can see or have physically visited in the past (divinations such as clairvoyance count as seeing). Once you or a willing creature passes through, both doors shut, ending the spell. If you or another creature does not move through the portal within 1 round, the spell ends.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the range increases by 100 feet and the duration increases by 1 round for each slot level above 3rd. Each round added to the duration allows one additional creature to move through the portal before the spell ends.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Sorceror, Wizard"
    },
    {
        "name": "Portal Trap",
        "level": "2nd-level",
        "level_int": "2",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You create a magical portal on a surface in an unoccupied space you can see within range. The portal occupies up to 5 square feet of the surface and is instantly covered with an illusion. The illusion looks like the surrounding terrain or surface features, such as mortared stone if the portal is placed on a stone wall, or a simple image of your choice like those created by the *minor illusion* spell. A creature that touches, steps on, or otherwise interacts with or enters the portal must succeed on a Wisdom saving throw or be teleported to an unoccupied space up to 30 feet away in a random direction. To determine the direction, roll a d8 and assign a direction to each die face. The creature can't be teleported into a solid object.\n  Physical interaction with the illusion reveals it to be an illusion, but such touching triggers the portal's effect. A creature that uses an action to examine the area where the portal is located can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can create one additional portal for each slot level above 2nd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Power Word Fling",
        "level": "3rd-level",
        "level_int": "3",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You mutter a word of power that causes a creature you can see within range to be flung vertically or horizontally. The creature must succeed on a Strength saving throw or be thrown up to 15 feet vertically or horizontally. If the target impacts a surface, such as a ceiling or wall, it stops moving and takes 3d6 bludgeoning damage. If the target was thrown vertically, it plummets to the ground, taking falling damage as normal, unless it has a flying speed or other method of preventing a fall. If the target impacts a creature, the target stops moving and takes 3d6 bludgeoning damage, and the creature the target hits must succeed on a Strength saving throw or be knocked prone. After the target is thrown horizontally or it falls from being thrown vertically, regardless of whether it impacted a surface, it is knocked prone.\n  As a bonus action on each of your subsequent turns, you can attempt to fling the same creature again. The target must succeed on another Strength saving throw or be thrown.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the distance you can fling the target increases by 5 feet, and the damage from impacting a surface or creature increases by 1d6 for each slot level above 3rd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Sorceror, Warlock, Wizard"
    },
    {
        "name": "Power Word Rend",
        "level": "4th-level",
        "level_int": "4",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "90 Feet",
        "components": "V",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You speak a word of power that causes the internal organs of a creature you can see within range to rupture. The target must make a Constitution saving throw. It takes 4d6 + 20 force damage on a failed save, or half as much damage on a successful one. If the target is below half its hit point maximum, it has disadvantage on this saving throw. This spell has no effect on creatures without vital internal organs, such as constructs, oozes, and undead.",
        "higher_level": "When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Protection from the Void",
        "level": "1st-level",
        "level_int": "1",
        "school": "abjuration",
        "sub_school": ["Void"],
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S,M",
        "materials": "a small bar of silver worth 15 sp, which the spell consumes",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "desc": "Until the spell ends, one willing creature you touch has resistance to necrotic and psychic damage and has advantage on saving throws against Void spells.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Wizard"
    },
    {
        "name": "Reaper's Knell",
        "level": "4th-level",
        "level_int": "4",
        "school": "necromancy",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S,M",
        "materials": "a silver bell",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "As the bell rings, a burst of necrotic energy ripples out in a 20-foot-radius sphere from a point you can see within range. Each creature in that area must make a Wisdom saving throw. On a failed save, the creature is marked with necrotic energy for the duration. If a marked creature is reduced to 0 hit points or dies before the spell ends, you regain hit points equal to 2d8 + your spellcasting ability modifier. Alternatively, you can choose for one ally you can see within range to regain the hit points instead.",
        "higher_level": "When you cast this spell using a spell slot of 5th level or higher, the healing increases by 1d8 for each slot level above 4th.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Rebounding Bolt",
        "level": "3rd-level",
        "level_int": "3",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,M",
        "materials": "a miniature arrow)",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You fire a vibrant blue beam of energy at a creature you can see within range. The beam then bounces to a creature of your choice within 30 feet of the target, losing some of its vibrancy and continuing to bounce to other creatures of your choice until it sputters out. Each subsequent target must be within 30 feet of the target affected before it, and the beam can't bounce to a target it has already affected.\n  Each target must make a Constitution saving throw. The first target takes 5d6 force damage on a failed save, or half as much damage on a successful one. The beam loses some of its power then bounces to the second target. The beam deals 1d6 force damage less (4d6, then 3d6, then 2d6, then 1d6) to each subsequent target with the final target taking 1d6 force damage on a failed save, or half as much damage on a successful one.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd. This increase allows the beam to jump an additional time, reducing the damage it deals by 1d6 with each bounce as normal.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Wizard"
    },
    {
        "name": "Reciprocating Portal",
        "level": "3rd-level",
        "level_int": "3",
        "school": "conjuration",
        "sub_school": ["liminal"],
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "With a gesture and a muttered word, you cause an inky black, circular portal to open on the ground beneath one or more creatures. You can create one 15-foot-diameter portal, two 10-foot-diameter portals, or six 5-foot-diameter portals. A creature that's standing where you create a portal must make a Dexterity saving throw. On a failed save, the creature falls through the portal, disappears into a demiplane where it is stunned as it falls endlessly, and the portal closes.\n  At the start of your next turn, the creatures that failed their saving throws fall through matching portals directly above their previous locations. A falling creature lands prone in the space it once occupied or the nearest unoccupied space and takes falling damage as if it fell 60 feet, regardless of the distance between the exit portal and the ground. Flying and levitating creatures can't be affected by this spell.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Warlock, Wizard"
    },
    {
        "name": "Reposition",
        "level": "4th-level",
        "level_int": "4",
        "school": "conjuration",
        "casting_time": "1 bonus action",
        "range": "30 Feet",
        "components": "V",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You designate up to three friendly creatures (one of which can be yourself) within range. Each target teleports to an unoccupied space of its choosing that it can see within 30 feet of itself.",
        "higher_level": "When you cast this spell using a spell slot of 5th level or higher, the spell targets one additional friendly creature for each slot level above 4th.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Repulsing Wall",
        "level": "4th-level",
        "level_int": "4",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V,S,M",
        "materials": "a snail shell",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You create a shimmering wall of light on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is translucent, and creatures have disadvantage on Wisdom (Perception) checks to look through the wall.\n  One side of the wall, selected by you when you cast this spell, deals 5d8 radiant damage when a creature enters the wall for the first time on a turn or ends its turn there. A creature attempting to pass through the wall must make a Strength saving throw. On a failed save, a creature is pushed 10 feet away from the wall and falls prone. A creature that is undead, a fiend, or vulnerable to radiant damage has disadvantage on this saving throw. The other side of the wall deals no damage and doesn't restrict movement through it.",
        "higher_level": "When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d8 for each slot level above 4th.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Paladin, Warlock, Wizard"
    },
    {
        "name": "Reset",
        "level": "4th-level",
        "level_int": "4",
        "school": "transmutation",
        "sub_school": ["temporal"],
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "Choose up to four creatures within range. If a target is your ally, it can reroll initiative, keeping whichever of the two results it prefers. If a target is your enemy, it must make a successful Wisdom saving throw or reroll initiative, keeping whichever of the two results you prefer. Changes to the initiative order go into effect at the start of the next round.",
        "higher_level": "When you cast this spell using a spell slot of 5th level or higher, you can affect one additional creature for each slot level above 4th.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Druid, Paladin, Wizard"
    },
    {
        "name": "Retribution",
        "level": "1st-level",
        "level_int": "1",
        "school": "abjuration",
        "casting_time": "1 action",
        "range": "Self",
        "components": "V",
        "duration": "1 hour",
        "concentration": "no",
        "desc": "You wrap yourself in shimmering ethereal armor. The next time a creature hits you with a melee attack, it takes force damage equal to half the damage it dealt to you, and it must make a Strength saving throw. On a failed save, the creature is pushed up to 5 feet away from you. Then the spell ends.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Wizard"
    },
    {
        "name": "Rive",
        "level": "4th-level",
        "level_int": "4",
        "school": "evocation",
        "sub_school": ["liminal"],
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "S,M",
        "materials": "a strand of gossamer",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You pull on the filaments of transition and possibility to tear at your enemies. Choose a creature you can see within range and make a ranged spell attack. On a hit, the target takes 5d8 cold damage as strands of icy nothingness whip from your outstretched hand to envelop it. If the target isn't native to the plane you're on, it takes an extra 3d6 psychic damage and must succeed on a Constitution saving throw or be stunned until the end of its next turn.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Druid, Warlock, Wizard"
    },
    {
        "name": "Rockfall Ward",
        "level": "1st-level",
        "level_int": "1",
        "school": "transmutation",
        "casting_time": "1 reaction, which you take when nonmagical debris fall within 120 feet of you",
        "range": "120 Feet",
        "components": "V,S",
        "duration": "1 minute",
        "concentration": "no",
        "desc": "You temporarily halt the fall of up to a 10-foot cube of nonmagical objects or debris, saving those who might have been crushed. The falling material's rate of descent slows to 60 feet per round and comes to a stop 5 feet above the ground, where it hovers until the spell ends. This spell can't prevent missile weapons from striking a target, and it can't slow the descent of an object larger than a 10-foot cube. However, at the GM's discretion, it can slow the descent of a section of a larger object, such as the wall of a falling building or a section of sail and rigging tied to a falling mast.",
        "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, the cube of debris and objects you can halt increases by 5 feet for each slot level above 1st.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Druid, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Sacrifice Pawn",
        "level": "4th-level",
        "level_int": "4",
        "school": "necromancy",
        "casting_time": "1 reaction, which you take when a friendly creature within 60 feet drops to 0 hit points",
        "range": "60 Feet",
        "components": "V",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "Sometimes one must fall so others might rise. When a friendly creature you can see within range drops to 0 hit points, you can harness its escaping life energy to heal yourself. You regain hit points equal to the fallen creature's level (or CR for a creature without a level) + your spellcasting ability modifier.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Warlock, Wizard"
    },
    {
        "name": "Sacrificial Healing",
        "level": "4th-level",
        "level_int": "4",
        "school": "necromancy",
        "sub_school": ["ritual"],
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S,M",
        "materials": "a silver knife",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You heal another creature's wounds by taking them upon yourself or transferring them to another willing creature in range. Roll 4d8. The number rolled is the amount of damage healed by the target and the damage you take, as its wounds close and similar damage appears on your body (or the body of the other willing target of the spell).",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror, Wizard"
    },
    {
        "name": "Safe Transposition",
        "level": "2nd-level",
        "level_int": "2",
        "school": "conjuration",
        "casting_time": "1 reaction, which you take when an injured ally is attacked",
        "range": "30 Feet",
        "components": "S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You cast this spell when an ally below half its hit point maximum within range is attacked. You swap places with your ally, each of you instantly teleporting into the space the other just occupied. If there isn't room for you in the new space or for your ally in your former space, this spell fails. After the two of you teleport, the triggering attack roll is compared to your AC to determine if it hits you.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Paladin"
    },
    {
        "name": "Secret Blind",
        "level": "3rd-level",
        "level_int": "3",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "Self (5-foot-radius sphere)",
        "components": "V,S",
        "duration": "10 minutes",
        "concentration": "no",
        "desc": "A 5-foot-radius immobile sphere springs into existence around you and remains stationary for the duration. You and up to four Medium or smaller creatures can occupy the sphere. If its area includes a larger creature or more than five creatures, each larger creature and excess creature is pushed to an unoccupied space outside of the sphere.\n  Creatures and objects within the sphere when you cast this spell may move through it freely. All other creatures and objects are barred from passing through the sphere after it forms. Spells and other magical effects can't extend through the sphere, with the exception of transmutation or conjuration spells and magical effects that allow you or the creatures inside the sphere to willingly leave it, such as the *dimension door* and *teleport* spells. The atmosphere inside the sphere is cool, dry, and filled with air, regardless of the conditions outside.\n  Until the effect ends, you can command the interior to be dimly lit or dark. The sphere is opaque from the outside and covered in an illusion that makes it appear as the surrounding terrain, but it is transparent from the inside. Physical interaction with the illusion reveals it to be an illusion as the creature touches the cool, firm surface of the sphere. A creature that uses an action to examine the sphere can determine it is covered by an illusion with a successful Intelligence (Investigation) check against your spell save DC.\n  The effect ends if you leave its area, or if the sphere is hit with the *disintegration* spell or a successful *dispel magic* spell.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Sorceror, Warlock, Wizard"
    },
    {
        "name": "Shadow Tree",
        "level": "2nd-level",
        "level_int": "2",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S,M",
        "materials": "a willow branch",
        "duration": "10 minutes",
        "concentration": "no",
        "desc": "This spell temporarily draws a willow tree from the Shadow Realm to the location you designate within range. The tree is 5 feet in diameter and 20 feet tall.\n  When you cast the spell, you can specify individuals who can interact with the tree. All other creatures see the tree as a shadow version of itself and can't grasp or climb it, passing through its shadowy substance. A creature that can interact with the tree and that has Sunlight Sensitivity or Sunlight Hypersensitivity is protected from sunlight while within 20 feet of the tree. A creature that can interact with the tree can climb into its branches, giving the creature half cover.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger, Sorceror, Wizard"
    },
    {
        "name": "Shadow's Brand",
        "level": "2nd-level",
        "level_int": "2",
        "school": "necromancy",
        "casting_time": "1 action",
        "range": "Touch",
        "components": "S",
        "duration": "Until dispelled",
        "concentration": "no",
        "desc": "You draw a rune or inscription no larger than your hand on the target. The target must succeed on a Constitution saving throw or be branded with the mark on a location of your choosing. The brand appears as an unintelligible mark to most creatures. Those who understand the Umbral language recognize it as a mark indicating the target is an enemy of the shadow fey. Shadow fey who view the brand see it outlined in a faint glow. The brand can be hidden by mundane means, such as clothing, but it can be removed only by the *remove curse* spell.\n  While branded, the target has disadvantage on ability checks when interacting socially with shadow fey.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Ranger, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Shared Frenzy",
        "level": "3rd-level",
        "level_int": "3",
        "school": "enchantment",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You yell defiantly as part of casting this spell to encourage a battle fury among your allies. Each friendly creature in range must make a Charisma saving throw; a creature can choose to fail this saving throw if it wishes. If a creature fails its saving throw, it has resistance to bludgeoning, piercing, and slashing damage and has advantage on attack rolls for the duration. However, attack rolls made against an affected creature have advantage.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, this spell no longer causes creatures to have advantage against the spell's targets.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard"
    },
    {
        "name": "Shocking Volley",
        "level": "2nd-level",
        "level_int": "2",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You draw back and release an imaginary bowstring while aiming at a point you can see within range. Bolts of arrow-shaped lightning shoot from the imaginary bow, and each creature within 20 feet of that point must make a Dexterity saving throw. On a failed save, a creature takes 2d8 lightning damage and is incapacitated until the end of its next turn. On a successful save, a creature takes half as much damage.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger, Wizard"
    },
    {
        "name": "Sightburst",
        "level": "2nd-level",
        "level_int": "2",
        "school": "divination",
        "casting_time": "1 action",
        "range": "Self (100-foot radius)",
        "components": "V,S",
        "duration": "1 round",
        "concentration": "no",
        "desc": "A wave of echoing sound emanates from you. Until the start of your next turn, you have blindsight out to a range of 100 feet, and you know the location of any natural hazards within that area. You have advantage on saving throws made against hazards detected with this spell.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the duration is concentration, up to 1 minute. When you use a spell slot of 5th level or higher, the duration is concentration, up to 10 minutes. When you use a spell slot of 7th level or higher, the duration is concentration, up to 1 hour.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Silvershout",
        "level": "2nd-level",
        "level_int": "2",
        "school": "abjuration",
        "casting_time": "1 action",
        "range": "Self (30-foot cone)",
        "components": "V,S,M",
        "materials": "ounce of silver powder",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You unleash a shout that coats all creatures in a 30'foot cone in silver dust. If a creature in that area is a shapeshifter, the dust covering it glows. In addition, each creature in the area must make a Constitution saving throw. On a failed save, weapon attacks against that creature are considered to be silvered for the purposes of overcoming resistance and immunity to nonmagical attacks that aren't silvered for 1 minute.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric"
    },
    {
        "name": "Smelting Blast",
        "level": "2nd-level",
        "level_int": "2",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V,S",
        "duration": "1 minute",
        "concentration": "no",
        "desc": "You unleash a bolt of red-hot liquid metal at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 2d8 fire damage and must succeed on a Constitution saving throw or be coated in cooling, liquid metal for the duration. A creature coated in liquid metal takes 1d8 fire damage at the start of each of its turns as the metal scorches while it cools. At the end of each of its turns, the creature can make another Constitution saving throw. On a success, the spell ends and the liquid metal disappears.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage (both initial and later) increases by 1d8 for each slot level above 2nd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Sorceror, Warlock, Wizard"
    },
    {
        "name": "Sneer",
        "level": "1st-level",
        "level_int": "1",
        "school": "evocation",
        "casting_time": "1 bonus action",
        "range": "30 Feet",
        "components": "S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You curl your lip in disgust at a creature you can see within range. The target must succeed on a Charisma saving throw or take psychic damage equal to 2d4 + your spellcasting ability modifier.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Spiked Barricade",
        "level": "3rd-level",
        "level_int": "3",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "90 Feet",
        "components": "V,M",
        "materials": "a wooden toothpick",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "desc": "With a word, you create a barricade of pointed, wooden poles, also known as a cheval de frise, to block your enemies' progress. The barricade is composed of six 5-foot cube barriers made of wooden spikes mounted on central, horizontal beams.\n  Each barrier doesn't need to be contiguous with another barrier, but each barrier must appear in an unoccupied space within range. Each barrier is difficult terrain, and a barrier provides half cover to a creature behind it. When a creature enters a barrier's area for the first time on a turn or starts its turn there, the creature must succeed on a Strength saving throw or take 3d6 piercing damage.\n  The barriers are objects made of wood that can be damaged and destroyed. Each barrier has AC 13, 20 hit points, and is vulnerable to bludgeoning and fire damage. Reducing a barrier to 0 hit points destroys it.\n  If you maintain your concentration on this spell for its whole duration, the barriers become permanent and can't be dispelled. Otherwise, the barriers disappear when the spell ends.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the number of barriers you create increases by two for each slot level above 3rd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Wizard"
    },
    {
        "name": "Spite",
        "level": "2nd-level",
        "level_int": "2",
        "school": "abjuration",
        "casting_time": "1 action",
        "range": "Self",
        "components": "S",
        "duration": "1 hour",
        "concentration": "no",
        "desc": "You prick your finger and anoint your forehead with your own blood, taking 1 piercing damage and warding yourself against hostile attacks. The first time a creature hits you with an attack during this spell's duration, it takes 3d6 psychic damage. Then the spell ends.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Sorceror, Wizard"
    },
    {
        "name": "Steam Gout",
        "level": "3rd-level",
        "level_int": "3",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "120 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You create a gout of billowing steam in a 40-foottall cylinder with a 5-foot radius centered on a point on the ground you can see within range. Exposed flames in the area are doused. Each creature in the area when the gout first appears must make a Dexterity saving throw. On a failed save, the creature takes 2d8 fire damage and falls prone. On a successful save, the creature takes half as much damage and doesn't fall prone.\n  The gout then covers the area in a sheen of slippery water. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a Dexterity saving throw. On a failed save, it falls prone.",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8, and you can create one additional gout of steam for each slot level above 3rd. A creature in the area of more than one gout of steam is affected only once.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Stone Aegis",
        "level": "1st-level",
        "level_int": "1",
        "school": "transmutation",
        "casting_time": "1 reaction, which you take when you are hit by an attack",
        "range": "Self",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "no",
        "desc": "A rocky coating covers your body, protecting you. Until the start of your next turn, you gain 5 temporary hit points and a +2 bonus to Armor Class, including against the triggering attack.\n  At the start of each of your subsequent turns, you can use a bonus action to extend the duration of the AC bonus until the start of your following turn, for up to 1 minute.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Druid, Warlock"
    },
    {
        "name": "Stone Fetch",
        "level": "4th-level",
        "level_int": "4",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "Self",
        "components": "V,S",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "desc": "You create a stony duplicate of yourself, which rises out of the ground and appears next to you. The duplicate looks like a stone carving of you, including the clothing you're wearing and equipment you're carrying at the time of the casting. It uses the statistics of an earth elemental.\n  For the duration, you have a telepathic link with the duplicate. You can use this telepathic link to issue commands to the duplicate while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as “Run over there” or “Fetch that object.” If the duplicate completes the order and doesn't receive further direction from you, it takes the Dodge or Hide action (your choice) on its turn. The duplicate can't attack, but it can speak in a gravelly version of your voice and mimic your mannerisms with exact detail.\n  As a bonus action, you can see through the duplicate's eyes and hear what it hears as if you were in the duplicate's space, gaining the benefits of the earth elemental's darkvision and tremorsense until the start of your next turn. During this time, you are deaf and blind with regard to your own senses. As an action while sharing the duplicate's senses, you can make the duplicate explode in a shower of jagged chunks of rock, destroying the duplicate and ending the spell. Each creature within 10 feet of the duplicate must make a Dexterity saving throw. A creature takes 4d10 slashing damage on a failed save, or half as much damage on a successful one.\n  The duplicate explodes at the end of the duration, if you didn't cause it to explode before then. If the duplicate is killed before it explodes, you suffer one level of exhaustion.",
        "higher_level": "When you cast this spell using a spell slot of 5th level or higher, the explosion damage increases by 1d10 for each slot level above 4th. In addition, when you cast this spell using a spell slot of 6th level or higher, the duration is 1 hour. When you cast this spell using a spell slot of 8th level or higher, the duration is 8 hours. Using a spell slot of 6th level or higher grants a duration that doesn't require concentration.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Storm of Wings",
        "level": "4th-level",
        "level_int": "4",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S,M",
        "materials": "a drop of honey",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You create a storm of spectral birds, bats, or flying insects in a 15-foot-radius sphere on a point you can see within range. The storm spreads around corners, and its area is lightly obscured. Each creature in the storm when it appears and each a creature that starts its turn in the storm is affected by the storm.\n  As a bonus action on your turn, you can move the storm up to 30 feet. As an action on your turn, you can change the storm from one type to another, such as from a storm of bats to a storm of insects.\n  ***Bats.*** The creature takes 4d6 necrotic damage, and its speed is halved while within the storm as the bats cling to it and drain its blood.\n  ***Birds.*** The creature takes 4d6 slashing damage, and has disadvantage on attack rolls while within the storm as the birds fly in the way of the creature's attacks.\n  ***Insects.*** The creature takes 4d6 poison damage, and it must make a Constitution saving throw each time it casts a spell while within the storm. On a failed save, the creature fails to cast the spell, losing the action but not the spell slot.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger"
    },
    {
        "name": "Subliminal Aversion",
        "level": "1st-level",
        "level_int": "1",
        "school": "transmutation",
        "sub_school": ["liminal"],
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S",
        "duration": "1 minute",
        "concentration": "no",
        "desc": "You ward a creature within range against attacks by making the choice to hit them painful. When the warded creature is hit with a melee attack from within 5 feet of it, the attacker takes 1d4 psychic damage.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Druid, Wizard"
    },
    {
        "name": "Sudden Slue",
        "level": "4th-level",
        "level_int": "4",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "With a growl, you call forth dozens of bears to overrun all creatures in a 20-foot cube within range. Each creature in the area must make a Dexterity saving throw. On a failed save, a creature takes 6d6 bludgeoning damage and is knocked prone. On a successful save, a creature takes half the damage and isn't knocked prone. The bears disappear after making their charge.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid"
    },
    {
        "name": "Sudden Stampede",
        "level": "4th-level",
        "level_int": "4",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S,M",
        "materials": "a horseshoe",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You conjure up a multitude of fey spirits that manifest as galloping horses. These horses run in a 10-foot'wide, 60-foot-long line, in a given direction starting from a point within range, trampling all creatures in their path, before vanishing again. Each creature in the line takes 6d10 bludgeoning damage and is knocked prone. A successful Dexterity saving throw reduces the damage by half, and the creature is not knocked prone.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Druid, Ranger"
    },
    {
        "name": "Suppress Regeneration",
        "level": "1st-level",
        "level_int": "1",
        "school": "transmutation",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S,M",
        "materials": "skin from a troll or other regenerating creature",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You temporarily remove the ability to regenerate from a creature you can see within range. The target must make a Constitution saving throw. On a failed save, the target can't regain hit points from the Regeneration trait or similar spell or trait for the duration. The target can receive magical healing or regain hit points from other traits, spells, or actions, as normal. At the end of each of its turns, the target can make another Constitution saving throw. On a success, the spell ends on the target.",
        "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Ranger, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Threshold Slip",
        "level": "2nd-level",
        "level_int": "2",
        "school": "conjuration",
        "sub_school": ["liminal"],
        "casting_time": "1 bonus action",
        "range": "Self",
        "components": "V",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "The threshold of a doorway, the sill of a window, the junction where the floor meets the wall, the intersection of two walls—these are all points of travel for you. When you cast this spell, you can step into the junction of two surfaces, slip through the boundary of the Material Plane, and reappear in an unoccupied space with another junction you can see within 60 feet.\n  You can take one willing creature of your size or smaller that you're touching with you. The target junction must have unoccupied spaces for both of you to enter when you reappear or the spell fails.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Warlock, Wizard"
    },
    {
        "name": "Toadstool Ring",
        "level": "6th-level",
        "level_int": "6",
        "school": "divination",
        "sub_school": ["ritual"],
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S,M",
        "materials": "a bit of dried mushroom",
        "duration": "1 hour",
        "concentration": "no",
        "desc": "You coax a toadstool ring to sprout from the ground. A creature of your choice can sit in the center of the ring and meditate for the duration, catching glimpses of the past, present, and future. The creature can ask up to three questions: one about the past, one about the present, and one about the future. The GM offers truthful answers in the form of dreamlike visions that may be subject to interpretation. When the spell ends, the toadstools turn black and dissolve back into the earth.\n  If you cast the spell two or more times before finishing your next long rest, there is a cumulative 25 percent chance for each casting after the first that the meditating creature gets a random vision unrelated to the question. The GM makes this roll in secret.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Sorceror, Wizard"
    },
    {
        "name": "Toothless Beast",
        "level": "2nd-level",
        "level_int": "2",
        "school": "enchantment",
        "casting_time": "1 action",
        "range": "60 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You hinder the natural attacks of a creature you can see within range. The creature must make a Wisdom saving throw. On a failed save, any time the creature attacks with a bite, claw, slam, or other weapon that isn't manufactured, it must roll the weapon's damage dice twice and use the lower total. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target. This spell has no effect on constructs.",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd. The creatures must be within 30 feet of each other when you target them.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Tracer",
        "level": "3rd-level",
        "level_int": "3",
        "school": "divination",
        "casting_time": "1 bonus action",
        "range": "Self",
        "components": "V,S,M",
        "materials": "a drop of bright paint",
        "duration": "8 hours",
        "concentration": "no",
        "desc": "When you cast this spell and as a bonus action on each of your turns until the spell ends, you can imbue a piece of ammunition you fire from a ranged weapon with a tiny, invisible beacon. If a ranged attack roll with an imbued piece of ammunition hits a target, the beacon is transferred to the target. The weapon that fired the ammunition is attuned to the beacon and becomes warm to the touch when it points in the direction of the target as long as the target is on the same plane of existence as you. You can have only one *tracer* target at a time. If you put a *tracer* on a different target, the effect on the previous target ends.\n  A creature must succeed on an Intelligence (Arcana) check against your spell save DC to notice the magical beacon.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger"
    },
    {
        "name": "Tree Heal",
        "level": "Cantrip",
        "level_int": "0",
        "school": "evocation",
        "casting_time": "1 action",
        "range": "Touch",
        "components": "V,S",
        "duration": "Instantaneous",
        "concentration": "no",
        "desc": "You touch a plant and it regains 1d4 hit points. Alternatively, you can cure it of one disease or remove pests from it. Once you cast this spell on a plant or plant creature, you can't cast it on that target again for 24 hours. This spell can be used only on plants and plant creatures.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid"
    },
    {
        "name": "Trollish Charge",
        "level": "4th-level",
        "level_int": "4",
        "school": "illusion",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "desc": "You veil a willing creature you can see within range in an illusion others perceive as their worst nightmares given flesh. When the affected creature moves at least 10 feet straight toward a creature and attacks it, that creature must succeed on a Wisdom saving throw or become frightened for 1 minute. If the affected creature’s attack hits the frightened target, the affected creature can roll the attack’s damage dice twice and use the higher total.\n  At the end of each of its turns, a creature frightened by this spell can make another Wisdom saving throw. On a success, the creature is no longer frightened and can’t be frightened by this spell again for 24 hours.",
        "higher_level": "When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Bard, Cleric, Sorceror, Warlock, Wizard"
    },
    {
        "name": "Vine Carpet",
        "level": "3rd-level",
        "level_int": "3",
        "school": "conjuration",
        "casting_time": "1 action",
        "range": "30 Feet",
        "components": "V,S",
        "duration": "1 hour",
        "concentration": "no",
        "desc": "You cause a thick carpet of vines to grow from a point on the ground within range. The vines cover objects and prone creatures within 20 feet of that point. While covered in this way, objects and creatures have total cover as long as they remain motionless. A creature that moves while beneath the carpet has only three-quarters cover from attacks on the other side of the carpet. A covered creature that stands up from prone stands atop the carpet and is no longer covered. The carpet of vines is plush enough that a Large or smaller creature can walk across it without harming or detecting those covered by it.\n  When the spell ends, the vines wither away into nothingness, revealing any objects and creatures that were still covered.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Ranger"
    },
    {
        "name": "War Horn",
        "level": "4th-level",
        "level_int": "4",
        "school": "enchantment",
        "casting_time": "1 action",
        "range": "Self (30-foot radius)",
        "components": "M",
        "materials": "metal horn worth at least 50 gp",
        "duration": "1 minute",
        "concentration": "no",
        "desc": "You blow a blast on your war horn, sending a ripple of fear through your enemies and bolstering your allies. Choose up to three hostile creatures in range and up to three friendly creatures in range. Each hostile target must succeed on a Wisdom saving throw or become frightened for the duration. At the end of each of its turns, a frightened creature can make another Wisdom saving throw. On a success, the spell ends on that creature.\n  Each friendly target gains a number of temporary hit points equal to 2d4 + your spellcasting ability modifier and has advantage on the next attack roll it makes before the spell ends. The temporary hit points last for 1 hour.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Cleric, Paladin, Wizard"
    },
    {
        "name": "Wild Hunt",
        "level": "7th-level",
        "level_int": "7",
        "school": "enchantment",
        "casting_time": "1 hour",
        "range": "30 Feet",
        "components": "V,S,M",
        "materials": "a jeweled dagger worth at least 500 gp, which the spell consumes",
        "duration": "24 hours",
        "concentration": "no",
        "desc": "While casting this spell, you must chant and drum, calling forth the spirit of the hunt. Up to nine other creatures can join you in the chant.\n  For the duration, each creature that participated in the chant is filled with the fervent bloodlust of the wild hunt and gains several benefits. The creature is immune to being charmed and frightened, it deals one extra die of damage on the first weapon or spell attack it makes on each of its turns, it has advantage on Strength or Dexterity saving throws (the creature's choice), and its Armor Class increases by 1.\n  When this spell ends, a creature affected by it suffers one level of exhaustion.",
        "ritual": "no",
        "source": "KP:ToH",
        "class": "Druid, Sorceror, Warlock"
    }
]