[
    {
        "name": "Barge Pole",
        "category": "Simple Melee Weapons",
        "cost": "1 sp",
        "damage_dice": "1d6",
        "damage_type": "bludgeoning",
        "weight": "5 lb.",
        "properties": [
            "reach",
            "special",
            "two-handed"
        ],
        "desc": "Barge poles (or quant poles) are about 10 feet long with a cap at one end and a prong at the other. Primarily used to propel or steer barges through the water, the forked prong at one tip prevents the pole from sinking into muck in the riverbed. Barge poles can be wielded as a bludgeoning weapon or used to stab with the prong for 1d4 piercing damage."
    },
    {
        "name": "Granite Fist",
        "category": "Simple Melee Weapons",
        "cost": "25 gp",
        "damage_dice": "1d4",
        "damage_type": "bludgeoning",
        "weight": "5 lb.",
        "properties": [
            ""
        ],
        "desc": "This stone gauntlet is curled into a fist and contains an iron bar inside for the wielder to grip."
    },
    {
        "name": "Light Pick",
        "category": "Simple Melee Weapons",
        "cost": "3 gp",
        "damage_dice": "1d4",
        "damage_type": "piercing",
        "weight": "2 lb.",
        "properties": [
            "light",
            "thrown (20/60)",
            ""
        ],
        "desc": "This weapon resembles a small pickaxe with a very long handle. It is equally as suited for digging as for throwing at an opponent."
    },
    {
        "name": "Stone Rake",
        "category": "Simple Melee Weapons",
        "cost": "5 gp",
        "damage_dice": "1d8",
        "damage_type": "piercing",
        "weight": "5 lb.",
        "properties": [
            "two-handed"
        ],
        "desc": "Settlers use stone rakes to remove rocks and other obstructions from the soil prior to planting or building structures. Though stone rakes aren't built with combat in mind, more than a few settlers have fended off wild animals with them."
    },
    {
        "name": "Clockwork Crossbow",
        "category": "Simple Ranged Weapons",
        "cost": "100 gp",
        "damage_dice": "1d8",
        "damage_type": "piercing",
        "weight": "8 lb.",
        "properties": [
            "ammunition (60/240)",
            "magazine (6)",
            "two-handed"
        ],
        "desc": "This weapon resembles a traditional light crossbow but with a removable, wooden and clockwork magazine. Though this crossbow is lighter and less powerful than a heavy crossbow, its magazine allows for faster volleys. The attached magazine must have at least one bolt loaded into it to make a ranged attack with this weapon."
    },
    {
        "name": "Pistol",
        "category": "Simple Ranged Weapons",
        "cost": "25 gp",
        "damage_dice": "1d6",
        "damage_type": "piercing",
        "weight": "5 lb.",
        "properties": [
            "ammunition (range 30/120)",
            "gunpowder",
            "light",
            "loading"
        ],
        "desc": "This small firearm fits easily in one hand, and its wooden handle often features unique engravings, similar to those found on muskets."
    },
    {
        "name": "Axespear",
        "category": "Martial Melee Weapons",
        "cost": "25 gp",
        "damage_dice": "1d8",
        "damage_type": "slashing",
        "weight": "8 lb.",
        "properties": [
            "double-headed (1d4)",
            "two-handed"
        ],
        "desc": "This weapon features an iron-banded wooden haft with an axe blade on one end and a spear point on the other. This weapon is balanced so that the axe head is the primary head. If you utilize this weapon's double-headed property, the spear deals piercing damage equal to the amount indicated in parenthesis."
    },
    {
        "name": "Bladed Scarf",
        "category": "Martial Melee Weapons",
        "cost": "100 gp",
        "damage_dice": "1d4",
        "damage_type": "slashing",
        "weight": "3 lb.",
        "properties": [
            "finesse",
            "reach",
            "special"
        ],
        "desc": "If you use one of your attacks to grapple a creature while wielding a bladed scarf, you can use a bonus action to make an attack against the grappled creature with the scarf."
    },
    {
        "name": "Double Axe",
        "category": "Martial Melee Weapons",
        "cost": "50 gp",
        "damage_dice": "1d8",
        "damage_type": "slashing",
        "weight": "10 lb.",
        "properties": [
            "double-headed (1d6)",
            "heavy",
            "two-handed"
        ],
        "desc": "This brutal weapon consists of a sturdy, wooden haft mounted with a double-sided axe head on each end of it."
    },
    {
        "name": "Chain Hook",
        "category": "Martial Melee Weapons",
        "cost": "15 gp",
        "damage_dice": "1d6",
        "damage_type": "slashing",
        "weight": "3 lb.",
        "properties": [
            "reach",
            "special",
            "thrown (range 10/20)"
        ],
        "desc": "This weapon consists of a 20-foot, hefty chain that terminates in an iron weight set with a bladed hook. After you throw the chain hook, you can use a bonus action to bring the bladed hook back to your hand."
    },
    {
        "name": "Chakram",
        "category": "Martial Melee Weapons",
        "cost": "15 gp",
        "damage_dice": "1d6",
        "damage_type": "slashing",
        "weight": "1 lb.",
        "properties": [
            "thrown (range 20/60)"
        ],
        "desc": "This metal weapon is a large ring with the interior edge dulled to rest comfortably in the hand."
    },
    {
        "name": "Climbing Adze",
        "category": "Martial Melee Weapons",
        "cost": "6 gp",
        "damage_dice": "1d4",
        "damage_type": "slashing",
        "weight": "3 lb.",
        "properties": [
            "light"
        ],
        "desc": "This tool is made of a sharp, wide blade perpendicular to a short handle with a leather thong to loop over the user's wrist. Climbing adzes are used primarily to peel bark from felled trees or remove buried stones from the soil, but if you use a pair of climbing adzes together, you have advantage on Strength (Athletics) checks made to climb."
    },
    {
        "name": "Club Shield",
        "category": "Martial Melee Weapons",
        "cost": "25 gp",
        "damage_dice": "1d4",
        "damage_type": "bludgeoning",
        "weight": "2 lb.",
        "properties": [
            "light",
            "special"
        ],
        "desc": "These shields are wielded by grasping onto a stout two-foot-long pole on the reverse side, allowing you to use your shield as an effective weapon. Wielding a club shield increases your Armor Class by 2. The club shield is considered both a shield and a weapon, and you can't benefit from more than one shield at a time, as normal."
    },
    {
        "name": "Dwarven Axe",
        "category": "Martial Melee Weapons",
        "cost": "15 gp",
        "damage_dice": "1d4",
        "damage_type": "slashing",
        "weight": "6 lb.",
        "properties": [
            "special",
            "versatile (1d10)"
        ],
        "desc": "Popularized by dwarves, this sturdy axe has a shorter haft than a standard battle axe, a reinforced spike on the head, and a heavy, counterweighted pommel. Many warriors fighting in close quarters prefer the dwarven axe, and its prominent spike occasionally serves as a makeshift guidon for units in areas with lower ceilings, like tunnels. When you use the dwarven axe to attack, you can choose to use the axe head, which deals slashing damage, or the spike, which deals piercing damage."
    },
    {
        "name": "Elven Dueling Blade",
        "category": "Martial Melee Weapons",
        "cost": "50 gp",
        "damage_dice": "1d4",
        "damage_type": "slashing",
        "weight": "4 lb.",
        "properties": [
            "finesse",
            "two-handed"
        ],
        "desc": "This archaic elven weapon resembles a thin greatsword with a slightly curved blade. Used in ceremonial duels and trials by combat, each dueling blade takes several years and master craftsmen to create. The blade is very light and nimble, but the length of the blade requires the wielder to use two hands to control it."
    },
    {
        "name": "Joining Dirks",
        "category": "Martial Melee Weapons",
        "cost": "50 gp",
        "damage_dice": "1d4",
        "damage_type": "slashing",
        "weight": "2 lb.",
        "properties": [
            "finesse",
            "light",
            "special"
        ],
        "desc": "Interlocking pommels cap this pair of blades. As a bonus action, you can interlock the pommels to create a single weapon with a blade on each end, and you can use a bonus action while holding the joined blade to separate it into the two blades again. When the blades are joined, this weapon has the double-headed (1d6) and two-handed properties, and it loses the light property. When the blades are separate, you have advantage on Dexterity (Sleight of Hand) checks to hide them on your person."
    },
    {
        "name": "Khopesh",
        "category": "Martial Melee Weapons",
        "cost": "25 gp",
        "damage_dice": "1d4",
        "damage_type": "slashing",
        "weight": "4 lb.",
        "properties": [
            "versatile (1d8)"
        ],
        "desc": "A khopesh is a one-handed martial melee weapon that looks like a cross between a sword and a sickle. The long blade emerges from the hilt straight like a longsword, but the blade curves toward the end."
    },
    {
        "name": "Pneumatic War Pick",
        "category": "Martial Melee Weapons",
        "cost": "50 gp",
        "damage_dice": "1d4",
        "damage_type": "piercing",
        "weight": "4 lb.",
        "properties": [
            "special"
        ],
        "desc": "This clockwork war pick features a spiked head on a pneumatic coil. Originally designed for demolition, the pneumatic war pick found great use in dwarven tunnels and narrow urban streets alike. When you hit an object or structure with this weapon, double the damage dice on the attack."
    },
    {
        "name": "Shashka",
        "category": "Martial Melee Weapons",
        "cost": "20 gp",
        "damage_dice": "1d4",
        "damage_type": "slashing",
        "weight": "4 lb.",
        "properties": [
            "special",
            "versatile (1d10)"
        ],
        "desc": "A cavalry saber employed to great effect by mounted warriors, the shashka can be swung while on horseback in a repeated, looping downward arc. When riding through enemy ranks, a mounted warrior employs a one-handed, whirling swing, crisscrossing the rider's pommel to strike at enemies on foot on both sides in a downward double arc. A shashka can't be wielded with two hands while you are mounted."
    },
    {
        "name": "Shotel",
        "category": "Martial Melee Weapons",
        "cost": "50 gp",
        "damage_dice": "1d4",
        "damage_type": "slashing",
        "weight": "3 lb.",
        "properties": [
            "finesse",
            "special"
        ],
        "desc": "The curve of a shotel's blade allows you to reach around your opponent's shield. When you attack a creature wielding a shield, you gain a +2 bonus to the attack roll."
    },
    {
        "name": "Temple Sword",
        "category": "Martial Melee Weapons",
        "cost": "35 gp",
        "damage_dice": "1d4",
        "damage_type": "slashing",
        "weight": "3 lb.",
        "properties": [
            "finesse",
            "light"
        ],
        "desc": "Also called a sickle sword, the blade ends in a crescent-shaped curve."
    },
    {
        "name": "Whipsaw",
        "category": "Martial Melee Weapons",
        "cost": "15 gp",
        "damage_dice": "1d4",
        "damage_type": "slashing",
        "weight": "2 lb.",
        "properties": [
            "finesse"
        ],
        "desc": "A whipsaw is comprised of razor-sharp teeth loosely riveted together and attached to a T-shaped handle at each end. Used as a tool, a whipsaw allows a single creature to cut down a Medium or smaller tree with 30 minutes of work. When not in use, a whipsaw can be coiled and hung from a belt or pack."
    },
    {
        "name": "Wormsilk Whip",
        "category": "Martial Melee Weapons",
        "cost": "50 gp",
        "damage_dice": "1d4",
        "damage_type": "slashing",
        "weight": "3 lb.",
        "properties": [
            "finesse",
            "reach"
        ],
        "desc": "Wormsilk is braided together with leather to lend this whip an edge."
    },
    {
        "name": "Wrist Knife",
        "category": "Martial Melee Weapons",
        "cost": "4 gp",
        "damage_dice": "1d4",
        "damage_type": "slashing",
        "weight": "1 lb.",
        "properties": [
            "finesse",
            "light"
        ],
        "desc": "This 1-to 2-inch-wide circular blade is worn around the wrist like a bracelet."
    },
    {
        "name": "Blunderbuss",
        "category": "Martial Ranged Weapons",
        "cost": "75 gp",
        "damage_dice": "2d4",
        "damage_type": "piercing",
        "weight": "12 lb.",
        "properties": [
            "ammunition",
            "gunpowder",
            "loading",
            "special",
            "two-handed"
        ],
        "desc": "This firearm features a flared muzzle. When you fire the weapon, it releases bullets in a 15-foot cone. Each creature in that area must make a DC 13 Dexterity saving throw, taking 2d4 piercing damage on a failed save, or half as much damage on a successful one. Each time you use the blunderbuss, it expends 5 pieces of ammunition, and, as with all firearms, the ammunition can't be recovered at the end of battle. Firing a blunderbuss releases a thunderous boom that is audible out to 200 feet."
    },
    {
        "name": "Bolas",
        "category": "Martial Ranged Weapons",
        "cost": "5 gp",
        "damage_dice": "",
        "damage_type": "",
        "weight": "2 lb.",
        "properties": [
            "special",
            "thrown (range 5/15)"
        ],
        "desc": "This ranged weapon consists of two small weights tied together. A Medium or smaller creature hit by a bolas has its speed reduced to 0 until it is freed, and it must succeed on a DC 10 Strength saving throw or fall prone. A set of bolas has no effect on formless creatures or creatures that are Large or larger. A creature can use its action to make a DC 10 Strength check, freeing itself or another creature within its reach on a success. Dealing 5 slashing damage to the bolas (AC 10) also frees the creature without harming it, ending the effect and destroying the bolas."
    },
    {
        "name": "Dwarven Arquebus",
        "category": "Martial Ranged Weapons",
        "cost": "100 gp",
        "damage_dice": "2d6",
        "damage_type": "piercing",
        "weight": "20 lb.",
        "properties": [
            "ammunition (range 25/100)",
            "gunpowder",
            "heavy",
            "loading",
            "two-handed"
        ],
        "desc": "This very heavy barreled firearm fires solid metal balls and deals devastating damage at short range."
    },
    {
        "name": "Dwarven Revolving Musket",
        "category": "Martial Ranged Weapons",
        "cost": "200 gp",
        "damage_dice": "1d8",
        "damage_type": "piercing",
        "weight": "12 lb.",
        "properties": [
            "ammunition (range 80/320)",
            "gunpowder",
            "magazine (8)",
            "two-handed"
        ],
        "desc": "This long-barreled firearm holds a removable, metal, cylindrical magazine, which allows the firearm to be fired multiple times before needing to be reloaded. The attached magazine must have at least one paper cartridge loaded into it to make a ranged attack with this weapon."
    },
    {
        "name": "Hand Trebuchet",
        "category": "Martial Ranged Weapons",
        "cost": "4 gp",
        "damage_dice": "",
        "damage_type": "",
        "weight": "3 lb.",
        "properties": [
            "ammunition (range 60/240)",
            "special"
        ],
        "desc": "The metal pocket of a hand trebuchet can be loaded with a small container of acid, alchemist's fire, holy water, or other liquid. See the appropriate entry for the ammunition used to determine damage and other effects. As a melee weapon, a hand trebuchet deals damage as a club."
    },
    {
        "name": "Musket",
        "category": "Martial Ranged Weapons",
        "cost": "50 gp",
        "damage_dice": "1d10",
        "damage_type": "piercing",
        "weight": "10 lb.",
        "properties": [
            "ammunition (range 80/320)",
            "gunpowder",
            "loading",
            "two-handed"
        ],
        "desc": "This long-barreled firearm comes in different styles. Its wooden handle often features engravings and other decorative embellishments that have significance to the owner or the original craftsperson."
    },
    {
        "name": "Wormsilk Net",
        "category": "Martial Ranged Weapons",
        "cost": "60 gp",
        "damage_dice": "",
        "damage_type": "",
        "weight": "2 lb.",
        "properties": [
            "special",
            "thrown (range 10/20)"
        ],
        "desc": "A wormsilk net is a lighter, more durable variant of a standard net. A creature restrained by a wormsilk net must succeed on a DC 14 Strength check to free itself. In addition, a wormsilk net has AC 12 and 10 hit points."
    }
]