[
    {
        "title": "Vault of Magic OGL",
        "slug": "vom",
        "desc": "Vault of Magic Open-Gaming License Content by Kobold Press",
        "license": "Open Gaming License",
        "author": "Phillip Larwood, Jeff Lee, and Christopher Lockey",
        "organization": "Kobold Press",
        "version": "1.0",
        "copyright": "Vault of Magic. Copyright 2021 Open Design LLC; Authors Phillip Larwood, Jeff Lee, and Christopher Lockey.",
        "url": "https://koboldpress.com/kpstore/product/vault-of-magic-for-5th-edition/",
        "ogl-lines":[
        "OPEN GAME LICENSE Version 1.0a",
"The following text is the property of Wizards of the Coast, Inc. and is Copyright 2000 Wizards of the Coast, Inc (“Wizards”). All Rights Reserved.",
"1. Definitions: (a)”Contributors” means the copyright and/or trademark owners who have contributed Open Game Content; (b)”Derivative Material” means copyrighted material",
"including derivative works and translations (including into other computer languages), potation, modification, correction, addition, extension, upgrade, improvement, compilation, abridgment",
"or other form in which an existing work may be recast, transformed or adapted; (c) “Distribute” means to reproduce, license, rent, lease, sell, broadcast, publicly display, transmit or otherwise distribute; (d)”Open Game Content” means the game mechanic and includes the methods, procedures, processes and routines to the extent such content does not embody the Product Identity and is an enhancement over the prior art and any additional content clearly identified as Open Game Content by the Contributor, and means any work covered by this License, including translations and derivative works under copyright law, but specifically excludes Product Identity. (e) “Product Identity” means product and product line names, logos and identifying marks including trade dress; artifacts; creatures characters; stories, storylines, plots, thematic elements, dialogue, incidents, language, artwork, symbols, designs, depictions, likenesses, formats, poses, concepts, themes and graphic, photographic and other visual or audio representations; names",
"and descriptions of characters, spells, enchantments, personalities, teams, personas, likenesses and special abilities; places, locations, environments, creatures, equipment, magical or supernatural abilities or effects, logos, symbols, or graphic designs; and any other trademark or registered trademark clearly identified as Product identity by the owner of the Product Identity, and which specifically excludes the Open Game Content; (f) “Trademark” means the logos, names, mark, sign, motto, designs that are used by a Contributor to identify itself or its products or the associated products contributed to the Open Game License by the Contributor (g) “Use”, “Used” or “Using” means to use, Distribute, copy, edit, format, modify, translate and otherwise create Derivative Material of Open Game Content. (h) “You” or “Your” means the licensee in terms of this agreement.",
"2. The License: This License applies to any Open Game Content that contains a notice indicating that the Open Game Content may only be Used under and in terms of this License. You must affix such a notice to any Open Game Content that you Use. No terms may be added to or subtracted from this License except as described by the License itself. No other terms or conditions may be applied to any Open Game Content distributed using this License.",
"3. Offer and Acceptance: By Using the Open Game Content You indicate Your acceptance of the terms of this License.",
"4. Grant and Consideration: In consideration for agreeing to use this License, the Contributors grant You a perpetual, worldwide, royalty-free, non-exclusive license with the exact terms of this License to Use, the Open Game Content.",
"5. Representation of Authority to Contribute: If You are contributing original material as Open Game Content, You represent that Your Con-tributions are Your original creation and/ or You have sufficient rights to grant the rights conveyed by this License.",
"6. Notice of License Copyright: You must update the COPYRIGHT NOTICE portion of this License to include the exact text of the COPYRIGHT NOTICE of any Open Game Content You are copying, modifying or distributing, and You must add the title, the copyright date, and the copyright holder’s name to the COPYRIGHT NOTICE of any original Open Game Content you Distribute.",
"7. Use of Product Identity: You agree not to Use any Product Identity, including as an indication as to compatibility, except as expressly licensed in another, independent Agreement with the owner of each element of that Product Identity. You agree not to indicate compatibility or co- adaptability with any Trademark or Registered Trademark in conjunction with a work containing Open Game Content except as expressly licensed in another, independent Agreement with the owner of such Trademark or Registered Trademark. The use of any Product Identity in Open Game Content does not constitute a challenge to the ownership of that Product Identity.",
"The owner of any Product Identity used in Open Game Content shall retain all rights, title and interest in and to that Product Identity.",
"8. Identification: If you distribute Open Game Content You must clearly indicate which portions of the work that you are distributing are Open Game Content.",
"9. Updating the License: Wizards or its designated Agents may publish updated versions of this License. You may use any authorized version of this License to copy, modify and distribute any Open Game Content originally distributed under any version of this License.",
"10. Copy of this License: You MUST include a copy of this License with every copy of the Open Game Content You Distribute.",
"11. Use of Contributor Credits: You may not market or advertise the Open Game Content using the name of any Contributor unless You have written permission from the Contributor to do so.",
"12. Inability to Comply: If it is impossible for You to comply with any of the terms of this License with respect to some or all of the Open Game Content due to statute, judicial order, or governmental regulation then You may not Use any Open Game Material so affected.",
"13. Termination: This License will terminate automatically if You fail to comply with all terms herein and fail to cure such breach within 30 days of becoming aware of the breach. All sublicenses shall survive the termination of this License.",
"14. Reformation: If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable.",
"15. COPYRIGHT NOTICE",
"Open Game License v 1.0a Copyright 2000, Wizards of the Coast, LLC.",
"System Reference Document 5.1 Copyright 2016, Wizards of the Coast, Inc.; Authors Mike Mearls, Jeremy Crawford, Chris Perkins, Rodney Thompson, Peter Lee, James Wyatt, Robert J. Schwalb, Bruce R. Cordell, Chris Sims, and Steve Townshend, based on original material by E. Gary Gygax and Dave Arneson.",
"A Leeward Shore © 2018 Open Design LLC; Author: Mike Welham Bastion of Rime and Salt © 2018 Open Design LLC; Author: Jon Sawatsky Birds of a Feather © 2019 Open Design LLC; Author: Kelly Pawlik",
"Book of Lairs for 5th Edition © 2016 Open Design LLC; Authors: Robert Adducci, Wolfgang Baur, Enrique Bertran, Brian Engard, Jeff Grubb, James J. Haeck, Shawn Merwin, Marc Radle, Jon Sawatsky, Mike Shea, Mike Welham, and Steve Winter",
"Casting the Longest Shadow © 2020 Open Design LLC; Author: Benjamin L. Eastman",
"Creature Codex © 2018 Open Design LLC; Authors: Wolfgang Baur, Dan Dillon, Richard Green, James J. Haeck, Chris Harris, Jeremy Hochhalter, James Introcaso, Christopher Lockey, Shawn Merwin, and Jon Sawatsky",
"Death of a Mage © 2020 Open Design LLC; Author: RP Davis",
"Deep Magic for 5th Edition © 2020 Open Design LLC; Authors: Dan Dillon, Chris Harris, and Jeff",
"Deep Magic: Elemental Magic © 2017 Open Design LLC; Author: Dan Dillon Deep Magic: Hieroglyphic Magic © 2018 Open Design LLC; Author: Michael Ohl",
"Demon Cults & Secret Societies for 5th Edition © 2017 Open Design LLC; Authors: Jeff Lee, Mike Welham, and Jon Sawatsky",
"Empire of the Ghouls © 2020 Open Design LLC; Authors: Wolfgang Baur, Richard Green, Jeff Lee, Christopher Lockey, Kelly Pawlik, and Mike Welham",
"Expanding Codex © 2020 Open Design LLC; Author: Mike Welham",
"Gold and Glory © 2020 Open Design LLC; Author: Bryan Armor",
"Items Wondrous Strange © 2017 Open Design LLC; Authors: James Bitoy, Peter von Bleichert, Dan Dillon, James J. Haeck, Neal Litherland, Adam Roy, and Jon Sawatsky",
"Margreve Player’s Guide © 2019 Open Design LLC; Authors: Lou Anders, Matthew Corley, Dan Dillon, Jon Sawatsky, Dennis Sustare, and Mike Welham",
"Midgard Heroes Handbook © 2018 Open Design LLC; Authors: Wolfgang Baur, Scott Carter, Dan Dillon, Richard Green, Chris Harris, Rich Howard, Greg Marks, Shawn Merwin, Michael Ohl, and Jon Sawatsky",
"Midgard Sagas © 2018 Open Design LLC; Authors: Wolfgang Baur, Dan Dillon, Robert Fairbanks, Greg Marks, Ben McFarland, Kelly Pawlik, Brian Suskind, and Troy Taylor",
"Midgard Worldbook © 2018 Open Design LLC; Authors: Wolfgang Baur, Dan Dillon, Richard Green, Jeff Grubb, Chris Harris, Brian Suskind, and Jon Sawatsky",
"Out of Phase © 2019 Open Design LLC; Author: Celeste Conowitch",
"Prepared 2: A Dozen 5th Edition One-Shot Adventures © 2017 Open Design LLC; Author: Jon Sawatsky",
"Raid on the Savage Oasis © 2020 Open Design LLC; Author: Jeff Lee",
"Richard Green, James Introcaso, Ben McFarland, and Jon Sawatsky",
"Run Like Hell © 2019 Open Design LLC; Author: Mike Welham",
"Sanctuary of Belches © 2016 Open Design LLC; Author: Jon Sawatsky",
"Skeletons of the Illyrian Fleet © 2018 Open Design LLC; Author: James J. Haeck",
"Southlands Worldbook © 2021 Open Design LLC; Authors: Richard Green with Wolfgang Baur, Basheer Ghouse, and Kelly Pawlik",
"Streets of Zobeck © 2017 Open Design LLC; Authors: Chris Harris, Mike Franke, Ben McFarland, Richard Pett, Christina Stiles, and Matthew Stinson",
"Tales Beneath the Sands © 2021 Open Design LLC; Author: Jerry LeNeave",
"Tales of the Old Margreve © 2019 Open Design LLC; Authors: Wolfgang Baur, Matthew Corley,",
"Terror at the Twelve Goats Tavern © 2020 Open Design LLC; Author: Travis Legge",
"The Adoration of Quolo © 2019 Open Design LLC; Authors: James J. Haeck and Hannah Rose",
"The Empty Village © 2018 Open Design LLC; Author: Mike Welham",
"The Light of Memoria © 2020 Open Design LLC; Author: Victoria Jaczko",
"The Scarlet Citadel © 2021 Open Design LLC; Authors: Steven Winter with Wolfgang Baur, Scott Gable, and Victoria Jaczko",
"The Sunken Library of Qezzit Qire © 2019 Open Design LLC; Author: Mike Welham",
"The Wandering Whelp © 2019 Open Design LLC; Author: Benjamin L. Eastman",
"Three Little Pigs – Part Two: Armina’s Peril © 2019 Open Design LLC; Author: Richard Pett",
"Tome of Beasts 2 © 2020 Open Design LLC; Authors: Wolfgang Baur, Celeste Conowitch, Darrin Drader, James Introcaso, Phillip Larwood, Jeff Lee, Kelly Pawlik, Brian Suskind, and Mike Welham",
"Underworld Lairs © 2020 Open Design LLC; Authors: Jeff Lee, Ben McFarland, Shawn Merwin, Kelly Pawlik, Brian Suskind, and Mike Welham",
"Vault of Magic © 2021 Open Design LLC; Authors: Phillip Larwood, Jeff Lee, and Christopher Lockey Lee",
"Warlock 11: Treasure Vaults © 2019 Open Design LLC; Authors: Lysa Chen, Richard Pett, Marc Radle, and Mike Welham",
"Warlock 12: Dwarves © 2019 Open Design LLC; Authors: Wolfgang Baur, Robert Fairbanks, Ben McFarland, Hannah Rose, and Ashley Warren",
"Warlock 13: War and Battle © 2019 Open Design LLC; Authors: Kelly Pawlik and Brian Suskind",
"Warlock 17: Halflings © 2020 Open Design LLC; Authors: Victoria Jaczko and Kelly Pawlik",
"Warlock 18: Blood Kingdom © 2020 Open Design LLC; Author: Christopher Lockey",
"Warlock 19: Masters of the Arcane © 2020 Open Design LLC; Authors: Jon Sawatsky and Mike Welham",
"Warlock 2: Dread Magic © 2017 Open Design LLC; Authors: Wolfgang Baur, Dan Dillon, Richard Green, and Jon Sawatsky",
"Warlock 21: Legends © 2020 Open Design LLC; Authors: Lou Anders, Jon Sawatsky, and Mike Welham",
"Warlock 22: Druids © 2020 Open Design LLC; Authors: Wolfgang Baur, Jerry LeNeave, Ashley Warren, and Mike Welham",
"Warlock 23: Bearfolk © 2020 Open Design LLC; Authors: Celeste Conowitch, Sarah Madsen, and Mike Welham",
"Warlock 24: Weird Fantasy © 2021 Open Design LLC; Authors: Jeff Lee and Mike Shea",
"Warlock 25: Dungeons © 2021 Open Design LLC; Authors: Christopher Lockey, Kelly Pawlik, and Steve Winter",
"Warlock 6: City of Brass © 2018 Open Design LLC; Authors: Richard Green, Jeff Grubb, Richard Pett, and Steve Winter",
"Warlock 9: World Tree © 2018 Open Design LLC; Authors: Wolfgang Baur, Richard Green, Sarah Madsen, and Kelly Pawlik",
"Warlock Grimoire © 2019 Open Design LLC; Authors: Wolfgang Baur, Lysa Chen, Dan Dillon, Richard Green, Jeff Grubb, James J. Haeck, Chris Harris, Jeremy Hochhalter, Brandon Hodge, Sarah Madsen, Ben McFarland, Shawn Merwin, Kelly Pawlik, Richard Pett, Hannah Rose, Jon Sawatsky, Brian Suskind, Troy E. Taylor, Steve Winter, and Peter von Bleichert",
"Warlock Grimoire 2 © 2020 Open Design LLC; Authors: Wolfgang Baur, Celeste Conowitch, David “Zeb” Cook, Dan Dillon, Robert Fairbanks, Scott Gable, Richard Green, Victoria Jaczko, TK Johnson, Christopher Lockey, Sarah Madsen, Greg Marks, Ben McFarland, Kelly Pawlik, Lysa Penrose, Richard Pett, Marc Radle, Hannah Rose, Jon Sawatsky, Robert Schwalb, Brian Suskind, Ashley Warren, and Mike Welham",
"Warlock Guide to the Planes © 2021 Open Design LLC; Authors: Wolfgang Baur and Brian Suskind Warlock Guide to the Shadow Realms © 2019 Open Design LLC; Author: Kelly Pawlik",
"Wrath of the Bramble King © 2018 Open Design LLC; Author: Mike Welham",
"Wrath of the River King © 2017 Open Design LLC; Authors: Wolfgang Baur and Robert Fairbanks Zobeck Gazetteer for 5th Edition © 2018 Open Design LLC; Authors: James J. Haeck",
"Zobeck Gazetteer for 5th Edition © 2018 Open Design LLC; Authors: James J. Haeck",
"Vault of Magic © 2021 Open Design LLC; Authors: Phillip Larwood, Jeff Lee, and Christopher Lockey"
        ]
    }
]
