[
  {
    "name": "Criminal",
    "desc": "As a career criminal you were acquainted with murderers, thieves, and those who hunt them. Your new career as an adventurer is, relatively speaking, an honest trade.\n\nWere you a pickpocket? An assassin? A back-alley mugger? Are you still?",
    "ability-score_increases": "+1 to Dexterity and one other ability score.",
    "skill-proficiencies": "Stealth, and either Deception or Intimidation.",
    "equipment": "Common clothes, dark cloak, thieves' tools.",
    "feature-name": "Thieves' Cant",
    "feature-description": "You know thieves' cant: a set of slang, hand signals, and code terms used by professional criminals. A creature that knows thieves' cant can hide a short message within a seemingly innocent statement. A listener who knows thieves' cant understands the message.",
    "suggested-characteristics": "### **Criminal Mementos**\n\n1. A golden key to which you haven't discovered the lock.\n2. A brand that was burned into your shoulder as punishment for a crime.\n3. A scar for which you have sworn revenge.\n4. The distinctive mask that gives you your nickname (for instance, the Black Mask or the Red Fox).\n5. A gold coin which reappears in your possession a week after you've gotten rid of it.\n6. The stolen symbol of a sinister organization; not even your fence will take it off your hands.\n7. Documents that incriminate a dangerous noble or politician.\n8. The floor plan of a palace.\n9. The calling cards you leave after (or before) you strike.\n10. A manuscript written by your mentor: *Secret Exits of the World's Most Secure Prisons*.",
    "adventures-and-advancement": "If you pull off several successful jobs or heists, you may be promoted (or reinstated) as a leader in your gang. You may gain the free service of up to 8"
  },
  {
    "name": "Farmer",
    "desc": "You were raised a farmer, an occupation where the money is short and the work days are long. You've become an adventurer, a career where the money is plentiful but your days—if you're not careful—may be all too short.\n\nWhy did you beat your plowshare into a sword? Do you seek adventure, excitement, or revenge? Do you leave behind a thriving farmstead or a smoking ruin?",
    "ability-score_increases": "+1 to Wisdom and one other ability score.",
    "skill-proficiencies": "Nature, and either Animal Handling or Survival.",
    "equipment": "Common clothes, shovel, mule with saddlebags, 5 Supply.",
    "feature-name": "Bit and Bridle",
    "feature-description": "You know how to stow and transport food. You and one animal under your care can each carry additional",
    "suggested-characteristics": "### **Farmer Mementos**\n\n1. A strange item you dug up in a field: a key, a lump of unmeltable metal, a glass dagger.\n2. The bag of beans your mother warned you not to plant.\n3. The shovel, pickaxe, pitchfork, or other tool you used for labor. For you it's a one-handed simple melee weapon that deals 1d6 piercing, slashing, or bludgeoning damage.\n4. A debt you must pay.\n5. A mastiff.\n6. Your trusty fishing pole.\n7. A corncob pipe.\n8. A dried flower from your family garden.\n9. Half of a locket given to you by a missing sweetheart.\n10. A family weapon said to have magic powers, though it exhibits none at the moment.",
    "adventures-and-advancement": "You left the farm for a reason but you still have an eye for land. If you acquire farming property, estates, or domains, you can earn twice as much as you otherwise would from their harvests, or be supported by your lands at a lifestyle one level higher than you otherwise would be."
  },
  {
    "name": "Outlander",
    "desc": "You lived far from the farms and fields of civilization. You know the beauties and the dangers of the wilderness.\n\nWere you part of a nomadic tribe? A hunter or guide? A lone wanderer or explorer? A guardian of civilization against monsters, or of the old ways against civilization?",
    "ability-score_increases": "+1 to Constitution and one other ability score.",
    "skill-proficiencies": "Survival, and either Athletics or Intimidation.",
    "equipment": "Traveler's clothes, waterskin, healer's kit, 7 days rations.",
    "feature-name": "Trader",
    "feature-description": "If you're in or near the wilderness and have a trading relationship with a tribe, settlement, or other nearby group, you can maintain a moderate lifestyle for yourself and your companions by trading the products of your hunting and gathering.",
    "suggested-characteristics": "### **Outlander Mementos**\n\n1. A trophy from the hunt of a mighty beast, such as an phase monster-horn helmet.\n2. A trophy from a battle against a fierce monster, such as a still-wriggling troll finger.\n3. A stone from a holy druidic shrine.\n4. Tools appropriate to your home terrain, such as pitons or snowshoes.\n5. Hand-crafted leather armor, hide armor, or clothing.\n6. The handaxe you made yourself.\n7. A gift from a dryad or faun.\n8. Trading goods worth 30 gold, such as furs or rare herbs.\n9. A tiny whistle given to you by a sprite.\n10. An incomplete map.",
    "adventures-and-advancement": "During your travels, wilderness dwellers may come to you for help battling monsters and other dangers. If you succeed in several such adventures, you may earn the freely given aid of up to 8"
  },
  {
    "name": "Trader",
    "desc": "You served your apprenticeship among merchants and traders. You've traveled dusty miles and haggled under distant skies.\n\nWhy are you living a life of adventure? Are you working off your debt to the company store? Are you escorting a caravan through dangerous wilds?\n\nAre you raising capital to start your own business, or trying to restore the fortunes of a ruined trading family? Or are you a smuggler, following secret trade routes unknown to the authorities?",
    "ability-score_increases": "+1 to Charisma and one other ability score.",
    "skill-proficiencies": "Persuasion, and either Culture, Deception, or Insight.",
    "equipment": "Traveler's clothes, abacus, merchant's scale.",
    "feature-name": "Supply and Demand",
    "feature-description": "When you buy a trade good and sell it elsewhere to a community in need of that good, you gain a 10% bonus to its sale price for every 100 miles between the buy and sell location (maximum of 50%).",
    "suggested-characteristics": "### **Trader Mementos**\n\n1. The first gold piece you earned.\n2. Thousands of shares in a failed venture.\n3. A letter of introduction to a rich merchant in a distant city.\n4. A sample of an improved version of a common tool.\n5. Scars from a wound sustained when you tried to collect a debt from a vicious noble.\n6. A love letter from the heir of a rival trading family.\n7. A signet ring bearing your family crest, which is famous in the mercantile world.\n8. A contract binding you to a particular trading company for the next few years.\n9. A letter from a friend imploring you to invest in an opportunity that can't miss.\n10. A trusted family member's travel journals that mix useful geographical knowledge with tall tales.",
    "adventures-and-advancement": "Because of your commercial contacts you may be offered money to lead or escort trade caravans. You'll receive a fee from each trader that reaches their destination safely."
  },
  {
    "name": "Artisan",
    "desc": "You are skilled enough in a trade to make a comfortable living and to aspire to mastery of your art. Yet here you are, ready to slog through mud and blood and danger.\n\nWhy did you become an adventurer? Did you flee a cruel master? Were you bored? Or are you a member in good standing, looking for new materials and new markets?",
    "ability-score_increases": "+1 to Intelligence and one other ability score.",
    "skill-proficiencies": "Persuasion, and either Insight or History.",
    "equipment": "One set of artisan's tools, traveler's clothes.",
    "feature-name": "Trade Mark",
    "feature-description": "* When in a city or town, you have access to a fully-stocked workshop with everything you need to ply your trade. Furthermore, you can expect to earn full price when you sell items you have crafted (though there is no guarantee of a buyer).",
    "suggested-characteristics": "### **Artisan Mementos**\n\n1. *Jeweler:* A 10,000 gold commission for a ruby ring (now all you need is a ruby worth 5,000 gold).\n2. *Smith:* Your blacksmith's hammer (treat as a light hammer).\n3. *Cook:* A well-seasoned skillet (treat as a mace).\n4. *Alchemist:* A formula with exotic ingredients that will produce...something.\n5. *Leatherworker:* An exotic monster hide which could be turned into striking-looking leather armor.\n6. *Mason:* Your trusty sledgehammer (treat as a warhammer).\n7. *Potter:* Your secret technique for vivid colors which is sure to disrupt Big Pottery.\n8. *Weaver:* A set of fine clothes (your own work).\n9. *Woodcarver:* A longbow, shortbow, or crossbow (your own work).\n10. *Calligrapher:* Strange notes you copied from a rambling manifesto. Do they mean something?",
    "adventures-and-advancement": "If you participate in the creation of a magic item (a “master work”), you will gain the services of up to 8 commoner apprentices with the appropriate tool proficiency."
  },
  {
    "name": "Entertainer",
    "desc": "You're a performer who knows how to dazzle a crowd, an artist but also a professional: you never forget to pass the hat after a show.\n\nAre you a lute-strumming singer? An actor? A poet or author? A tumbler or juggler? Are you a rising talent, or a star with an established following?",
    "ability-score_increases": "+1 to Charisma and one other ability score.",
    "skill-proficiencies": "Performance, and either Acrobatics, Culture, or Persuasion.",
    "equipment": "Lute or other musical instrument, costume.",
    "feature-name": "Pay the Piper",
    "feature-description": "In any settlement in which you haven't made yourself unpopular, your performances can earn enough money to support yourself and your companions: the bigger the settlement, the higher your standard of living, up to a moderate lifestyle in a city.",
    "suggested-characteristics": "### **Entertainer Mementos**\n\n1. Your unfinished masterpiece—if you can find inspiration to overcome your writer's block.\n2. Fine clothing suitable for a noble and some reasonably convincing costume jewelry.\n3. A love letter from a rich admirer.\n4. A broken instrument of masterwork quality—if repaired, what music you could make on it!\n5. A stack of slim poetry volumes you just can't sell.\n6. Jingling jester's motley.\n7. A disguise kit.\n8. Water-squirting wands, knotted scarves, trick handcuffs, and other tools of a bizarre new entertainment trend: a nonmagical magic show.\n9. A stage dagger.\n10. A letter of recommendation from your mentor to a noble or royal court.",
    "adventures-and-advancement": ".Some of your admirers will pay you to plead a cause or smear an enemy. If you succeed at several such quests, your fame will grow. You will be welcome at royal courts, which will support you at a rich lifestyle."
  },
  {
    "name": "Guildmember",
    "desc": "It never hurts to be part of a team, and when you're part of a guild opportunities knock at your door.\n\nAre you a member of a trade or artisan's guild? Or an order of mages or monster hunters? Or have you found entry into a secretive guild of thieves or assassins?",
    "ability-score_increases": "+1 to Constitution and one other ability score.",
    "skill-proficiencies": "Two of your choice.",
    "equipment": "One set of artisan's tools or one instrument, traveler's clothes, guild badge.",
    "feature-name": "Guild Business",
    "feature-description": "While in a city or town, you can maintain a moderate lifestyle by plying your trade. Furthermore, the guild occasionally informs you of jobs that need doing. Completing such a job might require performing a downtime activity, or it might require a full adventure. The guild provides a modest reward if you're successful.",
    "suggested-characteristics": "### **Guildmember Mementos**\n\n1. *Artisans Guild:* An incomplete masterpiece which your mentor never finished.\n2. *Entertainers Guild:* An incomplete masterpiece which your mentor never finished.\n3. *Explorers Guild:* A roll of incomplete maps each with a reward for completion.\n4. *Laborers Guild:* A badge entitling you to a free round of drinks at most inns and taverns.\n5. *Adventurers Guild:* A request from a circus to obtain live exotic animals.\n6. *Bounty Hunters Guild:* A set of manacles and a bounty on a fugitive who has already eluded you once.\n7. *Mages Guild:* The name of a wizard who has created a rare version of a spell that the guild covets.\n8. *Monster Hunters Guild:* A bounty, with no time limit, on a monster far beyond your capability.\n9. *Archaeologists Guild:* A map marking the entrance of a distant dungeon.\n10. *Thieves Guild:* Blueprints of a bank, casino, mint, or other rich locale.",
    "adventures-and-advancement": "Once you have completed several quests or endeavors advancing guild business, you may be promoted to guild officer. You gain access to more lucrative contracts. In addition, the guild supports you at a moderate lifestyle without you having to work."
  },
  {
    "name": "Sage",
    "desc": "You are a seeker of the world's truths and an expert in your chosen field, with esoteric knowledge at your fingertips, or at the farthest, in a book you vaguely remember.\n\nWhy have you left the confines of the library to explore the wider world? Do you seek ancient wisdom? Power? The answer to a specific question? Reinstatement in your former institution?",
    "ability-score_increases": "+1 to Intelligence and one other ability score.",
    "skill-proficiencies": "History, and either Arcana, Culture, Engineering, or Religion.",
    "equipment": "Bottle of ink, pen, 50 sheets of parchment, common clothes.",
    "feature-name": "Library Privileges",
    "feature-description": "As a fellow or friend of several universities you have visiting access to the great libraries, most of which are off-limits to the general public. With enough time spent in a library, you can uncover most of the answers you seek (any question answerable with a DC 20 Arcana, Culture, Engineering, History, Nature, or Religion check).",
    "suggested-characteristics": "### **Sage Mementos**\n\n1. A letter from a colleague asking for research help.\n2. Your incomplete manuscript.\n3. An ancient scroll in a language that no magic can decipher.\n4. A copy of your highly unorthodox theoretical work that got you in so much trouble.\n5. A list of the forbidden books that may answer your equally forbidden question.\n6. A formula for a legendary magic item for which you have no ingredients.\n7. An ancient manuscript of a famous literary work believed to have been lost; only you believe that it is genuine.\n8. Your mentor's incomplete bestiary, encyclopedia, or other work that you vowed to complete.\n9. Your prize possession: a magic quill pen that takes dictation.\n10. The name of a book you need for your research that seems to be missing from every library you've visited.",
    "adventures-and-advancement": "When you visit libraries and universities you tend to be asked for help in your role as a comparatively rough-and-tumble adventurer. After fetching a few bits of esoteric knowledge and settling a few academic disputes, you may be granted access to the restricted areas of the library (which contain darker secrets and deeper mysteries, such as those answerable with a DC 25 Arcana, Culture, Engineering, History, Nature, or Religion check)."
  },
  {
    "name": "Folk Hero",
    "desc": "You were born to a commoner family, but some event earned you fame. You're admired locally, and tales of your deeds have reached the far corners of the world.\n\nDid you win your fame by battling an oppressive tyrant? Saving your village from a monster? Or by something more prosaic like winning a wrestling bout or a pie-eating contest?",
    "ability-score_increases": "+1 to Constitution and one other ability score.",
    "skill-proficiencies": "Survival, and either Animal Handling or Nature.",
    "equipment": "Any artisan's tools except alchemist's supplies, common clothes.",
    "feature-name": "Local Fame",
    "feature-description": "Unless you conceal your identity, you're universally recognized and admired near the site of your exploits. You and your companions are treated to a moderate lifestyle in any settlement within 100 miles of your Prestige Center.",
    "suggested-characteristics": "### **Folk Hero Mementos**\n\n1. The mask you used to conceal your identity while fighting oppression (you are only recognized as a folk hero while wearing the mask).\n2. A necklace bearing a horn, tooth, or claw from the monster you defeated.\n3. A ring given to you by the dead relative whose death you avenged.\n4. The weapon you wrestled from the leader of the raid on your village.\n5. The trophy, wrestling belt, silver pie plate, or other prize marking you as the county champion.\n6. The famous scar you earned in your struggle against your foe.\n7. The signature weapon which provides you with your nickname.\n8. The injury or physical difference by which your admirers and foes recognize you.\n9. The signal whistle or instrument which you used to summon allies and spook enemies.\n10. Copies of the ballads and poems written in your honor.",
    "adventures-and-advancement": "Common folk come to you with all sorts of problems. If you fought an oppressive regime, they bring you tales of injustice. If you fought a monster, they seek you out with monster problems. If you solve many such predicaments, you become universally famous, gaining the benefits of your Local Fame feature in every settled land."
  },
  {
    "name": "Charlatan",
    "desc": "People call you a con artist, but you're really an entertainer. You make people happy—the separation of fools and villains from their money is purely a pleasant side effect.\n\nWhat is your most common con? Selling fake magic items? Speaking to ghosts? Posing as a long-lost relative? Or do you let dishonest people think they're cheating you?",
    "ability-score_increases": "+1 to Charisma and one other ability score.",
    "skill-proficiencies": "Deception, and either Culture, Insight, or Sleight of Hand.",
    "equipment": "Common clothes, disguise kit, forgery kit.",
    "feature-name": "Many Identities",
    "feature-description": "You have a bundle of forged papers of all kinds—property deeds, identification papers, love letters, arrest warrants, and letters of recommendation—all needing only a few signatures and flourishes to meet the current need. When you encounter a new document or letter, you can add a forged and modified copy to your bundle. If your bundle is lost, you can recreate it with a forgery kit and a day's work.",
    "suggested-characteristics": "### **Charlatan Mementos**\n\n1. A die that always comes up 6.\n2. A dozen brightly-colored “potions”.\n3. A magical staff that emits a harmless shower of sparks when vigorously thumped.\n4. A set of fine clothes suitable for nobility.\n5. A genuine document allowing its holder one free release from prison for a non-capital crime.\n6. A genuine deed to a valuable property that is, unfortunately, quite haunted.\n7. An ornate harlequin mask.\n8. Counterfeit gold coins or costume jewelry apparently worth 100 gold (DC 15Investigationcheck to notice they're fake).\n9. A sword that appears more magical than it really is (its blade is enchanted with *continual flame* and it is a mundane weapon).\n10. A nonmagical crystal ball.",
    "adventures-and-advancement": "If you pull off a long-standing impersonation or false identity with exceptional success, you may eventually legally become that person. If you're impersonating a real person, they might be considered the impostor. You gain any property and servants associated with your identity."
  },
  {
    "name": "Gambler",
    "desc": "You haven't met your match at dice or cards. A career of high stakes and daring escapades has taught you when to play close to the chest and when to risk it all—but you haven't yet learned when to walk away.\n\nAre you a brilliant student of the game, a charming master of the bluff and counterbluff, or a cheater with fast hands? What turned you to a life of adventure: a string of bad luck, or an insatiable thirst for risk?",
    "ability-score_increases": "+1 to Charisma and one other ability score.",
    "skill-proficiencies": "Deception, and either Insight or Sleight of Hand.",
    "equipment": "Fine clothes, dice set, playing card set.",
    "feature-name": "Lady Luck",
    "feature-description": "Each week you may attempt a “lucky throw” to support yourself by gambling. Roll a d6 to determine the lifestyle you can afford with your week's winnings (1–2: poor, 3–5: moderate, 6: rich).",
    "suggested-characteristics": "### **Gambler Mementos**\n\n1. Gambling debts owed you by someone who's gone missing.\n2. Your lucky coin that you've always won back after gambling it away.\n3. The deeds to a monster-infested copper mine, a castle on another plane of existence, and several other valueless properties.\n4. A pawn shop ticket for a valuable item—if you can gather enough money to redeem it.\n5. The hard-to-sell heirloom that someone really wants back.\n6. Loaded dice or marked cards. They grant advantage on gambling checks when used, but can be discovered when carefully examined by someone with the appropriate tool proficiency (dice or cards).\n7. An invitation to an annual high-stakes game to which you can't even afford the ante.\n8. A two-faced coin.\n9. A torn half of a card—a long-lost relative is said to hold the other half.\n10. An ugly trinket that its former owner claimed had hidden magical powers.",
    "adventures-and-advancement": "Once you've had more than your fair share of lucky throws, you attract the attention of richer opponents. You add +1 to all your lucky throws. Additionally, you and your friends may be invited to exclusive games with more at stake than money."
  },
  {
    "name": "Marauder",
    "desc": "You were a member of an outlaw band. You might have been part of a troop of cutthroat bandits, or a resistance movement battling a tyrant, or a pirate fleet. You lived outside of settled lands, and your name was a terror to rich travelers.\n\nHow did you join your outlaw band? Why did you leave it—or did you?",
    "ability-score_increases": "+1 to Dexterity and one other ability score.",
    "skill-proficiencies": "Survival, and either Intimidation or Stealth.",
    "equipment": "Traveler's clothes, signal whistle, tent (one person).",
    "feature-name": "Secret Ways",
    "feature-description": "When you navigate while traveling, pursuers have",
    "suggested-characteristics": "### **Marauder Mementos**\n\n1. The eerie mask by which your victims know you.\n2. The one item that you wish you hadn't stolen.\n3. A signet ring marking you as heir to a seized estate.\n4. A locket containing a picture of the one who betrayed you.\n5. A broken compass.\n6. A love token from the young heir to a fortune.\n7. Half of a torn officer's insignia.\n8. The hunter's horn which members of your band use to call allies.\n9. A wanted poster bearing your face.\n10. Your unfinished thesis from your previous life as an honest scholar.",
    "adventures-and-advancement": "Allies and informants occasionally give you tips about the whereabouts of poorly-guarded loot. After a few such scores, you may gain the free service of up to 8"
  },
  {
    "name": "Hermit",
    "desc": "You lived for years alone in a remote shrine, cave, monastery, or elsewhere away from the world. Among your daily tasks you had lots of time for introspection.\n\nWhy were you alone? Were you performing penance? In exile or hiding? Tending a shrine or holy spot? Grieving?",
    "ability-score_increases": "+1 to Wisdom and one other ability score.",
    "skill-proficiencies": "Religion, and either Medicine or Survival.",
    "equipment": "Healer's satchel, herbalism kit, common clothes, 7 days rations, and a prayer book, prayer wheel, or prayer beads.",
    "feature-name": "Inner Voice",
    "feature-description": "You occasionally hear a voice—perhaps your conscience, perhaps a higher power—which you have come to trust. It told you to go into seclusion, and then it advised you when to rejoin the world. You think it is leading you to your destiny (consult with your Narrator about this feature.)",
    "suggested-characteristics": "### **Hermit Mementos**\n\n1. The (possibly unhinged) manifesto, encyclopedia, or theoretical work that you spent so much time on.\n2. The faded set of fine clothes you preserved for so many years.\n3. The signet ring bearing the family crest that you were ashamed of for so long.\n4. The book of forbidden secrets that led you to your isolated refuge.\n5. The beetle, mouse, or other small creature which was your only companion for so long.\n6. The seemingly nonmagical item that your inner voice says is important.\n7. The magic-defying clay tablets you spent years translating.\n8. The holy relic you were duty bound to protect.\n9. The meteor metal you found in a crater the day you first heard your inner voice.\n10. Your ridiculous-looking sun hat.",
    "adventures-and-advancement": "Your inner voice may occasionally prompt you to accept certain adventure opportunities or to avoid certain actions. You are free to obey or disobey this voice. Eventually however it may lead you to a special revelation, adventure, or treasure."
  },
  {
    "name": "Sailor",
    "desc": "You're an experienced mariner with a keen weather eye and a favorite tavern in every port. Hard voyages have toughened you and the sea's power has made you humble.\n\nWere you a deckhand, an officer, or the captain of your vessel? Did you crew a naval cutter, a fishing boat, a merchant's barge, a privateering vessel, or a pirate ship?",
    "ability-score_increases": "+1 to Constitution and one other ability score.",
    "skill-proficiencies": "Athletics, and either Acrobatics or Perception.",
    "equipment": "Common clothes, navigator's tools, 50 feet of rope.",
    "feature-name": "Sea Salt",
    "feature-description": "Your nautical jargon and rolling gait mark you unmistakably as a mariner. You can easily enter into shop talk with any sailors that are not hostile to you, learning nautical gossip and ships' comings and goings. You also recognize most large ships by sight and by name, and can make a History orCulturecheck to recall their most recent captain and allegiance.",
    "suggested-characteristics": "### **Sailor Mementos**\n\n1. A dagger with a handle carved from a dragon turtle's tooth.\n2. A scroll tube filled with nautical charts.\n3. A harpoon (treat as a javelin with its butt end fastened to a rope).\n4. A scar with a famous tale behind it.\n5. A treasure map.\n6. A codebook which lets you decipher a certain faction's signal flags.\n7. A necklace bearing a scale, shell, tooth, or other nautical trinket.\n8. Several bottles of alcohol.\n9. A tale of an eerie encounter with a strange monster, a ghost ship, or other mystery.\n10. A half-finished manuscript outlining an untested theory about how to rerig a ship to maximize speed.",
    "adventures-and-advancement": ".You and your companions will be able to take passage for free on nearly any commercial ship in exchange for occasional ship duties when all hands are called. In addition, after you have a few naval exploits under your belt your fame makes sailors eager to sail under you. You can hire a ship's crew at half the usual price."
  },
  {
    "name": "Exile",
    "desc": "Your homeland is barred to you and you wander strange lands. You will never be mistaken for a local but you find ready acceptance among other adventurers, many of which are as rootless as you are.\n\nAre you a banished noble? A refugee from war or from an undead uprising? A dissident or a criminal on the run? Or a stranded traveler from an unreachable distant land?",
    "ability-score_increases": "+1 to Wisdom and one other ability score.",
    "skill-proficiencies": "Survival, and either History or Performance.",
    "equipment": "Traveler's clothes, 10 days rations.",
    "feature-name": "Fellow Traveler",
    "feature-description": "You gain an",
    "suggested-characteristics": "### **Exile Mementos**\n\n1. A musical instrument which was common in your homeland.\n2. A memorized collection of poems or sagas.\n3. A locket containing a picture of your betrothed from whom you are separated.\n4. Trade, state, or culinary secrets from your native land.\n5. A piece of jewelry given to you by someone you will never see again.\n6. An inaccurate, ancient map of the land you now live in.\n7. Your incomplete travel journals.\n8. A letter from a relative directing you to someone who might be able to help you.\n9. A precious cultural artifact you must protect.\n10. An arrow meant for the heart of your betrayer.",
    "adventures-and-advancement": "You may occasionally meet others from your native land. Some may be friends, and some dire enemies; few will be indifferent to you. After a few such encounters, you may become the leader of a faction of exiles. Your followers include up to three NPCs of Challenge Rating ½ or less, such as"
  },
  {
    "name": "Urchin",
    "desc": "You grew up on the streets. You know where to hide and when your puppy dog eyes will earn you a hot meal.\n\nWhy were you on the streets? Were you a runaway? An orphan? Or just an adventurous kid who stayed out late?",
    "ability-score_increases": "+1 to Dexterity and one other ability score.",
    "skill-proficiencies": "Sleight of Hand, and either Deception or Stealth.",
    "equipment": "Common clothes, disguise kit.",
    "feature-name": "Guttersnipe",
    "feature-description": "When you're in a town or city, you can provide a poor lifestyle for yourself and your companions. Also, you know how to get anywhere in town without being spotted by gangs, gossips, or guard patrols.",
    "suggested-characteristics": "### **Urchin Mementos**\n\n1. A locket containing pictures of your parents.\n2. A set of (stolen?) fine clothes.\n3. A small trained animal, such as a mouse, parrot, or monkey.\n4. A map of the sewers.\n5. The key or signet ring that was around your neck when you were discovered as a foundling.\n6. A battered one-eyed doll.\n7. A portfolio of papers given to you by a fleeing, wounded courier.\n8. A gold tooth (not yours, and not in your mouth).\n9. The flowers or trinkets that you sell.\n10. A dangerous secret overheard while at play.",
    "adventures-and-advancement": ".Street kids are among a settlement's most vulnerable people, especially in cities with lycanthropes, vampires, and other supernatural threats. After you help out a few urchins in trouble, word gets out and you'll be able to consult the street network to gather information. If you roll lower than a 15 on an Investigation check to gather information in a city or town, your roll is treated as a 15."
  }
]