[
{
  "model": "api_v2.background",
  "pk": "court-servant",
  "fields": {
    "name": "Court Servant",
    "desc": "Even though you are independent now, you were once a servant to a merchant, noble, regent, or other person of high station. You are an expert in complex social dynamics and knowledgeable in the history and customs of courtly life. Work with your GM to determine whom you served and why you are no longer a servant: did your master or masters retire and no longer require servants, did you resign from the service of a harsh master, did the court you served fall to a neighboring empire, or did something else happen?",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "desert-runner",
  "fields": {
    "name": "Desert Runner",
    "desc": "You grew up in the desert. As a nomad, you moved from place to place, following the caravan trails. Your upbringing makes you more than just accustomed to desert living—you thrive there. Your family has lived in the desert for centuries, and you know more about desert survival than life in the towns and cities.",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "destined",
  "fields": {
    "name": "Destined",
    "desc": "Duty is a complicated, tangled affair, be it filial, political, or civil. Sometimes, there's wealth and intrigue involved, but more often than not, there's also obligation and responsibility. You are a person with just such a responsibility. This could involve a noble title, an arranged marriage, a family business you're expected to administer, or an inherited civil office. You promised to fulfill this responsibility, you are desperately trying to avoid this duty, or you might even be seeking the person intended to be at your side. Regardless of the reason, you're on the road, heading toward or away from your destiny.\n\n***Destiny***\nYou're a person who's running from something or hurtling headfirst towards something, but just what is it? The responsibility or event might be happily anticipated or simply dreaded; either way, you're committed to the path. Choose a destiny or roll a d8 and consult the table below.\n\n| d8 | Destiny                                                                                                                  |\n|----|---------------------------------------------------------------------------------------------------------------------------|\n| 1  | You are running away from a marriage.                                                                                     |\n| 2  | You are seeking your runaway betrothed.                                                                                   |\n| 3  | You don't want to take over your famous family business.                                                                  |\n| 4  | You need to arrive at a religious site at a specific time to complete an event or prophecy.                               |\n| 5  | Your noble relative died, and you're required to take their vacant position.                                              |\n| 6  | You are the reincarnation of a famous figure, and you're expected to live in an isolated temple.                          |\n| 7  | You were supposed to serve an honorary but dangerous position in your people's military.                                  |\n| 8  | Members of your family have occupied a civil office (court scribe, sheriff, census official, or similar) for generations. |",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "diplomat",
  "fields": {
    "name": "Diplomat",
    "desc": "You have always found harmonious solutions to conflict. You might have started mediating family conflicts as a child. When you were old enough to recognize aggression, you sought to defuse it. You often resolved disputes among neighbors, arriving at a fair middle ground satisfactory to all parties.",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "forest-dweller",
  "fields": {
    "name": "Forest Dweller",
    "desc": "You are a creature of the forest, born and reared under a canopy of green. You expected to live all your days in the forest, at one with the green things of the world, until an unforeseen occurrence, traumatic or transformative, drove you from your familiar home and into the larger world. Civilization is strange to you, the open sky unfamiliar, and the bizarre ways of the so-called civilized world run counter to the truths of the natural world.",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "former-adventurer",
  "fields": {
    "name": "Former Adventurer",
    "desc": "As you belted on your weapons and hoisted the pack onto your back, you never thought you'd become an adventurer again. But the heroic call couldn't be ignored. You've tried this once before—perhaps it showered you in wealth and glory or perhaps it ended with sorrow and regret. No one ever said adventuring came with a guarantee of success.\n  Now, the time has come to set off toward danger once again. The reasons for picking up adventuring again vary. Could it be a calamitous threat to the town? The region? The world? Was the settled life not what you expected? Or did your past finally catch up to you? In the end, all that matters is diving back into danger. And it's time to show these new folks how it's done.\n\n***Reason for Retirement***\nGiving up your first adventuring career was a turning point in your life. Triumph or tragedy, the reason why you gave it up might still haunt you and may shape your actions as you reenter the adventuring life. Choose the event that led you to stop adventuring or roll a d12 and consult the table below.\n\n| d12  | Event                                                                                                      |\n|------|------------------------------------------------------------------------------------------------------------|\n| 1    | Your love perished on one of your adventures, and you quit in despair.                                     |\n| 2    | You were the only survivor after an ambush by a hideous beast.                                             |\n| 3    | Legal entanglements forced you to quit, and they may cause you trouble again.                              |\n| 4    | A death in the family required you to return home.                                                         |\n| 5    | Your old group disowned you for some reason.                                                               |\n| 6    | A fabulous treasure allowed you to have a life of luxury, until the money ran out.                         |\n| 7    | An injury forced you to give up adventuring.                                                               |\n| 8    | You suffered a curse which doomed your former group, but the curse has finally faded away.                 |\n| 9    | You rescued a young child or creature and promised to care for them. They have since grown up and left.    |\n| 10   | You couldn't master your fear and fled from a dangerous encounter, never to return.                        |\n| 11   | As a reward for helping an area, you were offered a position with the local authorities, and you accepted. |\n| 12   | You killed or defeated your nemesis. Now they are back, and you must finish the job.                       |",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "freebooter",
  "fields": {
    "name": "Freebooter",
    "desc": "You sailed the seas as a freebooter, part of a pirate crew. You should come up with a name for your former ship and its captain, as well as its hunting ground and the type of ships you preyed on. Did you sail under the flag of a bloodthirsty captain, raiding coastal communities and putting everyone to the sword? Or were you part of a group of former slaves turned pirates, who battle to end the vile slave trade? Whatever ship you sailed on, you feel at home on board a seafaring vessel, and you have difficulty adjusting to long periods on dry land.",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "gamekeeper",
  "fields": {
    "name": "Gamekeeper",
    "desc": "You are at home in natural environments, chasing prey or directing less skilled hunters in the best ways to track game through the brush. You know the requirements for encouraging a herd to grow, and you know what sustainable harvesting from a herd involves. You can train a hunting beast to recognize an owner and perform a half-dozen commands, given the time. You also know the etiquette for engaging nobility or other members of the upper classes, as they regularly seek your services, and you can carry yourself in a professional manner in such social circles.",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "innkeeper",
  "fields": {
    "name": "Innkeeper",
    "desc": "You spent some time as an innkeeper, tavern keeper, or perhaps a bartender. It might have been in a small crossroads town, a fishing community, a fine caravanserai, or a large cosmopolitan community. You did it all; preparing food, tracking supplies, tapping kegs, and everything in between. All the while, you listened to the adventurers plan their quests, heard their tales, saw their amazing trophies, marveled at their terrible scars, and eyed their full purses. You watched them come and go, thinking, “one day, I will have my chance.” Your time is now.\n\n***Place of Employment***\nWhere did you work before turning to the adventuring life? Choose an establishment or roll a d6 and consult the table below. Once you have this information, think about who worked with you, what sort of customers you served, and what sort of reputation your establishment had.\n\n| d6 | Establishment                                              |\n|----|------------------------------------------------------------|\n| 1  | Busy crossroads inn                                        |\n| 2  | Disreputable tavern full of scum and villainy              |\n| 3  | Caravanserai on a wide-ranging trade route                 |\n| 4  | Rough seaside pub                                          |\n| 5  | Hostel serving only the wealthiest clientele               |\n| 6  | Saloon catering to expensive and sometimes dangerous tastes |",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "mercenary-company-scion",
  "fields": {
    "name": "Mercenary Company Scion",
    "desc": "You descend from a famous line of free company veterans, and your first memory is playing among the tents, training yards, and war rooms of one campaign or another. Adored or perhaps ignored by your parents, you spent your formative years learning weapons and armor skills from brave captains, camp discipline from burly sergeants, and a host of virtues and vices from the common foot soldiers. You've always been told you are special and destined to glory. The weight of your family's legacy, honor, or reputation can weigh heavily, inspiring you to great deeds, or it can be a factor you try to leave behind.\r\n\r\n***Mercenary Company Reputation***\r\nYour family is part of or associated with a mercenary company. The company has a certain reputation that may or may not continue to impact your life. Roll a d8 or choose from the options in the Mercenary Company Reputation table to determine the reputation of this free company.\r\n\r\n| d8 | Mercenary Company Reputation                                                               |\r\n|----|--------------------------------------------------------------------------------------------|\r\n| 1  | Infamous. The company's evil deeds follow any who are known to consort with them.          |\r\n| 2  | Honest. An upstanding company whose words and oaths are trusted.                           |\r\n| 3  | Unknown. Few know of this company. Its deeds have yet to be written.                       |\r\n| 4  | Feared. For good or ill, this company is generally feared on the battlefield.              |\r\n| 5  | Mocked. Though it tries hard, the company is the butt of many jokes and derision.          |\r\n| 6  | Specialized. This company is known for a specific type of skill on or off the battlefield. |\r\n| 7  | Disliked. For well-known reasons, this company has a bad reputation.                       |\r\n| 8  | Famous. The company's great feats and accomplishments are known far and wide.              |",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "mercenary-recruit",
  "fields": {
    "name": "Mercenary Recruit",
    "desc": "Every year, the hopeful strive to earn a place in one of the great mercenary companies. Some of these would-be heroes received training from a mercenary company but needed more training before gaining membership. Others are full members but were selected to venture abroad to gain more experience before gaining a rank. You are one of these hopeful warriors, just beginning to carve your place in the world with blade, spell, or skill.",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "monstrous-adoptee",
  "fields": {
    "name": "Monstrous Adoptee",
    "desc": "Songs and sagas tell of heroes who, as children, were raised by creatures most view as monsters. You were one such child. Found, taken, left, or otherwise given to your monstrous parents, you were raised as one of their own species. Life with your adopted family could not have been easy for you, but the adversity and hardships you experienced only made you stronger. Perhaps you were “rescued” from your adopted family after only a short time with them, or perhaps only now have you realized the truth of your heritage. Maybe you've since learned enough civilized behavior to get by, or perhaps your “monstrous” tendencies are more evident. As you set out to make your way in the world, the time you spent with your adopted parents continues to shape your present and your future.\n\n***Adopted***\nPrior to becoming an adventurer, you defined your history by the creatures who raised you. Choose a type of creature for your adopted parents or roll a d10 and consult the table below. Work with your GM to determine which specific creature of that type adopted you. If you are of a particular race or species that matches a result on the table, your adopted parent can't be of the same race or species as you, as this background represents an individual raised by a creature or in a culture vastly different or even alien to their birth parents.\n\n| d10 | Creature Type                                                                 |\n|-----|-------------------------------------------------------------------------------|\n| 1   | Humanoid (such as gnoll, goblin, kobold, or merfolk)                          |\n| 2   | Aberration (such as aboleth, chuul, cloaker, or otyugh)                       |\n| 3   | Beast (such as ape, bear, tyrannosaurus rex, or wolf)                         |\n| 4   | Celestial or fiend (such as balor, bearded devil, couatl, deva, or unicorn)   |\n| 5   | Dragon (such as dragon turtle, pseudodragon, red dragon, or wyvern)           |\n| 6   | Elemental (such as efreeti, gargoyle, salamander, or water elemental)         |\n| 7   | Fey (such as dryad, green hag, satyr, or sprite)                              |\n| 8   | Giant (such as ettin, fire giant, ogre, or troll)                             |\n| 9   | Plant or ooze (such as awakened shrub, gray ooze, shambling mound, or treant) |\n| 10  | Monstrosity (such as behir, chimera, griffon, mimic, or minotaur)             |\n\n",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "mysterious-origins",
  "fields": {
    "name": "Mysterious Origins",
    "desc": "Your origins are a mystery even to you. You might recall fragments of your previous life, or you might dream of events that could be memories, but you can't be sure of what is remembered and what is imagined. You recall practical information and facts about the world and perhaps even your name, but your upbringing and life before you lost your memories now exist only in dreams or sudden flashes of familiarity.\n  You can leave the details of your character's past up to your GM or give the GM a specific backstory that your character can't remember. Were you the victim of a spell gone awry, or did you voluntarily sacrifice your memories in exchange for power? Is your amnesia the result of a natural accident, or did you purposefully have your mind wiped in order to forget a memory you couldn't live with? Perhaps you have family or friends that are searching for you or enemies you can't even remember.",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "northern-minstrel",
  "fields": {
    "name": "Northern Minstrel",
    "desc": "While the tribal warriors residing in other parts of the wintry north consider you to be soft and cowardly, you know the truth: life in northern cities and mead halls is not for the faint of heart. Whether you are a larger-than-life performer hailing from one of the skaldic schools, a contemplative scholar attempting to puzzle out the mysteries of the north, or a doughty warrior hoping to stave off the bleakness of the north, you have successfully navigated alleys and stages as treacherous as any ice-slicked ruin. You adventure for the thrill of adding new songs to your repertoire, adding new lore to your catalog, and proving false the claims of those so-called true northerners.\n\n***Skaldic Specialty***\nEvery minstrel excels at certain types of performance. Choose one specialty or roll a d8 and consult the table below to determine your preferred type of performance.\n\n| d8 | Specialty                       |\n|----|---------------------------------|\n| 1  | Recitation of epic poetry       |\n| 2  | Singing                         |\n| 3  | Tale-telling                    |\n| 4  | Flyting (insult flinging)       |\n| 5  | Yodeling                        |\n| 6  | Axe throwing                    |\n| 7  | Playing an instrument           |\n| 8  | Fire eating or sword swallowing |",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "occultist",
  "fields": {
    "name": "Occultist",
    "desc": "At your core, you are a believer in things others dismiss. The signs abound if you know where to look. Questions beget answers that spur further questions. The cycle is endless as you uncover layer after layer of mystery and secrets.\n  Piercing the veil hiding beyond the surface of reality is an irresistible lure spurring you to delve into forgotten and dangerous places in the world. Perhaps you've always yearned toward the occult, or it could be that you encountered something or someone who opened your eyes to the possibilities. You may belong to some esoteric organization determined to uncover the mystery, a cult bent on using the secrets for a dark purpose, or you may be searching for answers on your own. As an occultist, you ask the questions reality doesn't want to answer.",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "parfumier",
  "fields": {
    "name": "Parfumier",
    "desc": "You are educated and ambitious. You spent your youth apprenticed among a city's more reputable greenhouses, laboratories, and perfumeries. There, you studied botany and chemistry and explored properties and interactions with fine crystal, rare metals, and magic. You quickly mastered the skills to identify and process rare and complex botanical and alchemical samples and the proper extractions and infusions of essential oils, pollens, and other fragrant chemical compounds—natural or otherwise.\n  Not all (dramatic) changes to one's lifestyle, calling, or ambitions are a result of social or financial decline. Some are simply decided upon. Regardless of your motivation or incentive for change, you have accepted that a comfortable life of research, science and business is—at least for now—a part of your past.",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "scoundrel",
  "fields": {
    "name": "Scoundrel",
    "desc": "You were brought up in a poor neighborhood in a crowded town or city. You may have been lucky enough to have a leaky roof over your head, or perhaps you grew up sleeping in doorways or on the rooftops. Either way, you didn't have it easy, and you lived by your wits. While never a hardened criminal, you fell in with the wrong crowd, or you ended up in trouble for stealing food from an orange cart or clean clothes from a washing line. You're no stranger to the city watch in your hometown and have outwitted or outrun them many times.",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "sentry",
  "fields": {
    "name": "Sentry",
    "desc": "In your youth, the defense of the city, the community, the caravan, or your patron was how you earned your coin. You might have been trained by an old, grizzled city watchman, or you might have been pressed into service by the local magistrate for your superior skills, size, or intellect. However you came to the role, you excelled at defending others.\n  You have a nose for trouble, a keen eye for spotting threats, a strong arm to back it up, and you are canny enough to know when to act. Most importantly, though, you were a peace officer or a protector and not a member of an army which might march to war.\n\n***Specialization***\nEach person or location that hires a sentry comes with its own set of unique needs and responsibilities. As a sentry, you fulfilled one of these unique roles. Choose a specialization or roll a d6 and consult the table below to define your expertise as a sentry.\n\n| d6 | Specialization                 |\n|----|--------------------------------|\n| 1  | City or gate watch             |\n| 2  | Bodyguard or jailor            |\n| 3  | Caravan guard                  |\n| 4  | Palace or judicial sentry      |\n| 5  | Shop guard                     |\n| 6  | Ecclesiastical or temple guard |",
    "document": "toh"
  }
},
{
  "model": "api_v2.background",
  "pk": "trophy-hunter",
  "fields": {
    "name": "Trophy Hunter",
    "desc": "You hunt the mightiest beasts in the harshest environments, claiming their pelts as trophies and returning them to settled lands for a profit or to decorate your abode. You likely were set on this path since birth, following your parents on safaris and learning from their actions, but you may have instead come to this path as an adult after being swept away by the thrill of dominating the natural world.\n  Many big game hunters pursue their quarry purely for pleasure, as a calming avocation, but others sell their skills to the highest bidder to amass wealth and reputation as a trophy hunter.",
    "document": "toh"
  }
}
]
