[
{
  "model": "api_v2.trait",
  "pk": 98,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Dexterity score increases by 2, and your Wisdom score increases by 1.",
    "type": null,
    "race": "alseid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 99,
  "fields": {
    "name": "Speed",
    "desc": "Alseid are fast for their size, with a base walking speed of 40 feet.",
    "type": null,
    "race": "alseid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 100,
  "fields": {
    "name": "Darkvision",
    "desc": "Accustomed to the limited light beneath the forest canopy, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "type": null,
    "race": "alseid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 101,
  "fields": {
    "name": "Age",
    "desc": "Alseid reach maturity by the age of 20. They can live well beyond 100 years, but it is unknown just how old they can become.",
    "type": null,
    "race": "alseid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 102,
  "fields": {
    "name": "Alignment",
    "desc": "Alseid are generally chaotic, flowing with the unpredictable whims of nature, though variations are common, particularly among those rare few who leave their people.",
    "type": null,
    "race": "alseid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 103,
  "fields": {
    "name": "Size",
    "desc": "Alseid stand over 6 feet tall and weigh around 300 pounds. Your size is Medium.",
    "type": null,
    "race": "alseid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 104,
  "fields": {
    "name": "Languages",
    "desc": "You can speak, read, and write Common and Elvish.",
    "type": null,
    "race": "alseid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 105,
  "fields": {
    "name": "Alseid Weapon Training",
    "desc": "You have proficiency with spears and shortbows.",
    "type": null,
    "race": "alseid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 106,
  "fields": {
    "name": "Light Hooves",
    "desc": "You have proficiency in the Stealth skill.",
    "type": null,
    "race": "alseid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 107,
  "fields": {
    "name": "Quadruped",
    "desc": "The mundane details of the structures of humanoids can present considerable obstacles for you. You have to squeeze when moving through trapdoors, manholes, and similar structures even when a Medium humanoid wouldn't have to squeeze. In addition, ladders, stairs, and similar structures are difficult terrain for you.",
    "type": null,
    "race": "alseid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 108,
  "fields": {
    "name": "Woodfriend",
    "desc": "When in a forest, you leave no tracks and can automatically discern true north.",
    "type": null,
    "race": "alseid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 109,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Dexterity score increases by 2.",
    "type": null,
    "race": "catfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 110,
  "fields": {
    "name": "Speed",
    "desc": "Your base walking speed is 30 feet.",
    "type": null,
    "race": "catfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 111,
  "fields": {
    "name": "Darkvision",
    "desc": "You have a cat's keen senses, especially in the dark. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "type": null,
    "race": "catfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 112,
  "fields": {
    "name": "Age",
    "desc": "Catfolk mature at the same rate as humans and can live just past a century.",
    "type": null,
    "race": "catfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 113,
  "fields": {
    "name": "Alignment",
    "desc": "Catfolk tend toward two extremes. Some are free-spirited and chaotic, letting impulse and fancy guide their decisions. Others are devoted to duty and personal honor. Typically, catfolk deem concepts such as good and evil as less important than freedom or their oaths.",
    "type": null,
    "race": "catfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 114,
  "fields": {
    "name": "Size",
    "desc": "Catfolk have a similar stature to humans but are generally leaner and more muscular. Your size is Medium",
    "type": null,
    "race": "catfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 115,
  "fields": {
    "name": "Languages",
    "desc": "You can speak, read, and write Common.",
    "type": null,
    "race": "catfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 116,
  "fields": {
    "name": "Cat's Claws",
    "desc": "Your sharp claws can cut with ease. Your claws are natural melee weapons, which you can use to make unarmed strikes. When you hit with a claw, your claw deals slashing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.",
    "type": null,
    "race": "catfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 117,
  "fields": {
    "name": "Hunter's Senses",
    "desc": "You have proficiency in the Perception and Stealth skills.",
    "type": null,
    "race": "catfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 118,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Intelligence score increases by 1.",
    "type": null,
    "race": "malkin"
  }
},
{
  "model": "api_v2.trait",
  "pk": 119,
  "fields": {
    "name": "Curiously Clever",
    "desc": "You have proficiency in the Investigation skill.",
    "type": null,
    "race": "malkin"
  }
},
{
  "model": "api_v2.trait",
  "pk": 120,
  "fields": {
    "name": "Charmed Curiosity",
    "desc": "When you roll a 1 on the d20 for a Dexterity check or saving throw, you can reroll the die and must use the new roll.",
    "type": null,
    "race": "malkin"
  }
},
{
  "model": "api_v2.trait",
  "pk": 121,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Wisdom score increases by 1.",
    "type": null,
    "race": "pantheran"
  }
},
{
  "model": "api_v2.trait",
  "pk": 122,
  "fields": {
    "name": "Hunter's Charge",
    "desc": "Once per turn, if you move at least 10 feet toward a target and hit it with a melee weapon attack in the same turn, you can use a bonus action to attack that creature with your Cat's Claws. You can use this trait a number of times per day equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
    "type": null,
    "race": "pantheran"
  }
},
{
  "model": "api_v2.trait",
  "pk": 123,
  "fields": {
    "name": "One With the Wilds",
    "desc": "You have proficiency in one of the following skills of your choice: Insight, Medicine, Nature, or Survival.",
    "type": null,
    "race": "pantheran"
  }
},
{
  "model": "api_v2.trait",
  "pk": 124,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Dexterity score increases by 2.",
    "type": null,
    "race": "derro"
  }
},
{
  "model": "api_v2.trait",
  "pk": 125,
  "fields": {
    "name": "Speed",
    "desc": "Derro are fast for their size. Your base walking speed is 30 feet.",
    "type": null,
    "race": "derro"
  }
},
{
  "model": "api_v2.trait",
  "pk": 126,
  "fields": {
    "name": "Superior Darkvision",
    "desc": "Accustomed to life underground, you can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "type": null,
    "race": "derro"
  }
},
{
  "model": "api_v2.trait",
  "pk": 127,
  "fields": {
    "name": "Age",
    "desc": "Derro reach maturity by the age of 15 and live to be around 75.",
    "type": null,
    "race": "derro"
  }
},
{
  "model": "api_v2.trait",
  "pk": 128,
  "fields": {
    "name": "Alignment",
    "desc": "The derro's naturally unhinged minds are nearly always chaotic, and many, but not all, are evil.",
    "type": null,
    "race": "derro"
  }
},
{
  "model": "api_v2.trait",
  "pk": 129,
  "fields": {
    "name": "Size",
    "desc": "Derro stand between 3 and 4 feet tall with slender limbs and wide shoulders. Your size is Small.",
    "type": null,
    "race": "derro"
  }
},
{
  "model": "api_v2.trait",
  "pk": 130,
  "fields": {
    "name": "Languages",
    "desc": "You can speak, read, and write Dwarvish and your choice of Common or Undercommon.",
    "type": null,
    "race": "derro"
  }
},
{
  "model": "api_v2.trait",
  "pk": 131,
  "fields": {
    "name": "Eldritch Resilience",
    "desc": "You have advantage on Constitution saving throws against spells.",
    "type": null,
    "race": "derro"
  }
},
{
  "model": "api_v2.trait",
  "pk": 132,
  "fields": {
    "name": "Sunlight Sensitivity",
    "desc": "You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight.",
    "type": null,
    "race": "derro"
  }
},
{
  "model": "api_v2.trait",
  "pk": 133,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Charisma score increases by 1.",
    "type": null,
    "race": "far-touched"
  }
},
{
  "model": "api_v2.trait",
  "pk": 134,
  "fields": {
    "name": "Insanity",
    "desc": "You have advantage on saving throws against being charmed or frightened. In addition, you can read and understand Void Speech, but you can speak only a few words of the dangerous and maddening language—the words necessary for using the spells in your Mad Fervor trait.",
    "type": null,
    "race": "far-touched"
  }
},
{
  "model": "api_v2.trait",
  "pk": 135,
  "fields": {
    "name": "Mad Fervor",
    "desc": "The driving force behind your insanity has blessed you with a measure of its power. You know the vicious mockery cantrip. When you reach 3rd level, you can cast the enthrall spell with this trait, and starting at 5th level, you can cast the fear spell with it. Once you cast a non-cantrip spell with this trait, you can't do so again until you finish a long rest. Charisma is your spellcasting ability for these spells. If you are using Deep Magic for 5th Edition, these spells are instead crushing curse, maddening whispers, and alone, respectively.",
    "type": null,
    "race": "far-touched"
  }
},
{
  "model": "api_v2.trait",
  "pk": 136,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Strength score increases by 1.",
    "type": null,
    "race": "mutated"
  }
},
{
  "model": "api_v2.trait",
  "pk": 137,
  "fields": {
    "name": "Athletic Training",
    "desc": "You have proficiency in the Athletics skill, and you are proficient with two martial weapons of your choice.",
    "type": null,
    "race": "mutated"
  }
},
{
  "model": "api_v2.trait",
  "pk": 138,
  "fields": {
    "name": "Otherworldly Influence",
    "desc": "Your close connection to the strange powers that your people worship has mutated your form. Choose one of the following:\r\n\r\n**Alien Appendage.** You have a tentacle-like growth on your body. This tentacle is a natural melee weapon, which you can use to make unarmed strikes. When you hit with it, your tentacle deals bludgeoning damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. This tentacle has a reach of 5 feet and can lift a number of pounds equal to double your Strength score. The tentacle can't wield weapons or shields or perform tasks that require manual precision, such as performing the somatic components of a spell, but it can perform simple tasks, such as opening an unlocked door or container, stowing or retrieving an object, or pouring the contents out of a vial.\r\n**Tainted Blood.** Your blood is tainted by your connection with otherworldly entities. When you take piercing or slashing damage, you can use your reaction to force your blood to spray out of the wound. You and each creature within 5 feet of you take necrotic damage equal to your level. Once you use this trait, you can't use it again until you finish a short or long rest.\r\n**Tenebrous Flesh.** Your skin is rubbery and tenebrous, granting you a +1 bonus to your Armor Class.",
    "type": null,
    "race": "mutated"
  }
},
{
  "model": "api_v2.trait",
  "pk": 139,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Wisdom score increases by 1.",
    "type": null,
    "race": "uncorrupted"
  }
},
{
  "model": "api_v2.trait",
  "pk": 140,
  "fields": {
    "name": "Psychic Barrier",
    "desc": "Your time among your less sane brethren has inured you to their madness. You have resistance to psychic damage, and you have advantage on ability checks and saving throws made against effects that inflict insanity, such as spells like contact other plane and symbol, and effects that cause short-term, long-term, or indefinite madness.",
    "type": null,
    "race": "uncorrupted"
  }
},
{
  "model": "api_v2.trait",
  "pk": 141,
  "fields": {
    "name": "Studied Insight",
    "desc": "You are skilled at discerning other creature's motives and intentions. You have proficiency in the Insight skill, and, if you study a creature for at least 1 minute, you have advantage on any initiative checks in combat against that creature for the next hour.",
    "type": null,
    "race": "uncorrupted"
  }
},
{
  "model": "api_v2.trait",
  "pk": 142,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Intelligence score increases by 2.",
    "type": null,
    "race": "drow"
  }
},
{
  "model": "api_v2.trait",
  "pk": 143,
  "fields": {
    "name": "Speed",
    "desc": "Your base walking speed is 30 feet.",
    "type": null,
    "race": "drow"
  }
},
{
  "model": "api_v2.trait",
  "pk": 144,
  "fields": {
    "name": "Superior Darkvision",
    "desc": "Accustomed to life in the darkest depths of the world, you can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "type": null,
    "race": "drow"
  }
},
{
  "model": "api_v2.trait",
  "pk": 145,
  "fields": {
    "name": "Age",
    "desc": "Drow physically mature at the same rate as humans, but they aren't considered adults until they reach the age of 50. They typically live to be around 500.",
    "type": null,
    "race": "drow"
  }
},
{
  "model": "api_v2.trait",
  "pk": 146,
  "fields": {
    "name": "Alignment",
    "desc": "Drow believe in reason and rationality, which leads them to favor lawful activities. However, their current dire situation makes them more prone than their ancestors to chaotic behavior. Their vicious fight for survival makes them capable of doing great evil in the name of self-preservation, although they are not, by nature, prone to evil in other circumstances.",
    "type": null,
    "race": "drow"
  }
},
{
  "model": "api_v2.trait",
  "pk": 147,
  "fields": {
    "name": "Size",
    "desc": "Drow are slightly shorter and slimmer than humans. Your size is Medium.",
    "type": null,
    "race": "drow"
  }
},
{
  "model": "api_v2.trait",
  "pk": 148,
  "fields": {
    "name": "Languages",
    "desc": "You can speak, read, and write Elvish and your choice of Common or Undercommon.",
    "type": null,
    "race": "drow"
  }
},
{
  "model": "api_v2.trait",
  "pk": 149,
  "fields": {
    "name": "Fey Ancestry",
    "desc": "You have advantage on saving throws against being charmed, and magic can't put you to sleep.",
    "type": null,
    "race": "drow"
  }
},
{
  "model": "api_v2.trait",
  "pk": 150,
  "fields": {
    "name": "Mind of Steel",
    "desc": "You understand the complexities of minds, as well as the magic that can affect them. You have advantage on Wisdom, Intelligence, and Charisma saving throws against spells.",
    "type": null,
    "race": "drow"
  }
},
{
  "model": "api_v2.trait",
  "pk": 151,
  "fields": {
    "name": "Sunlight Sensitivity",
    "desc": "You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight.",
    "type": null,
    "race": "drow"
  }
},
{
  "model": "api_v2.trait",
  "pk": 152,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Strength or Dexterity score increases by 1.",
    "type": null,
    "race": "delver"
  }
},
{
  "model": "api_v2.trait",
  "pk": 153,
  "fields": {
    "name": "Rapport with Insects",
    "desc": "Your caste's years of working alongside the giant spiders and beetles that your people utilized in building and defending cities has left your caste with an innate affinity with the creatures. You can communicate simple ideas with insect-like beasts with an Intelligence of 3 or lower, such as spiders, beetles, wasps, scorpions, and centipedes. You can understand them in return, though this understanding is often limited to knowing the creature's current or most recent state, such as “hungry,” “content,” or “in danger.” Delver drow often keep such creatures as pets, mounts, or beasts of burden.",
    "type": null,
    "race": "delver"
  }
},
{
  "model": "api_v2.trait",
  "pk": 154,
  "fields": {
    "name": "Specialized Training",
    "desc": "You are proficient in one skill and one tool of your choice.",
    "type": null,
    "race": "delver"
  }
},
{
  "model": "api_v2.trait",
  "pk": 155,
  "fields": {
    "name": "Martial Excellence",
    "desc": "You are proficient with one martial weapon of your choice and with light armor.",
    "type": null,
    "race": "delver"
  }
},
{
  "model": "api_v2.trait",
  "pk": 156,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Constitution score increases by 1.",
    "type": null,
    "race": "fever-bit"
  }
},
{
  "model": "api_v2.trait",
  "pk": 157,
  "fields": {
    "name": "Deathly Resilience",
    "desc": "Your long exposure to the life-sapping energies of darakhul fever has made you more resilient. You have resistance to necrotic damage, and advantage on death saving throws.",
    "type": null,
    "race": "fever-bit"
  }
},
{
  "model": "api_v2.trait",
  "pk": 158,
  "fields": {
    "name": "Iron Constitution",
    "desc": "You are immune to disease.",
    "type": null,
    "race": "fever-bit"
  }
},
{
  "model": "api_v2.trait",
  "pk": 159,
  "fields": {
    "name": "Near-Death Experience",
    "desc": "Your brush with death has made you more stalwart in the face of danger. You have advantage on saving throws against being frightened.",
    "type": null,
    "race": "fever-bit"
  }
},
{
  "model": "api_v2.trait",
  "pk": 160,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Charisma score increases by 1.",
    "type": null,
    "race": "purified"
  }
},
{
  "model": "api_v2.trait",
  "pk": 161,
  "fields": {
    "name": "Innate Spellcasting",
    "desc": "You know the poison spray cantrip. When you reach 3rd level, you can cast suggestion once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the tongues spell once and regain the ability to do so when you finish a long rest. Intelligence is your spellcasting ability for these spells.",
    "type": null,
    "race": "purified"
  }
},
{
  "model": "api_v2.trait",
  "pk": 162,
  "fields": {
    "name": "Born Leader",
    "desc": "You gain proficiency with two of the following skills of your choice: History, Insight, Performance, and Persuasion.",
    "type": null,
    "race": "purified"
  }
},
{
  "model": "api_v2.trait",
  "pk": 163,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Dexterity score increases by 2, and you can choose to increase either your Wisdom or Charisma score by 1.",
    "type": null,
    "race": "erina"
  }
},
{
  "model": "api_v2.trait",
  "pk": 164,
  "fields": {
    "name": "Speed",
    "desc": "Your base walking speed is 25 feet.",
    "type": null,
    "race": "erina"
  }
},
{
  "model": "api_v2.trait",
  "pk": 165,
  "fields": {
    "name": "Darkvision",
    "desc": "Accustomed to life in the dark burrows of your people, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "type": null,
    "race": "erina"
  }
},
{
  "model": "api_v2.trait",
  "pk": 166,
  "fields": {
    "name": "Age",
    "desc": "Erina reach maturity around 15 years and can live up to 60 years, though some erina burrow elders have memories of events which suggest erina can live much longer.",
    "type": null,
    "race": "erina"
  }
},
{
  "model": "api_v2.trait",
  "pk": 167,
  "fields": {
    "name": "Alignment",
    "desc": "Erina are good-hearted and extremely social creatures who have a difficult time adapting to the laws of other species.",
    "type": null,
    "race": "erina"
  }
},
{
  "model": "api_v2.trait",
  "pk": 168,
  "fields": {
    "name": "Size",
    "desc": "Erina average about 3 feet tall and weigh about 50 pounds. Your size is Small.",
    "type": null,
    "race": "erina"
  }
},
{
  "model": "api_v2.trait",
  "pk": 169,
  "fields": {
    "name": "Languages",
    "desc": "You can speak Erina and either Common or Sylvan.",
    "type": null,
    "race": "erina"
  }
},
{
  "model": "api_v2.trait",
  "pk": 170,
  "fields": {
    "name": "Hardy",
    "desc": "The erina diet of snakes and venomous insects has made them hardy. You have advantage on saving throws against poison, and you have resistance against poison damage.",
    "type": null,
    "race": "erina"
  }
},
{
  "model": "api_v2.trait",
  "pk": 171,
  "fields": {
    "name": "Spines",
    "desc": "Erina grow needle-sharp spines in small clusters atop their heads and along their backs. While you are grappling a creature or while a creature is grappling you, the creature takes 1d4 piercing damage at the start of your turn.",
    "type": null,
    "race": "erina"
  }
},
{
  "model": "api_v2.trait",
  "pk": 172,
  "fields": {
    "name": "Keen Senses",
    "desc": "You have proficiency in the Perception skill.",
    "type": null,
    "race": "erina"
  }
},
{
  "model": "api_v2.trait",
  "pk": 173,
  "fields": {
    "name": "Digger",
    "desc": "You have a burrowing speed of 20 feet, but you can use it to move through only earth and sand, not mud, ice, or rock.",
    "type": null,
    "race": "erina"
  }
},
{
  "model": "api_v2.trait",
  "pk": 174,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Two different ability scores of your choice increase by 1.",
    "type": null,
    "race": "gearforged"
  }
},
{
  "model": "api_v2.trait",
  "pk": 175,
  "fields": {
    "name": "Speed",
    "desc": "Your base walking speed is determined by your Race Chassis.",
    "type": null,
    "race": "gearforged"
  }
},
{
  "model": "api_v2.trait",
  "pk": 176,
  "fields": {
    "name": "Age",
    "desc": "The soul inhabiting a gearforged can be any age. As long as its new body is kept in good repair, there is no known limit to how long it can function.",
    "type": null,
    "race": "gearforged"
  }
},
{
  "model": "api_v2.trait",
  "pk": 177,
  "fields": {
    "name": "Alignment",
    "desc": "No single alignment typifies gearforged, but most gearforged maintain the alignment they had before becoming gearforged.",
    "type": null,
    "race": "gearforged"
  }
},
{
  "model": "api_v2.trait",
  "pk": 178,
  "fields": {
    "name": "Size",
    "desc": "Your size is determined by your Race Chassis.",
    "type": null,
    "race": "gearforged"
  }
},
{
  "model": "api_v2.trait",
  "pk": 179,
  "fields": {
    "name": "Languages",
    "desc": "You can speak, read, and write Common, Machine Speech (a whistling, clicking language that's incomprehensible to non-gearforged), and a language associated with your Race Chassis.",
    "type": null,
    "race": "gearforged"
  }
},
{
  "model": "api_v2.trait",
  "pk": 180,
  "fields": {
    "name": "Construct Resilience",
    "desc": "Your body is constructed, which frees you from some of the limits of fleshand- blood creatures. You have resistance to poison damage, you are immune to disease, and you have advantage on saving throws against being poisoned.",
    "type": null,
    "race": "gearforged"
  }
},
{
  "model": "api_v2.trait",
  "pk": 181,
  "fields": {
    "name": "Construct Vitality",
    "desc": "You don't need to eat, drink, or breathe, and you don't sleep the way most creatures do. Instead, you enter a dormant state where you resemble a statue and remain semiconscious for 6 hours a day. During this time, the magic in your soul gem and everwound springs slowly repairs the day's damage to your mechanical body. While in this dormant state, you have disadvantage on Wisdom (Perception) checks. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.",
    "type": null,
    "race": "gearforged"
  }
},
{
  "model": "api_v2.trait",
  "pk": 182,
  "fields": {
    "name": "Living Construct",
    "desc": "Your consciousness and soul reside within a soul gem to animate your mechanical body. As such, you are a living creature with some of the benefits and drawbacks of a construct. Though you can regain hit points from spells like cure wounds, you can also be affected by game effects that specifically target constructs, such as the shatter spell. As long as your soul gem remains intact, game effects that raise a creature from the dead work on you as normal, repairing the damaged pieces of your mechanical body (restoring lost sections only if the spell normally restores lost limbs) and returning you to life as a gearforged. Alternatively, if your body is destroyed but your soul gem and memory gears are intact, they can be installed into a new body with a ritual that takes one day and 10,000 gp worth of materials. If your soul gem is destroyed, only a wish spell can restore you to life, and you return as a fully living member of your original race.",
    "type": null,
    "race": "gearforged"
  }
},
{
  "model": "api_v2.trait",
  "pk": 183,
  "fields": {
    "name": "Race Chassis",
    "desc": "Four races are known to create unique gearforged, building mechanical bodies similar in size and shape to their people: dwarf, gnome, human, and kobold. Choose one of these forms.",
    "type": null,
    "race": "gearforged"
  }
},
{
  "model": "api_v2.trait",
  "pk": 184,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Constitution score increases by 1.",
    "type": null,
    "race": "dwarf-chassis"
  }
},
{
  "model": "api_v2.trait",
  "pk": 185,
  "fields": {
    "name": "Always Armed",
    "desc": "Every dwarf knows that it's better to leave home without pants than without your weapon. Choose a weapon with which you are proficient and that doesn't have the two-handed property. You can integrate this weapon into one of your arms. While the weapon is integrated, you can't be disarmed of it by any means, though you can use an action to remove the weapon. You can draw or sheathe the weapon as normal, the weapon folding into or springing from your arm instead of a sheath. While the integrated weapon is drawn in this way, it is considered held in that arm's hand, which can't be used for other actions such as casting spells. You can integrate a new weapon or replace an integrated weapon as part of a short or long rest. You can have up to two weapons integrated at a time, one per arm. You have advantage on Dexterity (Sleight of Hand) checks to conceal an integrated weapon.",
    "type": null,
    "race": "dwarf-chassis"
  }
},
{
  "model": "api_v2.trait",
  "pk": 186,
  "fields": {
    "name": "Remembered Training",
    "desc": "You remember some of your combat training from your previous life. You have proficiency with two martial weapons of your choice and with light and medium armor.",
    "type": null,
    "race": "dwarf-chassis"
  }
},
{
  "model": "api_v2.trait",
  "pk": 187,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Intelligence score increases by 1.",
    "type": null,
    "race": "gnome-chassis"
  }
},
{
  "model": "api_v2.trait",
  "pk": 188,
  "fields": {
    "name": "Mental Fortitude",
    "desc": "When creating their first gearforged, gnome engineers put their efforts toward ensuring that the gnomish mind remained a mental fortress, though they were unable to fully replicate the gnomish mind's resilience once transferred to a soul gem. Choose Intelligence, Wisdom, or Charisma. You have advantage on saving throws made with that ability score against magic.",
    "type": null,
    "race": "gnome-chassis"
  }
},
{
  "model": "api_v2.trait",
  "pk": 189,
  "fields": {
    "name": "Quick Fix",
    "desc": "When you are below half your hit point maximum, you can use a bonus action to apply a quick patch up to your damaged body. You gain temporary hit points equal to your proficiency bonus. You can't use this trait again until you finish a short or long rest.",
    "type": null,
    "race": "gnome-chassis"
  }
},
{
  "model": "api_v2.trait",
  "pk": 190,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "One ability score of your choice increases by 1.",
    "type": null,
    "race": "human-chassis"
  }
},
{
  "model": "api_v2.trait",
  "pk": 191,
  "fields": {
    "name": "Adaptable Acumen",
    "desc": "You gain proficiency in two skills or tools of your choice. Choose one of those skills or tools or another skill or tool proficiency you have. Your proficiency bonus is doubled for any ability check you make that uses the chosen skill or tool.",
    "type": null,
    "race": "human-chassis"
  }
},
{
  "model": "api_v2.trait",
  "pk": 192,
  "fields": {
    "name": "Inspired Ingenuity",
    "desc": "When you roll a 9 or lower on the d20 for an ability check, you can use a reaction to change the roll to a 10. You can't use this trait again until you finish a short or long rest.",
    "type": null,
    "race": "human-chassis"
  }
},
{
  "model": "api_v2.trait",
  "pk": 193,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Dexterity score increases by 1.",
    "type": null,
    "race": "kobold-chassis"
  }
},
{
  "model": "api_v2.trait",
  "pk": 194,
  "fields": {
    "name": "Clutch Aide",
    "desc": "Kobolds spend their lives alongside their clutchmates, both those hatched around the same time as them and those they choose later in life, and you retain much of this group-oriented intuition. You can take the Help action as a bonus action.",
    "type": null,
    "race": "kobold-chassis"
  }
},
{
  "model": "api_v2.trait",
  "pk": 195,
  "fields": {
    "name": "Resourceful",
    "desc": "If you have at least one set of tools, you can cobble together one set of makeshift tools of a different type with 1 minute of work. For example, if you have cook's utensils, you can use them to create a temporary set of thieves' tools. The makeshift tools last for 10 minutes then collapse into their component parts, returning your tools to their normal forms. While the makeshift tools exist, you can't use the set of tools you used to create the makeshift tools. At the GM's discretion, you might not be able to replicate some tools, such as an alchemist's alembic or a disguise kit's cosmetics. A creature other than you that uses the makeshift tools has disadvantage on the check.",
    "type": null,
    "race": "kobold-chassis"
  }
},
{
  "model": "api_v2.trait",
  "pk": 196,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Strength score increases by 2, and your Constitution score increases by 1.",
    "type": null,
    "race": "minotaur"
  }
},
{
  "model": "api_v2.trait",
  "pk": 197,
  "fields": {
    "name": "Speed",
    "desc": "Your base walking speed is 30 feet.",
    "type": null,
    "race": "minotaur"
  }
},
{
  "model": "api_v2.trait",
  "pk": 198,
  "fields": {
    "name": "Darkvision",
    "desc": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "type": null,
    "race": "minotaur"
  }
},
{
  "model": "api_v2.trait",
  "pk": 199,
  "fields": {
    "name": "Age",
    "desc": "Minotaurs age at roughly the same rate as humans but mature 3 years earlier. Childhood ends around the age of 10 and adulthood is celebrated at 15.",
    "type": null,
    "race": "minotaur"
  }
},
{
  "model": "api_v2.trait",
  "pk": 200,
  "fields": {
    "name": "Alignment",
    "desc": "Minotaurs possess a wide range of alignments, just as humans do. Mixing a love for personal freedom and respect for history and tradition, the majority of minotaurs fall into neutral alignments.",
    "type": null,
    "race": "minotaur"
  }
},
{
  "model": "api_v2.trait",
  "pk": 201,
  "fields": {
    "name": "Size",
    "desc": "Adult males can reach a height of 7 feet, with females averaging 3 inches shorter. Your size is Medium.",
    "type": null,
    "race": "minotaur"
  }
},
{
  "model": "api_v2.trait",
  "pk": 202,
  "fields": {
    "name": "Languages",
    "desc": "You can speak, read, and write Common and Minotaur.",
    "type": null,
    "race": "minotaur"
  }
},
{
  "model": "api_v2.trait",
  "pk": 203,
  "fields": {
    "name": "Natural Attacks",
    "desc": "Your horns are sturdy and sharp. Your horns are a natural melee weapon, which you can use to make unarmed strikes. When you hit with your horns, they deal piercing damage equal to 1d6 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.",
    "type": null,
    "race": "minotaur"
  }
},
{
  "model": "api_v2.trait",
  "pk": 204,
  "fields": {
    "name": "Charge",
    "desc": "Once per turn, if you move at least 10 feet toward a target and hit it with a horn attack in the same turn, you deal an extra 1d6 piercing damage and you can shove the target up to 5 feet as a bonus action. At 11th level, when you shove a creature with Charge, you can push it up to 10 feet instead. You can use this trait a number of times per day equal to your Constitution modifier (minimum of once), and you regain all expended uses when you finish a long rest.",
    "type": null,
    "race": "minotaur"
  }
},
{
  "model": "api_v2.trait",
  "pk": 205,
  "fields": {
    "name": "Labyrinth Sense",
    "desc": "You can retrace without error any path you have previously taken, with no ability check.",
    "type": null,
    "race": "minotaur"
  }
},
{
  "model": "api_v2.trait",
  "pk": 210,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Constitution score increases by 2, and your Strength score increases by 1.",
    "type": null,
    "race": "bhain-kwai"
  }
},
{
  "model": "api_v2.trait",
  "pk": 211,
  "fields": {
    "name": "Strong Back",
    "desc": "Your carrying capacity is your Strength score multiplied by 20, instead of by 15.",
    "type": null,
    "race": "bhain-kwai"
  }
},
{
  "model": "api_v2.trait",
  "pk": 212,
  "fields": {
    "name": "Wetland Dweller",
    "desc": "You are adapted to your home terrain. Difficult terrain composed of mud or from wading through water up to waist deep doesn't cost you extra movement. You have a swimming speed of 25 feet.",
    "type": null,
    "race": "bhain-kwai"
  }
},
{
  "model": "api_v2.trait",
  "pk": 213,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Wisdom score increases by 2, and your Constitution score increases by 1.",
    "type": null,
    "race": "boghaid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 214,
  "fields": {
    "name": "Highlander",
    "desc": "You are adapted to life at high altitudes, and you suffer no ill effects or penalties from elevations above 8,000 feet.",
    "type": null,
    "race": "boghaid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 215,
  "fields": {
    "name": "Storied Culture",
    "desc": "You have proficiency in the Performance skill, and you gain proficiency with one of the following musical instruments: bagpipes, drum, horn, or shawm.",
    "type": null,
    "race": "boghaid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 216,
  "fields": {
    "name": "Wooly",
    "desc": "Your thick, wooly coat of hair keeps you warm, allowing you to function in cold weather without special clothing or gear. You have advantage on saving throws against spells and other effects that deal cold damage.",
    "type": null,
    "race": "boghaid"
  }
},
{
  "model": "api_v2.trait",
  "pk": 217,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Wisdom score increases by 2.",
    "type": null,
    "race": "mushroomfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 218,
  "fields": {
    "name": "Speed",
    "desc": "Your base walking speed is 30 feet.",
    "type": null,
    "race": "mushroomfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 219,
  "fields": {
    "name": "Darkvision",
    "desc": "Accustomed to life underground, you can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "type": null,
    "race": "mushroomfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 220,
  "fields": {
    "name": "Age",
    "desc": "Mushroomfolk reach maturity by the age of 5 and rarely live longer than 50 years.",
    "type": null,
    "race": "mushroomfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 221,
  "fields": {
    "name": "Alignment",
    "desc": "The limited interaction mushroomfolk have with other creatures leaves them with a fairly neutral view of the world in terms of good and evil, while their societal structure makes them more prone to law than chaos.",
    "type": null,
    "race": "mushroomfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 222,
  "fields": {
    "name": "Size",
    "desc": "A mushroomfolk's size is determined by its subrace.",
    "type": null,
    "race": "mushroomfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 223,
  "fields": {
    "name": "Languages",
    "desc": "You can speak, read, and write Mushroomfolk and your choice of Common or Undercommon.",
    "type": null,
    "race": "mushroomfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 224,
  "fields": {
    "name": "Fungoid Form",
    "desc": "You are a humanoid, though the fungal nature of your body and your unique diet of decayed vegetable and animal matter marks you with some plant-like characteristics. You have advantage on saving throws against poison, and you have resistance to poison damage. In addition, you are immune to disease.",
    "type": null,
    "race": "mushroomfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 225,
  "fields": {
    "name": "Hardy Survivor",
    "desc": "Your upbringing in mushroomfolk society has taught you how to defend yourself and find food. You have proficiency in the Survival skill.",
    "type": null,
    "race": "mushroomfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 226,
  "fields": {
    "name": "Subrace",
    "desc": "Three subraces of mushroomfolk are known to wander the world: acid cap, favored, and morel. Choose one of these subraces.",
    "type": null,
    "race": "mushroomfolk"
  }
},
{
  "model": "api_v2.trait",
  "pk": 227,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Strength score increases by 1.",
    "type": null,
    "race": "acid-cap"
  }
},
{
  "model": "api_v2.trait",
  "pk": 228,
  "fields": {
    "name": "Acid Cap Resistance",
    "desc": "You have resistance to acid damage.",
    "type": null,
    "race": "acid-cap"
  }
},
{
  "model": "api_v2.trait",
  "pk": 229,
  "fields": {
    "name": "Acid Spores",
    "desc": "When you are hit by a melee weapon attack within 5 feet of you, you can use your reaction to emit acidic spores. If you do, the attacker takes acid damage equal to half your level (rounded up). You can use your acid spores a number of times equal to your Constitution modifier (a minimum of once). You regain any expended uses when you finish a long rest.",
    "type": null,
    "race": "acid-cap"
  }
},
{
  "model": "api_v2.trait",
  "pk": 230,
  "fields": {
    "name": "Clan Athlete",
    "desc": "You have proficiency in the Athletics skill.",
    "type": null,
    "race": "acid-cap"
  }
},
{
  "model": "api_v2.trait",
  "pk": 231,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Charisma score increases by 1.",
    "type": null,
    "race": "favored"
  }
},
{
  "model": "api_v2.trait",
  "pk": 232,
  "fields": {
    "name": "Blessed Help",
    "desc": "Your intuition and connection to your allies allows you to assist and protect them. You know the spare the dying cantrip. When you reach 3rd level, you can cast the bless spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells.",
    "type": null,
    "race": "favored"
  }
},
{
  "model": "api_v2.trait",
  "pk": 233,
  "fields": {
    "name": "Clan Leader",
    "desc": "You have proficiency in the Persuasion skill.",
    "type": null,
    "race": "favored"
  }
},
{
  "model": "api_v2.trait",
  "pk": 234,
  "fields": {
    "name": "Restful Spores",
    "desc": "If you or any friendly creatures within 30 feet of you regain hit points at the end of a short rest by spending one or more Hit Dice, each of those creatures regains additional hit points equal to your proficiency bonus. Once a creature benefits from your restful spores, it can't do so again until it finishes a long rest.",
    "type": null,
    "race": "favored"
  }
},
{
  "model": "api_v2.trait",
  "pk": 235,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Dexterity score increases by 1.",
    "type": null,
    "race": "morel"
  }
},
{
  "model": "api_v2.trait",
  "pk": 236,
  "fields": {
    "name": "Adaptable Camouflage",
    "desc": "If you spend at least 1 minute in an environment with ample naturally occurring plants or fungi, such as a grassland, a forest, or an underground fungal cavern, you can adjust your natural coloration to blend in with the local plant life. If you do so, you have advantage on Dexterity (Stealth) checks for the next 24 hours while in that environment.",
    "type": null,
    "race": "morel"
  }
},
{
  "model": "api_v2.trait",
  "pk": 237,
  "fields": {
    "name": "Clan Scout",
    "desc": "You have proficiency in the Stealth skill.",
    "type": null,
    "race": "morel"
  }
},
{
  "model": "api_v2.trait",
  "pk": 238,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Constitution score increases by 2, and your Intelligence score increases by 1.",
    "type": null,
    "race": "satarre"
  }
},
{
  "model": "api_v2.trait",
  "pk": 239,
  "fields": {
    "name": "Speed",
    "desc": "Your base walking speed is 30 feet.",
    "type": null,
    "race": "satarre"
  }
},
{
  "model": "api_v2.trait",
  "pk": 240,
  "fields": {
    "name": "Darkvision",
    "desc": "Thanks to your dark planar parentage, you have superior vision in darkness. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "type": null,
    "race": "satarre"
  }
},
{
  "model": "api_v2.trait",
  "pk": 241,
  "fields": {
    "name": "Age",
    "desc": "Satarre grow quickly, walking soon after hatching and reaching the development of a 15-year-old human by age 6. They maintain the same appearance until about 50, then begin a rapid decline. Satarre often die violently, but those who live longer survive to no more than 65 years of age.",
    "type": null,
    "race": "satarre"
  }
},
{
  "model": "api_v2.trait",
  "pk": 242,
  "fields": {
    "name": "Alignment",
    "desc": "Satarre are born with a tendency toward evil akin to that of rapacious dragons, and, when raised among other satarre or darakhul, they are usually evil. Those raised among other cultures tend toward the norm for those cultures.",
    "type": null,
    "race": "satarre"
  }
},
{
  "model": "api_v2.trait",
  "pk": 243,
  "fields": {
    "name": "Size",
    "desc": "Satarre are tall but thin, from 6 to 7 feet tall with peculiar, segmented limbs. Your size is Medium.",
    "type": null,
    "race": "satarre"
  }
},
{
  "model": "api_v2.trait",
  "pk": 244,
  "fields": {
    "name": "Languages",
    "desc": "You can speak, read, and write Common and one of the following: Abyssal, Infernal, or Void Speech. Void Speech is a language of dark gods and ancient blasphemies, and the mere sound of its sibilant tones makes many other creatures quite uncomfortable.",
    "type": null,
    "race": "satarre"
  }
},
{
  "model": "api_v2.trait",
  "pk": 245,
  "fields": {
    "name": "A Friend to Death",
    "desc": "You have resistance to necrotic damage.",
    "type": null,
    "race": "satarre"
  }
},
{
  "model": "api_v2.trait",
  "pk": 246,
  "fields": {
    "name": "Keeper of Secrets",
    "desc": "You have proficiency in the Arcana skill, and you have advantage on Intelligence (Arcana) checks related to the planes and planar travel. In addition, you have proficiency in one of the following skills of your choice: History, Insight, and Religion.",
    "type": null,
    "race": "satarre"
  }
},
{
  "model": "api_v2.trait",
  "pk": 247,
  "fields": {
    "name": "Carrier of Rot",
    "desc": "You can use your action to inflict rot on a creature you can see within 10 feet of you. The creature must make a Constitution saving throw. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 1d4 necrotic damage on a failed save, and half as much damage on a successful one. A creature that fails the saving throw also rots for 1 minute. A rotting creature takes 1d4 necrotic damage at the end of each of its turns. The target or a creature within 5 feet of it can use an action to excise the rot with a successful Wisdom (Medicine) check. The DC for the check equals the rot's Constitution saving throw DC. The rot also disappears if the target receives magical healing. The damage for the initial action and the rotting increases to 2d4 at 6th level, 3d4 at 11th level, and 4d4 at 16th level. After you use your Carrier of Rot trait, you can't use it again until you complete a short or long rest.",
    "type": null,
    "race": "satarre"
  }
},
{
  "model": "api_v2.trait",
  "pk": 248,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Constitution score increases by 1.",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 249,
  "fields": {
    "name": "Speed",
    "desc": "Your base walking speed is determined by your Heritage Subrace.",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 250,
  "fields": {
    "name": "Darkvision",
    "desc": "You can see in dim light within 60 feet as though it were bright light and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 251,
  "fields": {
    "name": "Age",
    "desc": "An upper limit of darakhul age has never been discovered; most darakhul die violently.",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 252,
  "fields": {
    "name": "Alignment",
    "desc": "Your alignment does not change when you become a darakhul, but most darakhul have a strong draw toward evil.",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 253,
  "fields": {
    "name": "Size",
    "desc": "Your size is determined by your Heritage Subrace.",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 254,
  "fields": {
    "name": "Languages",
    "desc": "You can speak, read, and write Common, Darakhul, and a language associated with your Heritage Subrace.",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 255,
  "fields": {
    "name": "Hunger for Flesh",
    "desc": "You must consume 1 pound of raw meat each day or suffer the effects of starvation. If you go 24 hours without such a meal, you gain one level of exhaustion. While you have any levels of exhaustion from this trait, you can't regain hit points or remove levels of exhaustion until you spend at least 1 hour consuming 10 pounds of raw meat.",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 256,
  "fields": {
    "name": "Imperfect Undeath",
    "desc": "You transitioned into undeath, but your transition was imperfect. Though you are a humanoid, you are susceptible to effects that target undead. You can regain hit points from spells like cure wounds, but you can also be affected by game effects that specifically target undead, such as a cleric's Turn Undead feature. Game effects that raise a creature from the dead work on you as normal, but they return you to life as a darakhul. A true resurrection or wish spell can restore you to life as a fully living member of your original race.",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 257,
  "fields": {
    "name": "Powerful Jaw",
    "desc": "Your heavy jaw is powerful enough to crush bones to powder. Your bite is a natural melee weapon, which you can use to make unarmed strikes. When you hit with it, your bite deals piercing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 258,
  "fields": {
    "name": "Sunlight Sensitivity",
    "desc": "You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight.",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 259,
  "fields": {
    "name": "Undead Resilience",
    "desc": "You are infused with the dark energy of undeath, which frees you from some frailties that plague most creatures. You have resistance to necrotic damage and poison damage, you are immune to disease, and you have advantage on saving throws against being charmed or poisoned. When you finish a short rest, you can reduce your exhaustion level by 1, provided you have ingested at least 1 pound of raw meat in the last 24 hours (see Hunger for Flesh).",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 260,
  "fields": {
    "name": "Undead Vitality",
    "desc": "You don't need to breathe, and you don't sleep the way most creatures do. Instead, you enter a dormant state that resembles death, remaining semiconscious, for 6 hours a day. While dormant, you have disadvantage on Wisdom (Perception) checks. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 261,
  "fields": {
    "name": "Heritage Subrace",
    "desc": "You were something else before you became a darakhul. This heritage determines some of your traits. Choose one Heritage Subrace below and apply the listed traits.",
    "type": null,
    "race": "darakhul"
  }
},
{
  "model": "api_v2.trait",
  "pk": 262,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Charisma score increases by 2.",
    "type": null,
    "race": "derro-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 263,
  "fields": {
    "name": "Calculating Insanity",
    "desc": "The insanity of your race was compressed into a cold, hard brilliance when you took on your darakhul form. These flashes of brilliance come to you at unexpected moments. You know the true strike cantrip. Charisma is your spellcasting ability for it. You can cast true strike as a bonus action a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest.",
    "type": null,
    "race": "derro-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 264,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Strength score increases by 2.",
    "type": null,
    "race": "dragonborn-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 265,
  "fields": {
    "name": "Corrupted Bite",
    "desc": "The inherent breath weapon of your draconic heritage is corrupted by the necrotic energy of your new darakhul form. Instead of forming a line or cone, your breath weapon now oozes out of your ghoulish maw. As a bonus action, you breathe necrotic energy onto your fangs and make one bite attack. If the attack hits, it deals extra necrotic damage equal to your level. You can't use this trait again until you finish a long rest.",
    "type": null,
    "race": "dragonborn-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 266,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Intelligence score increases by 2.",
    "type": null,
    "race": "drow-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 267,
  "fields": {
    "name": "Poison Bite",
    "desc": "When you hit with your bite attack, you can release venom into your foe. If you do, your bite deals an extra 1d6 poison damage. The damage increases to 3d6 at 11th level. After you release this venom into a creature, you can't do so again until you finish a short or long rest.",
    "type": null,
    "race": "drow-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 268,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Wisdon score increases by 2.",
    "type": null,
    "race": "dwarf-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 269,
  "fields": {
    "name": "Dwarven Stoutness",
    "desc": "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level.",
    "type": null,
    "race": "dwarf-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 270,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Dexterity score increases by 2.",
    "type": null,
    "race": "elf-shadow-fey-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 271,
  "fields": {
    "name": "Supernatural Senses",
    "desc": "Your keen elven senses are honed even more by the power of undeath and the hunger within you. You can now smell when blood is in the air. You have proficiency in the Perception skill, and you have advantage on Wisdom (Perception) checks to notice or find a creature within 30 feet of you that doesn't have all of its hit points.",
    "type": null,
    "race": "elf-shadow-fey-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 272,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Intelligence score increases by 2.",
    "type": null,
    "race": "gnome-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 273,
  "fields": {
    "name": "Magical Hunger",
    "desc": "When a creature you can see within 30 feet of you casts a spell, you can use your reaction to consume the spell's residual magic. Your consumption doesn't counter or otherwise affect the spell or the spellcaster. When you consume this residual magic, you gain temporary hit points (minimum of 1) equal to your Constitution modifier, and you can't use this trait again until you finish a short or long rest.",
    "type": null,
    "race": "gnome-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 274,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Dexterity score increases by 2.",
    "type": null,
    "race": "halfling-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 275,
  "fields": {
    "name": "Ill Fortune",
    "desc": "Your uncanny halfling luck has taken a dark turn since your conversion to an undead creature. When a creature rolls a 20 on the d20 for an attack roll against you, the creature must reroll the attack and use the new roll. If the second attack roll misses you, the attacking creature takes necrotic damage equal to twice your Constitution modifier (minimum of 2).",
    "type": null,
    "race": "halfling-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 276,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "One ability score of your choice, other than Constitution, increases by 2.",
    "type": null,
    "race": "human-half-elf-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 277,
  "fields": {
    "name": "Versatility",
    "desc": "The training and experience of your early years was not lost when you became a darakhul. You have proficiency in two skills and one tool of your choice.",
    "type": null,
    "race": "human-half-elf-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 278,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Intelligence score increases by 2.",
    "type": null,
    "race": "kobold-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 279,
  "fields": {
    "name": "Devious Bite",
    "desc": "When you hit a creature with your bite attack and you have advantage on the attack roll, your bite deals an extra 1d4 piercing damage.",
    "type": null,
    "race": "kobold-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 280,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Dexterity score increases by 2.",
    "type": null,
    "race": "ravenfolk-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 281,
  "fields": {
    "name": "Sudden Bite and Flight",
    "desc": "If you surprise a creature during the first round of combat, you can make a bite attack as a bonus action. If it hits, you can immediately take the Dodge action as a reaction.",
    "type": null,
    "race": "ravenfolk-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 282,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Charisma score increases by 1.",
    "type": null,
    "race": "tiefling-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 283,
  "fields": {
    "name": "Necrotic Rebuke",
    "desc": "When you are hit by a weapon attack, you can use a reaction to envelop the attacker in shadowy flames. The attacker takes necrotic damage equal to your Charisma modifier (minimum of 1), and it has disadvantage on attack rolls until the end of its next turn. You must finish a long rest before you can use this feature again.",
    "type": null,
    "race": "tiefling-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 284,
  "fields": {
    "name": "Ability Score Increase",
    "desc": "Your Strength score increases by 2.",
    "type": null,
    "race": "trollkin-heritage"
  }
},
{
  "model": "api_v2.trait",
  "pk": 285,
  "fields": {
    "name": "Regenerative Bite",
    "desc": "The regenerative powers of your trollkin heritage are less potent than they were in life and need a little help. As an action, you can make a bite attack against a creature that isn't undead or a construct. On a hit, you regain hit points (minimum of 1) equal to half the amount of damage dealt. Once you use this trait, you can't use it again until you finish a long rest.",
    "type": null,
    "race": "trollkin-heritage"
  }
}
]
