[
{
  "model": "api_v2.feature",
  "pk": "additional-magical-secrets",
  "fields": {
    "name": "Additional Magical Secrets",
    "desc": "At 6th level, you learn two spells of your choice from any class. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you but don't count against the number of bard spells you know.",
    "document": "srd",
    "character_class": "college-of-lore"
  }
},
{
  "model": "api_v2.feature",
  "pk": "archdruid",
  "fields": {
    "name": "Archdruid",
    "desc": "At 20th level, you can use your Wild Shape an unlimited number of times.\r\n\r\nAdditionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape.",
    "document": "srd",
    "character_class": "druid"
  }
},
{
  "model": "api_v2.feature",
  "pk": "barbarian-ability-score-improvement",
  "fields": {
    "name": "Ability Score Improvement",
    "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "barbarian-extra-attack",
  "fields": {
    "name": "Extra Attack",
    "desc": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "barbarian-unarmored-defense",
  "fields": {
    "name": "Unarmored Defense",
    "desc": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "bard-ability-score-improvement",
  "fields": {
    "name": "Ability Score Improvement",
    "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
    "document": "srd",
    "character_class": "bard"
  }
},
{
  "model": "api_v2.feature",
  "pk": "bard-college",
  "fields": {
    "name": "Bard College",
    "desc": "At 3rd level, you delve into the advanced techniques of a bard college of your choice: the College of Lore or the College of Valor, both detailed at the end of the class description. Your choice grants you features at 3rd level and again at 6th and 14th level.",
    "document": "srd",
    "character_class": "bard"
  }
},
{
  "model": "api_v2.feature",
  "pk": "bard-expertise",
  "fields": {
    "name": "Expertise",
    "desc": "At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.\r\n\r\nAt 10th level, you can choose another two skill proficiencies to gain this benefit.",
    "document": "srd",
    "character_class": "bard"
  }
},
{
  "model": "api_v2.feature",
  "pk": "bard-spellcasting",
  "fields": {
    "name": "Spellcasting",
    "desc": "You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music.\r\n\r\nYour spells are part of your vast repertoire, magic that you can tune to different situations.\r\n\r\n###Cantrips\r\n\r\nYou know two cantrips of your choice from the bard spell list. You learn additional bard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Bard table.\r\n\r\n###Spell Slots\r\n\r\nThe Bard table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\r\n\r\nFor example, if you know the 1st-level spell cure wounds and have a 1st-level and a 2nd-level spell slot available, you can cast cure wounds using either slot.\r\n\r\n###Spells Known of 1st Level and Higher\r\n\r\nYou know four 1st-level spells of your choice from the bard spell list.\r\n\r\nThe Spells Known column of the Bard table shows when you learn more bard spells of your choice. Each of these spells must be of a level for which you have spell slots, as shown on the table. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level.\r\n\r\nAdditionally, when you gain a level in this class, you can choose one of the bard spells you know and replace it with another spell from the bard spell list, which also must be of a level for which you have spell slots.\r\n\r\n###Spellcasting Ability\r\n\r\nCharisma is your spellcasting ability for your bard spells. Your magic comes from the heart and soul you pour into the performance of your music or oration. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a bard spell you cast and when making an attack roll with one.\r\n\r\n*Spell save DC* = 8 + your proficiency bonus + your Charisma modifier\r\n\r\n*Spell attack modifier* = your proficiency bonus + your Charisma modifier\r\n\r\n###Ritual Casting\r\n\r\nYou can cast any bard spell you know as a ritual if that spell has the ritual tag.\r\n\r\n###Spellcasting Focus\r\n\r\nYou can use a musical instrument (see chapter 5, “Equipment”) as a spellcasting focus for your bard spells.",
    "document": "srd",
    "character_class": "bard"
  }
},
{
  "model": "api_v2.feature",
  "pk": "bardic-inspiration",
  "fields": {
    "name": "Bardic Inspiration",
    "desc": "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6.\r\n\r\nOnce within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the GM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time.\r\n\r\nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest.\r\n\r\nYour Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level.",
    "document": "srd",
    "character_class": "bard"
  }
},
{
  "model": "api_v2.feature",
  "pk": "beast-spells",
  "fields": {
    "name": "Beast Spells",
    "desc": "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components.",
    "document": "srd",
    "character_class": "druid"
  }
},
{
  "model": "api_v2.feature",
  "pk": "blessed-healer",
  "fields": {
    "name": "Blessed Healer",
    "desc": "Beginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell's level.",
    "document": "srd",
    "character_class": "life-domain"
  }
},
{
  "model": "api_v2.feature",
  "pk": "bonus-proficiencies",
  "fields": {
    "name": "Bonus Proficiencies",
    "desc": "When you join the College of Lore at 3rd level, you gain proficiency with three skills of your choice.",
    "document": "srd",
    "character_class": "college-of-lore"
  }
},
{
  "model": "api_v2.feature",
  "pk": "brutal-critical",
  "fields": {
    "name": "Brutal Critical",
    "desc": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack.\r\n\r\nThis increases to two additional dice at 13th level and three additional dice at 17th level.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "channel-divinity-preserve-life",
  "fields": {
    "name": "Channel Divinity: Preserve Life",
    "desc": "Starting at 2nd level, you can use your Channel Divinity to heal the badly injured.\r\n\r\nAs an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can't use this feature on an undead or a construct.",
    "document": "srd",
    "character_class": "life-domain"
  }
},
{
  "model": "api_v2.feature",
  "pk": "cleric-ability-score-improvement",
  "fields": {
    "name": "Ability Score Improvement",
    "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
    "document": "srd",
    "character_class": "cleric"
  }
},
{
  "model": "api_v2.feature",
  "pk": "cleric-channel-divinity",
  "fields": {
    "name": "Channel Divinity",
    "desc": "At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.\r\n\r\nWhen you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.\r\n\r\nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.\r\n\r\nBeginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses.\r\n\r\n### Channel Divinity: Turn Undead\r\n\r\nAs an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.\r\n\r\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action.",
    "document": "srd",
    "character_class": "cleric"
  }
},
{
  "model": "api_v2.feature",
  "pk": "cleric-spellcasting",
  "fields": {
    "name": "Spellcasting",
    "desc": "As a conduit for divine power, you can cast cleric spells.\r\n\r\n###Cantrips\r\n\r\nAt 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table.\r\nPreparing and Casting Spells\r\n\r\nThe Cleric table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\r\n\r\nYou prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots.\r\n\r\nFor example, if you are a 3rd-level cleric, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\r\n\r\nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.\r\n\r\n###Spellcasting Ability\r\n\r\nWisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one.\r\n\r\n*Spell save DC* = 8 + your proficiency bonus + your Wisdom modifier\r\n\r\n*Spell attack modifier* = your proficiency bonus + your Wisdom modifier\r\n\r\n###Ritual Casting\r\n\r\nYou can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared.\r\n\r\n###Spellcasting Focus\r\n\r\nYou can use a holy symbol (see chapter 5, “Equipment”) as a spellcasting focus for your cleric spells.",
    "document": "srd",
    "character_class": "cleric"
  }
},
{
  "model": "api_v2.feature",
  "pk": "countercharm",
  "fields": {
    "name": "Countercharm",
    "desc": "At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required).",
    "document": "srd",
    "character_class": "bard"
  }
},
{
  "model": "api_v2.feature",
  "pk": "cutting-words",
  "fields": {
    "name": "Cutting Words",
    "desc": "Also at 3rd level, you learn how to use your wit to distract, confuse, and otherwise sap the confidence and competence of others. When a creature that you can see within 60 feet of you makes an attack roll, an ability check, or a damage roll, you can use your reaction to expend one of your uses of Bardic Inspiration, rolling a Bardic Inspiration die and subtracting the number rolled from the creature's roll. You can choose to use this feature after the creature makes its roll, but before the GM determines whether the attack roll or ability check succeeds or fails, or before the creature deals its damage. The creature is immune if it can't hear you or if it's immune to being charmed.",
    "document": "srd",
    "character_class": "college-of-lore"
  }
},
{
  "model": "api_v2.feature",
  "pk": "danger-sense",
  "fields": {
    "name": "Danger Sense",
    "desc": "At 2nd level, you gain an uncanny sense of when things nearby aren’t as they should be, giving you an edge when you dodge away from danger.\r\n\r\nYou have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can’t be blinded, deafened, or incapacitated.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "destroy-undead",
  "fields": {
    "name": "Destroy Undead",
    "desc": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Destroy Undead table. \r\n\r\n### Destroy Undead (table)\r\n\r\n| Cleric Level | Destroys Undead of CR... | \r\n|---|---|\r\n| 5th | 1/2 or lower |\r\n| 8th | 1 or lower |\r\n| 11th | 2 or lower |\r\n| 14th | 3 or lower | \r\n| 17th | 4 or lower |",
    "document": "srd",
    "character_class": "cleric"
  }
},
{
  "model": "api_v2.feature",
  "pk": "disciple-of-life",
  "fields": {
    "name": "Disciple of Life",
    "desc": "Also starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell's level.",
    "document": "srd",
    "character_class": "life-domain"
  }
},
{
  "model": "api_v2.feature",
  "pk": "divine-domain",
  "fields": {
    "name": "Divine Domain",
    "desc": "Choose one domain related to your deity, such as  Life. Each domain is detailed at the end of the class  description, and each one provides examples of gods  associated with it. Your choice grants you domain  spells and other features when you choose it at 1st  level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd  level, and additional benefits at 6th, 8th, and 17th  levels.\r\n\r\n### Domain Spells\r\nEach domain has a list of spells—its domain spells—that you gain at the cleric levels noted in the domain  description. Once you gain a domain spell, you always have it prepared, and it doesn’t count against the number of spells you can prepare each day. \r\nIf you have a domain spell that doesn’t appear on the cleric spell list, the spell is nonetheless a cleric spell for you.",
    "document": "srd",
    "character_class": "cleric"
  }
},
{
  "model": "api_v2.feature",
  "pk": "divine-intervention",
  "fields": {
    "name": "Divine Intervention",
    "desc": "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great.\r\n\r\nImploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The GM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate.\r\n\r\nIf your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.\r\n\r\nAt 20th level, your call for intervention succeeds automatically, no roll required.",
    "document": "srd",
    "character_class": "cleric"
  }
},
{
  "model": "api_v2.feature",
  "pk": "divine-strike",
  "fields": {
    "name": "Divine Strike",
    "desc": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
    "document": "srd",
    "character_class": "life-domain"
  }
},
{
  "model": "api_v2.feature",
  "pk": "druid-ability-score-improvement",
  "fields": {
    "name": "Ability Score Improvement",
    "desc": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
    "document": "srd",
    "character_class": "druid"
  }
},
{
  "model": "api_v2.feature",
  "pk": "druid-circle",
  "fields": {
    "name": "Druid Circle",
    "desc": "At 2nd level, you choose to identify with a circle of druids such as the Circle of the Land. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level.",
    "document": "srd",
    "character_class": "druid"
  }
},
{
  "model": "api_v2.feature",
  "pk": "druid-spellcasting",
  "fields": {
    "name": "Spellcasting",
    "desc": "Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will.\r\n\r\n###Cantrips\r\n\r\nAt 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Druid table.\r\n\r\n###Preparing and Casting Spells\r\n\r\nThe Druid table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\r\n\r\nYou prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots.\r\n\r\nFor example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\r\n\r\nYou can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.\r\n\r\n###Spellcasting Ability\r\n\r\nWisdom is your spellcasting ability for your druid spells, since your magic draws upon your devotion and attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a druid spell you cast and when making an attack roll with one.\r\n\r\nSpell save DC = 8 + your proficiency bonus + your Wisdom modifier\r\n\r\nSpell attack modifier = your proficiency bonus + your Wisdom modifier\r\n\r\n###Ritual Casting\r\n\r\nYou can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared.\r\n\r\n###Spellcasting Focus\r\n\r\nYou can use a druidic focus (see chapter 5, “Equipment”) as a spellcasting focus for your druid spells.",
    "document": "srd",
    "character_class": "druid"
  }
},
{
  "model": "api_v2.feature",
  "pk": "druidic",
  "fields": {
    "name": "Druidic",
    "desc": "You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message's presence with a successful DC 15 Wisdom (Perception) check but can't decipher it without magic.",
    "document": "srd",
    "character_class": "druid"
  }
},
{
  "model": "api_v2.feature",
  "pk": "fast-movement",
  "fields": {
    "name": "Fast Movement",
    "desc": "Starting at 5th level, your speed increases by 10 feet while you aren’t wearing heavy armor.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "feral-instinct",
  "fields": {
    "name": "Feral Instinct",
    "desc": "By 7th level, your instincts are so honed that you have advantage on initiative rolls.\r\n\r\nAdditionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "font-of-inspiration",
  "fields": {
    "name": "Font of Inspiration",
    "desc": "Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest.",
    "document": "srd",
    "character_class": "bard"
  }
},
{
  "model": "api_v2.feature",
  "pk": "frenzy",
  "fields": {
    "name": "Frenzy",
    "desc": "Starting when you choose this path at 3rd level, you can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion (as described in appendix A).",
    "document": "srd",
    "character_class": "path-of-the-berserker"
  }
},
{
  "model": "api_v2.feature",
  "pk": "indomitable-might",
  "fields": {
    "name": "Indomitable Might",
    "desc": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "intimidating-presence",
  "fields": {
    "name": "Intimidating Presence",
    "desc": "Beginning at 10th level, you can use your action to frighten someone with your menacing presence. When you do so, choose one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you.\r\n\r\nIf the creature succeeds on its saving throw, you can't use this feature on that creature again for 24 hours.",
    "document": "srd",
    "character_class": "path-of-the-berserker"
  }
},
{
  "model": "api_v2.feature",
  "pk": "jack-of-all-trades",
  "fields": {
    "name": "Jack of All Trades",
    "desc": "Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn't already include your proficiency bonus.",
    "document": "srd",
    "character_class": "bard"
  }
},
{
  "model": "api_v2.feature",
  "pk": "life-bonus-proficiency",
  "fields": {
    "name": "Bonus Proficiency",
    "desc": "When you choose this domain at 1st level, you gain proficiency with heavy armor.",
    "document": "srd",
    "character_class": "life-domain"
  }
},
{
  "model": "api_v2.feature",
  "pk": "life-domain-spells",
  "fields": {
    "name": "Life Domain Spells (table)",
    "desc": "Cleric Level | Spells |\r\n|---|---|\r\n| 1st | bless, cure wounds | \r\n| 3rd | lesser restoration, spiritual weapon |\r\n| 5th | beacon of hope, revivify |\r\n| 7th | death ward, guardian of faith |\r\n| 9th | mass cure wounds, raise dead |",
    "document": "srd",
    "character_class": "life-domain"
  }
},
{
  "model": "api_v2.feature",
  "pk": "magical-secrets",
  "fields": {
    "name": "Magical Secrets",
    "desc": "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip.\r\n\r\nThe chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table.\r\n\r\nYou learn two additional spells from any class at 14th level and again at 18th level.",
    "document": "srd",
    "character_class": "bard"
  }
},
{
  "model": "api_v2.feature",
  "pk": "mindless-rage",
  "fields": {
    "name": "Mindless Rage",
    "desc": "Beginning at 6th level, you can't be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage.",
    "document": "srd",
    "character_class": "path-of-the-berserker"
  }
},
{
  "model": "api_v2.feature",
  "pk": "peerless-skill",
  "fields": {
    "name": "Peerless Skill",
    "desc": "Starting at 14th level, when you make an ability check, you can expend one use of Bardic Inspiration. Roll a Bardic Inspiration die and add the number rolled to your ability check. You can choose to do so after you roll the die for the ability check, but before the GM tells you whether you succeed or fail.",
    "document": "srd",
    "character_class": "college-of-lore"
  }
},
{
  "model": "api_v2.feature",
  "pk": "persistent-rage",
  "fields": {
    "name": "Persistent Rage",
    "desc": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "primal-champion",
  "fields": {
    "name": "Primal Champion",
    "desc": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "primal-path",
  "fields": {
    "name": "Primal Path",
    "desc": "At 3rd level, you choose a path that shapes the nature of your rage. Choose the Path of the Berserker or the Path of the Totem Warrior, both detailed at the end of the class description. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "rage",
  "fields": {
    "name": "Rage",
    "desc": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.\r\n\r\nWhile raging, you gain the following benefits if you aren't wearing heavy armor:\r\n\r\n* You have advantage on Strength checks and Strength saving throws.\r\n* When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table.\r\n* You have resistance to bludgeoning, piercing, and slashing damage. \r\n\r\nIf you are able to cast spells, you can't cast them or concentrate on them while raging.\r\n\r\nYour rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.\r\n\r\nOnce you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "reckless-attack",
  "fields": {
    "name": "Reckless Attack",
    "desc": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "relentless-rage",
  "fields": {
    "name": "Relentless Rage",
    "desc": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you’re raging and don’t die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.\r\n\r\nEach time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10.",
    "document": "srd",
    "character_class": "barbarian"
  }
},
{
  "model": "api_v2.feature",
  "pk": "retaliation",
  "fields": {
    "name": "Retaliation",
    "desc": "Starting at 14th level, when you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature.",
    "document": "srd",
    "character_class": "path-of-the-berserker"
  }
},
{
  "model": "api_v2.feature",
  "pk": "song-of-rest",
  "fields": {
    "name": "Song of Rest",
    "desc": "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points.\r\n\r\nThe extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level.",
    "document": "srd",
    "character_class": "bard"
  }
},
{
  "model": "api_v2.feature",
  "pk": "superior-inspiration",
  "fields": {
    "name": "Superior Inspiration",
    "desc": "At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use.",
    "document": "srd",
    "character_class": "bard"
  }
},
{
  "model": "api_v2.feature",
  "pk": "supreme-healing",
  "fields": {
    "name": "Supreme Healing",
    "desc": "Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12.",
    "document": "srd",
    "character_class": "life-domain"
  }
},
{
  "model": "api_v2.feature",
  "pk": "timeless-body",
  "fields": {
    "name": "Timeless Body",
    "desc": "Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year.",
    "document": "srd",
    "character_class": "druid"
  }
},
{
  "model": "api_v2.feature",
  "pk": "wild-shape",
  "fields": {
    "name": "Wild Shape",
    "desc": "Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.\r\n\r\nYour druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed.\r\n\r\n| Level | Max. CR | Limitations | Example |\r\n| --- | --- | --- | --- |\r\n| 2nd | 1/4 | No flying or swimming speed | Wolf |\r\n| 4th | 1/2 | No flying speed | Crocodile |\r\n| 8th | 1 | - | Giant Eagle |\r\n\r\nYou can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.\r\n\r\nWhile you are transformed, the following rules apply:\r\nYour game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them.\r\n\r\nWhen you transform, you assume the beast's hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious.\r\n\r\nYou can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as call lightning, that you've already cast.\r\n\r\nYou retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as darkvision, unless your new form also has that sense.\r\n\r\nYou choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the GM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form.",
    "document": "srd",
    "character_class": "druid"
  }
}
]
