[
{
  "model": "api_v2.ruleset",
  "pk": "srd_damage-and-healing",
  "fields": {
    "name": "Damage and Healing",
    "document": "srd",
    "desc": "Injury and the risk of death are constant companions of those who explore fantasy gaming worlds. The thrust of a sword, a well-placed arrow, or a blast of flame from a srd:fireball spell all have the potential to damage, or even kill, the hardiest of creatures."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_damage-and-healing_hit-points",
  "fields": {
    "ruleset": "srd_damage-and-healing",
    "document": "srd",
    "name": "Hit Points",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "Hit points represent a combination of physical and mental durability, the will to live, and luck. Creatures with more hit points are more difficult to kill. Those with fewer hit points are more fragile.\n\nA creature's current hit points (usually just called hit points) can be any number from the creature's hit point maximum down to 0. This number changes frequently as a creature takes damage or receives healing.\n\nWhenever a creature takes damage, that damage is subtracted from its hit points. The loss of hit points has no effect on a creature's capabilities until the creature drops to 0 hit points.\n\n## Damage Rolls\n\nEach weapon, spell, and harmful monster ability specifies the damage it deals. You roll the damage die or dice, add any modifiers, and apply the damage to your target. Magic weapons, special abilities, and other factors can grant a bonus to damage. With a penalty, it is possible to deal 0 damage, but never negative damage. When attacking with a **weapon**, you add your ability modifier---the same modifier used for the attack roll---to the damage. A **spell** tells you which dice to roll for damage and whether to add any modifiers.\n\nIf a spell or other effect deals damage to **more** **than one target** at the same time, roll the damage once for all of them. For example, when a wizard casts srd:fireball or a cleric casts srd:flame-strike, the spell's damage is rolled once for all creatures caught in the blast."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_damage-and-healing_damage-rolls",
  "fields": {
    "ruleset": "srd_damage-and-healing",
    "document": "srd",
    "name": "Damage Rolls",
    "index": 2,
    "initialHeaderLevel": 2,
    "desc": "Each weapon, spell, and harmful monster ability specifies the damage it deals. You roll the damage die or dice, add any modifiers, and apply the damage to your target. Magic weapons, special abilities, and other factors can grant a bonus to damage. With a penalty, it is possible to deal 0 damage, but never negative damage. When attacking with a **weapon**, you add your ability modifier---the same modifier used for the attack roll---to the damage. A **spell** tells you which dice to roll for damage and whether to add any modifiers.\n\nIf a spell or other effect deals damage to **more** **than one target** at the same time, roll the damage once for all of them. For example, when a wizard casts srd:fireball or a cleric casts srd:flame-strike, the spell's damage is rolled once for all creatures caught in the blast."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_damage-and-healing_critical-hits",
  "fields": {
    "ruleset": "srd_damage-and-healing",
    "document": "srd",
    "name": "Critical Hits",
    "index": 3,
    "initialHeaderLevel": 3,
    "desc": "Each weapon, spell, and harmful monster ability specifies the damage it deals. You roll the damage die or dice, add any modifiers, and apply the damage to your target. Magic weapons, special abilities, and other factors can grant a bonus to damage. With a penalty, it is possible to deal 0 damage, but never negative damage. When attacking with a **weapon**, you add your ability modifier---the same modifier used for the attack roll---to the damage. A **spell** tells you which dice to roll for damage and whether to add any modifiers.\n\nIf a spell or other effect deals damage to **more** **than one target** at the same time, roll the damage once for all of them. For example, when a wizard casts srd:fireball or a cleric casts srd:flame-strike, the spell's damage is rolled once for all creatures caught in the blast."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_damage-and-healing_damage-types",
  "fields": {
    "ruleset": "srd_damage-and-healing",
    "document": "srd",
    "name": "Damage Types",
    "index": 4,
    "initialHeaderLevel": 3,
    "desc": "Different attacks, damaging spells, and other harmful effects deal different types of damage. Damage types have no rules of their own, but other rules, such as damage resistance, rely on the types.\n\nThe damage types follow, with examples to help a GM assign a damage type to a new effect.\n\n**Acid.** The corrosive spray of a black dragon's breath and the dissolving enzymes secreted by a black pudding deal acid damage.\n\n**Bludgeoning.** Blunt force attacks---hammers, falling, constriction, and the like---deal bludgeoning damage.\n\n**Cold.** The infernal chill radiating from an ice devil's spear and the frigid blast of a white dragon's breath deal cold damage.\n\n**Fire.** Red dragons breathe fire, and many spells conjure flames to deal fire damage.\n\n**Force.** Force is pure magical energy focused into a damaging form. Most effects that deal force damage are spells, including _magic missile_ and _spiritual weapon_.\n\n**Lightning.** A _lightning bolt_ spell and a blue dragon's breath deal lightning damage.\n\n**Necrotic.** Necrotic damage, dealt by certain undead and a spell such as _chill touch_, withers matter and even the soul.\n\n**Piercing.** Puncturing and impaling attacks, including spears and monsters' bites, deal piercing damage.\n\n**Poison.** Venomous stings and the toxic gas of a green dragon's breath deal poison damage.\n\n**Psychic.** Mental abilities such as a mind flayer's psionic blast deal psychic damage.\n\n**Radiant.** Radiant damage, dealt by a cleric's _flame strike_ spell or an angel's smiting weapon, sears the flesh like fire and overloads the spirit with power.\n\n**Slashing.** Swords, axes, and monsters' claws deal slashing damage.\n\n**Thunder.** A concussive burst of sound, such as the effect of the srd:thunderwave spell, deals thunder damage."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_damage-and-healing_damage-types",
  "fields": {
    "ruleset": "srd_damage-and-healing",
    "document": "srd",
    "name": "Damage Types",
    "index": 5,
    "initialHeaderLevel": 3,
    "desc": "Different attacks, damaging spells, and other harmful effects deal different types of damage. Damage types have no rules of their own, but other rules, such as damage resistance, rely on the types.\n\nThe damage types follow, with examples to help a GM assign a damage type to a new effect.\n\n**Acid.** The corrosive spray of a black dragon's breath and the dissolving enzymes secreted by a black pudding deal acid damage.\n\n**Bludgeoning.** Blunt force attacks---hammers, falling, constriction, and the like---deal bludgeoning damage.\n\n**Cold.** The infernal chill radiating from an ice devil's spear and the frigid blast of a white dragon's breath deal cold damage.\n\n**Fire.** Red dragons breathe fire, and many spells conjure flames to deal fire damage.\n\n**Force.** Force is pure magical energy focused into a damaging form. Most effects that deal force damage are spells, including _magic missile_ and _spiritual weapon_.\n\n**Lightning.** A _lightning bolt_ spell and a blue dragon's breath deal lightning damage.\n\n**Necrotic.** Necrotic damage, dealt by certain undead and a spell such as _chill touch_, withers matter and even the soul.\n\n**Piercing.** Puncturing and impaling attacks, including spears and monsters' bites, deal piercing damage.\n\n**Poison.** Venomous stings and the toxic gas of a green dragon's breath deal poison damage.\n\n**Psychic.** Mental abilities such as a mind flayer's psionic blast deal psychic damage.\n\n**Radiant.** Radiant damage, dealt by a cleric's _flame strike_ spell or an angel's smiting weapon, sears the flesh like fire and overloads the spirit with power.\n\n**Slashing.** Swords, axes, and monsters' claws deal slashing damage.\n\n**Thunder.** A concussive burst of sound, such as the effect of the srd:thunderwave spell, deals thunder damage."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_damage-and-healing_resistance-and-vulnerability",
  "fields": {
    "ruleset": "srd_damage-and-healing",
    "document": "srd",
    "name": "Damage Resistance and Vulnerability",
    "index": 6,
    "initialHeaderLevel": 2,
    "desc": "Some creatures and objects are exceedingly difficult or unusually easy to hurt with certain types of damage.\n\nIf a creature or an object has **resistance** to a damage type, damage of that type is halved against it. If a creature or an object has **vulnerability** to a damage type, damage of that type is doubled against it.\n\nResistance and then vulnerability are applied after all other modifiers to damage. For example, a creature has resistance to bludgeoning damage and is hit by an attack that deals 25 bludgeoning damage. The creature is also within a magical aura that reduces all damage by 5. The 25 damage is first reduced by 5 and then halved, so the creature takes 10 damage.\n\nMultiple instances of resistance or vulnerability that affect the same damage type count as only one instance. For example, if a creature has resistance to fire damage as well as resistance to all nonmagical damage, the damage of a nonmagical fire is reduced by half against the creature, not reduced by three--- quarters."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_armor",
  "fields": {
    "name": "Armor",
    "document": "srd",
    "desc": "Fantasy gaming worlds are a vast tapestry made up of many different cultures, each with its own technology level. For this reason, adventurers have access to a variety of armor types, ranging from leather armor to chain mail to costly plate armor, with several other kinds of armor in between. The Armor table collects the most commonly available types of armor found in the game and separates them into three categories: light armor, medium armor, and heavy armor. Many warriors supplement their armor with a shield.\n\nThe Armor table shows the cost, weight, and other properties of the common types of armor worn in fantasy gaming worlds.\n\n**_Armor Proficiency._** Anyone can put on a suit of armor or strap a shield to an arm. Only those proficient in the armor's use know how to wear it effectively, however. Your class gives you proficiency with certain types of armor. If you wear armor that you lack proficiency with, you have disadvantage on any ability check, saving throw, or attack roll that involves Strength or Dexterity, and you can't cast spells.\n\n**_Armor Class (AC)._** Armor protects its wearer from attacks. The armor (and shield) you wear determines your base Armor Class.\n\n**_Heavy Armor._** Heavier armor interferes with the wearer's ability to move quickly, stealthily, and freely. If the Armor table shows “Str 13” or “Str 15” in the Strength column for an armor type, the armor reduces the wearer's speed by 10 feet unless the wearer has a Strength score equal to or higher than the listed score.\n\n**_Stealth._** If the Armor table shows “Disadvantage” in the Stealth column, the wearer has disadvantage on Dexterity (Stealth) checks.\n\n**_Shields._** A shield is made from wood or metal and is carried in one hand. Wielding a shield increases your Armor Class by 2. You can benefit from only one shield at a time.\n\n"
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_armor_light-armor",
  "fields": {
    "ruleset": "srd_armor",
    "document": "srd",
    "name": "Light Armor",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "Made from supple and thin materials, light armor favors agile adventurers since it offers some protection without sacrificing mobility. If you wear light armor, you add your Dexterity modifier to the base number from your armor type to determine your Armor Class.\n\n**_Padded._** Padded armor consists of quilted layers of cloth and batting.\n\n**_Leather._** The breastplate and shoulder protectors of this armor are made of leather that has been stiffened by being boiled in oil. The rest of the armor is made of softer and more flexible materials.\n\n**_Studded Leather._** Made from tough but flexible leather, studded leather is reinforced with close-set rivets or spikes."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_armor_medium-armor",
  "fields": {
    "ruleset": "srd_armor",
    "document": "srd",
    "name": "Medium Armor",
    "index": 2,
    "initialHeaderLevel": 2,
    "desc": "Medium armor offers more protection than light armor, but it also impairs movement more. If you wear medium armor, you add your Dexterity modifier, to a maximum of +2, to the base number from your armor type to determine your Armor Class.\n\n**_Hide._** This crude armor consists of thick furs and pelts. It is commonly worn by barbarian tribes, evil humanoids, and other folk who lack access to the tools and materials needed to create better armor.\n\n**_Chain Shirt._** Made of interlocking metal rings, a chain shirt is worn between layers of clothing or leather. This armor offers modest protection to the wearer's upper body and allows the sound of the rings rubbing against one another to be muffled by outer layers.\n\n**_Scale Mail._** This armor consists of a coat and leggings (and perhaps a separate skirt) of leather covered with overlapping pieces of metal, much like the scales of a fish. The suit includes gauntlets.\n\n**_Breastplate._** This armor consists of a fitted metal chest piece worn with supple leather. Although it leaves the legs and arms relatively unprotected, this armor provides good protection for the wearer's vital organs while leaving the wearer relatively unencumbered.\n\n**_Half Plate._** Half plate consists of shaped metal plates that cover most of the wearer's body. It does not include leg protection beyond simple greaves that are attached with leather straps."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_armor_heavy-armor",
  "fields": {
    "ruleset": "srd_armor",
    "document": "srd",
    "name": "Heavy Armor",
    "index": 3,
    "initialHeaderLevel": 2,
    "desc": "Of all the armor categories, heavy armor offers the best protection. These suits of armor cover the entire body and are designed to stop a wide range of attacks. Only proficient warriors can manage their weight and bulk.\n\nHeavy armor doesn't let you add your Dexterity modifier to your Armor Class, but it also doesn't penalize you if your Dexterity modifier is negative.\n\n**_Ring Mail._** This armor is leather armor with heavy rings sewn into it. The rings help reinforce the armor against blows from swords and axes. Ring mail is inferior to chain mail, and it's usually worn only by those who can't afford better armor.\n\n**_Chain Mail._** Made of interlocking metal rings, chain mail includes a layer of quilted fabric worn underneath the mail to prevent chafing and to cushion the impact of blows. The suit includes gauntlets.\n\n**_Splint._** This armor is made of narrow vertical strips of metal riveted to a backing of leather that is worn over cloth padding. Flexible chain mail protects the joints.\n\n**_Plate._** Plate consists of shaped, interlocking metal plates to cover the entire body. A suit of plate includes gauntlets, heavy leather boots, a visored helmet, and thick layers of padding underneath the armor. Buckles and straps distribute the weight over the body."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_armor_armor-table",
  "fields": {
    "ruleset": "srd_armor",
    "document": "srd",
    "name": "Armor Table",
    "index": 4,
    "initialHeaderLevel": 2,
    "desc": "| Armor              | Cost     | Armor Class (AC)          | Strength | Stealth      | Weight |\n|--------------------|----------|---------------------------|----------|--------------|--------|\n| **_Light Armor_**  |          |                           |          |              |        |\n| Padded             | 5 gp     | 11 + Dex modifier         | -        | Disadvantage | 8 lb.  |\n| Leather            | 10 gp    | 11 + Dex modifier         | -        | -            | 10 lb. |\n| Studded leather    | 45 gp    | 12 + Dex modifier         | -        | -            | 13 lb. |\n| **_Medium Armor_** |          |                           |          |              |        |\n| Hide               | 10 gp    | 12 + Dex modifier (max 2) | -        | -            | 12 lb. |\n| Chain shirt        | 50 gp    | 13 + Dex modifier (max 2) | -        | -            | 20 lb. |\n| Scale mail         | 50 gp    | 14 + Dex modifier (max 2) | -        | Disadvantage | 45 lb. |\n| Breastplate        | 400 gp   | 14 + Dex modifier (max 2) | -        | -            | 20 lb. |\n| Half plate         | 750 gp   | 15 + Dex modifier (max 2) | -        | Disadvantage | 40 lb. |\n| **_Heavy Armor_**  |          |                           |          |              |        |\n| Ring mail          | 30 gp    | 14                        | -        | Disadvantage | 40 lb. |\n| Chain mail         | 75 gp    | 16                        | Str 13   | Disadvantage | 55 lb. |\n| Splint             | 200 gp   | 17                        | Str 15   | Disadvantage | 60 lb. |\n| Plate              | 1,500 gp | 18                        | Str 15   | Disadvantage | 65 lb. |\n| **_Shield_**       |          |                           |          |              |        |\n| Shield             | 10 gp    | +2                        | -        | -            | 6 lb.  |"
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_armor_donning-and-doffing",
  "fields": {
    "ruleset": "srd_armor",
    "document": "srd",
    "name": "Getting Into and Out of Armor",
    "index": 5,
    "initialHeaderLevel": 2,
    "desc": "The time it takes to don or doff armor depends on the armor's category.\n\n**_Don._** This is the time it takes to put on armor. You benefit from the armor's AC only if you take the full time to don the suit of armor.\n\n**_Doff._** This is the time it takes to take off armor. If you have help, reduce this time by half.\n\n**Donning and Doffing Armor (table)**\n\n| Category     | Don        | Doff      |\n|--------------|------------|-----------|\n| Light Armor  | 1 minute   | 1 minute  |\n| Medium Armor | 5 minutes  | 1 minute  |\n| Heavy Armor  | 10 minutes | 5 minutes |\n| Shield       | 1 action   | 1 action  |"
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_abilities",
  "fields": {
    "name": "Abilities",
    "document": "srd",
    "desc": "Six abilities provide a quick description of every creature's physical and mental characteristics:\n\n- **Strength**, measuring physical power\n - **Dexterity**, measuring agility\n - **Constitution**, measuring endurance \n - **Intelligence**, measuring reasoning and memory \n - **Wisdom**, measuring perception and insight \n - **Charisma**, measuring force of personality\n\n\nIs a character muscle-bound and insightful? Brilliant and charming? Nimble and hardy? Ability scores define these qualities---a creature's assets as well as weaknesses.\n\nThe three main rolls of the game---the ability check, the saving throw, and the attack roll---rely on the six ability scores. The book's introduction describes the basic rule behind these rolls: roll a d20, add an ability modifier derived from one of the six ability scores, and compare the total to a target number."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_ability-scores-and-modifiers",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Ability Scores and Modifiers",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "Each of a creature's abilities has a score, a number that defines the magnitude of that ability. An ability score is not just a measure of innate capabilities, but also encompasses a creature's training and competence in activities related to that ability.\n\nA score of 10 or 11 is the normal human average, but adventurers and many monsters are a cut above average in most abilities. A score of 18 is the highest that a person usually reaches. Adventurers can have scores as high as 20, and monsters and divine beings can have scores as high as 30.\n\nEach ability also has a modifier, derived from the score and ranging from -5 (for an ability score of 1) to +10 (for a score of 30). The Ability Scores and Modifiers table notes the ability modifiers for the range of possible ability scores, from 1 to 30.\n\n  To determine an ability modifier without consulting the table, subtract 10 from the ability score and then divide the total by 2 (round down).\n\n Because ability modifiers affect almost every attack roll, ability check, and saving throw, ability modifiers come up in play more often than their associated scores."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_advantage-and-disadvantage",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Advantage and Disadvantage",
    "index": 2,
    "initialHeaderLevel": 2,
    "desc": "Sometimes a special ability or spell tells you that you have advantage or disadvantage on an ability check, a saving throw, or an attack roll.\nWhen that happens, you roll a second d20 when you make the roll. Use the higher of the two rolls if you have advantage, and use the lower roll if you have disadvantage. For example, if you have disadvantage and roll a 17 and a 5, you use the 5. If you instead have advantage and roll those numbers, you use the 17.\n\nIf multiple situations affect a roll and each one grants advantage or imposes disadvantage on it, you don't roll more than one additional d20.\nIf two favorable situations grant advantage, for example, you still roll only one additional d20.\n\nIf circumstances cause a roll to have both advantage and disadvantage, you are considered to have neither of them, and you roll one d20. This is true even if multiple circumstances impose disadvantage and only one grants advantage or vice versa. In such a situation, you have neither advantage nor disadvantage.\n\nWhen you have advantage or disadvantage and something in the game, such as the halfling's Lucky trait, lets you reroll the d20, you can reroll only one of the dice. You choose which one. For example, if a halfling has advantage or disadvantage on an ability check and rolls a 1 and a 13, the halfling could use the Lucky trait to reroll the 1.\n\nYou usually gain advantage or disadvantage through the use of special abilities, actions, or spells. Inspiration can also give a character advantage. The GM can also decide that circumstances influence a roll in one direction or the other and grant advantage or impose disadvantage as a result."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_proficiency-bonus",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Proficiency Bonus",
    "index": 3,
    "initialHeaderLevel": 2,
    "desc": "Characters have a proficiency bonus determined by level. Monsters also have this bonus, which is incorporated in their stat blocks. The bonus is used in the rules on ability checks, saving throws, and attack rolls.\n\nYour proficiency bonus can't be added to a single die roll or other number more than once. For example, if two different rules say you can add your proficiency bonus to a Wisdom saving throw, you nevertheless add the bonus only once when you make the save.\n\nOccasionally, your proficiency bonus might be multiplied or divided (doubled or halved, for example) before you apply it. For example, the rogue's Expertise feature doubles the proficiency bonus for certain ability checks. If a circumstance suggests that your proficiency bonus applies more than once to the same roll, you still add it only once and multiply or divide it only once.\n\nBy the same token, if a feature or effect allows you to multiply your proficiency bonus when making an ability check that wouldn't normally benefit from your proficiency bonus, you still don't add the bonus to the check. For that check your proficiency bonus is 0, given the fact that multiplying 0 by any number is still 0. For instance, if you lack proficiency in the History skill, you gain no benefit from a feature that lets you double your proficiency bonus when you make Intelligence (History) checks.\n\nIn general, you don't multiply your proficiency bonus for attack rolls or saving throws. If a feature or effect allows you to do so, these same rules apply."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_ability-checks",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Ability Checks",
    "index": 4,
    "initialHeaderLevel": 2,
    "desc": "An ability check tests a character's or monster's innate talent and training in an effort to overcome a challenge. The GM calls for an ability check when a character or monster attempts an action (other than an attack) that has a chance of failure. When the outcome is uncertain, the dice determine the results.\n\nFor every ability check, the GM decides which of the six abilities is relevant to the task at hand and the difficulty of the task, represented by a Difficulty Class.\n\nThe more difficult a task, the higher its DC. The Typical Difficulty Classes table shows the most common DCs.\n\nTo make an ability check, roll a d20 and add the relevant ability modifier. As with other d20 rolls, apply bonuses and penalties, and compare the total to the DC. If the total equals or exceeds the DC, the ability check is a success---the creature overcomes the challenge at hand. Otherwise, it's a failure, which means the character or monster makes no progress toward the objective or makes progress combined with a setback determined by the GM."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_contests",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Contents",
    "index": 5,
    "initialHeaderLevel": 3,
    "desc": "Sometimes one character's or monster's efforts are directly opposed to another's. This can occur when both of them are trying to do the same thing and only one can succeed, such as attempting to snatch up a magic ring that has fallen on the floor. This situation also applies when one of them is trying to prevent the other one from accomplishing a goal---for example, when a monster tries to force open a door that an adventurer is holding closed. In situations like these, the outcome is determined by a special form of ability check, called a contest.\n\nBoth participants in a contest make ability checks appropriate to their efforts. They apply all appropriate bonuses and penalties, but instead of comparing the total to a DC, they compare the totals of their two checks. The participant with the higher check total wins the contest.\nThat character or monster either succeeds at the action or prevents the other one from succeeding.\n\nIf the contest results in a tie, the situation remains the same as it was before the contest. Thus, one contestant might win the contest by default. If two characters tie in a contest to snatch a ring off the floor, neither character grabs it. In a contest between a monster trying to open a door and an adventurer trying to keep the door closed, a tie means that the door remains shut."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_skills",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Skills",
    "index": 6,
    "initialHeaderLevel": 3,
    "desc": "Each ability covers a broad range of capabilities, including skills that a character or a monster can be proficient in. A skill represents a specific aspect of an ability score, and an individual's proficiency in a skill demonstrates a focus on that aspect. (A character's starting skill proficiencies are determined at character creation, and a monster's skill proficiencies appear in the monster's stat block.)  For example, a Dexterity check might reflect a character's attempt to pull off an acrobatic stunt, to palm an object, or to stay hidden. Each of these aspects of Dexterity has an associated skill: Acrobatics, Sleight of Hand, and Stealth, respectively. So a character who has proficiency in the Stealth skill is particularly good at Dexterity checks related to sneaking and hiding.\n\nThe skills related to each ability score are shown in the following list. (No skills are related to Constitution.) See an ability's description in the later sections of this section for examples of how to use a skill associated with an ability.\n\n**Strength**\n\n- Athletics\n\n**Dexterity**\n- Acrobatics\n- Sleight of Hand\n- Stealth\n\n**Intelligence**\n\n- Arcana\n- History\n- Investigation\n- Nature\n- Religion\n\n**Wisdom**\n\n- Animal Handling\n- Insight\n- Medicine\n- Perception\n- Survival\n\n**Charisma**\n\n- Deception\n- Intimidation\n- Performance\n- Persuasion\n\n\nSometimes, the GM might ask for an ability check using a specific skill---for example, Make a Wisdom (Perception) check. At other times, a player might ask the GM if proficiency in a particular skill applies to a check. In either case, proficiency in a skill means an individual can add his or her proficiency bonus to ability checks that involve that skill. Without proficiency in the skill, the individual makes a normal ability check.\n\nFor example, if a character attempts to climb up a dangerous cliff, the GM might ask for a Strength (Athletics) check. If the character is proficient in Athletics, the character's proficiency bonus is added to the Strength check. If the character lacks that proficiency, he or she just makes a Strength check."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_skills-with-different-abilities",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Variant: Skills with Different Abilities",
    "index": 7,
    "initialHeaderLevel": 4,
    "desc": "Normally, your proficiency in a skill applies only to a specific kind of ability check. Proficiency in Athletics, for example, usually applies to Strength checks. In some situations, though, your proficiency might reasonably apply to a different kind of check. In such cases, the GM might ask for a check using an unusual combination of ability and skill, or you might ask your GM if you can apply a proficiency to a different check. For example, if you have to swim from an offshore island to the mainland, your GM might call for a Constitution check to see if you have the stamina to make it that far. In this case, your GM might allow you to apply your proficiency in Athletics and ask for a Constitution (Athletics) check. So if you're proficient in Athletics, you apply your proficiency bonus to the Constitution check just as you would normally do for a Strength (Athletics) check. Similarly, when your half-orc barbarian uses a display of raw strength to intimidate an enemy, your GM might ask for a Strength (Intimidation) check, even though Intimidation is normally associated with Charisma."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_passive-checks",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Passive Checks",
    "index": 8,
    "initialHeaderLevel": 3,
    "desc": "A passive check is a special kind of ability check that doesn't involve any die rolls. Such a check can represent the average result for a task done repeatedly, such as searching for secret doors over and over again, or can be used when the GM wants to secretly determine whether the characters succeed at something without rolling dice, such as noticing a hidden monster.\n\nHere's how to determine a character's total for a passive check:  > 10 + all modifiers that normally apply to the check  If the character has advantage on the check, add 5. For disadvantage, subtract 5. The game refers to a passive check total as a **score**.\n\nFor example, if a 1st-level character has a Wisdom of 15 and proficiency in Perception, he or she has a passive Wisdom (Perception) score of 14.\n\nThe rules on hiding in the Dexterity section below rely on passive checks, as do the exploration rules."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_working-together",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Working Together",
    "index": 9,
    "initialHeaderLevel": 3,
    "desc": "Sometimes two or more characters team up to attempt a task. The character who's leading the effort---or the one with the highest ability modifier---can make an ability check with advantage, reflecting the help provided by the other characters. In combat, this requires the Help action.\n\nA character can only provide help if the task is one that he or she could attempt alone. For example, trying to open a lock requires proficiency with thieves' tools, so a character who lacks that proficiency can't help another character in that task. Moreover, a character can help only when two or more individuals working together would actually be productive. Some tasks, such as threading a needle, are no easier with help."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_group-checks",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Group Checks",
    "index": 10,
    "initialHeaderLevel": 4,
    "desc": "When a number of individuals are trying to accomplish something as a group, the GM might ask for a group ability check. In such a situation, the characters who are skilled at a particular task help cover those who aren't.\n\nTo make a group ability check, everyone in the group makes the ability check. If at least half the group succeeds, the whole group succeeds.\nOtherwise, the group fails.\n\nGroup checks don't come up very often, and they're most useful when all the characters succeed or fail as a group. For example, when adventurers are navigating a swamp, the GM might call for a group Wisdom (Survival) check to see if the characters can avoid the quicksand, sinkholes, and other natural hazards of the environment. If at least half the group succeeds, the successful characters are able to guide their companions out of danger. Otherwise, the group stumbles into one of these hazards.\n\nEvery task that a character or monster might attempt in the game is covered by one of the six abilities. This section explains in more detail what those abilities mean and the ways they are used in the game."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_strength",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Strength",
    "index": 11,
    "initialHeaderLevel": 3,
    "desc": "Strength measures bodily power, athletic training, and the extent to which you can exert raw physical force.\n\n## Strength Checks  \nA Strength check can model any attempt to lift, push, pull, or break something, to force your body through a space, or to otherwise apply brute force to a situation. The Athletics skill reflects aptitude in certain kinds of Strength checks.\n\n### Athletics  \nYour Strength (Athletics) check covers difficult situations you encounter while climbing, jumping, or swimming. Examples include the following activities:  - You attempt to climb a sheer or slippery cliff, avoid hazards while   scaling a wall, or cling to a surface while something is trying to   knock you off.\n- You try to jump an unusually long distance or pull off a stunt   midjump.\n- You struggle to swim or stay afloat in treacherous currents,   storm-tossed waves, or areas of thick seaweed. Or another creature   tries to push or pull you underwater or otherwise interfere with   your swimming.\n\n## Other Strength Checks  \nThe GM might also call for a Strength check when you try to accomplish tasks like the following:  - Force open a stuck, locked, or barred door - Break free of bonds - Push through a tunnel that is too small - Hang on to a wagon while being dragged behind it - Tip over a statue - Keep a boulder from rolling\n\n\n## Attack Rolls and Damage\n\nYou add your Strength modifier to your attack roll and your damage roll when attacking with a melee weapon such as a mace, a battleaxe, or a javelin. You use melee weapons to make melee attacks in hand-to-hand combat, and some of them can be thrown to make a ranged attack.\n\n## Lifting and Carrying  \nYour Strength score determines the amount of weight you can bear. The following terms define what you can lift or carry.\n\n**Carrying Capacity.** Your carrying capacity is your Strength score multiplied by 15. This is the weight (in pounds) that you can carry, which is high enough that most characters don't usually have to worry about it.\n\n**Push, Drag, or Lift.** You can push, drag, or lift a weight in pounds up to twice your carrying capacity (or 30 times your Strength score).\nWhile pushing or dragging weight in excess of your carrying capacity, your speed drops to 5 feet.\n\n**Size and Strength.** Larger creatures can bear more weight, whereas Tiny creatures can carry less. For each size category above Medium, double the creature's carrying capacity and the amount it can push, drag, or lift. For a Tiny creature, halve these weights.\n\n## Variant: Encumbrance  \nThe rules for lifting and carrying are intentionally simple. Here is a variant if you are looking for more detailed rules for determining how a character is hindered by the weight of equipment. When you use this variant, ignore the Strength column of the Armor table.\n\nIf you carry weight in excess of 5 times your Strength score, you are **encumbered**, which means your speed drops by 10 feet.\n\nIf you carry weight in excess of 10 times your Strength score, up to your maximum carrying capacity, you are instead **heavily encumbered**, which means your speed drops by 20 feet and you have disadvantage on ability checks, attack rolls, and saving throws that use Strength, Dexterity, or Constitution."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_dexterity",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Dexterity",
    "index": 12,
    "initialHeaderLevel": 3,
    "desc": "Dexterity measures agility, reflexes, and balance.\n\n## Dexterity Checks\n\nA Dexterity check can model any attempt to move nimbly, quickly, or quietly, or to keep from falling on tricky footing. The Acrobatics, Sleight of Hand, and Stealth skills reflect aptitude in certain kinds of Dexterity checks.\n\n### Acrobatics  \nYour Dexterity (Acrobatics) check covers your attempt to stay on your feet in a tricky situation, such as when you're trying to run across a sheet of ice, balance on a tightrope, or stay upright on a rocking ship's deck. The GM might also call for a Dexterity (Acrobatics) check to see if you can perform acrobatic stunts, including dives, rolls, somersaults, and flips.\n\n### Sleight of Hand  \nWhenever you attempt an act of legerdemain or manual trickery, such as planting something on someone else or concealing an object on your person, make a Dexterity (Sleight of Hand) check. The GM might also call for a Dexterity (Sleight of Hand) check to determine whether you can lift a coin purse off another person or slip something out of another person's pocket.\n\n## Stealth  \nMake a Dexterity (Stealth) check when you attempt to conceal yourself from enemies, slink past guards, slip away without being noticed, or sneak up on someone without being seen or heard.\n\n### Other Dexterity Checks  \nThe GM might call for a Dexterity check when you try to accomplish tasks like the following:  - Control a heavily laden cart on a steep descent - Steer a chariot around a tight turn - Pick a lock - Disable a trap - Securely tie up a prisoner - Wriggle free of bonds - Play a stringed instrument - Craft a small or detailed object  **Hiding**  The GM decides when circumstances are appropriate for hiding. When you try to hide, make a Dexterity (Stealth) check. Until you are discovered or you stop hiding, that check's total is contested by the Wisdom (Perception) check of any creature that actively searches for signs of your presence.\n\nYou can't hide from a creature that can see you clearly, and you give away your position if you make noise, such as shouting a warning or knocking over a vase.\n\nAn invisible creature can always try to hide. Signs of its passage might still be noticed, and it does have to stay quiet.\n\nIn combat, most creatures stay alert for signs of danger all around, so if you come out of hiding and approach a creature, it usually sees you.\nHowever, under certain circumstances, the GM might allow you to stay hidden as you approach a creature that is distracted, allowing you to gain advantage on an attack roll before you are seen.\n\n**Passive Perception.** When you hide, there's a chance someone will notice you even if they aren't searching. To determine whether such a creature notices you, the GM compares your Dexterity (Stealth) check with that creature's passive Wisdom (Perception) score, which equals 10  - the creature's Wisdom modifier, as well as any other bonuses or   penalties. If the creature has advantage, add 5. For disadvantage,   subtract 5. For example, if a 1st-level character (with a proficiency   bonus of +2) has a Wisdom of 15 (a +2 modifier) and proficiency in   Perception, he or she has a passive Wisdom (Perception) of 14.\n\n**What Can You See?** One of the main factors in determining whether you can find a hidden creature or object is how well you can see in an area, which might be **lightly** or **heavily obscured**, as explained in the-environment.\n\n## Attack Rolls and Damage\n\nYou add your Dexterity modifier to your attack roll and your damage roll when attacking with a ranged weapon, such as a sling or a longbow. You can also add your Dexterity modifier to your attack roll and your damage roll when attacking with a melee weapon that has the finesse property, such as a dagger or a rapier.\n\n## Armor Class  \nDepending on the armor you wear, you might add some or all of your Dexterity modifier to your Armor Class.\n\n## Initiative  \nAt the beginning of every combat, you roll initiative by making a Dexterity check. Initiative determines the order of creatures' turns in combat."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_constitution",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Constitution",
    "index": 13,
    "initialHeaderLevel": 3,
    "desc": "Constitution measures health, stamina, and vital force.\n\n## Constitution Checks  \nConstitution checks are uncommon, and no skills apply to Constitution checks, because the endurance this ability represents is largely passive rather than involving a specific effort on the part of a character or monster. A Constitution check can model your attempt to push beyond normal limits, however.\n\nThe GM might call for a Constitution check when you try to accomplish tasks like the following:  - Hold your breath - March or labor for hours without rest - Go without sleep - Survive without food or water - Quaff an entire stein of ale in one go  ## Hit Points  \nYour Constitution modifier contributes to your hit points. Typically, you add your Constitution modifier to each Hit Die you roll for your hit points.\n\nIf your Constitution modifier changes, your hit point maximum changes as well, as though you had the new modifier from 1st level. For example, if you raise your Constitution score when you reach 4th level and your Constitution modifier increases from +1 to +2, you adjust your hit point maximum as though the modifier had always been +2. So you add 3 hit points for your first three levels, and then roll your hit points for 4th level using your new modifier. Or if you're 7th level and some effect lowers your Constitution score so as to reduce your Constitution modifier by 1, your hit point maximum is reduced by 7."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_intelligence",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Intelligence",
    "index": 14,
    "initialHeaderLevel": 3,
    "desc": "Intelligence measures mental acuity, accuracy of recall, and the ability to reason.\n\n## Intelligence Checks  \nAn Intelligence check comes into play when you need to draw on logic, education, memory, or deductive reasoning. The Arcana, History, Investigation, Nature, and Religion skills reflect aptitude in certain kinds of Intelligence checks.\n\n### Arcana\n\nYour Intelligence (Arcana) check measures your ability to recall lore about spells, magic items, eldritch symbols, magical traditions, the planes of existence, and the inhabitants of those planes.\n\n### History\n\nYour Intelligence (History) check measures your ability to recall lore about historical events, legendary people, ancient kingdoms, past disputes, recent wars, and lost civilizations.\n\n### Investigation\n\nWhen you look around for clues and make deductions based on those clues, you make an Intelligence (Investigation) check. You might deduce the location of a hidden object, discern from the appearance of a wound what kind of weapon dealt it, or determine the weakest point in a tunnel that could cause it to collapse. Poring through ancient scrolls in search of a hidden fragment of knowledge might also call for an Intelligence (Investigation) check.\n\n### Nature\n\nYour Intelligence (Nature) check measures your ability to recall lore about terrain, plants and animals, the weather, and natural cycles.\n\n### Religion\n\nYour Intelligence (Religion) check  measures your ability to recall lore about deities, rites and prayers, religious hierarchies, holy symbols, and the practices of secret cults.\n\n### Other Intelligence Checks  \nThe GM might call for an Intelligence check when you try to accomplish tasks like the following:  - Communicate with a creature without using words - Estimate the value of a precious item - Pull together a disguise to pass as a city guard - Forge a document - Recall lore about a craft or trade - Win a game of skill\n\n## Spellcasting Ability\n\nWizards use Intelligence as their spellcasting ability, which helps determine the saving throw DCs of spells they cast."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_wisdom",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Wisdom",
    "index": 15,
    "initialHeaderLevel": 3,
    "desc": "Wisdom reflects how attuned you are to the world around you and represents perceptiveness and intuition.\n\n## Wisdom Checks\n\nA Wisdom check might reflect an effort to read body language, understand someone's feelings, notice things about the environment, or care for an injured person. The Animal Handling, Insight, Medicine, Perception, and Survival skills reflect aptitude in certain kinds of Wisdom checks.\n\n### Animal Handling\n\nWhen there is any question whether you can calm down a domesticated animal, keep a mount from getting spooked, or intuit an animal's intentions, the GM might call for a Wisdom (Animal Handling) check. You also make a Wisdom (Animal Handling) check to control your mount when you attempt a risky maneuver.\n\n### Insight\n\nYour Wisdom (Insight) check decides whether you can determine the true intentions of a creature, such as when searching out a lie or predicting someone's next move. Doing so involves gleaning clues from body language, speech habits, and changes in mannerisms.\n\n### Medicine\n\nA Wisdom (Medicine) check lets you try to stabilize a dying companion or diagnose an illness.\n\n### Perception\n\nYour Wisdom (Perception) check lets you spot, hear, or otherwise detect the presence of something. It measures your general awareness of your surroundings and the keenness of your senses. For example, you might try to hear a conversation through a closed door, eavesdrop under an open window, or hear monsters moving stealthily in the forest. Or you might try to spot things that are obscured or easy to miss, whether they are orcs lying in ambush on a road, thugs hiding in the shadows of an alley, or candlelight under a closed secret door.\n\n### Survival\n\nThe GM might ask you to make a Wisdom (Survival) check to follow tracks, hunt wild game, guide your group through frozen wastelands, identify signs that owlbears live nearby, predict the weather, or avoid quicksand and other natural hazards.\n\n### Other Wisdom Checks\n\nThe GM might call for a Wisdom check when you try to accomplish tasks like the following:  - Get a gut feeling about what course of action to follow - Discern whether a seemingly dead or living creature is undead  ## Spellcasting Ability\n\nClerics, druids, and rangers use Wisdom as their spellcasting ability, which helps determine the saving throw DCs of spells they cast."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_abilities_charisma",
  "fields": {
    "ruleset": "srd_abilities",
    "document": "srd",
    "name": "Charisma",
    "index": 16,
    "initialHeaderLevel": 3,
    "desc": "Charisma measures your ability to interact effectively with others. It includes such factors as confidence and eloquence, and it can represent a charming or commanding personality.\n\n## Charisma Checks\n\nA Charisma check might arise when you try to influence or entertain others, when you try to make an impression or tell a convincing lie, or when you are navigating a tricky social situation. The Deception, Intimidation, Performance, and Persuasion skills reflect aptitude in certain kinds of Charisma checks.\n\n### Deception\n\nYour Charisma (Deception) check determines whether you can convincingly hide the truth, either verbally or through your actions. This deception can encompass everything from misleading others through ambiguity to telling outright lies. Typical situations include trying to fast-talk a guard, con a merchant, earn money through gambling, pass yourself off in a disguise, dull someone's suspicions with false assurances, or maintain a straight face while telling a blatant lie.\n\n### Intimidation  \nWhen you attempt to influence someone through overt threats, hostile actions, and physical violence, the GM might ask you to make a Charisma (Intimidation) check. Examples include trying to pry information out of a prisoner, convincing street thugs to back down from a confrontation, or using the edge of a broken bottle to convince a sneering vizier to reconsider a decision.\n\n### Performance  \nYour Charisma (Performance) check determines how well you can delight an audience with music, dance, acting, storytelling, or some other form of entertainment.\n\n### Persuasion  \nWhen you attempt to influence someone or a group of people with tact, social graces, or good nature, the GM might ask you to make a Charisma (Persuasion) check. Typically, you use persuasion when acting in good faith, to foster friendships, make cordial requests, or exhibit proper etiquette. Examples of persuading others include convincing a chamberlain to let your party see the king, negotiating peace between warring tribes, or inspiring a crowd of townsfolk\n\n### Other Charisma Checks\n\nThe GM might call for a Charisma check when you try to accomplish tasks like the following:\n\n- Find the best person to talk to for news, rumors, and gossip\n- Blend into a crowd to get the sense of key topics of conversation\n\n\n## Spellcasting Ability\n\nBards, paladins, sorcerers, and warlocks use Charisma as their spellcasting ability, which helps determine the saving throw DCs of spells they cast."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_actions-in-combat",
  "fields": {
    "name": "Actions in Combat",
    "document": "srd",
    "desc": "When you take your action on your turn, you can take one of the actions presented here, an action you gained from your class or a special feature, or an action that you improvise. Many monsters have action options of their own in their stat blocks.\n\nWhen you describe an action not detailed elsewhere in the rules, the GM tells you whether that action is possible and what kind of roll you need to make, if any, to determine success or failure."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_actions-in-combat_attack",
  "fields": {
    "ruleset": "srd_actions-in-combat",
    "document": "srd",
    "name": "Attack",
    "index": 1,
    "initialHeaderLevel": 3,
    "desc": "The most common action to take in combat is the Attack action, whether you are swinging a sword, firing an arrow from a bow, or brawling with your fists.\n\nWith this action, you make one melee or ranged attack. See the Making an Attack section for the rules that govern attacks. Certain features, such as the Extra Attack feature of the fighter, allow you to make more than one attack with this action."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_actions-in-combat_cast-a-spell",
  "fields": {
    "ruleset": "srd_actions-in-combat",
    "document": "srd",
    "name": "Cast a Spell",
    "index": 2,
    "initialHeaderLevel": 3,
    "desc": "Spellcasters such as wizards and clerics, as well as many monsters, have access to spells and can use them to great effect in combat. Each spell has a casting time, which specifies whether the caster must use an action, a reaction, minutes, or even hours to cast the spell. Casting a spell is, therefore, not necessarily an action. Most spells do have a casting time of 1 action, so a spellcaster often uses his or her action in combat to cast such a spell."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_actions-in-combat_dash",
  "fields": {
    "ruleset": "srd_actions-in-combat",
    "document": "srd",
    "name": "Dash",
    "index": 3,
    "initialHeaderLevel": 3,
    "desc": "When you take the Dash action, you gain extra movement for the current turn. The increase equals your speed, after applying any modifiers. With a speed of 30 feet, for example, you can move up to 60 feet on your turn if you dash.\n\nAny increase or decrease to your speed changes this additional movement by the same amount. If your speed of 30 feet is reduced to 15 feet, for instance, you can move up to 30 feet this turn if you dash."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_actions-in-combat_disengage",
  "fields": {
    "ruleset": "srd_actions-in-combat",
    "document": "srd",
    "name": "Disengage",
    "index": 4,
    "initialHeaderLevel": 3,
    "desc": "If you take the Disengage action, your movement doesn't provoke opportunity attacks for the rest of the turn."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_actions-in-combat_dodge",
  "fields": {
    "ruleset": "srd_actions-in-combat",
    "document": "srd",
    "name": "Dodge",
    "index": 5,
    "initialHeaderLevel": 3,
    "desc": "When you take the Dodge action, you focus entirely on avoiding attacks. Until the start of your next turn, any attack roll made against you has disadvantage if you can see the attacker, and you make Dexterity saving throws with advantage. You lose this benefit if you are incapacitated or if your speed drops to 0."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_actions-in-combat_help",
  "fields": {
    "ruleset": "srd_actions-in-combat",
    "document": "srd",
    "name": "Help",
    "index": 6,
    "initialHeaderLevel": 3,
    "desc": "You can lend your aid to another creature in the completion of a task.\n\nWhen you take the Help action, the creature you aid gains advantage on the next ability check it makes to perform the task you are helping with, provided that it makes the check before the start of your next turn.\n\nAlternatively, you can aid a friendly creature in attacking a creature within 5 feet of you. You feint, distract the target, or in some other way team up to make your ally's attack more effective. If your ally attacks the target before your next turn, the first attack roll is made with advantage."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_actions-in-combat_hide",
  "fields": {
    "ruleset": "srd_actions-in-combat",
    "document": "srd",
    "name": "Hide",
    "index": 7,
    "initialHeaderLevel": 3,
    "desc": "When you take the Hide action, you make a Dexterity (Stealth) check in an attempt to hide, following the rules for hiding. If you succeed, you gain certain benefits, as described in srd:unseen-attackers-and-targets."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_actions-in-combat_ready",
  "fields": {
    "ruleset": "srd_actions-in-combat",
    "document": "srd",
    "name": "Ready",
    "index": 8,
    "initialHeaderLevel": 3,
    "desc": "Sometimes you want to get the jump on a foe or wait for a particular circumstance before you act. To do so, you can take the Ready action on your turn, which lets you act using your reaction before the start of your next turn.\n\nFirst, you decide what perceivable circumstance will trigger your reaction. Then, you choose the action you will take in response to that trigger, or you choose to move up to your speed in response to it. Examples include 'If the cultist steps on the trapdoor, I'll pull the lever that opens it,' and 'If the goblin steps next to me, I move away.'\n\nWhen the trigger occurs, you can either take your reaction right after the trigger finishes or ignore the trigger. Remember that you can take only one reaction per round.\n\nWhen you ready a spell, you cast it as normal but hold its energy, which you release with your reaction when the trigger occurs. To be readied, a spell must have a casting time of 1 action, and holding onto the spell's magic requires concentration. If your concentration is broken, the spell dissipates without taking effect. For example, if you are concentrating on the srd:web spell and ready srd:magic-missile, your srd:web spell ends, and if you take damage before you release srd:magic-missile with your reaction, your concentration might be broken."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_actions-in-combat_search",
  "fields": {
    "ruleset": "srd_actions-in-combat",
    "document": "srd",
    "name": "Search",
    "index": 9,
    "initialHeaderLevel": 3,
    "desc": "When you take the Search action, you devote your attention to finding something. Depending on the nature of your search, the GM might have you make a Wisdom (Perception) check or an Intelligence (Investigation) check."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_actions-in-combat_use-an-object",
  "fields": {
    "ruleset": "srd_actions-in-combat",
    "document": "srd",
    "name": "Search",
    "index": 9,
    "initialHeaderLevel": 3,
    "desc": "You normally interact with an object while doing something else, such as when you draw a sword as part of an attack. When an object requires your action for its use, you take the Use an Object action. This action is also useful when you want to interact with more than one object on your turn."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_alignment",
  "fields": {
    "name": "Alignment",
    "document": "srd",
    "desc": "A typical creature in the game world has an alignment, which broadly describes its moral and personal attitudes. Alignment is a combination of two factors: one identifies morality (good, evil, or neutral), and the other describes attitudes toward society and order (lawful, chaotic, or neutral). Thus, nine distinct alignments define the possible combinations.\n\nThese brief summaries of the nine alignments describe the typical behavior of a creature with that alignment. Individuals might vary significantly from that typical behavior, and few people are perfectly and consistently faithful to the precepts of their alignment.\n\n**Lawful good** (LG) creatures can be counted on to do the right thing as expected by society. Gold dragons, paladins, and most dwarves are lawful good.\n\n**Neutral good** (NG) folk do the best they can to help others according to their needs. Many celestials, some cloud giants, and most gnomes are neutral good.\n\n**Chaotic good** (CG) creatures act as their conscience directs, with little regard for what others expect. Copper dragons, many elves, and unicorns are chaotic good.\n\n**Lawful neutral** (LN) individuals act in accordance with law, tradition, or personal codes. Many monks and some wizards are lawful neutral.\n\n**Neutral** (N) is the alignment of those who prefer to steer clear of moral questions and don't take sides, doing what seems best at the time. Lizardfolk, most druids, and many humans are neutral.\n\n**Chaotic neutral** (CN) creatures follow their whims, holding their personal freedom above all else. Many barbarians and rogues, and some bards, are chaotic neutral.\n\n**Lawful evil** (LE) creatures methodically take what they want, within the limits of a code of tradition, loyalty, or order. Devils, blue dragons, and hobgoblins are lawful evil.\n\n**Neutral evil** (NE) is the alignment of those who do whatever they can get away with, without compassion or qualms. Many drow, some cloud giants, and goblins are neutral evil.\n\n**Chaotic evil** (CE) creatures act with arbitrary violence, spurred by their greed, hatred, or bloodlust. Demons, red dragons, and orcs are chaotic evil."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_alignment_alignment-in-the-multiverse",
  "fields": {
    "ruleset": "srd_alignment",
    "document": "srd",
    "name": "Alignment in the Multiverse",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "For many thinking creatures, alignment is a moral choice. Humans, dwarves, elves, and other humanoid races can choose whether to follow the paths of good or evil, law or chaos. According to myth, the good- aligned gods who created these races gave them free will to choose their moral paths, knowing that good without free will is slavery.\n\nThe evil deities who created other races, though, made those races to serve them. Those races have strong inborn tendencies that match the nature of their gods. Most orcs share the violent, savage nature of the orc gods, and are thus inclined toward evil. Even if an orc chooses a good alignment, it struggles against its innate tendencies for its entire life. (Even half-orcs feel the lingering pull of the orc god's influence.)\n\nAlignment is an essential part of the nature of celestials and fiends. A devil does not choose to be lawful evil, and it doesn't tend toward lawful evil, but rather it is lawful evil in its essence. If it somehow ceased to be lawful evil, it would cease to be a devil.\n\nMost creatures that lack the capacity for rational thought do not have alignments-they are **unaligned**. Such a creature is incapable of making a moral or ethical choice and acts according to its bestial nature. Sharks are savage predators, for example, but they are not evil; they have no alignment."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_attacking",
  "fields": {
    "name": "Attacking",
    "document": "srd",
    "desc": "Whether you're striking with a melee weapon, firing a weapon at range, or making an attack roll as part of a spell, an attack has a simple structure.\n\n1. **Choose a target.** Pick a target within your attack's range: a creature, an object, or a location.\n2. **Determine modifiers.** The GM determines whether the target has cover and whether you have advantage or disadvantage against the target. In addition, spells, special abilities, and other effects can apply penalties or bonuses to your attack roll.\n3. **Resolve the attack.** You make the attack roll. On a hit, you roll damage, unless the particular attack has rules that specify otherwise. Some attacks cause special effects in addition to or instead of damage.\n\n\nIf there's ever any question whether something you're doing counts as an attack, the rule is simple: if you're making an attack roll, you're making an attack."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_attacking_attack-rolls",
  "fields": {
    "ruleset": "srd_attacking",
    "document": "srd",
    "name": "Attack Rolls",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "When you make an attack, your attack roll determines whether the attack hits or misses. To make an attack roll, roll a d20 and add the appropriate modifiers. If the total of the roll plus modifiers equals or exceeds the target's Armor Class (AC), the attack hits. The AC of a character is determined at character creation, whereas the AC of a monster is in its stat block."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_attacking_attack-modifiers",
  "fields": {
    "ruleset": "srd_attacking",
    "document": "srd",
    "name": "Modifiers to the Roll",
    "index": 2,
    "initialHeaderLevel": 3,
    "desc": "When a character makes an attack roll, the two most common modifiers to the roll are an ability modifier and the character's proficiency bonus. When a monster makes an attack roll, it uses whatever modifier is provided in its stat block.\n\n**Ability Modifier.** The ability modifier used for a melee weapon attack is Strength, and the ability modifier used for a ranged weapon attack is Dexterity. Weapons that have the finesse or thrown property break this rule.\n\nSome spells also require an attack roll. The ability modifier used for a spell attack depends on the spellcasting ability of the spellcaster.\n\n**Proficiency Bonus.** You add your proficiency bonus to your attack roll when you attack using a weapon with which you have proficiency, as well as when you attack with a spell."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_attacking_rolling-1-or-20",
  "fields": {
    "ruleset": "srd_attacking",
    "document": "srd",
    "name": "Rolling 1 or 20",
    "index": 3,
    "initialHeaderLevel": 3,
    "desc": "Sometimes fate blesses or curses a combatant, causing the novice to hit and the veteran to miss.\n\n> **Sage Advice**\n\n> Spell attacks can score critical hits, just like any other attack.\n\n> \n\n> Source: [Sage Advice > Compendium](http://media.wizards.com/2015/downloads/dnd/SA_Compendium_1.01.pdf)\n\nIf the d20 roll for an attack is a 20, the attack hits regardless of any modifiers or the target's AC. This is called a critical hit.\n\nIf the d20 roll for an attack is a 1, the attack misses regardless of any modifiers or the target's AC."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_attacking_unseen-attackers-and-targets",
  "fields": {
    "ruleset": "srd_attacking",
    "document": "srd",
    "name": "Unseen Attackers and Targets",
    "index": 4,
    "initialHeaderLevel": 2,
    "desc": "Combatants often try to escape their foes' notice by hiding, casting the invisibility spell, or lurking in darkness.\n\nWhen you attack a target that you can't see, you have disadvantage on the attack roll. This is true whether you're guessing the target's location or you're targeting a creature you can hear but not see. If the target isn't in the location you targeted, you automatically miss, but the GM typically just says that the attack missed, not whether you guessed the target's location correctly.\n\nWhen a creature can't see you, you have advantage on attack rolls against it. If you are hidden---both unseen and unheard---when you make an attack, you give away your location when the attack hits or misses."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_attacking_ranged-attacks",
  "fields": {
    "ruleset": "srd_attacking",
    "document": "srd",
    "name": "Rnged Attacks",
    "index": 5,
    "initialHeaderLevel": 2,
    "desc": "When you make a ranged attack, you fire a bow or a crossbow, hurl a handaxe, or otherwise send projectiles to strike a foe at a distance. A monster might shoot spines from its tail. Many spells also involve making a ranged attack."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_attacking_range",
  "fields": {
    "ruleset": "srd_attacking",
    "document": "srd",
    "name": "Range",
    "index": 6,
    "initialHeaderLevel": 3,
    "desc": "You can make ranged attacks only against targets within a specified range. If a ranged attack, such as one made with a spell, has a single range, you can't attack a target beyond this range.\n\nSome ranged attacks, such as those made with a longbow or a shortbow, have two ranges. The smaller number is the normal range, and the larger number is the long range. Your attack roll has disadvantage when your target is beyond normal range, and you can't attack a target beyond the long range."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_attacking_ranged-attacks-in-close-combat",
  "fields": {
    "ruleset": "srd_attacking",
    "document": "srd",
    "name": "Ranged Attacks in Close Combat",
    "index": 7,
    "initialHeaderLevel": 3,
    "desc": "Aiming a ranged attack is more difficult when a foe is next to you. When you make a ranged attack with a weapon, a spell, or some other means, you have disadvantage on the attack roll if you are within 5 feet of a hostile creature who can see you and who isn't incapacitated."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_attacking_melee-attacks",
  "fields": {
    "ruleset": "srd_attacking",
    "document": "srd",
    "name": "Melee Attacks",
    "index": 8,
    "initialHeaderLevel": 2,
    "desc": "Used in hand-to-hand combat, a melee attack allows you to attack a foe within your reach. A melee attack typically uses a handheld weapon such as a sword, a warhammer, or an axe. A typical monster makes a melee attack when it strikes with its claws, horns, teeth, tentacles, or other body part. A few spells also involve making a melee attack.\n\nMost creatures have a 5-foot **reach** and can thus attack targets within 5 feet of them when making a melee attack. Certain creatures (typically those larger than Medium) have melee attacks with a greater reach than 5 feet, as noted in their descriptions.\n\nInstead of using a weapon to make a melee weapon attack, you can use an **unarmed strike**: a punch, kick, head-butt, or similar forceful blow (none of which count as weapons). On a hit, an unarmed strike deals bludgeoning damage equal to 1 + your Strength modifier. You are proficient with your unarmed strikes."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_attacking_opportunity-attacks",
  "fields": {
    "ruleset": "srd_attacking",
    "document": "srd",
    "name": "Opportunity Attacks",
    "index": 9,
    "initialHeaderLevel": 3,
    "desc": "In a fight, everyone is constantly watching for a chance to strike an enemy who is fleeing or passing by. Such a strike is called an opportunity attack.\n\nYou can make an opportunity attack when a hostile creature that you can see moves out of your reach. To make the opportunity attack, you use your reaction to make one melee attack against the provoking creature. The attack occurs right before the creature leaves your reach.\n\nYou can avoid provoking an opportunity attack by taking the Disengage action. You also don't provoke an opportunity attack when you teleport or when someone or something moves you without using your movement, action, or reaction. For example, you don't provoke an opportunity attack if an explosion hurls you out of a foe's reach or if gravity causes you to fall past an enemy."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_attacking_two-weapon-fighting",
  "fields": {
    "ruleset": "srd_attacking",
    "document": "srd",
    "name": "Two-Weapon Fighting",
    "index": 10,
    "initialHeaderLevel": 3,
    "desc": "When you take the Attack action and attack with a light melee weapon that you're holding in one hand, you can use a bonus action to attack with a different light melee weapon that you're holding in the other hand. You don't add your ability modifier to the damage of the bonus attack, unless that modifier is negative.\n\nIf either weapon has the thrown property, you can throw the weapon, instead of making a melee attack with it."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_attacking_grappling",
  "fields": {
    "ruleset": "srd_attacking",
    "document": "srd",
    "name": "Grappling",
    "index": 11,
    "initialHeaderLevel": 3,
    "desc": "When you want to grab a creature or wrestle with it, you can use the Attack action to make a special melee attack, a grapple. If you're able to make multiple attacks with the Attack action, this attack replaces one of them.\n\nThe target of your grapple must be no more than one size larger than you and must be within your reach. Using at least one free hand, you try to seize the target by making a grapple check instead of an attack roll: a Strength (Athletics) check contested by the target's Strength (Athletics) or Dexterity (Acrobatics) check (the target chooses the ability to use). If you succeed, you subject the target to the srd:grappled condition. The condition specifies the things that end it, and you can release the target whenever you like (no action required).\n\n**Escaping a Grapple.** A grappled creature can use its action to escape. To do so, it must succeed on a Strength (Athletics) or Dexterity (Acrobatics) check contested by your Strength (Athletics) check.\n\n **Moving a Grappled Creature.** When you move, you can drag or carry the grappled creature with you, but your speed is halved, unless the creature is two or more sizes smaller than you.\n\n > **Contests in Combat**\n\n > Battle often involves pitting your prowess against that of your foe. Such a challenge is represented by a contest. This section includes the most common contests that require an action in combat: grappling and shoving a creature. The GM can use these contests as models for improvising others."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_attacking_shoving",
  "fields": {
    "ruleset": "srd_attacking",
    "document": "srd",
    "name": "Shoving a Creature",
    "index": 12,
    "initialHeaderLevel": 3,
    "desc": "Using the Attack action, you can make a special melee attack to shove a creature, either to knock it srd:prone or push it away from you. If you're able to make multiple attacks with the Attack action, this attack replaces one of them.\n\nThe target must be no more than one size larger than you and must be within your reach. Instead of making an attack roll, you make a Strength (Athletics) check contested by the target's Strength (Athletics) or Dexterity (Acrobatics) check (the target chooses the ability to use). If you win the contest, you either knock the target srd:prone or push it 5 feet away from you."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_backgrounds",
  "fields": {
    "name": "Background",
    "document": "srd",
    "desc": "Every story has a beginning. Your character's background reveals where you came from, how you became an adventurer, and your place in the world. Your fighter might have been a courageous knight or a grizzled soldier. Your wizard could have been a sage or an artisan. Your rogue might have gotten by as a guild thief or commanded audiences as a jester.\n\nChoosing a background provides you with important story cues about your character's identity. The most important question to ask about your background is *what changed*? Why did you stop doing whatever your background describes and start adventuring? Where did you get the money to purchase your starting gear, or, if you come from a wealthy background, why don't you have *more* money? How did you learn the skills of your class? What sets you apart from ordinary people who share your background?\n\nThe sample backgrounds in this chapter provide both concrete benefits (features, proficiencies, and languages) and roleplaying suggestions."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_backgrounds_proficiencies",
  "fields": {
    "ruleset": "srd_backgrounds",
    "document": "srd",
    "name": "Proficiencies",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "Each background gives a character proficiency in two skills (described in “Using Ability Scores”).\n\nIn addition, most backgrounds give a character proficiency with one or more tools (detailed in “Equipment”).\n\nIf a character would gain the same proficiency from two different sources, he or she can choose a different proficiency of the same kind (skill or tool) instead."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_backgrounds_languages",
  "fields": {
    "ruleset": "srd_backgrounds",
    "document": "srd",
    "name": "Languages",
    "index": 2,
    "initialHeaderLevel": 2,
    "desc": "Some backgrounds also allow characters to learn additional languages beyond those given by race. See “Languages."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_backgrounds_equipment",
  "fields": {
    "ruleset": "srd_backgrounds",
    "document": "srd",
    "name": "Equipment",
    "index": 3,
    "initialHeaderLevel": 2,
    "desc": "Each background provides a package of starting equipment. If you use the optional rule to spend coin on gear, you do not receive the starting equipment from your background."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_backgrounds_suggested-characteristics",
  "fields": {
    "ruleset": "srd_backgrounds",
    "document": "srd",
    "name": "Suggested Characteristics",
    "index": 4,
    "initialHeaderLevel": 2,
    "desc": "A background contains suggested personal characteristics based on your background. You can pick characteristics, roll dice to determine them randomly, or use the suggestions as inspiration for characteristics of your own creation."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_backgrounds_customizing-a-background",
  "fields": {
    "ruleset": "srd_backgrounds",
    "document": "srd",
    "name": "Customizing a Background",
    "index": 5,
    "initialHeaderLevel": 2,
    "desc": "You might want to tweak some of the features of a background so it better fits your character or the campaign setting. To customize a background, you can replace one feature with any other one, choose any two skills, and choose a total of two tool proficiencies or languages from the sample backgrounds. You can either use the equipment package from your background or spend coin on gear as described in the equipment section. (If you spend coin, you can't also take the equipment package suggested for your class.) Finally, choose two personality traits, one ideal, one bond, and one flaw. If you can't find a feature that matches your desired background, work with your GM to create one."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_between-adventures",
  "fields": {
    "name": "Between Adventures",
    "document": "srd",
    "desc": "Between trips to dungeons and battles against ancient evils, adventurers need time to rest, recuperate, and prepare for their next adventure.\n\n Many adventurers also use this time to perform other tasks, such as crafting arms and armor, performing research, or spending their hard-earned gold.\n\n In some cases, the passage of time is something that occurs with little fanfare or description. When starting a new adventure, the GM might simply declare that a certain amount of time has passed and allow you to describe in general terms what your character has been doing. At other times, the GM might want to keep track of just how much time is passing as events beyond your perception stay in motion."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_between-adventures_lifestyle-expenses",
  "fields": {
    "ruleset": "srd_between-adventures",
    "document": "srd",
    "name": "Lifestyle Expenses",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "Between adventures, you choose a particular quality of life and pay the cost of maintaining that lifestyle.\n\nLiving a particular lifestyle doesn't have a huge effect on your character, but your lifestyle can affect the way other individuals and groups react to you. For example, when you lead an aristocratic lifestyle, it might be easier for you to influence the nobles of the city than if you live in poverty."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_between-adventures_downtime-activities",
  "fields": {
    "ruleset": "srd_between-adventures",
    "document": "srd",
    "name": "Downtime Activities",
    "index": 2,
    "initialHeaderLevel": 2,
    "desc": "Between adventures, the GM might ask you what your character is doing during his or her downtime. Periods of downtime can vary in duration, but each downtime activity requires a certain number of days to complete before you gain any benefit, and at least 8 hours of each day must be spent on the downtime activity for the day to count. The days do not need to be consecutive. If you have more than the minimum amount of days to spend, you can keep doing the same thing for a longer period of time, or switch to a new downtime activity.\n\n Downtime activities other than the ones presented below are possible. If you want your character to spend his or her downtime performing an activity not covered here, discuss it with your GM."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_between-adventures_crafting",
  "fields": {
    "ruleset": "srd_between-adventures",
    "document": "srd",
    "name": "Crafting",
    "index": 3,
    "initialHeaderLevel": 3,
    "desc": "You can craft nonmagical objects, including adventuring equipment and works of art. You must be proficient with tools related to the object you are trying to create (typically artisan's tools). You might also need access to special materials or locations necessary to create it.\n\nFor example, someone proficient with smith's tools needs a forge in order to craft a sword or suit of armor.\n\nFor every day of downtime you spend crafting, you can craft one or more items with a total market value not exceeding 5 gp, and you must expend raw materials worth half the total market value. If something you want to craft has a market value greater than 5 gp, you make progress every day in 5- gp increments until you reach the market value of the item.\n\nFor example, a suit of plate armor (market value 1,500 gp) takes 300 days to craft by yourself.\n\n Multiple characters can combine their efforts toward the crafting of a single item, provided that the characters all have proficiency with the requisite tools and are working together in the same place. Each character contributes 5 gp worth of effort for every day spent helping to craft the item. For example, three characters with the requisite tool proficiency and the proper facilities can craft a suit of plate armor in 100 days, at a total cost of 750 gp.\n\n While crafting, you can maintain a modest lifestyle without having to pay 1 gp per day, or a comfortable lifestyle at half the normal cost."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_between-adventures_practicing-a-profession",
  "fields": {
    "ruleset": "srd_between-adventures",
    "document": "srd",
    "name": "Practicing a Profession",
    "index": 4,
    "initialHeaderLevel": 3,
    "desc": "You can work between adventures, allowing you to maintain a modest lifestyle without having to pay 1 gp per day. This benefit lasts as long you continue to practice your profession.\n\nIf you are a member of an organization that can provide gainful employment, such as a temple or a thieves' guild, you earn enough to support a comfortable lifestyle instead.\n\nIf you have proficiency in the Performance skill and put your performance skill to use during your downtime, you earn enough to support a wealthy lifestyle instead."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_between-adventures_recuperating",
  "fields": {
    "ruleset": "srd_between-adventures",
    "document": "srd",
    "name": "Recuperating",
    "index": 5,
    "initialHeaderLevel": 3,
    "desc": "You can use downtime between adventures to recover from a debilitating injury, disease, or poison.\n\nAfter three days of downtime spent recuperating, you can make a DC 15 Constitution saving throw. On a successful save, you can choose one of the following results:\n\n- End one effect on you that prevents you from regaining hit points.\n- For the next 24 hours, gain advantage on saving throws against one disease or poison currently affecting you."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_between-adventures_researching",
  "fields": {
    "ruleset": "srd_between-adventures",
    "document": "srd",
    "name": "Researching",
    "index": 6,
    "initialHeaderLevel": 3,
    "desc": "The time between adventures is a great chance to perform research, gaining insight into mysteries that have unfurled over the course of the campaign. Research can include poring over dusty tomes and crumbling scrolls in a library or buying drinks for the locals to pry rumors and gossip from their lips.\n\nWhen you begin your research, the GM determines whether the information is available, how many days of downtime it will take to find it, and whether there are any restrictions on your research (such as needing to seek out a specific individual, tome, or location). The GM might also require you to make one or more ability checks, such as an Intelligence (Investigation) check to find clues pointing toward the information you seek, or a Charisma (Persuasion) check to secure someone's aid. Once those conditions are met, you learn the information if it is available.\n\nFor each day of research, you must spend 1 gp to cover your expenses.\n\nThis cost is in addition to your normal lifestyle expenses."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_between-adventures_training",
  "fields": {
    "ruleset": "srd_between-adventures",
    "document": "srd",
    "name": "Training",
    "index": 7,
    "initialHeaderLevel": 3,
    "desc": "You can spend time between adventures learning a new language or training with a set of tools. Your GM might allow additional training options.\n\nFirst, you must find an instructor willing to teach you. The GM determines how long it takes, and whether one or more ability checks are required.\n\nThe training lasts for 250 days and costs 1 gp per day. After you spend the requisite amount of time and money, you learn the new language or gain proficiency with the new tool."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_coins",
  "fields": {
    "name": "Coins",
    "document": "srd",
    "desc": "Common coins come in several different denominations based on the relative worth of the metal from which they are made. The three most common coins are the gold piece (gp), the silver piece (sp), and the copper piece (cp).\n\nWith one gold piece, a character can buy a bedroll, 50 feet of good rope, or a goat. A skilled (but not exceptional) artisan can earn one gold piece a day. The old piece is the standard unit of measure for wealth, even if the coin itself is not commonly used. When merchants discuss deals that involve goods or services worth hundreds or thousands of gold pieces, the transactions don't usually involve the exchange of individual coins. Rather, the gold piece is a standard measure of value, and the actual exchange is in gold bars, letters of credit, or valuable goods.\n\nOne gold piece is worth ten silver pieces, the most prevalent coin among commoners. A silver piece buys a laborer's work for half a day, a flask of lamp oil, or a night's rest in a poor inn.\n\nOne silver piece is worth ten copper pieces, which are common among laborers and beggars. A single copper piece buys a candle, a torch, or a piece of chalk.\n\nIn addition, unusual coins made of other precious metals sometimes appear in treasure hoards. The electrum piece (ep) and the platinum piece (pp) originate from fallen empires and lost kingdoms, and they sometimes arouse suspicion and skepticism when used in transactions. An electrum piece is worth five silver pieces, and a platinum piece is worth ten gold pieces.\n\nA standard coin weighs about a third of an ounce, so fifty coins weigh a pound."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_coins_exchange-rates",
  "fields": {
    "ruleset": "srd_coins",
    "document": "srd",
    "name": "Training",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "| Coin          | CP    | SP   | EP   | GP    | PP      |\n|---------------|-------|------|------|-------|---------|\n| Copper (cp)   | 1     | 1/10 | 1/50 | 1/100 | 1/1,000 |\n| Silver (sp)   | 10    | 1    | 1/5  | 1/10  | 1/100   |\n| Electrum (ep) | 50    | 5    | 1    | 1/2   | 1/20    |\n| Gold (gp)     | 100   | 10   | 2    | 1     | 1/10    |\n| Platinum (pp) | 1,000 | 100  | 20   | 10    | 1       |"
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_combat-sequence",
  "fields": {
    "name": "Combat Sequence",
    "document": "srd",
    "desc": "A typical combat encounter is a clash between two sides, a flurry of weapon swings, feints, parries, footwork, and spellcasting. The game organizes the chaos of combat into a cycle of rounds and turns. A **round** represents about 6 seconds in the game world. During a round, each participant in a battle takes a **turn**. The order of turns is determined at the beginning of a combat encounter, when everyone rolls initiative. Once everyone has taken a turn, the fight continues to the next round if neither side has defeated the other.\n\n> **Combat Step by Step** > > 1. **Determine surprise.** The GM determines whether anyone involved > in the combat encounter is surprised. > 2. **Establish positions.** The GM decides where all the characters > and monsters are located. Given the adventurers' marching order or > their stated positions in the room or other location, the GM > figures out where the adversaries are̶ how far away and in what > direction. > 3. **Roll initiative.** Everyone involved in the combat encounter > rolls initiative, determining the order of combatants' turns. > 4. **Take turns.** Each participant in the battle takes a turn in > initiative order. > 5. **Begin the next round.** When everyone involved in the combat has > had a turn, the round ends. Repeat step 4 until the fighting > stops.\n\n**Surprise**\n\nA band of adventurers sneaks up on a bandit camp springing from the trees to attack them. A gelatinous cube glides down a dungeon passage, unnoticed by the adventurers until the cube engulfs one of them. In these situations, one side of the battle gains surprise over the other.\n\nThe GM determines who might be surprised. If neither side tries to be stealthy, they automatically notice each other. Otherwise, the GM compares the Dexterity (Stealth) checks of anyone hiding with the passive Wisdom (Perception) score of each creature on the opposing side. Any character or monster that doesn't notice a threat is surprised at the start of the encounter.\n\nIf you're surprised, you can't move or take an action on your first turn of the combat, and you can't take a reaction until that turn ends. A member of a group can be surprised even if the other members aren't."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_combat-sequence_initiative",
  "fields": {
    "ruleset": "srd_combat-sequence",
    "document": "srd",
    "name": "Initiative",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "Initiative determines the order of turns during combat. When combat starts, every participant makes a Dexterity check to determine their place in the initiative order. The GM makes one roll for an entire group of identical creatures, so each member of the group acts at the same time.\n\nThe GM ranks the combatants in order from the one with the highest Dexterity check total to the one with the lowest. This is the order (called the initiative order) in which they act during each round. The initiative order remains the same from round to round.\n\nIf a tie occurs, the GM decides the order among tied GM-controlled creatures, and the players decide the order among their tied characters. The GM can decide the order if the tie is between a monster and a player character. Optionally, the GM can have the tied characters and monsters each roll a d20 to determine the order, highest roll going first."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_combat-sequence_your-turn",
  "fields": {
    "ruleset": "srd_combat-sequence",
    "document": "srd",
    "name": "Your Turn",
    "index": 2,
    "initialHeaderLevel": 2,
    "desc": "On your turn, you can **move** a distance up to your speed and **take one action**. You decide whether to move first or take your action first. Your speed---sometimes called your walking speed---is noted on your character sheet.\n\nThe most common actions you can take are described in srd:actions-in-combat. Many class features and other abilities provide additional options for your action.\n\nsrd:movement-and-position gives the rules for your move.\n\nYou can forgo moving, taking an action, or doing anything at all on your turn. If you can't decide what to do on your turn, consider taking the Dodge or Ready action, as described in srd:actions-in-combat."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_combat-sequence_bonus-actions",
  "fields": {
    "ruleset": "srd_combat-sequence",
    "document": "srd",
    "name": "Bonus Actions",
    "index": 3,
    "initialHeaderLevel": 3,
    "desc": "Various class features, spells, and other abilities let you take an additional action on your turn called a bonus action. The Cunning Action feature, for example, allows a rogue to take a bonus action. You can take a bonus action only when a special ability, spell, or other feature of the game states that you can do something as a bonus action. You otherwise don't have a bonus action to take.\n\n> **Sage Advice**\n\n> Actions and bonus actions can't be exchanged. If you have two abilities that require bonus actions to activate you can only use one, even if you take no other actions.\n\n> Source: [Sage Advice > Compendium](http://media.wizards.com/2015/downloads/dnd/SA_Compendium_1.01.pdf)\n\nYou can take only one bonus action on your turn, so you must choose which bonus action to use when you have more than one available.\n\nYou choose when to take a bonus action during your turn, unless the bonus action's timing is specified, and anything that deprives you of your ability to take actions also prevents you from taking a bonus action."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_combat-sequence_other-activities-on-your-turn",
  "fields": {
    "ruleset": "srd_combat-sequence",
    "document": "srd",
    "name": "Other Actions on Your Turn",
    "index": 4,
    "initialHeaderLevel": 3,
    "desc": "Your turn can include a variety of flourishes that require neither your action nor your move.\n\nYou can communicate however you are able, through brief utterances and gestures, as you take your turn.\n\nYou can also interact with one object or feature of the environment for free, during either your move or your action. For example, you could open a door during your move as you stride toward a foe, or you could draw your weapon as part of the same action you use to attack.\n\nIf you want to interact with a second object, you need to use your action. Some magic items and other special objects always require an action to use, as stated in their descriptions.\n\nThe GM might require you to use an action for any of these activities when it needs special care or when it presents an unusual obstacle. For instance, the GM could reasonably expect you to use an action to open a stuck door or turn a crank to lower a drawbridge."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_combat-sequence_reactions",
  "fields": {
    "ruleset": "srd_combat-sequence",
    "document": "srd",
    "name": "Reactions",
    "index": 5,
    "initialHeaderLevel": 2,
    "desc": "Certain special abilities, spells, and situations allow you to take a special action called a reaction. A reaction is an instant response to a trigger of some kind, which can occur on your turn or on someone else's. The opportunity attack <srd:opportunity-attacks> is the most common type of reaction.\n\nWhen you take a reaction, you can't take another one until the start of your next turn. If the reaction interrupts another creature's turn, that creature can continue its turn right after the reaction."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_cover",
  "fields": {
    "name": "Cover",
    "document": "srd",
    "desc": "Walls, trees, creatures, and other obstacles can provide cover during combat, making a target more difficult to harm. A target can benefit from cover only when an attack or other effect originates on the opposite side of the cover.\n\n There are three degrees of cover. If a target is behind multiple sources of cover, only the most protective degree of cover applies; the degrees aren't added together. For example, if a target is behind a creature that gives half cover and a tree trunk that gives three-quarters cover, the target has three-quarters cover.\n\nA target with **half cover** has a +2 bonus to AC and Dexterity saving throws. A target has half cover if an obstacle blocks at least half of its body. The obstacle might be a low wall, a large piece of furniture, a narrow tree trunk, or a creature, whether that creature is an enemy or a friend.\n\nA target with **three-quarters cover** has a +5 bonus to AC and Dexterity saving throws. A target has three-quarters cover if about three-quarters of it is covered by an obstacle. The obstacle might be a portcullis, an arrow slit, or a thick tree trunk.\n\n A target with **total cover** can't be targeted directly by an attack or a spell, although some spells can reach such a target by including it in an area of effect. A target has total cover if it is completely concealed by an obstacle."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_diseases",
  "fields": {
    "name": "Diseases",
    "document": "srd",
    "desc": "A plague ravages the kingdom, setting the adventurers on a quest to find a cure. An adventurer emerges from an ancient tomb, unopened for centuries, and soon finds herself suffering from a wasting illness. A warlock offends some dark power and contracts a strange affliction that spreads whenever he casts spells.\n\nA simple outbreak might amount to little more than a small drain on party resources, curable by a casting of _lesser restoration_. A more complicated outbreak can form the basis of one or more adventures as characters search for a cure, stop the spread of the disease, and deal with the consequences.\n\nA disease that does more than infect a few party members is primarily a plot device. The rules help describe the effects of the disease and how it can be cured, but the specifics of how a disease works aren't bound by a common set of rules. Diseases can affect any creature, and a given illness might or might not pass from one race or kind of creature to another. A plague might affect only constructs or undead, or sweep through a halfling neighborhood but leave other races untouched. What matters is the story you want to tell."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_diseases_sample-diseases",
  "fields": {
    "ruleset": "srd_diseases",
    "document": "srd",
    "name": "Sample Diseases",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "The diseases here illustrate the variety of ways disease can work in the game. Feel free to alter the saving throw DCs, incubation times, symptoms, and other characteristics of these diseases to suit your campaign."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_diseases_cackle-fever",
  "fields": {
    "ruleset": "srd_diseases",
    "document": "srd",
    "name": "Cackle Fever",
    "index": 2,
    "initialHeaderLevel": 3,
    "desc": "This disease targets humanoids, although gnomes are strangely immune. While in the grips of this disease, victims frequently succumb to fits of mad laughter, giving the disease its common name and its morbid nickname: “the shrieks.”\n\nSymptoms manifest 1d4 hours after infection and include fever and disorientation. The infected creature gains one level of exhaustion that can't be removed until the disease is cured.\n\nAny event that causes the infected creature great stress-including entering combat, taking damage, experiencing fear, or having a nightmare-forces the creature to make a DC 13 Constitution saving throw. On a failed save, the creature takes 5 (1d10) psychic damage and becomes incapacitated with mad laughter for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the mad laughter and the incapacitated condition on a success.\n\nAny humanoid creature that starts its turn within 10 feet of an infected creature in the throes of mad laughter must succeed on a DC 10 Constitution saving throw or also become infected with the disease. Once a creature succeeds on this save, it is immune to the mad laughter of that particular infected creature for 24 hours.\n\nAt the end of each long rest, an infected creature can make a DC 13 Constitution saving throw. On a successful save, the DC for this save and for the save to avoid an attack of mad laughter drops by 1d6. When the saving throw DC drops to 0, the creature recovers from the disease. A creature that fails three of these saving throws gains a randomly determined form of indefinite madness, as described later in this chapter."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_diseases_sewer-plague",
  "fields": {
    "ruleset": "srd_diseases",
    "document": "srd",
    "name": "Sewer Plague",
    "index": 3,
    "initialHeaderLevel": 3,
    "desc": "Sewer plague is a generic term for a broad category of illnesses that incubate in sewers, refuse heaps, and stagnant swamps, and which are sometimes transmitted by creatures that dwell in those areas, such as rats and otyughs.\n\nWhen a humanoid creature is bitten by a creature that carries the disease, or when it comes into contact with filth or offal contaminated by the disease, the creature must succeed on a DC 11 Constitution saving throw or become infected.\n\nIt takes 1d4 days for sewer plague's symptoms to manifest in an infected creature. Symptoms include fatigue and cramps. The infected creature suffers one level of exhaustion, and it regains only half the normal number of hit points from spending Hit Dice and no hit points from finishing a long rest.\n\nAt the end of each long rest, an infected creature must make a DC 11 Constitution saving throw. On a failed save, the character gains one level of exhaustion. On a successful save, the character's exhaustion level decreases by one level. If a successful saving throw reduces the infected creature's level of exhaustion below 1, the creature recovers from the disease."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_diseases_sight-rot",
  "fields": {
    "ruleset": "srd_diseases",
    "document": "srd",
    "name": "Sight Rot",
    "index": 3,
    "initialHeaderLevel": 4,
    "desc": "This painful infection causes bleeding from the eyes and eventually blinds the victim.\n\nA beast or humanoid that drinks water tainted by sight rot must succeed on a DC 15 Constitution saving throw or become infected. One day after infection, the creature's vision starts to become blurry. The creature takes a -1 penalty to attack rolls and ability checks that rely on sight. At the end of each long rest after the symptoms appear, the penalty worsens by 1. When it reaches -5, the victim is blinded until its sight is restored by magic such as _lesser restoration_ or _heal_.\n\nSight rot can be cured using a rare flower called Eyebright, which grows in some swamps. Given an hour, a character who has proficiency with an herbalism kit can turn the flower into one dose of ointment. Applied to the eyes before a long rest, one dose of it prevents the disease from worsening after that rest. After three doses, the ointment cures the disease entirely."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_environment",
  "fields": {
    "name": "Environment",
    "document": "srd",
    "desc": "By its nature, adventuring involves delving into places that are dark, dangerous, and full of mysteries to be explored. The rules in thissection cover some of the most important ways in which adventurersinteract with the environment in such places."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_environment_falling",
  "fields": {
    "ruleset": "srd_environment",
    "document": "srd",
    "name": "Falling",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "A fall from a great height is one of the most common hazards facing anadventurer. At the end of a fall, a creature takes 1d6 bludgeoningdamage for every 10 feet it fell, to a maximum of 20d6. The creaturelands prone, unless it avoids taking damage from the fall."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_environment_suffocating",
  "fields": {
    "ruleset": "srd_environment",
    "document": "srd",
    "name": "Suffocating",
    "index": 2,
    "initialHeaderLevel": 2,
    "desc": "A creature can hold its breath for a number of minutes equal to 1 + itsConstitution modifier (minimum of 30 seconds).\nWhen a creature runs out of breath or is choking, it can survive for anumber of rounds equal to its Constitution modifier (minimum of 1round). At the start of its next turn, it drops to 0 hit points and isdying, and it can't regain hit points or be stabilized until it canbreathe again.\nFor example, a creature with a Constitution of 14 can hold its breathfor 3 minutes. If it starts suffocating, it has 2 rounds to reach airbefore it drops to 0 hit points."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_environment_vision-and-light",
  "fields": {
    "ruleset": "srd_environment",
    "document": "srd",
    "name": "Vision and Light",
    "index": 3,
    "initialHeaderLevel": 2,
    "desc": "The most fundamental tasks of adventuring---noticing danger, finding hidden objects, hitting an enemy in combat, and targeting a spell, toname just a few---rely heavily on a character's ability to see. Darknessand other effects that obscure vision can prove a significant hindrance.\nA given area might be lightly or heavily obscured. In a **lightly obscured** area, such as dim light, patchy fog, or moderate foliage,creatures have disadvantage on Wisdom (Perception) checks that rely onsight.\nA **heavily obscured** area---such as darkness, opaque fog, or densefoliage---blocks vision entirely. A creature effectively suffers fromthe blinded condition when trying to see something in that area.\nThe presence or absence of light in an environment creates threecategories of illumination: bright light, dim light, and darkness.\n**Bright light** lets most creatures see normally. Even gloomy daysprovide bright light, as do torches, lanterns, fires, and other sourcesof illumination within a specific radius.\n**Dim light**, also called shadows, creates a lightly obscured area. Anarea of dim light is usually a boundary between a source of brightlight, such as a torch, and surrounding darkness. The soft light oftwilight and dawn also counts as dim light. A particularly brilliantfull moon might bathe the land in dim light.\n**Darkness** creates a heavily obscured area. Characters face darknessoutdoors at night (even most moonlit nights), within the confines of an unlit dungeon or a subterranean vault, or in an area of magical darkness."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_environment_blindsight",
  "fields": {
    "ruleset": "srd_environment",
    "document": "srd",
    "name": "Blindsight",
    "index": 4,
    "initialHeaderLevel": 3,
    "desc": "A creature with blindsight can perceive its surroundings without relyingon sight, within a specific radius. Creatures without eyes, such asoozes, and creatures with echolocation or heightened senses, such asbats and true dragons, have this sense."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_environment_darkvision",
  "fields": {
    "ruleset": "srd_environment",
    "document": "srd",
    "name": "Blindsight",
    "index": 5,
    "initialHeaderLevel": 3,
    "desc": "Many creatures in fantasy gaming worlds, especially those that dwell underground, have darkvision. Within a specified range, a creature withdarkvision can see in darkness as if the darkness were dim light, soareas of darkness are only lightly obscured as far as that creature is concerned. However, the creature can't discern color in darkness, only shades of gray."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_environment_truesight",
  "fields": {
    "ruleset": "srd_environment",
    "document": "srd",
    "name": "Truesight",
    "index": 6,
    "initialHeaderLevel": 3,
    "desc": "A creature with truesight can, out to a specific range, see in normal and magical darkness, see invisible creatures and objects,automatically detect visual illusions and succeed on saving throwsagainst them, and perceives the original form of a shapechanger or acreature that is transformed by magic. Furthermore, the creature can see into the Ethereal Plane."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_environment_food-and-water",
  "fields": {
    "ruleset": "srd_environment",
    "document": "srd",
    "name": "Food and Water",
    "index": 7,
    "initialHeaderLevel": 2,
    "desc": "Characters who don't eat or drink suffer the effects of exhaustion. Exhaustion caused by lack of food or water can't beremoved until the character eats and drinks the full required amount."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_environment_food-and-water",
  "fields": {
    "ruleset": "srd_environment",
    "document": "srd",
    "name": "Food and Water",
    "index": 8,
    "initialHeaderLevel": 2,
    "desc": "Characters who don't eat or drink suffer the effects of exhaustion. Exhaustion caused by lack of food or water can't beremoved until the character eats and drinks the full required amount.\n## Food\nA character needs one pound of food per day and can make food last longer by subsisting on half rations. Eating half a pound of food in aday counts as half a day without food.\n\nA character can go without food for a number of days equal to 3 + his orher Constitution modifier (minimum 1). At the end of each day beyondthat limit, a character automatically suffers one level of exhaustion.\n\nA normal day of eating resets the count of days without food to zero.## Water\n\nA character needs one gallon of water per day, or two gallons per day ifthe weather is hot. A character who drinks only half that much watermust succeed on a DC 15 Constitution saving throw or suffer one level of exhaustion at the end of the day. A character with access to evenless water automatically suffers one level of exhaustion at the end of the day.\n\nIf the character already has one or more levels of exhaustion, the character takes two levels in either case."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_environment_interacting-with-objects",
  "fields": {
    "ruleset": "srd_environment",
    "document": "srd",
    "name": "Interacting with Objects",
    "index": 9,
    "initialHeaderLevel": 2,
    "desc": "A character's interaction with objects in an environment is often simple to resolve in the game. The player tells the GM that his or hercharacter is doing something, such as moving a lever, and the GM describes what, if anything, happens.\nFor example, a character might decide to pull a lever, which might, inturn, raise a portcullis, cause a room to flood with water, or open asecret door in a nearby wall. If the lever is rusted in position,though, a character might need to force it. In such a situation, the GM might call for a Strength check to see whether the character can wrench the lever into place. The GM sets the DC for any such check based on the difficulty of the task.\nCharacters can also damage objects with their weapons and spells.\nObjects are immune to poison and psychic damage, but otherwise they canbe affected by physical and magical attacks much like creatures can. TheGM determines an object's Armor Class and hit points, and might decidethat certain objects have resistance or immunity to certain kinds ofattacks. (It's hard to cut a rope with a club, for example.) Objectsalways fail Strength and Dexterity saving throws, and they are immune toeffects that require other saves. When an object drops to 0 hit points,it breaks.\nA character can also attempt a Strength check to break an object. The GM sets the DC for any such check."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_equipment-packs",
  "fields": {
    "name": "Equipment Packs",
    "document": "srd",
    "desc": "The starting equipment you get from your class includes a collection of useful adventuring gear, put together in a pack. The contents of these packs are listed here.\n\nIf you are buying your starting equipment, you can purchase a pack for the price shown, which might be cheaper than buying the items individually.\n\n**Burglar's Pack (16 gp).** Includes a backpack, a bag of 1,000 ball bearings, 10 feet of string, a bell, 5 candles, a crowbar, a hammer, 10 pitons, a hooded lantern, 2 flasks of oil, 5 days rations, a tinderbox, and a waterskin. The pack also has 50 feet of hempen rope strapped to the side of it.\n\n**Diplomat's Pack (39 gp).** Includes a chest, 2 cases for maps and scrolls, a set of fine clothes, a bottle of ink, an ink pen, a lamp, 2 flasks of oil, 5 sheets of paper, a vial of perfume, sealing wax, and soap.\n\n**Dungeoneer's Pack (12 gp).** Includes a backpack, a crowbar, a hammer, 10 pitons, 10 torches, a tinderbox, 10 days of rations, and a waterskin. The pack also has 50 feet of hempen rope strapped to the side of it.\n\n**Entertainer's Pack (40 gp).** Includes a backpack, a bedroll, 2 costumes, 5 candles, 5 days of rations, a waterskin, and a disguise kit.\n\n**Explorer's Pack (10 gp).** Includes a backpack, a bedroll, a mess kit, a tinderbox, 10 torches, 10 days of rations, and a waterskin. The pack also has 50 feet of hempen rope strapped to the side of it.\n\n**Priest's Pack (19 gp).** Includes a backpack, a blanket, 10 candles, a tinderbox, an alms box, 2 blocks of incense, a censer, vestments, 2 days of rations, and a waterskin.\n\n**Scholar's Pack (40 gp).** Includes a backpack, a book of lore, a bottle of ink, an ink pen, 10 sheet of parchment, a little bag of sand, and a small knife."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_expenses",
  "fields": {
    "name": "Expenses",
    "document": "srd",
    "desc": "When not descending into the depths of the earth, exploring ruins for lost treasures, or waging war against the encroaching darkness, adventurers face more mundane realities. Even in a fantastical world, people require basic necessities such as shelter, sustenance, and clothing. These things cost money, although some lifestyles cost more than others."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_expenses_lifestyle-expenses",
  "fields": {
    "ruleset": "srd_expenses",
    "document": "srd",
    "name": "Lifestyle Expenses",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "Lifestyle expenses provide you with a simple way to account for the cost of living in a fantasy world. They cover your accommodations, food and drink, and all your other necessities. Furthermore, expenses cover the cost of maintaining your equipment so you can be ready when adventure next calls.\n\nAt the start of each week or month (your choice), choose a lifestyle from the Expenses table and pay the price to sustain that lifestyle. The prices listed are per day, so if you wish to calculate the cost of your chosen lifestyle over a thirty-day period, multiply the listed price by 30. Your lifestyle might change from one period to the next, based on the funds you have at your disposal, or you might maintain the same lifestyle throughout your character's career.\n\nYour lifestyle choice can have consequences. Maintaining a wealthy lifestyle might help you make contacts with the rich and powerful, though you run the risk of attracting thieves. Likewise, living frugally might help you avoid criminals, but you are unlikely to make powerful connections.\n\n**Lifestyle Expenses (table)**\n\n| Lifestyle    | Price/Day     |\n|--------------|---------------|\n| Wretched     | -             |\n| Squalid      | 1 sp          |\n| Poor         | 2 sp          |\n| Modest       | 1 gp          |\n| Comfortable  | 2 gp          |\n| Wealthy      | 4 gp          |\n| Aristocratic | 10 gp minimum |\n\n**_Wretched._** You live in inhumane conditions. With no place to call home, you shelter wherever you can, sneaking into barns, huddling in old crates, and relying on the good graces of people better off than you. A wretched lifestyle presents abundant dangers. Violence, disease, and hunger follow you wherever you go. Other wretched people covet your armor, weapons, and adventuring gear, which represent a fortune by their standards. You are beneath the notice of most people.\n\n**_Squalid._** You live in a leaky stable, a mud-floored hut just outside town, or a vermin-infested boarding house in the worst part of town. You have shelter from the elements, but you live in a desperate and often violent environment, in places rife with disease, hunger, and misfortune. You are beneath the notice of most people, and you have few legal protections. Most people at this lifestyle level have suffered some terrible setback. They might be disturbed, marked as exiles, or suffer from disease.\n\n**_Poor._** A poor lifestyle means going without the comforts available in a stable community. Simple food and lodgings, threadbare clothing, and unpredictable conditions result in a sufficient, though probably unpleasant, experience. Your accommodations might be a room in a flophouse or in the common room above a tavern. You benefit from some legal protections, but you still have to contend with violence, crime, and disease. People at this lifestyle level tend to be unskilled laborers, costermongers, peddlers, thieves, mercenaries, and other disreputable types.\n\n**_Modest._** A modest lifestyle keeps you out of the slums and ensures that you can maintain your equipment. You live in an older part of town, renting a room in a boarding house, inn, or temple. You don't go hungry or thirsty, and your living conditions are clean, if simple. Ordinary people living modest lifestyles include soldiers with families, laborers, students, priests, hedge wizards, and the like.\n\n**_Comfortable._** Choosing a comfortable lifestyle means that you can afford nicer clothing and can easily maintain your equipment. You live in a small cottage in a middle-class neighborhood or in a private room at a fine inn. You associate with merchants, skilled tradespeople, and military officers.\n\n**_Wealthy._** Choosing a wealthy lifestyle means living a life of luxury, though you might not have achieved the social status associated with the old money of nobility or royalty. You live a lifestyle comparable to that of a highly successful merchant, a favored servant of the royalty, or the owner of a few small businesses. You have respectable lodgings, usually a spacious home in a good part of town or a comfortable suite at a fine inn. You likely have a small staff of servants.\n\n**_Aristocratic._** You live a life of plenty and comfort. You move in circles populated by the most powerful people in the community. You have excellent lodgings, perhaps a townhouse in the nicest part of town or rooms in the finest inn. You dine at the best restaurants, retain the most skilled and fashionable tailor, and have servants attending to your every need. You receive invitations to the social gatherings of the rich and powerful, and spend evenings in the company of politicians, guild leaders, high priests, and nobility. You must also contend with the highest levels of deceit and treachery. The wealthier you are, the greater the chance you will be drawn into political intrigue as a pawn or participant."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_expenses_self-sufficiency",
  "fields": {
    "ruleset": "srd_expenses",
    "document": "srd",
    "name": "Self-Sufficiency",
    "index": 2,
    "initialHeaderLevel": 3,
    "desc": "> The expenses and lifestyles described here assume that you are spending your time between adventures in town, availing yourself of whatever services you can afford-paying for food and shelter, paying townspeople to sharpen your sword and repair your armor, and so on. Some characters, though, might prefer to spend their time away from civilization, sustaining themselves in the wild by hunting, foraging, and repairing their own gear.\n>\n> Maintaining this kind of lifestyle doesn't require you to spend any coin, but it is time-consuming. If you spend your time between adventures practicing a profession, you can eke out the equivalent of a poor lifestyle. Proficiency in the Survival skill lets you live at the equivalent of a comfortable lifestyle."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_expenses_food-drink-lodging",
  "fields": {
    "ruleset": "srd_expenses",
    "document": "srd",
    "name": "Food, Drink, and Lodging",
    "index": 3,
    "initialHeaderLevel": 3,
    "desc": "The Food, Drink, and Lodging table gives prices for individual food items and a single night's lodging. These prices are included in your total lifestyle expenses.\n\n**Food, Drink, and Lodging (table)**\n\n| Item                     | Cost  |\n|--------------------------|-------|\n| **_Ale_**                |       |\n| - Gallon                 | 2 sp  |\n| - Mug                    | 4 cp  |\n| Banquet (per person)     | 10 gp |\n| Bread, loaf              | 2 cp  |\n| Cheese, hunk             | 1 sp  |\n| **_Inn stay (per day)_** |       |\n| - Squalid                | 7 cp  |\n| - Poor                   | 1 sp  |\n| - Modest                 | 5 sp  |\n| - Comfortable            | 8 sp  |\n| - Wealthy                | 2 gp  |\n| - Aristocratic           | 4 gp  |\n| **_Meals (per day)_**    |       |\n| - Squalid                | 3 cp  |\n| - Poor                   | 6 cp  |\n| - Modest                 | 3 sp  |\n| - Comfortable            | 5 sp  |\n| - Wealthy                | 8 sp  |\n| - Aristocratic           | 2 gp  |\n| Meat, chunk              | 3 sp  |\n| **_Wine_**               |       |\n| - Common (pitcher)       | 2 sp  |\n| - Fine (bottle)          | 10 gp |"
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_expenses_services",
  "fields": {
    "ruleset": "srd_expenses",
    "document": "srd",
    "name": "Services",
    "index": 4,
    "initialHeaderLevel": 2,
    "desc": "Adventurers can pay nonplayer characters to assist them or act on their behalf in a variety of circumstances. Most such hirelings have fairly ordinary skills, while others are masters of a craft or art, and a few are experts with specialized adventuring skills.\n\nSome of the most basic types of hirelings appear on the Services table. Other common hirelings include any of the wide variety of people who inhabit a typical town or city, when the adventurers pay them to perform a specific task. For example, a wizard might pay a carpenter to construct an elaborate chest (and its miniature replica) for use in the *secret chest* spell. A fighter might commission a blacksmith to forge a special sword. A bard might pay a tailor to make exquisite clothing for an upcoming performance in front of the duke.\n\nOther hirelings provide more expert or dangerous services. Mercenary soldiers paid to help the adventurers take on a hobgoblin army are hirelings, as are sages hired to research ancient or esoteric lore. If a high-level adventurer establishes a stronghold of some kind, he or she might hire a whole staff of servants and agents to run the place, from a castellan or steward to menial laborers to keep the stables clean. These hirelings often enjoy a long-term contract that includes a place to live within the stronghold as part of the offered compensation.\n\nSkilled hirelings include anyone hired to perform a service that involves a proficiency (including weapon, tool, or skill): a mercenary, artisan, scribe, and so on. The pay shown is a minimum; some expert hirelings require more pay. Untrained hirelings are hired for menial work that requires no particular skill and can include laborers, porters, maids, and similar workers.\n\n**Services (table)**\n\n| Service Pay       | Pay           |\n|-------------------|---------------|\n| **_Coach cab_**   |               |\n| - Between towns   | 3 cp per mile |\n| - Within a city   | 1 cp          |\n| **_Hireling_**    |               |\n| - Skilled         | 2 gp per day  |\n| - Untrained       | 2 sp per day  |\n| Messenger         | 2 cp per mile |\n| Road or gate toll | 1 cp          |\n| Ship's passage    | 1 sp per mile |"
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_expenses_spellcasting-services",
  "fields": {
    "ruleset": "srd_expenses",
    "document": "srd",
    "name": "Spellcasting Services",
    "index": 5,
    "initialHeaderLevel": 2,
    "desc": "People who are able to cast spells don't fall into the category of ordinary hirelings. It might be possible to find someone willing to cast a spell in exchange for coin or favors, but it is rarely easy and no established pay rates exist. As a rule, the higher the level of the desired spell, the harder it is to find someone who can cast it and the more it costs.\n\nHiring someone to cast a relatively common spell of 1st or 2nd level, such as *cure wounds* or *identify*, is easy enough in a city or town, and might cost 10 to 50 gold pieces (plus the cost of any expensive material components). Finding someone able and willing to cast a higher-level spell might involve traveling to a large city, perhaps one with a university or prominent temple. Once found, the spellcaster might ask for a service instead of payment-the kind of service that only adventurers can provide, such as retrieving a rare item from a dangerous locale or traversing a monster-infested wilderness to deliver something important to a distant settlement."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_feats",
  "fields": {
    "name": "Feats",
    "document": "srd",
    "desc": "A feat represents a talent or an area of expertise that gives a character special capabilities. It embodies training, experience, and abilities beyond what a class provides.\n\nAt certain levels, your class gives you the Ability Score Improvement feature. Using the optional feats rule, you can forgo taking that feature to take a feat of your choice instead. You can take each feat only once, unless the feat’s description says otherwise.\n\nYou must meet any prerequisite specified in a feat to take that feat. If you ever lose a feat’s prerequisite, you can’t use that feat until you regain the prerequisite. For example, the Grappler feat requires you to have a Strength of 13 or higher. If your Strength is reduced below 13 somehow—perhaps by a withering curse—you can’t benefit from the Grappler feat until your Strength is restored."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_inspiration",
  "fields": {
    "name": "Inspiration",
    "document": "srd",
    "desc": "Inspiration is a rule the game master can use to reward you for playing your character in a way that's true to his or her personality traits, ideal, bond, and flaw. By using inspiration, you can draw on your personality trait of compassion for the downtrodden to give you an edge in negotiating with the Beggar Prince. Or inspiration can let you call on your bond to the defense of your home village to push past the effect of a spell that has been laid on you."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_inspiration_gaining-inspiration",
  "fields": {
    "ruleset": "srd_inspiration",
    "document": "srd",
    "name": "Gaining Inspiration",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "Your GM can choose to give you inspiration for a variety of reasons. Typically, GMs award it when you play out your personality traits, give in to the drawbacks presented by a flaw or bond, and otherwise portray your character in a compelling way. Your GM will tell you how you can earn inspiration in the game.\n\nYou either have inspiration or you don't - you can't stockpile multiple “inspirations” for later use."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_inspiration_using-inspiration",
  "fields": {
    "ruleset": "srd_inspiration",
    "document": "srd",
    "name": "Using Inspiration",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "If you have inspiration, you can expend it when you make an attack roll, saving throw, or ability check. Spending your inspiration gives you advantage on that roll.\n\nAdditionally, if you have inspiration, you can reward another player for good roleplaying, clever thinking, or simply doing something exciting in the game. When another player character does something that really contributes to the story in a fun and interesting way, you can give up your inspiration to give that character inspiration."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_languages",
  "fields": {
    "name": "Languages",
    "document": "srd",
    "desc": "Your race indicates the languages your character can speak by default, and your background might give you access to one or more additional languages of your choice. Note these languages on your character sheet.\n\nChoose your languages from the Standard Languages table, or choose one that is common in your campaign. With your GM's permission, you can instead choose a language from the Exotic Languages table or a secret language, such as thieves' cant or the tongue of druids.\n\nSome of these languages are actually families of languages with many dialects. For example, the Primordial language includes the Auran, Aquan, Ignan, and Terran dialects, one for each of the four elemental planes. Creatures that speak different dialects of the same language can communicate with one another.\n\n**Standard Languages (table)**\n\n| Language | Typical Speakers | Script   |\n|----------|------------------|----------|\n| Common   | Humans           | Common   |\n| Dwarvish | Dwarves          | Dwarvish |\n| Elvish   | Elves            | Elvish   |\n| Giant    | Ogres, giants    | Dwarvish |\n| Gnomish  | Gnomes           | Dwarvish |\n| Goblin   | Goblinoids       | Dwarvish |\n| Halfling | Halflings        | Common   |\n| Orc      | Orcs             | Dwarvish |\n\n**Exotic Languages (table)**\n\n| Language    | Typical Speakers    | Script    |\n|-------------|---------------------|-----------|\n| Abyssal     | Demons              | Infernal  |\n| Celestial   | Celestials          | Celestial |\n| Draconic    | Dragons, dragonborn | Draconic  |\n| Deep Speech | Aboleths, cloakers  | -         |\n| Infernal    | Devils              | Infernal  |\n| Primordial  | Elementals          | Dwarvish  |\n| Sylvan      | Fey creatures       | Elvish    |\n| Undercommon | Underworld traders  | Elvish    |"
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_leveling-up",
  "fields": {
    "name": "Leveling Up",
    "document": "srd",
    "desc": "As your character goes on adventures and overcomes challenges, he or she gains experience, represented by experience points. A character who reaches a specified experience point total advances in capability. This advancement is called **gaining a level**.\n\nWhen your character gains a level, his or her class often grants additional features, as detailed in the class description. Some of these features allow you to increase your ability scores, either increasing two scores by 1 each or increasing one score by 2. You can't increase an ability score above 20. In addition, every character's proficiency bonus increases at certain levels.\n\nEach time you gain a level, you gain 1 additional Hit Die. Roll that Hit Die, add your Constitution modifier to the roll, and add the total to your hit point maximum. Alternatively, you can use the fixed value shown in your class entry, which is the average result of the die roll (rounded up).\n\nWhen your Constitution modifier increases by 1, your hit point maximum increases by 1 for each level you have attained. For example, if your 7th-level fighter has a Constitution score of 18, when he reaches 8th level, he increases his Constitution score from 17 to 18, thus increasing his Constitution modifier from +3 to +4. His hit point maximum then increases by 8.\n\nThe Character Advancement table summarizes the XP you need to advance in levels from level 1 through level 20, and the proficiency bonus for a character of that level. Consult the information in your character's class description to see what other improvements you gain at each level.\n\n**Character Advancement (table)**\n\n| Experience Points | Level | Proficiency Bonus |\n|-------------------|-------|-------------------|\n| 0                 | 1     | +2                |\n| 300               | 2     | +2                |\n| 900               | 3     | +2                |\n| 2,700             | 4     | +2                |\n| 6,500             | 5     | +3                |\n| 14,000            | 6     | +3                |\n| 23,000            | 7     | +3                |\n| 34,000            | 8     | +3                |\n| 48,000            | 9     | +4                |\n| 64,000            | 10    | +4                |\n| 85,000            | 11    | +4                |\n| 100,000           | 12    | +4                |\n| 120,000           | 13    | +5                |\n| 140,000           | 14    | +5                |\n| 165,000           | 15    | +5                |\n| 195,000           | 16    | +5                |\n| 225,000           | 17    | +6                |\n| 265,000           | 18    | +6                |\n| 305,000           | 19    | +6                |\n| 355,000           | 20    | +6                |"
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_madness",
  "fields": {
    "name": "Madness",
    "document": "srd",
    "desc": "In a typical campaign, characters aren't driven mad by the horrors they face and the carnage they inflict day after day, but sometimes the stress of being an adventurer can be too much to bear. If your campaign has a strong horror theme, you might want to use madness as a way to reinforce that theme, emphasizing the extraordinarily horrific nature of the threats the adventurers face."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_madness_going-mad",
  "fields": {
    "ruleset": "srd_madness",
    "document": "srd",
    "name": "Going Mad",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "Various magical effects can inflict madness on an otherwise stable mind. Certain spells, such as _contact other plane_ and _symbol_, can cause insanity, and you can use the madness rules here instead of the spell effects of those spells*.* Diseases, poisons, and planar effects such as psychic wind or the howling winds of Pandemonium can all inflict madness. Some artifacts can also break the psyche of a character who uses or becomes attuned to them.\n\nResisting a madness-inducing effect usually requires a Wisdom or Charisma saving throw."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_madness_madness-effects",
  "fields": {
    "ruleset": "srd_madness",
    "document": "srd",
    "name": "Madness Effects",
    "index": 2,
    "initialHeaderLevel": 2,
    "desc": "Madness can be short-term, long-term, or indefinite. Most relatively mundane effects impose short-term madness, which lasts for just a few minutes. More horrific effects or cumulative effects can result in long-term or indefinite madness.\n\nA character afflicted with **short-term madness** is subjected to an effect from the Short-Term Madness table for 1d10 minutes.\n\nA character afflicted with **long-term madness** is subjected to an effect from the Long-Term Madness table for 1d10 × 10 hours.\n\nA character afflicted with **indefinite madness** gains a new character flaw from the Indefinite Madness table that lasts until cured.\n\n**Short-Term Madness (table)**\n| d100   | Effect (lasts 1d10 minutes)                                                                                                  |\n|--------|------------------------------------------------------------------------------------------------------------------------------|\n| 01-20  | The character retreats into his or her mind and becomes paralyzed. The effect ends if the character takes any damage.        |\n| 21-30  | The character becomes incapacitated and spends the duration screaming, laughing, or weeping.                                 |\n| 31-40  | The character becomes frightened and must use his or her action and movement each round to flee from the source of the fear. |\n| 41-50  | The character begins babbling and is incapable of normal speech or spellcasting.                                             |\n| 51-60  | The character must use his or her action each round to attack the nearest creature.                                          |\n| 61-70  | The character experiences vivid hallucinations and has disadvantage on ability checks.                                       |\n| 71-75  | The character does whatever anyone tells him or her to do that isn't obviously self- destructive.                            |\n| 76-80  | The character experiences an overpowering urge to eat something strange such as dirt, slime, or offal.                       |\n| 81-90  | The character is stunned.                                                                                                    |\n| 91-100 | The character falls unconscious.                                                                                             |\n\n**Long-Term Madness (table)**\n| d100   | Effect (lasts 1d10 × 10 hours)                                                                                                                                                                                                       |\n|--------|--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n| 01-10  | The character feels compelled to repeat a specific activity over and over, such as washing hands, touching things, praying, or counting coins.                                                                                       |\n| 11-20  | The character experiences vivid hallucinations and has disadvantage on ability checks.                                                                                                                                               |\n| 21-30  | The character suffers extreme paranoia. The character has disadvantage on Wisdom and Charisma checks.                                                                                                                                |\n| 31-40  | The character regards something (usually the source of madness) with intense revulsion, as if affected by the antipathy effect of the antipathy/sympathy spell.                                                                      |\n| 41-45  | The character experiences a powerful delusion. Choose a potion. The character imagines that he or she is under its effects.                                                                                                          |\n| 46-55  | The character becomes attached to a “lucky charm,” such as a person or an object, and has disadvantage on attack rolls, ability checks, and saving throws while more than 30 feet from it.                                           |\n| 56-65  | The character is blinded (25%) or deafened (75%).                                                                                                                                                                                    |\n| 66-75  | The character experiences uncontrollable tremors or tics, which impose disadvantage on attack rolls, ability checks, and saving throws that involve Strength or Dexterity.                                                           |\n| 76-85  | The character suffers from partial amnesia. The character knows who he or she is and retains racial traits and class features, but doesn't recognize other people or remember anything that happened before the madness took effect. |\n| 86-90  | Whenever the character takes damage, he or she must succeed on a DC 15 Wisdom saving throw or be affected as though he or she failed a saving throw against the confusion spell. The confusion effect lasts for 1 minute.            |\n| 91-95  | The character loses the ability to speak.                                                                                                                                                                                            |\n| 96-100 | The character falls unconscious. No amount of jostling or damage can wake the character.                                                                                                                                             |\n\n**Indefinite Madness (table)**\n| d100   | Flaw (lasts until cured)                                                                                                                 |\n|--------|------------------------------------------------------------------------------------------------------------------------------------------|\n| 01-15  | “Being drunk keeps me sane.”                                                                                                             |\n| 16-25  | “I keep whatever I find.”                                                                                                                |\n| 26-30  | “I try to become more like someone else I know-adopting his or her style of dress, mannerisms, and name.”                                |\n| 31-35  | “I must bend the truth, exaggerate, or outright lie to be interesting to other people.”                                                  |\n| 36-45  | “Achieving my goal is the only thing of interest to me, and I'll ignore everything else to pursue it.”                                   |\n| 46-50  | “I find it hard to care about anything that goes on around me.”                                                                          |\n| 51-55  | “I don't like the way people judge me all the time.”                                                                                     |\n| 56-70  | “I am the smartest, wisest, strongest, fastest, and most beautiful person I know.”                                                       |\n| 71-80  | “I am convinced that powerful enemies are hunting me, and their agents are everywhere I go. I am sure they're watching me all the time.” |\n| 81-85  | “There's only one person I can trust. And only I can see this special friend.”                                                           |\n| 86-95  | “I can't take anything seriously. The more serious the situation, the funnier I find it.”                                                |\n| 96-100 | “I've discovered that I really like killing people.”                                                                                     |\n## Curing Madness\n\nA _calm emotions_ spell can suppress the effects of madness, while a _lesser restoration_ spell can rid a character of a short-term or long-term madness. Depending on the source of the madness, _remove curse_ or _dispel evil_ might also prove effective. A _greater restoration_ spell or more powerful magic is required to rid a character of indefinite madness."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_magic-items",
  "fields": {
    "name": "Magic Items",
    "document": "srd",
    "desc": "Magic items are gleaned from the hoards of conquered monsters or discovered in long-lost vaults. Such items grant capabilities a character could rarely have otherwise, or they complement their owner’s capabilities in wondrous ways."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_magic-items_attunement",
  "fields": {
    "ruleset": "srd_magic-items",
    "document": "srd",
    "name": "Attunement",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "Some magic items require a creature to form a bond with them before their magical properties can be used. This bond is called attunement, and certain items have a prerequisite for it. If the prerequisite is a class, a creature must be a member of that class to attune to the item. (If the class is a spellcasting class, a monster qualifies if it has spell slots and uses that class’s spell list.) If the prerequisite is to be a spellcaster, a creature qualifies if it can cast at least one spell using its traits or features, not using a magic item or the like.\n\nWithout becoming attuned to an item that requires attunement, a creature gains only its nonmagical benefits, unless its description states otherwise. For example, a magic shield that requires attunement provides the benefits of a normal shield to a creature not attuned to it, but none of its magical properties.\n\nAttuning to an item requires a creature to spend a short rest focused on only that item while being in physical contact with it (this can’t be the same short rest used to learn the item’s properties). This focus can take the form of weapon practice (for a weapon), meditation (for a wondrous item), or some other appropriate activity. If the short rest is interrupted, the attunement attempt fails. Otherwise, at the end of the short rest, the creature gains an intuitive understanding of how to activate any magical properties of the item, including any necessary command words.\n\nAn item can be attuned to only one creature at a time, and a creature can be attuned to no more than three magic items at a time. Any attempt to attune to a fourth item fails; the creature must end its attunement to an item first. Additionally, a creature can’t attune to more than one copy of an item. For example, a creature can’t attune to more than one *ring of protection* at a time.\n\nA creature’s attunement to an item ends if the creature no longer satisfies the prerequisites for attunement, if the item has been more than 100 feet away for at least 24 hours, if the creature dies, or if another creature attunes to the item. A creature can also voluntarily end attunement by spending another short rest focused on the item, unless the item is cursed."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_magic-items_wearing-and-wielding",
  "fields": {
    "ruleset": "srd_magic-items",
    "document": "srd",
    "name": "Wearing and Wielding Items",
    "index": 2,
    "initialHeaderLevel": 2,
    "desc": "Using a magic item’s properties might mean wearing or wielding it. A magic item meant to be worn must be donned in the intended fashion: boots go on the feet, gloves on the hands, hats and helmets on the head, and rings on the finger. Magic armor must be donned, a shield strapped to the arm, a cloak fastened about the shoulders. A weapon must be held.\n\nIn most cases, a magic item that’s meant to be worn can fit a creature regardless of size or build. Many magic garments are made to be easily adjustable, or they magically adjust themselves to the wearer. Rare exceptions exist. If the story suggests a good reason for an item to fit only creatures of a certain size or shape, you can rule that it doesn’t adjust. For example, drow-made armor might fit elves only. Dwarves might make items usable only by dwarf-sized and dwarf-shaped folk.\n\nWhen a nonhumanoid tries to wear an item, use your discretion as to whether the item functions as intended. A ring placed on a tentacle might work, but a yuan-ti with a snakelike tail instead of legs can’t wear boots."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_magic-items_multiple-items-of-same-kind",
  "fields": {
    "ruleset": "srd_magic-items",
    "document": "srd",
    "name": "Multiple Items of the Same Kind",
    "index": 3,
    "initialHeaderLevel": 3,
    "desc": "Use common sense to determine whether more than one of a given kind of magic item can be worn. A character can’t normally wear more than one pair of footwear, one pair of gloves or gauntlets, one pair of bracers, one suit of armor, one item of headwear, and one cloak. You can make exceptions; a character might be able to wear a circlet under a helmet, for example, or to layer two cloaks."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_magic-items_paired-items",
  "fields": {
    "ruleset": "srd_magic-items",
    "document": "srd",
    "name": "Paired Items",
    "index": 4,
    "initialHeaderLevel": 3,
    "desc": "Items that come in pairs—such as boots, bracers, gauntlets, and gloves—impart their benefits only if both items of the pair are worn. For example, a character wearing a boot of striding and springing on one foot and a boot of elvenkind on the other foot gains no benefit from either."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_magic-items_activating-an-item",
  "fields": {
    "ruleset": "srd_magic-items",
    "document": "srd",
    "name": "Activating an Item",
    "index": 5,
    "initialHeaderLevel": 2,
    "desc": "Activating some magic items requires a user to do something special, such as holding the item and uttering a command word. The description of each item category or individual item details how an item is activated. Certain items use the following rules for their activation.\n\nIf an item requires an action to activate, that action isn’t a function of the Use an Item action, so a feature such as the rogue’s Fast Hands can’t be used to activate the item."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_magic-items_command-word",
  "fields": {
    "ruleset": "srd_magic-items",
    "document": "srd",
    "name": "Command Word",
    "index": 6,
    "initialHeaderLevel": 3,
    "desc": "A command word is a word or phrase that must be spoken for an item to work. A magic item that requires a command word can’t be activated in an area where sound is prevented, as in the area of the silence spell."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_magic-items_consumables",
  "fields": {
    "ruleset": "srd_magic-items",
    "document": "srd",
    "name": "Consumables",
    "index": 7,
    "initialHeaderLevel": 3,
    "desc": "Some items are used up when they are activated. A potion or an elixir must be swallowed, or an oil applied to the body. The writing vanishes from a scroll when it is read. Once used, a consumable item loses its magic."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_magic-items_spells",
  "fields": {
    "ruleset": "srd_magic-items",
    "document": "srd",
    "name": "Consumables",
    "index": 8,
    "initialHeaderLevel": 3,
    "desc": "Some magic items allow the user to cast a spell from the item. The spell is cast at the lowest possible spell level, doesn’t expend any of the user’s spell slots, and requires no components, unless the item’s description says otherwise. The spell uses its normal casting time, range, and duration, and the user of the item must concentrate if the spell requires concentration. Many items, such as potions, bypass the casting of a spell and confer the spell’s effects, with their usual duration. Certain items make exceptions to these rules, changing the casting time, duration, or other parts of a spell.\n\nA magic item, such as certain staffs, may require you to use your own spellcasting ability when you cast a spell from the item. If you have more than one spellcasting ability, you choose which one to use with the item. If you don’t have a spellcasting ability—perhaps you’re a rogue with the Use Magic Device feature—your spellcasting ability modifier is +0 for the item, and your proficiency bonus does apply."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_magic-items_charges",
  "fields": {
    "ruleset": "srd_magic-items",
    "document": "srd",
    "name": "Charges",
    "index": 9,
    "initialHeaderLevel": 3,
    "desc": "Some magic items have charges that must be expended to activate their properties. The number of charges an item has remaining is revealed when an identify spell is cast on it, as well as when a creature attunes to it. Additionally, when an item regains charges, the creature attuned to it learns how many charges it regained."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_magic-items_sentient-magic-items",
  "fields": {
    "ruleset": "srd_magic-items",
    "document": "srd",
    "name": "Sentient Magic Items",
    "index": 10,
    "initialHeaderLevel": 3,
    "desc": "Some magic items possess sentience and personality. Such an item might be possessed, haunted by the spirit of a previous owner, or self-aware thanks to the magic used to create it. In any case, the item behaves like a character, complete with personality quirks, ideals, bonds, and sometimes flaws. A sentient item might be a cherished ally to its wielder or a continual thorn in the side.\n\nMost sentient items are weapons. Other kinds of items can manifest sentience, but consumable items such as potions and scrolls are never sentient.\n\nSentient magic items function as NPCs under the GM’s control. Any activated property of the item is under the item’s control, not its wielder’s. As long as the wielder maintains a good relationship with the item, the wielder can access those properties normally. If the relationship is strained, the item can suppress its activated properties or even turn them against the wielder."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_magic-items_creating-sentient-magic-items",
  "fields": {
    "ruleset": "srd_magic-items",
    "document": "srd",
    "name": "Creating Sentient Magic Items",
    "index": 11,
    "initialHeaderLevel": 3,
    "desc": "When you decide to make a magic item sentient, you create the item’s persona in the same way you would create an NPC, with a few exceptions described here.\n\n## Abilities\n\nA sentient magic item has Intelligence, Wisdom, and Charisma scores. You can choose the item’s abilities or determine them randomly. To determine them randomly, roll 4d6 for each one, dropping the lowest roll and totaling the rest.\n\n## Communication\n\nA sentient item has some ability to communicate, either by sharing its emotions, broadcasting its thoughts telepathically, or speaking aloud. You can choose how it communicates or roll on the following table.\n\n| d100 | Communication |\n|--------|-----------------------|\n| 01–60 | The item communicates by transmitting emotion to the creature carrying or wielding it. |\n| 61–90 | The item can speak, read, and understand one or more languages. |\n|  91–00 | The item can speak, read, and understand one or more languages. In addition, the item can communicate telepathically with any character that carries or wields it. |\n\n## Senses\n\nWith sentience comes awareness. A sentient item can perceive its surroundings out to a limited range. You can choose its senses or roll on the following table.\n\n| d4 | Senses |\n|-----|------------|\n| 1 | Hearing and normal vision out to 30 feet. |\n| 2  | Hearing and normal vision out to 60 feet |\n| 3 | Hearing and normal vision out to 120 feet. |\n| 4 | Hearing and darkvision out to 120 feet. |\n\n## Alignment\n\nA sentient magic item has an alignment. Its creator or nature might suggest an alignment. If not, you can pick an alignment or roll on the following table.\n\n| d100 | Alignment |\n|--------|---------------|\n| 01–15 | Lawful good |\n| 16–35 | Neutral good |\n| 36–50 | Chaotic good |\n| 51–63 | Lawful neutral |\n| 64–73 | Neutral |\n| 74–85 | Chaotic neutral |\n| 86–89 | Lawful evil |\n| 90–96 | Neutral evil |\n| 97–00 | Chaotic evil |\n\n ## Special Purpose\n\nYou can give a sentient item an objective it pursues, perhaps to the exclusion of all else. As long as the wielder’s use of the item aligns with that special purpose, the item remains cooperative. Deviating from this course might cause conflict between the wielder and the item, and could even cause the item to prevent the use of its activated properties. You can pick a special purpose or roll on the following table.\n\n| d10 | Purpose |\n|-------|-------------|\n| 1 | *Aligned:* The item seeks to defeat or destroy those of a diametrically opposed alignment. (Such an item is never neutral.) |\n| 2 | *Bane:* The item seeks to defeat or destroy creatures of a particular kind, such as fiends, shapechangers, trolls, or wizards. |\n| 3 | *Protector:* The item seeks to defend a particular race or kind of creature, such as elves or druids. |\n| 4 | *Crusader:* The item seeks to defeat, weaken, or destroy the servants of a particular deity. |\n| 5 | *Templar:* The item seeks to defend the servants and interests of a particular deity. |\n| 6 | *Destroyer:* The item craves destruction and goads its user to fight arbitrarily. |\n| 7 | *Glory Seeker:* The item seeks renown as the greatest magic item in the world, by establishing its user as a famous or notorious figure. |\n| 8 | *Lore Seeker:* The item craves knowledge or is determined to solve a mystery, learn a secret, or unravel a cryptic prophecy. |\n| 9 | *Destiny Seeker:* The item is convinced that it and its wielder have key roles to play in future events. |\n| 10 | *Creator Seeker:* The item seeks its creator and wants to understand why it was created. |"
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_magic-items_conflict",
  "fields": {
    "ruleset": "srd_magic-items",
    "document": "srd",
    "name": "Conflict",
    "index": 12,
    "initialHeaderLevel": 2,
    "desc": "A sentient item has a will of its own, shaped by its personality and alignment. If its wielder acts in a manner opposed to the item’s alignment or purpose, conflict can arise. When such a conflict occurs, the item makes a Charisma check contested by the wielder’s Charisma check. If the item wins the contest, it makes one or more of the following demands:\n\n* The item insists on being carried or worn at all times.\n* The item demands that its wielder dispose of anything the item finds repugnant.\n* The item demands that its wielder pursue the item’s goals to the exclusion of all other goals.\n* The item demands to be given to someone else.\n\nIf its wielder refuses to comply with the item’s wishes, the item can do any or all of the following:\n\n* Make it impossible for its wielder to attune to it.\n* Suppress one or more of its activated properties.\n* Attempt to take control of its wielder.\n\nIf a sentient item attempts to take control of its wielder, the wielder must make a Charisma saving throw, with a DC equal to 12 + the item’s Charisma modifier. On a failed save, the wielder is charmed by the item for 1d12 hours. While charmed, the wielder must try to follow the item’s commands. If the wielder takes damage, it can repeat the saving throw, ending the effect on a success. Whether the attempt to control its user succeeds or fails, the item can’t use this power again until the next dawn."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_monsters",
  "fields": {
    "name": "Monsters",
    "document": "srd",
    "desc": "A monster’s statistics, sometimes referred to as its **stat block**, provide the essential information that you need to run the monster."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_size",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Size",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "A monster can be Tiny, Small, Medium, Large, Huge, or Gargantuan. The Size Categories table shows how much space a creature of a particular size controls in combat. See the *Player’s Handbook* for more information on creature size and space.\n\n### Size Categories\n\n| Size | Space | Examples |\n|--------|----------|---------------|\n| Tiny | 2½ by 2½ ft. | Imp, sprite |\n| Small | 5 b 5 ft. | Giant rat, goblin |\n| Medium | 5 b 5 ft. | Orc, werewolf |\n| Large | 10 b 10 ft. | Hippogriff, ogre |\n| Huge | 15 b 15 ft. | Fire giant, treant |\n| Gargantuan | 20 b 20 ft. or larger | Kraken, purple worm "
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_modifying-creatures",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Modifying Creatures",
    "index": 2,
    "initialHeaderLevel": 4,
    "desc": "Despite the versatile collection of monsters in this book, you might be at a loss when it comes to finding the perfect creature for part of an adventure. Feel free to tweak an existing creature to make it into something more useful for you, perhaps by borrowing a trait or two from a different monster or by using a variant or template, such as the ones in this book. Keep in mind that modifying a monster, including when you apply a template to it, might change its challenge rating."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_type",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Type",
    "index": 2,
    "initialHeaderLevel": 2,
    "desc": "A monster’s type speaks to its fundamental nature. Certain spells, magic items, class features, and other effects in the game interact in special ways with creatures of a particular type. For example, an *arrow of dragon slaying* deals extra damage not only to dragons but also other creatures of the dragon type, such as dragon turtles and wyverns.\n\nThe game includes the following monster types, which have no rules of their own.\n\n**Aberrations** are utterly alien beings. Many of them have innate magical abilities drawn from the creature’s alien mind rather than the mystical forces of the world. The quintessential aberrations are aboleths, beholders, mind flayers, and slaadi.\n\n**Beasts** are nonhumanoid creatures that are a natural part of the fantasy ecology. Some of them have magical powers, but most are unintelligent and lack any society or language. Beasts include all varieties of ordinary animals, dinosaurs, and giant versions of animals.\n\n**Celestials** are creatures native to the Upper Planes. Many of them are the servants of deities, employed as messengers or agents in the mortal realm and throughout the planes. Celestials are good by nature, so the exceptional celestial who strays from a good alignment is a horrifying rarity. Celestials include angels, couatls, and pegasi.\n\n**Constructs** are made, not born. Some are programmed by their creators to follow a simple set of instructions, while others are imbued with sentience and capable of independent thought. Golems are the iconic constructs. Many creatures native to the outer plane of Mechanus, such as modrons, are constructs shaped from the raw material of the plane by the will of more powerful creatures.\n\n**Dragons** are large reptilian creatures of ancient origin and tremendous power. True dragons, including the good metallic dragons and the evil chromatic dragons, are highly intelligent and have innate magic. Also in this category are creatures distantly related to true dragons, but less powerful, less intelligent, and less magical, such as wyverns and pseudodragons.\n\n**Elementals** are creatures native to the elemental planes. Some creatures of this type are little more than animate masses of their respective elements, including the creatures simply called elementals. Others have biological forms infused with elemental energy. The races of genies, including djinn and efreet, form the most important civilizations on the elemental planes. Other elemental creatures include azers and invisible stalkers.\n\n**Fey** are magical creatures closely tied to the forces of nature. They dwell in twilight groves and misty forests. In some worlds, they are closely tied to the Feywild, also called the Plane of Faerie. Some are also found in the Outer Planes, particularly the planes of Arborea and the Beastlands. Fey include dryads, pixies, and satyrs.\n\n**Fiends** are creatures of wickedness that are native to the Lower Planes. A few are the servants of deities, but many more labor under the leadership of archdevils and demon princes. Evil priests and mages sometimes summon fiends to the material world to do their bidding. If an evil celestial is a rarity, a good fiend is almost inconceivable. Fiends include demons, devils, hell hounds, rakshasas, and yugoloths.\n\n**Giants** tower over humans and their kind. They are humanlike in shape, though some have multiple heads (ettins) or deformities (fomorians). The six varieties of true giant are hill giants, stone giants, frost giants, fire giants, cloud giants, and storm giants. Besides these, creatures such as ogres and trolls are giants.\n\n**Humanoids** are the main peoples of a fantasy gaming world, both civilized and savage, including humans and a tremendous variety of other species. They have language and culture, few if any innate magical abilities (though most humanoids can learn spellcasting), and a bipedal form. The most common humanoid races are the ones most suitable as player characters: humans, dwarves, elves, and halflings. Almost as numerous but far more savage and brutal, and almost uniformly evil, are the races of goblinoids (goblins, hobgoblins, and bugbears), orcs, gnolls, lizardfolk, and kobolds.\n\n**Monstrosities** are monsters in the strictest sense—frightening creatures that are not ordinary, not truly natural, and almost never benign. Some are the results of magical experimentation gone awry (such as owlbears), and others are the product of terrible curses (including minotaurs and yuan-ti). They defy categorization, and in some sense serve as a catch-all category for creatures that don’t fit into any other type.\n\n**Oozes** are gelatinous creatures that rarely have a fixed shape. They are mostly subterranean, dwelling in caves and dungeons and feeding on refuse, carrion, or creatures unlucky enough to get in their way. Black puddings and gelatinous cubes are among the most recognizable oozes.\n\n**Plants** in this context are vegetable creatures, not ordinary flora. Most of them are ambulatory, and some are carnivorous. The quintessential plants are the shambling mound and the treant. Fungal creatures such as the gas spore and the myconid also fall into this category.\n\n**Undead** are once-living creatures brought to a horrifying state of undeath through the practice of necromantic magic or some unholy curse. Undead include walking corpses, such as vampires and zombies, as well as bodiless spirits, such as ghosts and specters."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_tags",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Tags",
    "index": 3,
    "initialHeaderLevel": 3,
    "desc": "A monster might have one or more tags appended to its type, in parentheses. For example, an orc has the *humanoid (orc)* type. The parenthetical tags provide additional categorization for certain creatures. The tags have no rules of their own, but something in the game, such as a magic item, might refer to them. For instance, a spear that is especially effective at fighting demons would work against any monster that has the demon tag."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_alignment",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Alignment",
    "index": 4,
    "initialHeaderLevel": 2,
    "desc": "A monster’s alignment provides a clue to its disposition and how it behaves in a roleplaying or combat situation. For example, a chaotic evil monster might be difficult to reason with and might attack characters on sight, whereas a neutral monster might be willing to negotiate. See the *Player’s Handbook* for descriptions of the different alignments.\n\nThe alignment specified in a monster’s stat block is the default. Feel free to depart from it and change a monster’s alignment to suit the needs of your campaign. If you want a good-aligned green dragon or an evil storm giant, there’s nothing stopping you.\n\nSome creatures can have **any alignment**. In other words, you choose the monster’s alignment. Some monster’s alignment entry indicates a tendency or aversion toward law, chaos, good, or evil. For example, a berserker can be any chaotic alignment (chaotic good, chaotic neutral, or chaotic evil), as befits its wild nature.\n\nMany creatures of low intelligence have no comprehension of law or chaos, good or evil. They don’t make moral or ethical choices, but rather act on instinct. These creatures are **unaligned**, which means they don’t have an alignment."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_armor-class",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Armor Class",
    "index": 5,
    "initialHeaderLevel": 2,
    "desc": "A monster that wears armor or carries a shield has an Armor Class (AC) that takes its armor, shield, and Dexterity into account. Otherwise, a monster’s AC is based on its Dexterity modifier and natural armor, if any. If a monster has natural armor, wears armor, or carries a shield, this is noted in parentheses after its AC value."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_hit-points",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Hit Points",
    "index": 6,
    "initialHeaderLevel": 2,
    "desc": "A monster usually dies or is destroyed when it drops to 0 hit points. For more on hit points, see the *Player’s Handbook*.\n\nA monster’s hit points are presented both as a die expression and as an average number. For example, a monster with 2d8 hit points has 9 hit points on average (2 × 4½).\n\nA monster’s size determines the die used to calculate its hit points, as shown in the Hit Dice by Size table."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_hit-dice-by-size",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Hit Dice by Size",
    "index": 7,
    "initialHeaderLevel": 2,
    "desc": "| Monster Size | Hit Die | Average HP per Die |\n|-------------------|-----------|----------------------------|\n| Tiny | d4 | 2½ |\n| Small | d6 | 3½ |\n| Medium | d8 | 4½ |\n| Large | d10 | 5½ |\n| Huge | d12 | 6½ |\n| Gargantuan | d20 | 10½ |\n\nA monster’s Constitution modifier also affects the number of hit points it has. Its Constitution modifier is multiplied by the number of Hit Dice it possesses, and the result is added to its hit points. For example, if a monster has a Constitution of 12 (+1 modifier) and 2d8 Hit Dice, it has 2d8 + 2 hit points (average 11)."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_speed",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Speed",
    "index": 8,
    "initialHeaderLevel": 2,
    "desc": "A monster’s speed tells you how far it can move on its turn. For more information on speed, see the *Player’s Handbook*.\n\nAll creatures have a walking speed, simply called the monster’s speed. Creatures that have no form of ground-based locomotion have a walking speed of 0 feet.\n\nSome creatures have one or more of the following additional movement modes.\n\n## Burrow\n\nA monster that has a burrowing speed can use that speed to move through sand, earth, mud, or ice. A monster can’t burrow through solid rock unless it has a special trait that allows it to do so.\n\n## Climb\n\nA monster that has a climbing speed can use all or part of its movement to move on vertical surfaces. The monster doesn’t need to spend extra movement to climb.\n\n## Fly\n\nA monster that has a flying speed can use all or part of its movement to fly. Some monsters have the ability to hover, which makes them hard to knock out of the air (as explained in the rules on flying in the *Player’s Handbook*). Such a monster stops hovering when it dies.\n\n## Swim\n\nA monster that has a swimming speed doesn’t need to spend extra movement to swim."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_ability-scores",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Ability Score",
    "index": 9,
    "initialHeaderLevel": 2,
    "desc": "Every monster has six ability scores (Strength, Dexterity, Constitution, Intelligence, Wisdom, and Charisma) and corresponding modifiers. For more information on ability scores and how they’re used in play, see the *Player’s Handbook*."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_saving-throws",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Saving Throws",
    "index": 10,
    "initialHeaderLevel": 2,
    "desc": "The Saving Throws entry is reserved for creatures that are adept at resisting certain kinds of effects. For example, a creature that isn’t easily charmed or frightened might gain a bonus on its Wisdom saving throws. Most creatures don’t have special saving throw bonuses, in which case this section is absent.\n\nA saving throw bonus is the sum of a monster’s relevant ability modifier and its proficiency bonus, which is determined by the monster’s challenge rating (as shown in the Proficiency Bonus by Challenge Rating table)."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_prof-bonus-by-cr",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Proficiency Bonus by Challenge Rating",
    "index": 11,
    "initialHeaderLevel": 2,
    "desc": "| Challenge | Proficiency Bonus |\n|---------------|--------------------------|\n| 0 | +2 |\n| ⅛ | +2 |\n| ¼ | +2 |\n| ½ |+2 |\n| 1 | +2 |\n| 2 | +2 |\n| 3 | +2 |\n| 4 | +2 |\n| 5 | +3 |\n| 6 | +3 |\n| 7 | +3 |\n| 8 | +3 |\n| 9 | +4 |\n| 10 | +4 |\n| 11 | +4 |\n| 12 | +4 |\n| 13 | +5 |\n| 14 | +5 |\n| 15 | +5 |\n| 16 | +5 |\n| 17 | +6 |\n| 18 | +6 |\n| 19 | +6 |\n| 20 | +6 |\n| 21 | +7 |\n| 22 | +7 |\n| 23 | +7 |\n| 24 | +7 |\n| 25 | +8 |\n| 26 | +8 |\n| 27 | +8 |\n| 28 | +8 |\n| 29 | +9 |\n| 30 | +9 |\n\n"
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_skills",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Skills",
    "index": 12,
    "initialHeaderLevel": 2,
    "desc": "The Skills entry is reserved for monsters that are proficient in one or more skills. For example, a monster that is very perceptive and stealthy might have bonuses to Wisdom (Perception) and Dexterity (Stealth) checks.\n\nA skill bonus is the sum of a monster’s relevant ability modifier and its proficiency bonus, which is determined by the monster’s challenge rating (as shown in the Proficiency Bonus by Challenge Rating table). Other modifiers might apply. For instance, a monster might have a larger-than-expected bonus (usually double its proficiency bonus) to account for its heightened expertise."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_armor-weapon-tool-proficiencies",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Armor, Weapon and Tool Proficiency",
    "index": 13,
    "initialHeaderLevel": 3,
    "desc": "Assume that a creature is proficient with its armor, weapons, and tools. If you swap them out, you decide whether the creature is proficient with its new equipment.\n\nFor example, a hill giant typically wears hide armor and wields a greatclub. You could equip a hill giant with chain mail and a greataxe instead, and assume the giant is proficient with both, one or the other, or neither.\n\nSee the *Player’s Handbook* for rules on using armor or weapons without proficiency."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_vulnerabilities-resistances-immunities",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Vulnerabilities, Resistances, and Immunities",
    "index": 14,
    "initialHeaderLevel": 2,
    "desc": "Some creatures have vulnerability, resistance, or immunity to certain types of damage. Particular creatures are even resistant or immune to damage from nonmagical attacks (a magical attack is an attack delivered by a spell, a magic item, or another magical source). In addition, some creatures are immune to certain conditions."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_senses",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Senses",
    "index": 15,
    "initialHeaderLevel": 2,
    "desc": "The Senses entry notes a monster’s passive Wisdom (Perception) score, as well as any special senses the monster might have. Special senses are described below.\n\n## Blindsight\n\nA monster with blindsight can perceive its surroundings without relying on sight, within a specific radius.\n\nCreatures without eyes, such as grimlocks and gray oozes, typically have this special sense, as do creatures with echolocation or heightened senses, such as bats and true dragons.\n\nIf a monster is naturally blind, it has a parenthetical note to this effect, indicating that the radius of its blindsight defines the maximum range of its perception.\n\n## Darkvision\n\nA monster with darkvision can see in the dark within a specific radius. The monster can see in dim light within the radius as if it were bright light, and in darkness as if it were dim light. The monster can’t discern color in darkness, only shades of gray. Many creatures that live underground have this special sense.\n\n### Tremorsense\n\nA monster with tremorsense can detect and pinpoint the origin of vibrations within a specific radius, provided that the monster and the source of the vibrations are in contact with the same ground or substance. Tremorsense can’t be used to detect flying or incorporeal creatures. Many burrowing creatures, such as ankhegs and umber hulks, have this special sense.\n\n## Truesight\n\nA monster with truesight can, out to a specific range, see in normal and magical darkness, see invisible creatures and objects, automatically detect visual illusions and succeed on saving throws against them, and perceive the original form of a shapechanger or a creature that is transformed by magic. Furthermore, the monster can see into the Ethereal Plane within the same range."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_languages",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Languages",
    "index": 16,
    "initialHeaderLevel": 2,
    "desc": "The languages that a monster can speak are listed in alphabetical order. Sometimes a monster can understand a language but can’t speak it, and this is noted in its entry. A \"—\" indicates that a creature neither speaks nor understands any language."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_telepathy",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Telepathy",
    "index": 17,
    "initialHeaderLevel": 3,
    "desc": "Telepathy is a magical ability that allows a monster to communicate mentally with another creature within a specified range. The contacted creature doesn’t need to share a language with the monster to communicate in this way with it, but it must be able to understand at least one language. A creature without telepathy can receive and respond to telepathic messages but can’t initiate or terminate a telepathic conversation.\n\nA telepathic monster doesn’t need to see a contacted creature and can end the telepathic contact at any time. The contact is broken as soon as the two creatures are no longer within range of each other or if the telepathic monster contacts a different creature within range. A telepathic monster can initiate or terminate a telepathic conversation without using an action, but while the monster is incapacitated, it can’t initiate telepathic contact, and any current contact is terminated.\n\nA creature within the area of an *antimagic field* or in any other location where magic doesn’t function can’t send or receive telepathic messages."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_challenge",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Challenge",
    "index": 18,
    "initialHeaderLevel": 2,
    "desc": "A monster’s **challenge rating** tells you how great a threat the monster is. An appropriately equipped and well-rested party of four adventurers should be able to defeat a monster that has a challenge rating equal to its level without suffering any deaths. For example, a party of four 3rd-level characters should find a monster with a challenge rating of 3 to be a worthy challenge, but not a deadly one.\n\nMonsters that are significantly weaker than 1st-level characters have a challenge rating lower than 1. Monsters with a challenge rating of 0 are insignificant except in large numbers; those with no effective attacks are worth no experience points, while those that have attacks are worth 10 XP each.\n\nSome monsters present a greater challenge than even a typical 20th-level party can handle. These monsters have a challenge rating of 21 or higher and are specifically designed to test player skill."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_experience-points",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Experience Points",
    "index": 19,
    "initialHeaderLevel": 3,
    "desc": "The number of experience points (XP) a monster is worth is based on its challenge rating. Typically, XP is awarded for defeating the monster, although the GM may also award XP for neutralizing the threat posed by the monster in some other manner.\n\nUnless something tells you otherwise, a monster summoned by a spell or other magical ability is worth the XP noted in its stat block."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_experience-points-by-cr",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Experience Points by Challenge Rating",
    "index": 20,
    "initialHeaderLevel": 4,
    "desc": "| Challenge | XP |\n|---------------|------|\n| 0 | 0 or 10 |\n| ⅛ | 25 |\n| ¼ | 50 |\n| ½ |100 |\n| 1 | 200 |\n| 2 | 450 |\n| 3 | 700 |\n| 4 | 1,100 |\n| 5 | 1,800 |\n| 6 | 2,300 |\n| 7 | 2,900 |\n| 8 | 3,900 |\n| 9 | 5,000 |\n| 10 | 5,900 |\n| 11 | 7,200 |\n| 12 | 8,400 |\n| 13 | 10,000 |\n| 14 | 11,500 |\n| 15 | 13,000 |\n| 16 | 15,000 |\n| 17 | 18,000 |\n| 18 | 20,000 |\n| 19 | 22,000 |\n| 20 | 25,000 |\n| 21 | 33,000 |\n| 22 | 41,000 |\n| 23 | 50,000 |\n| 24 | 62,000 |\n| 25 | 75,000 |\n| 26 | 90,000 |\n| 27 | 105,000 |\n| 28 | 120,000 |\n| 29 | 135,000 |\n| 30 | 155,000 |"
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_special-traits",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Special Traits",
    "index": 21,
    "initialHeaderLevel": 2,
    "desc": "Special traits (which appear after a monster’s challenge rating but before any actions or reactions) are characteristics that are likely to be relevant in a combat encounter and that require some explanation."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_innate-spellcasting",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Innate Spellcasting",
    "index": 22,
    "initialHeaderLevel": 3,
    "desc": "A monster with the innate ability to cast spells has the Innate Spellcasting special trait. Unless noted otherwise, an innate spell of 1st level or higher is always cast at its lowest possible level and can’t be cast at a higher level. If a monster has a cantrip where its level matters and no level is given, use the monster’s challenge rating.\n\nAn innate spell can have special rules or restrictions. For example, a drow mage can innately cast the *levitate* spell, but the spell has a “self only” restriction, which means that the spell affects only the drow mage.\n\nA monster’s innate spells can’t be swapped out with other spells. If a monster’s innate spells don’t require attack rolls, no attack bonus is given for them."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_spellcasting",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Spellcasting",
    "index": 23,
    "initialHeaderLevel": 3,
    "desc": "A monster with the Spellcasting special trait has a spellcaster level and spell slots, which it uses to cast its spells of 1st level and higher (as explained in the *Player’s Handbook*). The spellcaster level is also used for any cantrips included in the feature.\n\nThe monster has a list of spells known or prepared from a specific class. The list might also include spells from a feature in that class, such as the Divine Domain feature of the cleric or the Druid Circle feature of the druid. The monster is considered a member of that class when attuning to or using a magic item that requires membership in the class or access to its spell list.\n\nA monster can cast a spell from its list at a higher level if it has the spell slot to do so. For example, a drow mage with the 3rd-level *lightning bolt* spell can cast it as a 5th-level spell by using one of its 5th-level spell slots.\n\nYou can change the spells that a monster knows or has prepared, replacing any spell on its spell list with a spell of the same level and from the same class list. If you do so, you might cause the monster to be a greater or lesser threat than suggested by its challenge rating."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_psionics",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Psionics",
    "index": 24,
    "initialHeaderLevel": 3,
    "desc": "A monster that casts spells using only the power of its mind has the psionics tag added to its Spellcasting or Innate Spellcasting special trait. This tag carries no special rules of its own, but other parts of the game might refer to it. A monster that has this tag typically doesn’t require any components to cast its spells."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_actions",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Actions",
    "index": 25,
    "initialHeaderLevel": 2,
    "desc": "When a monster takes its action, it can choose from the options in the Actions section of its stat block or use one of the actions available to all creatures, such as the Dash or Hide action, as described in the *Player’s Handbook*."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_melee-and-ranged-attacks",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Melee and Ranged Attacks",
    "index": 26,
    "initialHeaderLevel": 3,
    "desc": "The most common actions that a monster will take in combat are melee and ranged attacks. These can be spell attacks or weapon attacks, where the “weapon” might be a manufactured item or a natural weapon, such as a claw or tail spike. For more information on different kinds of attacks, see the *Player’s Handbook*.\n\n***Creature vs. Target.*** The target of a melee or ranged attack is usually either one creature or one target, the difference being that a “target” can be a creature or an object.\n\n***Hit.*** Any damage dealt or other effects that occur as a result of an attack hitting a target are described after the \"*Hit*\" notation. You have the option of taking average damage or rolling the damage; for this reason, both the average damage and the die expression are presented.\n\n***Miss.*** If an attack has an effect that occurs on a miss, that information is presented after the \"*Miss:*\" notation."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_multiattack",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Multiattack",
    "index": 27,
    "initialHeaderLevel": 3,
    "desc": "A creature that can make multiple attacks on its turn has the Multiattack action. A creature can’t use Multiattack when making an opportunity attack, which must be a single melee attack."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_ammunition",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Ammunition",
    "index": 28,
    "initialHeaderLevel": 3,
    "desc": "A monster carries enough ammunition to make its ranged attacks. You can assume that a monster has 2d4 pieces of ammunition for a thrown weapon attack, and 2d10 pieces of ammunition for a projectile weapon such as a bow or crossbow."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_reactions",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Ammunition",
    "index": 29,
    "initialHeaderLevel": 2,
    "desc": "If a monster can do something special with its reaction, that information is contained here. If a creature has no special reaction, this section is absent."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_limited-usage",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Limited Usage",
    "index": 30,
    "initialHeaderLevel": 2,
    "desc": "Some special abilities have restrictions on the number of times they can be used.\n\n***X/Day.*** The notation \"X/Day\" means a special ability can be used X number of times and that a monster must finish a long rest to regain expended uses. For example, \"1/Day\" means a special ability can be used once and that the monster must finish a long rest to use it again.\n\n***Recharge X–Y.*** The notation \"Recharge X–Y\" means a monster can use a special ability once and that the ability then has a random chance of recharging during each subsequent round of combat. At the start of each of the monster’s turns, roll a d6. If the roll is one of the numbers in the recharge notation, the monster regains the use of the special ability. The ability also recharges when the monster finishes a short or long rest.\n\nFor example, \"Recharge 5–6\" means a monster can use the special ability once. Then, at the start of the monster’s turn, it regains the use of that ability if it rolls a 5 or 6 on a d6.\n\n***Recharge after a Short or Long Rest.*** This notation means that a monster can use a special ability once and then must finish a short or long rest to use it again."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_grapple-rules",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Grapple Rules for Monsters",
    "index": 31,
    "initialHeaderLevel": 3,
    "desc": "Many monsters have special attacks that allow them to quickly grapple prey. When a monster hits with such an attack, it doesn’t need to make an additional ability check to determine whether the grapple succeeds, unless the attack says otherwise.\n\nA creature grappled by the monster can use its action to try to escape. To do so, it must succeed on a Strength (Athletics) or Dexterity (Acrobatics) check against the escape DC in the monster’s stat block. If no escape DC is given, assume the DC is 10 + the monster’s Strength (Athletics) modifier."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_equipment",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Equipment",
    "index": 32,
    "initialHeaderLevel": 3,
    "desc": "A stat block rarely refers to equipment, other than armor or weapons used by a monster. A creature that customarily wears clothes, such as a humanoid, is assumed to be dressed appropriately.\n\nYou can equip monsters with additional gear and trinkets however you like, and you decide how much of a monster’s equipment is recoverable after the creature is slain and whether any of that equipment is still usable. A battered suit of armor made for a monster is rarely usable by someone else, for instance.\n\nIf a spellcasting monster needs material components to cast its spells, assume that it has the material components it needs to cast the spells in its stat block."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_legendary-creatures",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Legendary Creature",
    "index": 33,
    "initialHeaderLevel": 2,
    "desc": "A legendary creature can do things that ordinary creatures can’t. It can take special actions outside its turn, and it might exert magical influence for miles around.\n\nIf a creature assumes the form of a legendary creature, such as through a spell, it doesn’t gain that form’s legendary actions, lair actions, or regional effects."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_legendary-actions",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Legendary Actions",
    "index": 34,
    "initialHeaderLevel": 3,
    "desc": "A legendary creature can take a certain number of special actions—called legendary actions—outside its turn. Only one legendary action option can be used at a time and only at the end of another creature’s turn. A creature regains its spent legendary actions at the start of its turn. It can forgo using them, and it can’t use them while incapacitated or otherwise unable to take actions. If surprised, it can’t use them until after its first turn in the combat."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_legendary-creatures-lair",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Legendary Creature’s Lair",
    "index": 35,
    "initialHeaderLevel": 3,
    "desc": "A legendary creature might have a section describing its lair and the special effects it can create while there, either by act of will or simply by being present. Such a section applies only to a legendary creature that spends a great deal of time in its lair."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_lair-actions",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Lair Actions",
    "index": 36,
    "initialHeaderLevel": 3,
    "desc": "If a legendary creature has lair actions, it can use them to harness the ambient magic in its lair. On initiative count 20 (losing all initiative ties), it can use one of its lair action options. It can’t do so while incapacitated or otherwise unable to take actions. If surprised, it can’t use one until after its first turn in the combat."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_monsters_regional-effects",
  "fields": {
    "ruleset": "srd_monsters",
    "document": "srd",
    "name": "Regional Effects",
    "index": 37,
    "initialHeaderLevel": 3,
    "desc": "The mere presence of a legendary creature can have strange and wondrous effects on its environment, as noted in this section. Regional effects end abruptly or dissipate over time when the legendary creature dies."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_mounted-combat",
  "fields": {
    "name": "Mounted Combat",
    "document": "srd",
    "desc": "A knight charging into battle on a warhorse, a wizard casting spells from the back of a griffon, or a cleric soaring through the sky on a pegasus all enjoy the benefits of speed and mobility that a mount can provide.\n\nA willing creature that is at least one size larger than you and that has an appropriate anatomy can serve as a mount, using the following rules."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_mounted-combat_mounting-and-dismounting",
  "fields": {
    "ruleset": "srd_mounted-combat",
    "document": "srd",
    "name": "Mounting and Dismounting",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "Once during your move, you can mount a creature that is within 5 feet of you or dismount. Doing so costs an amount of movement equal to half your speed. For example, if your speed is 30 feet, you must spend 15 feet of movement to mount a horse. Therefore, you can't mount it if you don't have 15 feet of movement left or if your speed is 0.\n\nIf an effect moves your mount against its will while you're on it, you must succeed on a DC 10 Dexterity saving throw or fall off the mount, landing srd:prone in a space within 5 feet of it. If you're knocked srd:prone while mounted, you must make the same saving throw.\n\nIf your mount is knocked srd:prone, you can use your reaction to dismount it as it falls and land on your feet. Otherwise, you are dismounted and fall srd:prone in a space within 5 feet it."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_mounted-combat_controlling-a-mount",
  "fields": {
    "ruleset": "srd_mounted-combat",
    "document": "srd",
    "name": "Controlling a Mount",
    "index": 2,
    "initialHeaderLevel": 2,
    "desc": "While you're mounted, you have two options. You can either control the mount or allow it to act independently. Intelligent creatures, such as dragons, act independently.\n\nYou can control a mount only if it has been trained to accept a rider. Domesticated horses, donkeys, and similar creatures are assumed to have such training. The initiative of a controlled mount changes to match yours when you mount it. It moves as you direct it, and it has only three action options: Dash, Disengage, and Dodge. A controlled mount can move and act even on the turn that you mount it.\n\nAn independent mount retains its place in the initiative order. Bearing a rider puts no restrictions on the actions the mount can take, and it moves and acts as it wishes. It might flee from combat, rush to attack and devour a badly injured foe, or otherwise act against your wishes.\n\nIn either case, if the mount provokes an opportunity attack while you're on it, the attacker can target you or the mount."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_mounts-and-vehicles",
  "fields": {
    "name": "Mounts and Vehicles",
    "document": "srd",
    "desc": "A good mount can help you move more quickly through the wilderness, but its primary purpose is to carry the gear that would otherwise slow you down. The Mounts and Other Animals table shows each animal's speed and base carrying capacity.\n\nAn animal pulling a carriage, cart, chariot, sled, or wagon can move weight up to five times its base carrying capacity, including the weight of the vehicle. If multiple animals pull the same vehicle, they can add their carrying capacity together.\n\nMounts other than those listed here are available in fantasy gaming worlds, but they are rare and not normally available for purchase. These include flying mounts (pegasi, griffons, hippogriffs, and similar animals) and even aquatic mounts (giant sea horses, for example). Acquiring such a mount often means securing an egg and raising the creature yourself, making a bargain with a powerful entity, or negotiating with the mount itself.\n\n**_Barding._** Barding is armor designed to protect an animal's head, neck, chest, and body. Any type of armor shown on the Armor table can be purchased as barding. The cost is four times the equivalent armor made for humanoids, and it weighs twice as much.\n\n**_Saddles._** A military saddle braces the rider, helping you keep your seat on an active mount in battle. It gives you advantage on any check you make to remain mounted. An exotic saddle is required for riding any aquatic or flying mount.\n\n**_Vehicle Proficiency._** If you have proficiency with a certain kind of vehicle (land or water), you can add your proficiency bonus to any check you make to control that kind of vehicle in difficult circumstances.\n\n**_Rowed Vessels._** Keelboats and rowboats are used on lakes and rivers. If going downstream, add the speed of the current (typically 3 miles per hour) to the speed of the vehicle. These vehicles can't be rowed against any significant current, but they can be pulled upstream by draft animals on the shores. A rowboat weighs 100 pounds, in case adventurers carry it over land."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_mounts-and-vehicles_mounts",
  "fields": {
    "ruleset": "srd_mounts-and-vehicles",
    "document": "srd",
    "name": "Mounts and Other Animals",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "| Item           | Cost   | Speed  | Carrying Capacity |\n|----------------|--------|--------|-------------------|\n| Camel          | 50 gp  | 50 ft. | 480 lb.           |\n| Donkey or mule | 8 gp   | 40 ft. | 420 lb.           |\n| Elephant       | 200 gp | 40 ft. | 1,320 lb.         |\n| Horse, draft   | 50 gp  | 40 ft. | 540 lb.           |\n| Horse, riding  | 75 gp  | 60 ft. | 480 lb.           |\n| Mastiff        | 25 gp  | 40 ft. | 195 lb.           |\n| Pony           | 30 gp  | 40 ft. | 225 lb.           |\n| Warhorse       | 400 gp | 60 ft. | 540 lb.           |"
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_mounts-and-vehicles_tack-harness-drawn-vehicles",
  "fields": {
    "ruleset": "srd_mounts-and-vehicles",
    "document": "srd",
    "name": "Tack, Harness, and Drawn Vehicles",
    "index": 2,
    "initialHeaderLevel": 2,
    "desc": "| Item               | Cost   | Weight  |\n|--------------------|--------|---------|\n| Barding            | ×4     | ×2      |\n| Bit and bridle     | 2 gp   | 1 lb.   |\n| Carriage           | 100 gp | 600 lb. |\n| Cart               | 15 gp  | 200 lb. |\n| Chariot            | 250 gp | 100 lb. |\n| Feed (per day)     | 5 cp   | 10 lb.  |\n| **_Saddle_**       |        |         |\n| - Exotic           | 60 gp  | 40 lb.  |\n| - Military         | 20 gp  | 30 lb.  |\n| - Pack             | 5 gp   | 15 lb.  |\n| - Riding           | 10 gp  | 25 lb.  |\n| Saddlebags         | 4 gp   | 8 lb.   |\n| Sled               | 20 gp  | 300 lb. |\n| Stabling (per day) | 5 sp   | -       |\n| Wagon              | 35 gp  | 400 lb. |"
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_mounts-and-vehicles_waterborne-vehicles",
  "fields": {
    "ruleset": "srd_mounts-and-vehicles",
    "document": "srd",
    "name": "Waterborne Vehicles",
    "index": 3,
    "initialHeaderLevel": 2,
    "desc": "| Item         | Cost      | Speed  |\n|--------------|-----------|--------|\n| Galley       | 30,000 gp | 4 mph  |\n| Keelboat     | 3,000 gp  | 1 mph  |\n| Longship     | 10,000 gp | 3 mph  |\n| Rowboat      | 50 gp     | 1½ mph |\n| Sailing ship | 10,000 gp | 2 mph  |\n| Warship      | 25,000 gp | 2½ mph |"
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_movement",
  "fields": {
    "name": "Movement",
    "document": "srd",
    "desc": "Swimming across a rushing river, sneaking down a dungeon corridor, scaling a treacherous mountain slope---all sorts of movement play a keyrole in fantasy gaming adventures.\n\nThe GM can summarize the adventurers' movement without calculating exactdistances or travel times: You travel through the forest and find thedungeon entrance late in the evening of the third day. Even in adungeon, particularly a large dungeon or a cave network, the GM cansummarize movement between encounters: After killing the guardian at the entrance to the ancient dwarven stronghold, you consult your map,which leads you through miles of echoing corridors to a chasm bridged bya narrow stone arch. Sometimes it's important, though, to know how long it takes to get fromone spot to another, whether the answer is in days, hours, or minutes.\n\nThe rules for determining travel time depend on two factors: the speedand travel pace of the creatures moving and the terrain they're movingover."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_movement_speed",
  "fields": {
    "ruleset": "srd_movement",
    "document": "srd",
    "name": "Speed",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "Every character and monster has a speed, which is the distance in feetthat the character or monster can walk in 1 round. This number assumesshort bursts of energetic movement in the midst of a life-threatening situation."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_movement_speed",
  "fields": {
    "ruleset": "srd_movement",
    "document": "srd",
    "name": "Speed",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "Every character and monster has a speed, which is the distance in feetthat the character or monster can walk in 1 round. This number assumesshort bursts of energetic movement in the midst of a life-threatening situation.\n\nThe following rules determine how far a character or monster can move in a minute, an hour, or a day."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_movement_travel-pace",
  "fields": {
    "ruleset": "srd_movement",
    "document": "srd",
    "name": "Travel Pace",
    "index": 2,
    "initialHeaderLevel": 3,
    "desc": "While traveling, a group of adventurers can move at a normal, fast, orslow pace, as shown on the Travel Pace table. The table states how farthe party can move in a period of time and whether the pace has anyeffect. A fast pace makes characters less perceptive, while a slow pacemakes it possible to sneak around and to search an area more carefully.\n\n**Forced March.** The Travel Pace table assumes that characters travelfor 8 hours in day. They can push on beyond that limit, at the risk of exhaustion.\n\nFor each additional hour of travel beyond 8 hours, the characters coverthe distance shown in the Hour column for their pace, and each charactermust make a Constitution saving throw at the end of the hour. The DC is 10 + 1 for each hour past 8 hours. On a failed saving throw, a charactersuffers one level of exhaustion.\n\n**Mounts and Vehicles.** For short spans of time (up to an hour), many animals move much faster than humanoids. A mounted character can ride at a gallop for about an hour, covering twice the usual distance for a fastpace. If fresh mounts are available every 8 to 10 miles, characters cancover larger distances at this pace, but this is very rare except indensely populated areas.\nCharacters in wagons, carriages, or other land vehicles choose a pace asnormal. Characters in a waterborne vessel are limited to the speed ofthe vessel, and they don't suffer penalties for a fast pace or gainbenefits from a slow pace. Depending on the vessel and the size of thecrew, ships might be able to travel for up to 24 hours per day.\nCertain special mounts, such as a pegasus or griffon, or specialvehicles, such as a carpet of flying, allow you to travel more swiftly."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_movement_difficult-terrain",
  "fields": {
    "ruleset": "srd_movement",
    "document": "srd",
    "name": "Difficult Terrain",
    "index": 3,
    "initialHeaderLevel": 3,
    "desc": "The travel speeds given in the Travel Pace table assume relativelysimple terrain: roads, open plains, or clear dungeon corridors. But adventurers often face dense forests, deep swamps, rubble-filled ruins, steep mountains, and ice-covered ground---all considered difficult terrain.\n\nYou move at half speed in difficult terrain---moving 1 foot in difficult terrain costs 2 feet of speed---so you can cover only half the normal distance in a minute, an hour, or a day."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_movement_special-types-of-movement",
  "fields": {
    "ruleset": "srd_movement",
    "document": "srd",
    "name": "Special Types of Movement",
    "index": 4,
    "initialHeaderLevel": 2,
    "desc": "Movement through dangerous dungeons or wilderness areas often involves more than simply walking. Adventurers might have to climb, crawl, swim,or jump to get where they need to go."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_movement_climbing-swimming-crawling",
  "fields": {
    "ruleset": "srd_movement",
    "document": "srd",
    "name": "Climbing, Swimming and Crawling",
    "index": 5,
    "initialHeaderLevel": 3,
    "desc": "While climbing or swimming, each foot of movement costs 1 extra foot (2extra feet in difficult terrain), unless a creature has a climbing orswimming speed. At the GM's option, climbing a slippery vertical surfaceor one with few handholds requires a successful Strength (Athletics) check. Similarly, gaining any distance in rough water might require asuccessful Strength (Athletics) check."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_movement_jumping",
  "fields": {
    "ruleset": "srd_movement",
    "document": "srd",
    "name": "Jumping",
    "index": 6,
    "initialHeaderLevel": 3,
    "desc": "Your Strength determines how far you can jump.\n\n**Long Jump.** When you make a long jump, you cover a number of feet upto your Strength score if you move at least 10 feet on foot immediatelybefore the jump. When you make a standing long jump, you can leap onlyhalf that distance. Either way, each foot you clear on the jump costs afoot of movement.\nThis rule assumes that the height of your jump doesn't matter, such as ajump across a stream or chasm. At your GM's option, you must succeed ona DC 10 Strength (Athletics) check to clear a low obstacle (no tallerthan a quarter of the jump's distance), such as a hedge or low wall.\nOtherwise, you hit it.\nWhen you land in difficult terrain, you must succeed on a DC 10Dexterity (Acrobatics) check to land on your feet. Otherwise, you landprone.\n\n**High Jump.** When you make a high jump, you leap into the air a numberof feet equal to 3 + your Strength modifier if you move at least 10 feeton foot immediately before the jump. When you make a standing high jump,you can jump only half that distance. Either way, each foot you clear onthe jump costs a foot of movement. In some circumstances, your GM mightallow you to make a Strength (Athletics) check to jump higher than younormally can.\nYou can extend your arms half your height above yourself during thejump. Thus, you can reach above you a distance equal to the height ofthe jump plus 1½ times your height."
  }
},
{
  "model": "api_v2.ruleset",
  "pk": "srd_multiclassing",
  "fields": {
    "name": "Multiclassing",
    "document": "srd",
    "desc": "Multiclassing allows you to gain levels in multiple classes. Doing so lets you mix the abilities of those classes to realize a character concept that might not be reflected in one of the standard class options.\n\nWith this rule, you have the option of gaining a level in a new class whenever you advance in level, instead of gaining a level in your current class. Your levels in all your classes are added together to determine your character level. For example, if you have three levels in wizard and two in fighter, you're a 5th-level character.\n\nAs you advance in levels, you might primarily remain a member of your original class with just a few levels in another class, or you might change course entirely, never looking back at the class you left behind. You might even start progressing in a third or fourth class. Compared to a single-class character of the same level, you'll sacrifice some focus in exchange for versatility."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_multiclassing_prerequistes",
  "fields": {
    "ruleset": "srd_multiclassing",
    "document": "srd",
    "name": "Prerequisites",
    "index": 1,
    "initialHeaderLevel": 2,
    "desc": "To qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one, as shown in the Multiclassing Prerequisites table. For example, a barbarian who decides to multiclass into the druid class must have both Strength and Wisdom scores of 13 or higher. Without the full training that a beginning character receives, you must be a quick study in your new class, having a natural aptitude that is reflected by higher- than-average ability scores.\n\n**Multiclassing Prerequisites (table)**\n\n| Class     | Ability Score Minimum       |\n|-----------|-----------------------------|\n| Barbarian | Strength 13                 |\n| Bard      | Charisma 13                 |\n| Cleric    | Wisdom 13                   |\n| Druid     | Wisdom 13                   |\n| Fighter   | Strength 13 or Dexterity 13 |\n| Monk      | Dexterity 13 and Wisdom 13  |\n| Paladin   | Strength 13 and Charisma 13 |\n| Ranger    | Dexterity 13 and Wisdom 13  |\n| Rogue     | Dexterity 13                |\n| Sorcerer  | Charisma 13                 |\n| Warlock   | Charisma 13                 |\n| Wizard    | Intelligence 13             |"
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_multiclassing_experience-points",
  "fields": {
    "ruleset": "srd_multiclassing",
    "document": "srd",
    "name": "Experience Points",
    "index": 2,
    "initialHeaderLevel": 2,
    "desc": "The experience point cost to gain a level is always based on your total character level, as shown in the Character Advancement table, not your level in a particular class. So, if you are a cleric 6/fighter 1, you must gain enough XP to reach 8th level before you can take your second level as a fighter or your seventh level as a cleric."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_multiclassing_hit-points-and-hit-dice",
  "fields": {
    "ruleset": "srd_multiclassing",
    "document": "srd",
    "name": "Hit Points and Hit Dice",
    "index": 3,
    "initialHeaderLevel": 2,
    "desc": "You gain the hit points from your new class as described for levels after 1st. You gain the 1st-level hit points for a class only when you are a 1st-level character.\n\nYou add together the Hit Dice granted by all your classes to form your pool of Hit Dice. If the Hit Dice are the same die type, you can simply pool them together. For example, both the fighter and the paladin have a d10, so if you are a paladin 5/fighter 5, you have ten d10 Hit Dice. If your classes give you Hit Dice of different types, keep track of them separately. If you are a paladin 5/cleric 5, for example, you have five d10 Hit Dice and five d8 Hit Dice."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_multiclassing_proficiency-bonus",
  "fields": {
    "ruleset": "srd_multiclassing",
    "document": "srd",
    "name": "Hit Points and Hit Dice",
    "index": 4,
    "initialHeaderLevel": 2,
    "desc": "Your proficiency bonus is always based on your total character level, as shown in the Character Advancement table in chapter 1, not your level in a particular class. For example, if you are a fighter 3/rogue 2, you have the proficiency bonus of a 5th- level character, which is +3."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_multiclassing_proficiencies",
  "fields": {
    "ruleset": "srd_multiclassing",
    "document": "srd",
    "name": "Proficiencies",
    "index": 5,
    "initialHeaderLevel": 2,
    "desc": "When you gain your first level in a class other than your initial class, you gain only some of new class's starting proficiencies, as shown in the Multiclassing Proficiencies table.\n\n**Multiclassing Proficiencies (table)**\n\n| Class     | Proficiencies Gained                                                                                       |\n|-----------|------------------------------------------------------------------------------------------------------------|\n| Barbarian | Shields, simple weapons, martial weapons                                                                   |\n| Bard      | Light armor, one skill of your choice, one musical instrument of your choice                               |\n| Cleric    | Light armor, medium armor, shields                                                                         |\n| Druid     | Light armor, medium armor, shields (druids will not wear armor or use shields made of metal)               |\n| Fighter   | Light armor, medium armor, shields, simple weapons, martial weapons                                        |\n| Monk      | Simple weapons, shortswords                                                                                |\n| Paladin   | Light armor, medium armor, shields, simple weapons, martial weapons                                        |\n| Ranger    | Light armor, medium armor, shields, simple weapons, martial weapons, one skill from the class's skill list |\n| Rogue     | Light armor, one skill from the class's skill list, thieves' tools                                         |\n| Sorcerer  | -                                                                                                          |\n| Warlock   | Light armor, simple weapons                                                                                |\n| Wizard    | -                                                                                                          |"
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_multiclassing_class-features",
  "fields": {
    "ruleset": "srd_multiclassing",
    "document": "srd",
    "name": "Class Features",
    "index": 6,
    "initialHeaderLevel": 2,
    "desc": "When you gain a new level in a class, you get its features for that level. You don't, however, receive the class's starting equipment, and a few features have additional rules when you're multiclassing: Channel Divinity, Extra Attack, Unarmored Defense, and Spellcasting."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_multiclassing_channel-divinity",
  "fields": {
    "ruleset": "srd_multiclassing",
    "document": "srd",
    "name": "Channel Divinity",
    "index": 7,
    "initialHeaderLevel": 2,
    "desc": "If you already have the Channel Divinity feature and gain a level in a class that also grants the feature, you gain the Channel Divinity effects granted by that class, but getting the feature again doesn't give you an additional use of it. You gain additional uses only when you reach a class level that explicitly grants them to you. For example, if you are a cleric 6/paladin 4, you can use Channel Divinity twice between rests because you are high enough level in the cleric class to have more uses. Whenever you use the feature, you can choose any of the Channel Divinity effects available to you from your two classes."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_multiclassing_extra-attack",
  "fields": {
    "ruleset": "srd_multiclassing",
    "document": "srd",
    "name": "Extra Attack",
    "index": 8,
    "initialHeaderLevel": 2,
    "desc": "If you gain the Extra Attack class feature from more than one class, the features don't add together. You can't make more than two attacks with this feature unless it says you do (as the fighter's version of Extra Attack does). Similarly, the warlock's eldritch invocation Thirsting Blade doesn't give you additional attacks if you also have Extra Attack."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_multiclassing_unarmored-defense",
  "fields": {
    "ruleset": "srd_multiclassing",
    "document": "srd",
    "name": "Unarmored Defense",
    "index": 9,
    "initialHeaderLevel": 2,
    "desc": "If you already have the Unarmored Defense feature, you can't gain it again from another class."
  }
},
{
  "model": "api_v2.rule",
  "pk": "srd_multiclassing_spellcasting",
  "fields": {
    "ruleset": "srd_multiclassing",
    "document": "srd",
    "name": "Spellcasting",
    "index": 10,
    "initialHeaderLevel": 2,
    "desc": "Your capacity for spellcasting depends partly on your combined levels in all your spellcasting classes and partly on your individual levels in those classes. Once you have the Spellcasting feature from more than one class, use the rules below. If you multiclass but have the Spellcasting feature from only one class, you follow the rules as described in that class.\n\n**_Spells Known and Prepared._** You determine what spells you know and can prepare for each class individually, as if you were a single-classed member of that class. If you are a ranger 4/wizard 3, for example, you know three 1st-level ranger spells based on your levels in the ranger class. As 3rd-level wizard, you know three wizard cantrips, and your spellbook contains ten wizard spells, two of which (the two you gained when you reached 3rd level as a wizard) can be 2nd-level spells. If your Intelligence is 16, you can prepare six wizard spells from your spellbook.\n\nEach spell you know and prepare is associated with one of your classes, and you use the spellcasting ability of that class when you cast the spell. Similarly, a spellcasting focus, such as a holy symbol, can be used only for the spells from the class associated with that focus.\n\n**_Spell Slots._** You determine your available spell slots by adding together all your levels in the bard, cleric, druid, sorcerer, and wizard classes, and half your levels (rounded down) in the paladin and ranger classes. Use this total to determine your spell slots by consulting the Multiclass Spellcaster table.\n\nIf you have more than one spellcasting class, this table might give you spell slots of a level that is higher than the spells you know or can prepare. You can use those slots, but only to cast your lower-level spells. If a lower-level spell that you cast, like _burning hands_, has an enhanced effect when cast using a higher-level slot, you can use the enhanced effect, even though you don't have any spells of that higher level.\n\nFor example, if you are the aforementioned ranger 4/wizard 3, you count as a 5th-level character when determining your spell slots: you have four 1st-level slots, three 2nd-level slots, and two 3rd-level slots. However, you don't know any 3rd-level spells, nor do you know any 2nd-level ranger spells. You can use the spell slots of those levels to cast the spells you do know-and potentially enhance their effects.\n\n**_Pact Magic._** If you have both the Spellcasting class feature and the Pact Magic class feature from the warlock class, you can use the spell slots you gain from the Pact Magic feature to cast spells you know or have prepared from classes with the Spellcasting class feature, and you can use the spell slots you gain from the Spellcasting class feature to cast warlock spells you know.\n\n**Multiclass Spellcaster: Spell Slots per Spell Level (table)**\n\n| Level | 1st | 2nd | 3rd | 4th | 5th | 6th | 7th | 8th | 9th |\n|-------|-----|-----|-----|-----|-----|-----|-----|-----|-----|\n| 1st   | 2   | -   | -   | -   | -   | -   | -   | -   | -   |\n| 2nd   | 3   | -   | -   | -   | -   | -   | -   | -   | -   |\n| 3rd   | 4   | 2   | -   | -   | -   | -   | -   | -   | -   |\n| 4th   | 4   | 3   | -   | -   | -   | -   | -   | -   | -   |\n| 5th   | 4   | 3   | 2   | -   | -   | -   | -   | -   | -   |\n| 6th   | 4   | 3   | 3   | -   | -   | -   | -   | -   | -   |\n| 7th   | 4   | 3   | 3   | 1   | -   | -   | -   | -   | -   |\n| 8th   | 4   | 3   | 3   | 2   | -   | -   | -   | -   | -   |\n| 9th   | 4   | 3   | 3   | 3   | 1   | -   | -   | -   | -   |\n| 10th  | 4   | 3   | 3   | 3   | 2   | -   | -   | -   | -   |\n| 11th  | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   |\n| 12th  | 4   | 3   | 3   | 3   | 2   | 1   | -   | -   | -   |\n| 13th  | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   |\n| 14th  | 4   | 3   | 3   | 3   | 2   | 1   | 1   | -   | -   |\n| 15th  | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   |\n| 16th  | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | -   |\n| 17th  | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | 1   |\n| 18th  | 4   | 3   | 3   | 3   | 3   | 1   | 1   | 1   | 1   |\n| 19th  | 4   | 3   | 3   | 3   | 3   | 2   | 1   | 1   | 1   |\n| 20th  | 4   | 3   | 3   | 3   | 3   | 2   | 2   | 1   | 1   |"
  }
}
]