[
    {
        "name": "Abhorrent Apparition",
        "desc": "You imbue a terrifying visage onto a gourd and toss it ahead of you to a spot of your choosing within range. Each creature within 15 feet of that spot takes 6d8 psychic damage and becomes frightened of you for 1 minute; a successful Wisdom saving throw halves the damage and negates the fright. A creature frightened in this way repeats the saving throw at the end of each of its turns, ending the effect on itself on a success.\n",
        "higher_level": "If you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d8 for each slot level above 4th.",
        "range": "60 feet",
        "components": "M",
        "material": "a gourd with a face carved on it",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "4th-level",
        "level_int": "4",
        "school": "illusion",
        "class": "Bard, Sorcerer, Wizard",
        "damage_type": [
            "psychic"
        ]
    },
    {
        "name": "Accelerate",
        "desc": "Choose up to three willing creatures within range, which can include you. For the duration of the spell, each target’s walking speed is doubled. Each target can also use a bonus action on each of its turns to take the Dash action, and it has advantage on Dexterity saving throws.\n",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, you can affect one additional creature for each slot level above 3rd.",
        "range": "Touch",
        "components": "V, S, M",
        "material": "a toy top",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "level_int": "3",
        "school": "transmutation",
        "class": "Bard, Cleric, Druid, Sorcerer, Wizard"
    },
    {
        "name": "Acid Gate",
        "desc": "You create a portal of swirling, acidic green vapor in an unoccupied space you can see. This portal connects with a target destination within 100 miles that you are personally familiar with and have seen with your own eyes, such as your wizard’s tower or an inn you have stayed at. You and up to three creatures of your choice can enter the portal and pass through it, arriving at the target destination (or within 10 feet of it, if it is currently occupied). If the target destination doesn’t exist or is inaccessible, the spell automatically fails and the gate doesn’t form.\n\nAny creature that tries to move through the gate, other than those selected by you when the spell was cast, takes 10d6 acid damage and is teleported 1d100 × 10 feet in a random, horizontal direction. If the creature makes a successful Intelligence saving throw, it can’t be teleported by this portal, but it still takes acid damage when it enters the acid-filled portal and every time it ends its turn in contact with it.\n",
        "higher_level": "When you cast this spell using a spell slot of 8th level or higher, you can allow one additional creature to use the gate for each slot level above 7th.",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "a vial of acid and a polished silver mirror worth 125 gp",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "7th-level",
        "level_int": "7",
        "school": "conjuration",
        "damage_type": [
            "acid"
        ]
    },
    {
        "name": "Acid Rain",
        "desc": "You unleash a storm of swirling acid in a cylinder 20 feet wide and 30 feet high, centered on a point you can see. The area is heavily obscured by the driving acidfall. A creature that starts its turn in the area or that enters the area for the first time on its turn takes 6d6 acid damage, or half as much damage if it makes a successful Dexterity saving throw. A creature takes half as much damage from the acid (as if it had made a successful saving throw) at the start of its first turn after leaving the affected area.\n",
        "higher_level": "When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d6 for each slot level above 5th.",
        "range": "150 feet",
        "components": "V, S, M",
        "material": "a drop of acid",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "5th-level",
        "level_int": "5",
        "school": "conjuration",
        "class": "Sorcerer, Warlock, Wizard",
        "shape": " cylinder",
        "damage_type": [
            "acid"
        ]
    },
    {
        "name": "Adjust Position",
        "desc": "You adjust the location of an ally to a better tactical position. You move one willing creature within range 5 feet. This movement does not provoke opportunity attacks. The creature moves bodily through the intervening space (as opposed to teleporting), so there can be no physical obstacle (such as a wall or a door) in the path.\n",
        "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, you can target an additional willing creature for each slot level above 1st.",
        "range": "30 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 bonus action",
        "level": "1st-level",
        "level_int": "1",
        "school": "transmutation",
        "class": "Bard, Cleric, Warlock, Wizard"
    },
    {
        "name": "Afflict Line",
        "desc": "You invoke the darkest curses upon your victim and his or her descendants. This spell does not require that you have a clear path to your target, only that your target is within range. The target must make a successful Wisdom saving throw or be cursed until the magic is dispelled. While cursed, the victim has disadvantage on ability checks and saving throws made with the ability score that you used when you cast the spell. In addition, the target’s firstborn offspring is also targeted by the curse. That individual is allowed a saving throw of its own if it is currently alive, or it makes one upon its birth if it is not yet born when the spell is cast. If the target’s firstborn has already died, the curse passes to the target’s next oldest offspring.\n\n**Ritual Focus.** If you expend your ritual focus, the curse becomes hereditary, passing from firstborn to firstborn for the entire length of the family’s lineage until one of them successfully saves against the curse and throws off your dark magic.",
        "range": "1 mile",
        "components": "V, S, M",
        "material": "a statuette carved in the likeness of the victim worth 1,250 gp",
        "ritual": "yes",
        "duration": "Permanent; one generation",
        "concentration": "no",
        "casting_time": "1 hour",
        "level": "9th-level",
        "level_int": "9",
        "school": "necromancy",
        "class": "Cleric, Warlock, Wizard"
    },
    {
        "name": "Agonizing Mark",
        "desc": "You choose a creature you can see within range to mark as your prey, and a ray of black energy issues forth from you. Until the spell ends, each time you deal damage to the target it must make a Charisma saving throw. On a failed save, it falls prone as its body is filled with torturous agony.",
        "range": "90 feet",
        "components": "S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "1st-level",
        "level_int": "1",
        "school": "evocation",
        "class": "Bard, Cleric, Druid, Ranger, Sorcerer, Wizard"
    },
    {
        "name": "Alchemical Form",
        "desc": "You transform into an amoebic form composed of highly acidic and poisonous alchemical jelly. While in this form:\n* you are immune to acid and poison damage and to the poisoned and stunned conditions;\n* you have resistance to nonmagical fire, piercing, and slashing damage;\n* you can’t speak, cast spells, use items or weapons, or manipulate objects;\n* your gear melds into your body and reappears when the spell ends;\n* you don't need to breathe;\n* your speed is 20 feet;\n* your size doesn’t change, but you can move through and between obstructions as if you were two size categories smaller; and\n* you gain the following action: //Melee Weapon Attack:// spellcasting ability modifier + proficiency bonus to hit, range 5 ft., one target; //Hit:// 4d6 acid or poison damage (your choice), and the target must make a successful Constitution saving throw or be poisoned until the start of your next turn.",
        "range": "Self",
        "components": "V, S, M",
        "material": "a vial of acid, poison, or alchemist's fire",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "6th-level",
        "level_int": "6",
        "school": "transmutation",
        "damage_type": [
            "fire",
            "piercing",
            "slashing"
        ]
    },
    {
        "name": "Ale-dritch Blast",
        "desc": "A stream of ice-cold ale blasts from your outstretched hands toward a creature or object within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 cold damage and it must make a successful Constitution saving throw or be poisoned until the end of its next turn. A targeted creature has disadvantage on the saving throw if it has drunk any alcohol within the last hour.\n\nThe damage increases when you reach higher levels: 2d8 at 5th level, 3d8 at 11th level, and 4d8 at 17th level.",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "level_int": "0",
        "school": "Conjuration",
        "class": "Bard, Druid, Wizard",
        "rolls-attack": true,
        "damage_type": [
            "cold"
        ]
    },
    {
        "name": "Ally Aegis",
        "desc": "When you see an ally within range in imminent danger, you can use your reaction to protect that creature with a shield of magical force. Until the start of your next turn, your ally has a +5 bonus to AC and is immune to force damage. In addition, if your ally must make a saving throw against an enemy’s spell that deals damage, the ally takes half as much damage on a failed saving throw and no damage on a successful save. Ally aegis offers no protection, however, against psychic damage from any source.\n",
        "higher_level": "When you cast this spell using a spell slot of 7th level or higher, you can target one additional ally for each slot level above 6th.",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 round",
        "concentration": "no",
        "casting_time": "1 reaction, which you take when your ally is hit by an attack or is targeted by a spell that deals damage other than psychic damage",
        "level": "6th-level",
        "level_int": "6",
        "school": "abjuration",
        "class": "Bard, Cleric, Sorcerer, Wizard",
        "damage_type": [
            "psychic"
        ]
    },
    {
        "name": "Alone",
        "desc": "You cause a creature within range to believe its allies have been banished to a different realm. The target must succeed on a Wisdom saving throw, or it treats its allies as if they were invisible and silenced. The affected creature cannot target, perceive, or otherwise interact with its allies for the duration of the spell. If one of its allies hits it with a melee attack, the affected creature can make another Wisdom saving throw. On a successful save, the spell ends.",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "level_int": "3",
        "school": "enchantment",
        "class": "Cleric, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Alter Arrow’s Fortune",
        "desc": "You clap your hands, setting off a chain of tiny events that culminate in throwing off an enemy’s aim. When an enemy makes a ranged attack with a weapon or a spell that hits one of your allies, this spell causes the enemy to reroll the attack roll unless the enemy makes a successful Charisma saving throw. The attack is resolved using the lower of the two rolls (effectively giving the enemy disadvantage on the attack).",
        "range": "100 feet",
        "components": "S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 reaction, which you take when an enemy makes a ranged attack that hits",
        "level": "1st-level",
        "level_int": "1",
        "school": "divination",
        "class": "Bard, Cleric, Druid, Ranger, Sorcerer, Wizard"
    },
    {
        "name": "Althea’s Travel Tent",
        "desc": "You touch an ordinary, properly pitched canvas tent to create a space where you and a companion can sleep in comfort. From the outside, the tent appears normal, but inside it has a small foyer and a larger bedchamber. The foyer contains a writing desk with a chair; the bedchamber holds a soft bed large enough to sleep two, a small nightstand with a candle, and a small clothes rack. The floor of both rooms is a clean, dry, hard-packed version of the local ground. When the spell ends, the tent and the ground return to normal, and any creatures inside the tent are expelled to the nearest unoccupied spaces.\n",
        "higher_level": "When the spell is cast using a 3rd-level slot, the foyer becomes a dining area with seats for six and enough floor space for six people to sleep, if they bring their own bedding. The sleeping room is unchanged. With a 4th-level slot, the temperature inside the tent is comfortable regardless of the outside temperature, and the dining area includes a small kitchen. With a 5th-level slot, an unseen servant is conjured to prepare and serve food (from your supplies). With a 6th-level slot, a third room is added that has three two-person beds. With a slot of 7th level or higher, the dining area and second sleeping area can each accommodate eight persons.",
        "range": "Touch",
        "components": "V, S, M",
        "material": "a canvas tent",
        "ritual": "yes",
        "duration": "8 hours",
        "concentration": "no",
        "casting_time": "5 minutes",
        "level": "2nd-level",
        "level_int": "2",
        "school": "conjuration",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Amplify Gravity",
        "desc": "This spell intensifies gravity in a 50-foot-radius area within range. Inside the area, damage from falling is quadrupled (2d6 per 5 feet fallen) and maximum damage from falling is 40d6. Any creature on the ground in the area when the spell is cast must make a successful Strength saving throw or be knocked prone; the same applies to a creature that enters the area or ends its turn in the area. A prone creature in the area must make a successful Strength saving throw to stand up. A creature on the ground in the area moves at half speed and has disadvantage on Dexterity checks and ranged attack rolls.",
        "range": "100 feet",
        "components": "V, S, M",
        "material": "a piece of lead",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "7th-level",
        "level_int": "7",
        "school": "transmutation",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Analyze Device",
        "desc": "You discover all mechanical properties, mechanisms, and functions of a single construct or clockwork device, including how to activate or deactivate those functions, if appropriate.",
        "range": "Touch",
        "components": "V, S, M",
        "material": "a set of clockworker’s tools",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 hour",
        "level": "1st-level",
        "level_int": "1",
        "school": "divination",
        "class": "Bard, Sorcerer, Wizard"
    },
    {
        "name": "Ancestor’s Strength",
        "desc": "Choose a willing creature you can see and touch. Its muscles bulge and become invigorated. For the duration, the target is considered one size category larger for determining its carrying capacity, the maximum weight it can lift, push, or pull, and its ability to break objects. It also has advantage on Strength checks.",
        "range": "Touch",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 8 hours",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "1st-level",
        "level_int": "1",
        "school": "transmutation",
        "class": "Cleric, Druid, Paladin"
    },
    {
        "name": "Anchoring Rope",
        "desc": "You create a spectral lanyard. One end is tied around your waist, and the other end is magically anchored in the air at a point you select within range. You can choose to make the rope from 5 to 30 feet long, and it can support up to 800 pounds. The point where the end of the rope is anchored in midair can’t be moved after the spell is cast. If this spell is cast as a reaction while you are falling, you stop at a point of your choosing in midair and take no falling damage. You can dismiss the rope as a bonus action.\n",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can create one additional rope for every two slot levels above 1st. Each rope must be attached to a different creature.",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "5 minutes",
        "concentration": "no",
        "casting_time": "1 action, or 1 reaction that you take while falling",
        "level": "1st-level",
        "level_int": "1",
        "school": "evocation",
        "class": "Bard, Druid, Ranger"
    },
    {
        "name": "Ancient Shade",
        "desc": "You grant the semblance of life and intelligence to a pile of bones (or even bone dust) of your choice within range, allowing the ancient spirit to answer the questions you pose. These remains can be the remnants of undead, including animated but unintelligent undead, such as skeletons and zombies. (Intelligent undead are not affected.) Though it can have died centuries ago, the older the spirit called, the less it remembers of its mortal life.\n\nUntil the spell ends, you can ask the ancient spirit up to five questions if it died within the past year, four questions if it died within ten years, three within one hundred years, two within one thousand years, and but a single question for spirits more than one thousand years dead. The ancient shade knows only what it knew in life, including languages. Answers are usually brief, cryptic, or repetitive, and the corpse is under no compulsion to offer a truthful answer if you are hostile to it or it recognizes you as an enemy. This spell doesn’t return the creature’s soul to its body, only its animating spirit. Thus, the corpse can’t learn new information, doesn’t comprehend anything that has happened since it died, and can’t speculate about future events.",
        "range": "10 feet",
        "components": "V, S, M",
        "material": "burning candles of planar origin worth 500 gp",
        "ritual": "no",
        "duration": "10 minutes",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "5th-level",
        "level_int": "5",
        "school": "necromancy",
        "class": "Cleric, Wizard"
    },
    {
        "name": "Angelic Guardian",
        "desc": "You conjure a minor celestial manifestation to protect a creature you can see within range. A faintly glowing image resembling a human head and shoulders hovers within 5 feet of the target for the duration. The manifestation moves to interpose itself between the target and any incoming attacks, granting the target a +2 bonus to AC.\n\nAlso, the first time the target gets a failure on a Dexterity saving throw while the spell is active, it can use its reaction to reroll the save. The spell then ends.",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "1st-level",
        "level_int": "1",
        "school": "conjuration",
        "class": "Cleric, Paladin, Warlock, Wizard"
    },
    {
        "name": "Animate Ghoul",
        "desc": "You raise one Medium or Small humanoid corpse as a ghoul under your control. Any class levels or abilities the creature had in life are gone, replaced by the standard ghoul stat block.\n",
        "higher_level": "When you cast this spell using a 3rd-level spell slot, it can be used on the corpse of a Large humanoid to create a Large ghoul. When you cast this spell using a spell slot of 4th level or higher, this spell creates a ghast, but the material component changes to an onyx gemstone worth at least 200 gp.",
        "range": "Touch",
        "components": "V, S, M",
        "material": "piece of rotting flesh and an onyx gemstone worth 100 gp",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "level_int": "2",
        "school": "necromancy",
        "class": "Cleric, Sorcerer, Wizard"
    },
    {
        "name": "Animate Greater Undead",
        "desc": "//Animate greater undead// creates an undead servant from a pile of bones or from the corpse of a Large or Huge humanoid within range. The spell imbues the target with a foul mimicry of life, raising it as an undead skeleton or zombie. A skeleton uses the stat block of a minotaur skeleton, or a zombie uses the stat block of an ogre zombie, unless a more appropriate stat block is available.\n\nThe creature is under your control for 24 hours, after which it stops obeying your commands. To maintain control of the creature for another 24 hours, you must cast this spell on it again while you have it controlled. Casting the spell for this purpose reasserts your control over up to four creatures you have previously animated rather than animating a new one.\n",
        "higher_level": "When you cast this spell using a spell slot of 7th level or higher, you can reanimate one additional creature for each slot level above 6th.",
        "range": "15 feet",
        "components": "V, S, M",
        "material": "a pint of blood, a pound of flesh, and an ounce of bone dust, all of which the spell consumes",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 hour",
        "level": "6th-level",
        "level_int": "6",
        "school": "necromancy",
        "class": "Cleric, Wizard"
    },
    {
        "name": "Animated Scroll",
        "desc": "The paper or parchment must be folded into the shape of an animal before casting the spell. It then becomes an animated paper animal of the kind the folded paper most closely resembles. The creature uses the stat block of any beast that has a challenge rating of 0. It is made of paper, not flesh and bone, but it can do anything the real creature can do: a paper owl can fly and attack with its talons, a paper frog can swim without disintegrating in water, and so forth. It follows your commands to the best of its ability, including carrying messages to a recipient whose location you know.\n\nThe duration increases by 24 hours at 5th level (48 hours), 11th level (72 hours), and 17th level (96 hours).",
        "range": "Touch",
        "components": "V, S, M",
        "material": "intricately folded paper or parchment",
        "ritual": "no",
        "duration": "24 hours",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "level_int": "0",
        "school": "Transmutation",
        "class": "Druid, Sorcerer, Wizard"
    },
    {
        "name": "Anticipate Arcana",
        "desc": "Your foresight gives you an instant to ready your defenses against a magical attack. When you cast //anticipate arcana//, you have advantage on saving throws against spells and other magical effects until the start of your next turn.",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 reaction, which you take when an enemy you can see casts a spell",
        "level": "3rd-level",
        "level_int": "3",
        "school": "divination",
        "class": "Cleric, Paladin, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Anticipate Attack",
        "desc": "In a flash of foreknowledge, you spot an oncoming attack with enough time to avoid it. Upon casting this spell, you can move up to half your speed without provoking opportunity attacks. The oncoming attack still occurs but misses automatically if you are no longer within the attack’s range, are in a space that's impossible for the attack to hit, or can’t be targeted by that attack in your new position. If none of those circumstances apply but the situation has changed—you have moved into a position where you have cover, for example—then the attack is made after taking the new situation into account.",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 reaction, which you take when you are attacked but before the attack roll is made",
        "level": "2nd-level",
        "level_int": "2",
        "school": "divination",
        "class": "Bard, Cleric, Druid, Paladin, Ranger, Sorcerer, Wizard"
    },
    {
        "name": "Anticipate Weakness",
        "desc": "With a quick glance into the future, you pinpoint where a gap is about to open in your foe’s defense, and then you strike. After casting //anticipate weakness//, you have advantage on attack rolls until the end of your turn.",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 bonus action",
        "level": "1st-level",
        "level_int": "1",
        "school": "divination",
        "class": "Bard, Cleric, Druid, Ranger, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Arcane Sight",
        "desc": "The recipient of this spell gains the benefits of both //[[[srd-spell:true seeing]]]// and //[[[srd-spell:detect magic]]]// until the spell ends, and also knows the name and effect of every spell he or she witnesses during the spell’s duration.",
        "range": "Touch",
        "components": "V, S, M",
        "material": "a piece of clear quartz",
        "ritual": "no",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "8th-level",
        "level_int": "8",
        "school": "divination",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "As You Were",
        "desc": "When cast on a dead or undead body, //as you were// returns that creature to the appearance it had in life while it was healthy and uninjured. The target must have a physical body; the spell fails if the target is normally noncorporeal.\n\nIf as you were is cast on a corpse, its effect is identical to that of //[[[srd-spell:gentle repose]]]//, except that the corpse’s appearance is restored to that of a healthy, uninjured (albeit dead) person.\n\nIf the target is an undead creature, it also is restored to the appearance it had in life, even if it died from disease or from severe wounds, or centuries ago. The target looks, smells, and sounds (if it can speak) as it did in life. Friends and family can tell something is wrong only with a successful Wisdom (Insight) check against your spell save DC, and only if they have reason to be suspicious. (Knowing that the person should be dead is sufficient reason.) Spells and abilities that detect undead are also fooled, but the creature remains susceptible to Turn Undead as normal.\n\nThis spell doesn’t confer the ability to speak on undead that normally can’t speak. The creature eats, drinks, and breathes as a living creature does; it can mimic sleep, but it has no more need for it than it had before.\n\nThe effect lasts for a number of hours equal to your caster level. You can use an action to end the spell early. Any amount of radiant or necrotic damage dealt to the creature, or any effect that reduces its Constitution, also ends the spell.\n\nIf this spell is cast on an undead creature that isn’t your ally or under your control, it makes a Charisma saving throw to resist the effect.",
        "range": "Touch",
        "components": "V, S, M",
        "material": "a piece of flesh from a creature of the target’s race",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 minute",
        "level": "2nd-level",
        "level_int": "2",
        "school": "necromancy",
        "class": "Cleric, Wizard",
        "damage_type": [
            "necrotic",
            "radiant"
        ]
    },
    {
        "name": "Ashen Memories",
        "desc": "You touch the ashes, embers, or soot left behind by a fire and receive a vision of one significant event that occurred in the area while the fire was burning. For example, if you were to touch the cold embers of a campfire, you might witness a snippet of a conversation that occurred around the fire. Similarly, touching the ashes of a burned letter might grant you a vision of the person who destroyed the letter or the contents of the letter. You have no control over what information the spell reveals, but your vision usually is tied to the most meaningful event related to the fire. The GM determines the details of what is revealed.",
        "range": "Touch",
        "components": "V, S",
        "ritual": "yes",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 minute",
        "level": "2nd-level",
        "level_int": "2",
        "school": "divination",
        "class": "Bard, Cleric, Wizard"
    },
    {
        "name": "Aspect of the Dragon",
        "desc": "This spell draws out the ancient nature within your blood, allowing you to assume the form of any dragon-type creature of challenge 10 or less.\n\nYou assume the hit points and Hit Dice of the new form. When you revert to your normal form, you return to the number of hit points you had before you transformed. If you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. As long as the excess damage doesn’t reduce your normal form to 0 hit points, you aren’t knocked unconscious.\n\nYou retain the benefits of any features from your class, race, or other source and can use them, provided that your new form is physically capable of doing so. You can speak only if the dragon can normally speak.\n\nWhen you transform, you choose whether your equipment falls to the ground, merges into the new form, or is worn by it. Worn equipment functions normally, but equipment doesn’t change shape or size to match the new form. Any equipment that the new form can’t wear must either fall to the ground or merge into the new form. The GM has final say on whether the new form can wear or use a particular piece of equipment. Equipment that merges has no effect in that state.",
        "range": "Self",
        "components": "V, S, M",
        "material": "a dragon scale",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "7th-level",
        "level_int": "7",
        "school": "transmutation"
    },
    {
        "name": "Aspect of the Serpent",
        "desc": "A creature you touch takes on snakelike aspects for the duration of the spell. Its tongue becomes long and forked, its canine teeth become fangs with venom sacs, and its pupils become sharply vertical. The target gains darkvision with a range of 60 feet and blindsight with a range of 30 feet. As a bonus action when you cast the spell, the target can make a ranged weapon attack with a normal range of 60 feet that deals 2d6 poison damage on a hit.\n\nAs an action, the target can make a bite attack using either Strength or Dexterity (Melee Weapon Attack: range 5 ft., one creature; Hit: 2d6 piercing damage), and the creature must make a successful DC 14 Constitution saving throw or be paralyzed for 1 minute. A creature paralyzed in this way repeats the saving throw at the end of each of its turns, ending the effect on itself on a success).\n",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, both the ranged attack and bite attack damage increase by 1d6 for each slot level above 3rd.",
        "range": "Touch",
        "components": "V, S, M",
        "material": "a dried snakeskin",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "level_int": "3",
        "school": "transmutation",
        "class": "Druid, Sorcerer, Wizard",
        "damage_type": [
            "piercing",
            "poison"
        ]
    },
    {
        "name": "Aura of Protection or Destruction",
        "desc": "When you cast this spell, you radiate an otherworldly energy that warps the fate of all creatures within 30 feet of you. Decide whether to call upon either a celestial or a fiend for aid. Choosing a celestial charges a 30-foot-radius around you with an aura of nonviolence; until the start of your next turn, every attack roll made by or against a creature inside the aura is treated as a natural 1. Choosing a fiend charges the area with an aura of violence; until the start of your next turn, every attack roll made by or against a creature inside the aura, including you, is treated as a natural 20.\n",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, you can extend the duration by 1 round for each slot level above 3rd.",
        "range": "Self (30-foot radius)",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "3rd-level",
        "level_int": "3",
        "school": "abjuration",
        "class": "Cleric, Paladin"
    },
    {
        "name": "Auspicious Warning",
        "desc": "Just in time, you call out a fortunate warning to a creature within range. The target rolls a d4 and adds the number rolled to an attack roll, ability check, or saving throw that it has just made and uses the new result for determining success or failure.",
        "range": "30 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 reaction, which you take when an ally makes an attack roll, ability check, or saving throw",
        "level": "1st-level",
        "level_int": "1",
        "school": "enchantment",
        "class": "Bard, Sorcerer, Wizard"
    },
    {
        "name": "Avoid Grievous Injury",
        "desc": "You cast this spell when a foe strikes you with a critical hit but before damage dice are rolled. The critical hit against you becomes a normal hit.",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 reaction, which you take when you are struck by a critical hit",
        "level": "1st-level",
        "level_int": "1",
        "school": "divination",
        "class": "Bard, Cleric, Druid, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Avronin’s Astral Assembly",
        "desc": "You alert a number of creatures that you are familiar with, up to your spellcasting ability modifier (minimum of 1), of your intent to communicate with them through spiritual projection. The invitation can extend any distance and even cross to other planes of existence. Once notified, the creatures can choose to accept this communication at any time during the duration of the spell.\n\nWhen a creature accepts, its spirit is projected into one of the gems used in casting the spell. The material body it leaves behind falls unconscious and doesn't need food or air. The creature's consciousness is present in the room with you, and its normal form appears as an astral projection within 5 feet of the gem its spirit occupies. You can see and hear all the creatures who have joined in the assembly, and they can see and hear you and each other as if they were present (which they are, astrally). They can't interact with anything physically.\n\nA creature can end the spell's effect on itself voluntarily at any time, as can you. When the effect ends or the duration expires, a creature's spirit returns to its body and it regains consciousness. A creature that withdraws voluntarily from the assembly can't rejoin it even if the spell is still active. If a gem is broken while occupied by a creature's astral self, the spirit in the gem returns to its body and the creature suffers two levels of exhaustion.",
        "range": "Unlimited",
        "components": "V, M",
        "material": "a spool of fine copper wire and a gem worth at least 100 gp for each target",
        "ritual": "yes",
        "duration": "Up to 1 hour",
        "concentration": "yes",
        "casting_time": "10 minutes",
        "level": "6th-level",
        "level_int": "6",
        "school": "necromancy",
        "class": "Warlock, Wizard"
    },
    {
        "name": "Awaken Object",
        "desc": "After spending the casting time enchanting a ruby along with a Large or smaller nonmagical object in humanoid form, you touch the ruby to the object. The ruby dissolves into the object, which becomes a living construct imbued with sentience. If the object has no face, a humanoid face appears on it in an appropriate location. The awakened object's statistics are determined by its size, as shown on the table below. An awakened object can use an action to make a melee weapon attack against a target within 5 feet of it. It has free will, acts independently, and speaks one language you know. It is initially friendly to anyone who assisted in its creation.\n\nAn awakened object's speed is 30 feet. If it has no apparent legs or other means of moving, it gains a flying speed of 30 feet and it can hover. Its sight and hearing are equivalent to a typical human's senses. Intelligence, Wisdom, and Charisma can be adjusted up or down by the GM to fit unusual circumstances. A beautiful statue might awaken with increased Charisma, for example, or the bust of a great philosopher could have surprisingly high Wisdom.\n\nAn awakened object needs no air, food, water, or sleep. Damage to an awakened object can be healed or mechanically repaired.\n\n||~ Size ||~ HP ||~ AC ||~ Attack ||~ Str ||~ Dex ||~ Con ||~ Int ||~ Wis ||~ Cha ||\n|| T || 20 || 18 || +8 to hit, 1d4 + 4 damage || 4 || 18 || 10 || 2d6 || 2d6 || 2d6 ||\n|| S || 25 || 16 || +6 to hit, 1d8 + 2 damage || 6 || 14 || 10 || 3d6 || 2d6 || 2d6 ||\n|| M || 40 || 13 || +5 to hit, 2d6 + 1 damage || 10 || 12 || 10 || 3d6 || 3d6 || 2d6 ||\n|| L || 50 || 10 || +6 to hit, 2d10 + 2 damage || 14 || 10 || 10 || 3d6 || 3d6 || 2d6 + 2 ||",
        "range": "Touch",
        "components": "V, S, M",
        "material": "a ruby worth at least 1,000 gp, which the spell consumes",
        "ritual": "no",
        "duration": "Permanent",
        "concentration": "no",
        "casting_time": "8 hours",
        "level": "8th-level",
        "level_int": "8",
        "school": "transmutation"
    },
    {
        "name": "Bad Timing",
        "desc": "You point toward a creature that you can see and twist strands of chaotic energy around its fate. If the target gets a failure on a Charisma saving throw, the next attack roll or ability check the creature attempts within 10 minutes is made with disadvantage.",
        "range": "60 feet",
        "components": "V",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "level_int": "2",
        "school": "divination",
        "class": "Bard, Sorcerer, Wizard"
    },
    {
        "name": "Batsense",
        "desc": "For the duration of the spell, a creature you touch can produce and interpret squeaking sounds used for echolocation, giving it blindsight out to a range of 60 feet. The target cannot use its blindsight while deafened, and its blindsight doesn't penetrate areas of magical silence. While using blindsight, the target has disadvantage on Dexterity (Stealth) checks that rely on being silent. Additionally, the target has advantage on Wisdom (Perception) checks that rely on hearing.",
        "range": "Touch",
        "components": "V, S, M",
        "material": "a bit of fur from a bat’s ear",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "level_int": "2",
        "school": "transmutation",
        "class": "Bard, Druid, Ranger, Sorcerer"
    },
    {
        "name": "Become Nightwing",
        "desc": "This spell imbues you with wings of shadow. For the duration of the spell, you gain a flying speed of 60 feet and a new attack action: Nightwing Breath.\n\n//**Nightwing Breath (Recharge 4–6).**// You exhale shadow‐substance in a 30-foot cone. Each creature in the area takes 5d6 necrotic damage, or half the damage with a successful Dexterity saving throw.",
        "range": "Self",
        "components": "V, S, M",
        "material": "a crow’s eye",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "level_int": "6",
        "school": "enchantment",
        "class": "Sorcerer, Warlock, Wizard",
        "shape": " cone",
        "damage_type": [
            "necrotic"
        ]
    },
    {
        "name": "Beguiling Bet",
        "desc": "You issue a challenge against one creature you can see within range, which must make a successful Wisdom saving throw or become charmed. On a failed save, you can make an ability check as a bonus action. For example, you could make a Strength (Athletics) check to climb a difficult surface or to jump as high as possible; you could make a Dexterity (Acrobatics) check to perform a backflip; or you could make a Charisma (Performance) check to sing a high note or to extemporize a clever rhyme. You can choose to use your spellcasting ability modifier in place of the usual ability modifier for this check, and you add your proficiency bonus if you're proficient in the skill being used.\n\nThe charmed creature must use its next action (which can be a legendary action) to make the same ability check in a contest against your check. Even if the creature can't perform the action—it may not be close enough to a wall to climb it, or it might not have appendages suitable for strumming a lute—it must still attempt the action to the best of its capability. If you win the contest, the spell (and the contest) continues, with you making a new ability check as a bonus action on your turn. The spell ends when it expires or when the creature wins the contest. ",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for every two slot levels above 2nd. Each creature must be within 30 feet of another creature when you cast the spell.",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "level_int": "2",
        "school": "enchantment"
    },
    {
        "name": "Benediction",
        "desc": "You call down a blessing in the name of an angel of protection. A creature you can see within range shimmers with a faint white light. The next time the creature takes damage, it rolls a d4 and reduces the damage by the result. The spell then ends.",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "Cantrip",
        "level_int": "0",
        "school": "Abjuration",
        "class": "Cleric, Warlock, Wizard"
    },
    {
        "name": "Bestial Fury",
        "desc": "You instill primal fury into a creature you can see within range. The target must make a Charisma saving throw; a creature can choose to fail this saving throw. On a failure, the target must use its action to attack its nearest enemy it can see with unarmed strikes or natural weapons. For the duration, the target’s attacks deal an extra 1d6 damage of the same type dealt by its weapon, and the target can’t be charmed or frightened. If there are no enemies within reach, the target can use its action to repeat the saving throw, ending the effect on a success.\n\nThis spell has no effect on undead or constructs.\n",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "level_int": "2",
        "school": "enchantment"
    },
    {
        "name": "Binding Oath",
        "desc": "You seal an agreement between two or more willing creatures with an oath in the name of the god of justice, using ceremonial blessings during which both the oath and the consequences of breaking it are set: if any of the sworn break this vow, they are struck by a curse. For each individual that does so, you choose one of the options given in the //[[[srd-spell:bestow curse]]]// spell. When the oath is broken, all participants are immediately aware that this has occurred, but they know no other details.\n\nThe curse effect of binding oath can’t be dismissed by //[[[srd-spell:dispel magic]]]//, but it can be removed with //[[[srd-spell:dispel evil and good]]], [[[srd-spell:remove curse]]]//, or //[[[srd-spell:wish]]]//. Remove curse functions only if the spell slot used to cast it is equal to or higher than the spell slot used to cast //binding oath//. Depending on the nature of the oath, one creature’s breaking it may or may not invalidate the oath for the other targets. If the oath is completely broken, the spell ends for every affected creature, but curse effects already bestowed remain until dispelled.",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Until dispelled",
        "concentration": "no",
        "casting_time": "10 minutes",
        "level": "4th-level",
        "level_int": "4",
        "school": "necromancy",
        "class": "Bard, Cleric, Paladin"
    },
    {
        "name": "Biting Arrow",
        "desc": "As part of the action used to cast this spell, you make a ranged weapon attack with a bow, a crossbow, or a thrown weapon. The effect is limited to a range of 120 feet despite the weapon’s range, and the attack is made with disadvantage if the target is in the weapon’s long range.\n\nIf the weapon attack hits, it deals damage as usual. In addition, the target becomes coated in thin frost until the start of your next turn. If the target uses its reaction before the start of your next turn, it immediately takes 1d6 cold damage and the spell ends.\n\nThe spell’s damage, for both the ranged attack and the cold damage, increases by 1d6 when you reach 5th level (+1d6 and 2d6), 11th level (+2d6 and 3d6), and 17th level (+3d6 and 4d6).",
        "range": "Self",
        "components": "V, M",
        "material": "an arrow or a thrown weapon",
        "ritual": "no",
        "duration": "1 round",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "level_int": "0",
        "school": "Evocation",
        "class": "Druid, Sorcerer, Wizard",
        "damage_type": [
            "cold"
        ]
    },
    {
        "name": "Bitter Chains",
        "desc": "The spiked ring in your hand expands into a long, barbed chain to ensnare a creature you touch. Make a melee spell attack against the target. On a hit, the target is bound in metal chains for the duration. While bound, the target can move only at half speed and has disadvantage on attack rolls, saving throws, and Dexterity checks. If it moves more than 5 feet during a turn, it takes 3d6 piercing damage from the barbs.\n\nThe creature can escape from the chains by using an action and making a successful Strength or Dexterity check against your spell save DC, or if the chains are destroyed. The chains have AC 18 and 20 hit points.",
        "range": "Touch",
        "components": "V, S, M",
        "material": "a spiked metal ring",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "level_int": "2",
        "school": "transmutation",
        "class": "Sorcerer, Warlock, Wizard",
        "rolls-attack": true,
        "damage_type": [
            "piercing"
        ]
    },
    {
        "name": "Black Goat’s Blessing",
        "desc": "You raise your hand with fingers splayed and utter an incantation of the Black Goat with a Thousand Young. Your magic is blessed with the eldritch virility of the All‑Mother. The target has disadvantage on saving throws against spells you cast until the end of your next turn.",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "1 round",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "level_int": "0",
        "school": "Enchantment",
        "class": "Bard, Cleric, Druid, Paladin, Ranger, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Black Hand",
        "desc": "You gather the powers of darkness into your fist and fling dark, paralyzing flame at a target within 30 feet. If you make a successful ranged spell attack, this spell siphons vitality from the target into you. For the duration, the target has disadvantage (and you have advantage) on attack rolls, ability checks, and saving throws made with Strength, Dexterity, or Constitution. An affected target makes a Constitution saving throw (with disadvantage) at the end of its turn, ending the effect on a success.",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "level_int": "4",
        "school": "necromancy",
        "class": "Warlock, Wizard",
        "rolls-attack": true
    },
    {
        "name": "Black Ribbons",
        "desc": "You pull pieces of the plane of shadow into your own reality, causing a 20-foot cube to fill with inky ribbons that turn the area into difficult terrain and wrap around nearby creatures. Any creature that ends its turn in the area becomes restrained by the ribbons until the end of its next turn, unless it makes a successful Dexterity saving throw. Once a creature succeeds on this saving throw, it can’t be restrained again by the ribbons, but it’s still affected by the difficult terrain.",
        "range": "40 feet",
        "components": "V, S, M",
        "material": "a piece of ribbon",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "1st-level",
        "level_int": "1",
        "school": "conjuration",
        "class": "Sorcerer, Warlock, Wizard",
        "shape": " cube"
    },
    {
        "name": "Black Sunshine",
        "desc": "You hold up a flawed pearl and it disappears, leaving behind a magic orb in your hand that pulses with dim purple light. Allies that you designate become invisible if they're within 60 feet of you and if light from the orb can reach the space they occupy. An invisible creature still casts a faint, purple shadow.\n\nThe orb can be used as a thrown weapon to attack an enemy. On a hit, the orb explodes in a flash of light and the spell ends. The targeted enemy and each creature within 10 feet of it must make a successful Dexterity saving throw or be blinded for 1 minute. A creature blinded in this way repeats the saving throw at the end of each of its turns, ending the effect on itself on a success.",
        "range": "Self (60-foot radius)",
        "components": "V, M",
        "material": "a discolored pearl, which the spell consumes",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "8th-level",
        "level_int": "8",
        "school": "illusion",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Black Swan Storm",
        "desc": "You call forth a whirlwind of black feathers that fills a 5-foot cube within range. The feathers deal 2d8 force damage to creatures in the cube’s area and radiate darkness, causing the illumination level within 20 feet of the cube to drop by one step (from bright light to dim light, and from dim light to darkness). Creatures that make a successful Dexterity saving throw take half the damage and are still affected by the change in light.\n",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the feathers deal an extra 1d8 force damage for each slot level above 2nd.",
        "range": "30 feet",
        "components": "V, S, M",
        "material": "a feather from a black swan",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "level_int": "2",
        "school": "evocation",
        "class": "Sorcerer, Warlock, Wizard",
        "shape": " cube",
        "damage_type": [
            "force"
        ]
    },
    {
        "name": "Black Well",
        "desc": "You summon a seething sphere of dark energy 5 feet in diameter at a point within range. The sphere pulls creatures toward it and devours the life force of those it envelops. Every creature other than you that starts its turn within 90 feet of the black well must make a successful Strength saving throw or be pulled 50 feet toward the well. A creature pulled into the well takes 6d8 necrotic damage and is stunned; a successful Constitution saving throw halves the damage and causes the creature to become incapacitated. A creature that starts its turn inside the well also makes a Constitution saving throw; the creature is stunned on a failed save or incapacitated on a success. An incapacitated creature that leaves the well recovers immediately and can take actions and reactions on that turn. A creature takes damage only upon entering the well—it takes no additional damage for remaining there—but if it leaves the well and is pulled back in again, it takes damage again. A total of nine Medium creatures, three Large creatures, or one Huge creature can be inside the well’s otherdimensional space at one time. When the spell’s duration ends, all creatures inside it tumble out in a heap, landing prone.\n",
        "higher_level": "When you cast this spell using a spell slot of 7th level or higher, the damage dealt by the well increases by 1d8—and the well pulls creatures an additional 5 feet—for each slot level above 6th.",
        "range": "300 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "6th-level",
        "level_int": "6",
        "school": "necromancy",
        "shape": " sphere",
        "damage_type": [
            "necrotic"
        ]
    },
    {
        "name": "Blade of my Brother",
        "desc": "You touch a melee weapon that was used by an ally who is now dead, and it leaps into the air and flies to another ally (chosen by you) within 15 feet of you. The weapon enters that ally’s space and moves when the ally moves. If the weapon or the ally is forced to move more than 5 feet from the other, the spell ends.\n\nThe weapon acts on your turn by making an attack if a target presents itself. Its attack modifier equals your spellcasting level + the weapon’s inherent magical bonus, if any; it receives only its own inherent magical bonus to damage. The weapon fights for up to 4 rounds or until your concentration is broken, after which the spell ends and it falls to the ground.",
        "range": "Touch",
        "components": "V, S, M",
        "material": "melee weapon owned by a dead ally of the target",
        "ritual": "no",
        "duration": "Up to 4 rounds",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "level_int": "4",
        "school": "transmutation",
        "class": "Cleric, Paladin"
    },
    {
        "name": "Blade of Wrath",
        "desc": "You create a sword of pure white fire in your free hand. The blade is similar in size and shape to a longsword, and it lasts for the duration. The blade disappears if you let go of it, but you can call it forth again as a bonus action.\n\nYou can use your action to make a melee spell attack with the blade. On a hit, the target takes 2d8 fire damage and 2d8 radiant damage. An aberration, fey, fiend, or undead creature damaged by the blade must succeed on a Wisdom saving throw or be frightened until the start of your next turn.\n\nThe blade sheds bright light in a 20-foot radius and dim light for an additional 20 feet.\n",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, either the fire damage or the radiant damage (your choice) increases by 1d8 for each slot level above 3rd.",
        "range": "Self",
        "components": "V, S, M",
        "material": "a rebuke of evil, written in Celestial",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 bonus action",
        "level": "3rd-level",
        "level_int": "3",
        "school": "evocation",
        "class": "Cleric, Paladin, Warlock, Wizard",
        "rolls-attack": true,
        "damage_type": [
            "fire",
            "radiant"
        ]
    },
    {
        "name": "Blazing Chariot",
        "desc": "Calling upon the might of the angels, you conjure a flaming chariot made of gold and mithral in an unoccupied 10-foot‐square space you can see within range. Two horses made of fire and light pull the chariot. You and up to three other Medium or smaller creatures you designate can board the chariot (at the cost of 5 feet of movement) and are unharmed by the flames. Any other creature that touches the chariot or hits it (or a creature riding in it) with a melee attack while within 5 feet of the chariot takes 3d6 fire damage and 3d6 radiant damage. The chariot has AC 18 and 50 hit points, is immune to fire, poison, psychic, and radiant damage, and has resistance to all other nonmagical damage. The horses are not separate creatures but are part of the chariot. The chariot vanishes if it is reduced to 0 hit points, and any creature riding it falls out. The chariot has a speed of 50 feet and a flying speed of 40 feet.\n\nOn your turn, you can guide the chariot in place of your own movement. You can use a bonus action to direct it to take the Dash, Disengage, or Dodge action. As an action, you can use the chariot to overrun creatures in its path. On this turn, the chariot can enter a hostile creature’s space. The creature takes damage as if it had touched the chariot, is shunted to the nearest unoccupied space that it can occupy, and must make a successful Strength saving throw or fall prone in that space.",
        "range": "30 feet",
        "components": "V, S, M",
        "material": "a small golden wheel worth 250 gp",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "5th-level",
        "level_int": "5",
        "school": "conjuration",
        "class": "Cleric, Paladin, Warlock, Wizard"
    },
    {
        "name": "Bleating Call",
        "desc": "You create a sound on a point within range. The sound’s volume can range from a whisper to a scream, and it can be any sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.\n\nEach creature that starts its turn within 30 feet of the sound and can hear it must make a Wisdom saving throw. On a failed save, the target must take the Dash or Disengage action and move toward the sound by the safest available route on each of its turns. When it arrives to the source of the sound, the target must use its action to examine the sound. Once it has examined the sound, the target determines the sound is illusory and can no longer hear it, ending the spell’s effects on that target and preventing the target from being affected by the sound again for the duration of the spell. If a target takes damage from you or a creature friendly to you, it is no longer under the effects of this spell.\n\nCreatures that can’t be charmed are immune to this spell.",
        "range": "90 feet",
        "components": "S, M",
        "material": "a bit of fur or hair from a young beast or humanoid",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "level_int": "2",
        "school": "enchantment",
        "class": "Bard, Ranger, Sorcerer, Wizard"
    },
    {
        "name": "Bleed",
        "desc": "Crackling energy coats the blade of one weapon you are carrying that deals slashing damage. Until the spell ends, when you hit a creature with the weapon, the weapon deals an extra 1d4 necrotic damage and the creature must make a Constitution saving throw. On a failed save, the creature suffers a bleeding wound. Each time you hit a creature with this weapon while it suffers from a bleeding wound, your weapon deals an extra 1 necrotic damage for each time you have previously hit the creature with this weapon (to a maximum of 10 necrotic damage).\n\nAny creature can take an action to stanch the bleeding wound by succeeding on a Wisdom (Medicine) check against your spell save DC. The wound also closes if the target receives magical healing. This spell has no effect on undead or constructs.",
        "range": "Self",
        "components": "V, S, M",
        "material": "a drop of blood",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 bonus action",
        "level": "1st-level",
        "level_int": "1",
        "school": "necromancy",
        "class": "Ranger, Warlock",
        "damage_type": [
            "slashing"
        ]
    },
    {
        "name": "Bless the Dead",
        "desc": "You grant a blessing to one deceased creature, enabling it to cross over to the realm of the dead in peace. A creature that benefits from //bless the dead// can’t become undead. The spell has no effect on living creatures or the undead.",
        "range": "Touch",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "level_int": "0",
        "school": "Abjuration",
        "class": "Cleric, Druid, Warlock"
    },
    {
        "name": "Blessed Halo",
        "desc": "A nimbus of golden light surrounds your head for the duration. The halo sheds bright light in a 20-foot radius and dim light for an additional 20 feet.\n\nThis spell grants you a pool of 10 points of healing. When you cast the spell and as an action on subsequent turns during the spell’s duration, you can expend points from this pool to restore an equal number of hit points to one creature within 20 feet that you can see.\n\nAdditionally, you have advantage on Charisma checks made against good creatures within 20 feet.\n\nIf any of the light created by this spell overlaps an area of magical darkness created by a spell of 2nd level or lower, the spell that created the darkness is dispelled.\n",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the spell’s pool of healing points increases by 5 for each spell slot above 2nd, and the spell dispels magical darkness created by a spell of a level equal to the slot used to cast this spell.",
        "range": "Self",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "level_int": "2",
        "school": "evocation",
        "class": "Cleric, Paladin, Warlock, Wizard"
    },
    {
        "name": "Blizzard",
        "desc": "A howling storm of thick snow and ice crystals appears in a cylinder 40 feet high and 40 feet in diameter within range. The area is heavily obscured by the swirling snow. When the storm appears, each creature in the area takes 8d8 cold damage, or half as much damage with a successful Constitution saving throw. A creature also makes this saving throw and takes damage when it enters the area for the first time on a turn or ends its turn there. In addition, a creature that takes cold damage from this spell has disadvantage on Constitution saving throws to maintain concentration until the start of its next turn.",
        "range": "100 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "7th-level",
        "level_int": "7",
        "school": "conjuration",
        "class": "Sorcerer, Warlock, Wizard",
        "shape": " cylinder",
        "damage_type": [
            "cold"
        ]
    },
    {
        "name": "Blood and Steel",
        "desc": "When you cast this spell, you cut your hand and take 1d4 slashing damage that can’t be healed until you take a long rest. You then touch a construct; it must make a successful Constitution saving throw or be charmed by you for the duration. If you or your allies are fighting the construct, it has advantage on the saving throw. Even constructs that are immune to charm effects can be affected by this spell.\n\nWhile the construct is charmed, you have a telepathic link with it as long as the two of you are on the same plane of existence. You can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as, “Attack the ghouls,” “Block the bridge,” or, “Fetch that bucket.” If the construct completes the order and doesn’t receive further direction from you, it defends itself.\n\nYou can use your action to take total and precise control of the target. Until the end of your next turn, the construct takes only the actions you specify and does nothing you haven’t ordered it to do. During this time, you can also cause the construct to use a reaction, but doing this requires you to use your own reaction as well.\n\nEach time the construct takes damage, it makes a new Constitution saving throw against the spell. If the saving throw succeeds, the spell ends.\n\nIf the construct is already under your control when the spell is cast, it gains an Intelligence of 10 (unless its own Intelligence is higher, in which case it retains the higher score) for 4 hours. The construct is capable of acting independently, though it remains loyal to you for the spell’s duration. You can also grant the target a bonus equal to your Intelligence modifier on one skill in which you have proficiency.\n",
        "higher_level": "When you cast this spell using a 5th‑level spell slot, the duration is concentration, up to 10 minutes. When you use a 6th-level spell slot, the duration is concentration, up to 1 hour. When you use a spell slot of 7th level or higher, the duration is concentration, up to 8 hours.",
        "range": "Touch",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "level_int": "4",
        "school": "transmutation",
        "class": "Cleric, Sorcerer, Wizard",
        "damage_type": [
            "slashing"
        ]
    },
    {
        "name": "Blood Armor",
        "desc": "When you strike a foe with a melee weapon attack, you can immediately cast //blood armor// as a bonus action. The foe you struck must contain blood; if the target doesn’t bleed, the spell ends without effect. The blood flowing from your foe magically increases in volume and forms a suit of armor around you, granting you an Armor Class of 18 + your Dexterity modifier for the spell’s duration. This armor has no Strength requirement, doesn’t hinder spellcasting, and doesn’t incur disadvantage on Dexterity (Stealth) checks.\n\nIf the creature you struck was a celestial, //blood armor// also grants you advantage on Charisma saving throws for the duration of the spell.",
        "range": "Self",
        "components": "V, S",
        "material": "you must have just struck a foe with a melee weapon",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 bonus action",
        "level": "3rd-level",
        "level_int": "3",
        "school": "necromancy",
        "class": "Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Blood Lure",
        "desc": "You point at any location (a jar, a bowl, even a puddle) within range that contains at least a pint of blood. Each creature that feeds on blood and is within 60 feet of that location must make a Charisma saving throw. (This includes undead, such as vampires.) A creature that has Keen Smell or any similar scent-boosting ability has disadvantage on the saving throw, while undead have advantage on the saving throw. On a failed save, the creature is attracted to the blood and must move toward it unless impeded.\n\nOnce an affected creature reaches the blood, it tries to consume it, foregoing all other actions while the blood is present. A successful attack against an affected creature ends the effect, as does the consumption of the blood, which requires an action by an affected creature.",
        "range": "10 feet",
        "components": "V, S, M",
        "material": "a container or pool of blood",
        "ritual": "no",
        "duration": "1 minute",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "level_int": "2",
        "school": "enchantment",
        "class": "Cleric, Sorcerer, Wizard"
    },
    {
        "name": "Blood Offering",
        "desc": "You touch the corpse of a creature that isn’t undead or a construct and consume its life force. You must have dealt damage to the creature before it died, and it must have been dead for no more than 1 hour. You regain a number of hit points equal to 1d4 × the creature's challenge rating (minimum of 1d4). The creature can be restored to life only by means of a //[[[srd-spell:true resurrection]]]// or a //[[[srd-spell:wish]]]// spell.",
        "range": "Touch",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 minute",
        "level": "3rd-level",
        "level_int": "3",
        "school": "necromancy",
        "class": "Druid, Ranger, Sorcerer, Warlock, Wizard"
    },
    {
        "name": "Blood Puppet",
        "desc": "With a sample of its blood, you are able to magically control a creature’s actions, like a marionette on magical strings. Choose a creature you can see within range whose blood you hold. The target must succeed on a Constitution saving throw, or you gain control over its physical activity (as long as you interact with the blood material component each round). As a bonus action on your turn, you can direct the creature to perform various activities. You can specify a simple and general course of action, such as, “Attack that creature,” “Run over there,” or, “Fetch that object.” If the creature completes the order and doesn’t receive further direction from you, it defends and preserves itself to the best of its ability. The target is aware of being controlled. At the end of each of its turns, the target can make another Constitution saving throw. On a success, the spell ends.",
        "range": "100 feet",
        "components": "V, M",
        "material": "a drop of blood from the target",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "level_int": "4",
        "school": "transmutation",
        "class": "Cleric, Sorcerer, Wizard"
    },
    {
        "name": "Blood Scarab",
        "desc": "Your blood is absorbed into the beetle’s exoskeleton to form a beautiful, rubylike scarab that flies toward a creature of your choice within range. The target must make a successful Constitution saving throw or take 1d6 necrotic damage. You gain temporary hit points equal to the necrotic damage dealt.\n",
        "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, the number of scarabs increases by one for each slot level above 1st. You can direct the scarabs at the same target or at different targets. Each target makes a single saving throw, regardless of the number of scarabs targeting it.",
        "range": "30 feet",
        "components": "V, M",
        "material": "a drop of the caster’s blood, and the exoskeleton of a scarab beetle",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "level_int": "1",
        "school": "necromancy",
        "class": "Cleric, Warlock",
        "damage_type": [
            "necrotic"
        ]
    },
    {
        "name": "Blood Spoor",
        "desc": "By touching a drop of your quarry’s blood (spilled or drawn within the past hour), you can follow the creature’s trail unerringly across any surface or under water, no matter how fast you are moving. If your quarry takes flight, you can follow its trail along the ground—or through the air, if you have the means to fly.\n\nIf your quarry moves magically (such as by way of a //[[[srd-spell:dimension door]]]// or a //[[[srd-spell:teleport]]]// spell), you sense its trail as a straight path leading from where the magical movement started to where it ended. Such a route might lead through lethal or impassable barriers. This spell even reveals the route of a creature using //[[[srd-spell:pass without trace]]]//, but it fails to locate a creature protected by //[[[srd-spell:nondetection]]]// or by other effects that prevent //[[[srd-spell:scrying]]]// spells or cause //[[[srd-spell:divination]]]// spells to fail. If your quarry moves to another plane, its trail ends without trace, but //blood spoor// picks up the trail again if the caster moves to the same plane as the quarry before the spell’s duration expires.",
        "range": "Self",
        "components": "V, S, M",
        "material": "a drop of the quarry’s blood",
        "ritual": "no",
        "duration": "Up to 10 minutes",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "level_int": "4",
        "school": "divination"
    },
    {
        "name": "Blood Tide",
        "desc": "When you cast this spell, a creature you designate within range must succeed on a Constitution saving throw or bleed from its nose, eyes, ears, and mouth. This bleeding deals no damage but imposes a –2 penalty on the creature’s Intelligence, Charisma, and Wisdom checks. //Blood tide// has no effect on undead or constructs.\n\nA bleeding creature might attract the attention of creatures such as stirges, sharks, or giant mosquitoes, depending on the circumstances.\n\nA //[[[srd-spell:cure wounds]]]// spell stops the bleeding before the duration of blood tide expires, as does a successful DC 10 Wisdom (Medicine) check.\n\nThe spell’s duration increases to 2 minutes when you reach 5th level, to 10 minutes when you reach 11th level, and to 1 hour when you reach 17th level.",
        "range": "25 feet",
        "components": "V",
        "ritual": "no",
        "duration": "4 rounds",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "Cantrip",
        "level_int": "0",
        "school": "Necromancy",
        "class": "Sorcerer, Wizard"
    },
    {
        "name": "Blood to Acid",
        "desc": "When you cast this spell, you designate a creature within range and convert its blood into virulent acid. The target must make a Constitution saving throw. On a failed save, it takes 10d12 acid damage and is stunned by the pain for 1d4 rounds. On a successful save, it takes half the damage and isn’t stunned.\n\nCreatures without blood, such as constructs and plants, are not affected by this spell. If //blood to acid// is cast on a creature composed mainly of blood, such as a [[[monster:blood elemental]]] or a [[[monster:blood zombie]]], the creature is slain by the spell if its saving throw fails.",
        "range": "60 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "9th-level",
        "level_int": "9",
        "school": "transmutation",
        "damage_type": [
            "acid"
        ]
    },
    {
        "name": "Bloodhound",
        "desc": "You touch a willing creature to grant it an enhanced sense of smell. For the duration, that creature has advantage on Wisdom (Perception) checks that rely on smell and on Wisdom (Survival) checks to follow tracks.\n",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you also grant the target blindsight out to a range of 30 feet for the duration.",
        "range": "Touch",
        "components": "V, S, M",
        "material": "a drop of ammonia",
        "ritual": "no",
        "duration": "8 hours",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "level_int": "1",
        "school": "transmutation",
        "class": "Druid, Ranger, Sorcerer, Wizard"
    },
    {
        "name": "Bloodshot",
        "desc": "You launch a jet of boiling blood from your eyes at a creature within range. You take 1d6 necrotic damage and make a ranged spell attack against the target. If the attack hits, the target takes 2d10 fire damage plus 2d8 psychic damage.\n",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the fire damage increases by 1d10 for each slot level above 2nd.",
        "range": "40 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "level_int": "2",
        "school": "conjuration",
        "class": "Sorcerer, Warlock, Wizard",
        "rolls-attack": true,
        "damage_type": [
            "fire",
            "necrotic",
            "psychic"
        ]
    },
    {
        "name": "Bloody Hands",
        "desc": "You cause the hands (or other appropriate body parts, such as claws or tentacles) of a creature within range to bleed profusely. The target must succeed on a Constitution saving throw or take 1 necrotic damage each round and suffer disadvantage on all melee and ranged attack rolls that require the use of its hands for the spell’s duration.\n\nCasting any spell that has somatic or material components while under the influence of this spell requires a DC 10 Constitution saving throw. On a failed save, the spell is not cast but it is not lost; the casting can be attempted again in the next round.",
        "range": "30 feet",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "1st-level",
        "level_int": "1",
        "school": "necromancy",
        "class": "Sorcerer, Warlock, Wizard",
        "damage_type": [
            "necrotic"
        ]
    },
    {
        "name": "Bloody Smite",
        "desc": "The next time during the spell’s duration that you hit a creature with a melee weapon attack, your weapon pulses with a dull red light, and the attack deals an extra 1d6 necrotic damage to the target. Until the spell ends, the target must make a Constitution saving throw at the start of each of its turns. On a failed save, it takes 1d6 necrotic damage, it bleeds profusely from the mouth, and it can’t speak intelligibly or cast spells that have a verbal component. On a successful save, the spell ends. If the target or an ally within 5 feet of it uses an action to tend the wound and makes a successful Wisdom (Medicine) check against your spell save DC, or if the target receives magical healing, the spell ends.",
        "range": "Self",
        "components": "V",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 bonus action",
        "level": "1st-level",
        "level_int": "1",
        "school": "necromancy",
        "class": "Cleric, Druid, Ranger, Wizard",
        "damage_type": [
            "necrotic"
        ]
    },
    {
        "name": "Bloom",
        "desc": "You plant a silver acorn in solid ground and spend an hour chanting a litany of praises to the natural world, after which the land within 1 mile of the acorn becomes extremely fertile, regardless of its previous state. Any seeds planted in the area grow at twice the natural rate. Food harvested regrows within a week. After one year, the land slowly reverts to its normal fertility, unable to stave off the march of nature.\n\nChoose one of the following effects, which appears and grows immediately:\n* A field planted with vegetables of your choice, ready for harvest.\n* A thick forest of stout trees and ample undergrowth.\n* A grassland with wildflowers and fodder for grazing.\n* An orchard of fruit trees of your choice, growing in orderly rows and ready for harvest.\nLiving creatures that take a short rest within the area of a bloom spell receive the maximum hit points for Hit Dice expended. //Bloom// counters the effects of a //[[[spell:desolation]]]// spell.\n\n//**Ritual Focus.**// If you expend your ritual focus, the duration becomes permanent.",
        "range": "1 mile",
        "components": "V, S, M",
        "material": "a silver acorn worth 500 gp, which is consumed in the casting",
        "ritual": "yes",
        "duration": "1 year",
        "concentration": "no",
        "casting_time": "1 hour",
        "level": "8th-level",
        "level_int": "8",
        "school": "conjuration",
        "class": "Cleric, Druid, Wizard"
    },
    {
        "name": "Boiling Blood",
        "desc": "You cause the blood within a creature’s body to boil with supernatural heat. Choose one creature that you can see within range that isn’t a construct or an undead. The target must make a Constitution saving throw. On a successful save, it takes 2d6 fire damage and the spell ends. On a failed save, the creature takes 4d6 fire damage and is blinded. At the end of each of its turns, the target can make another Constitution saving throw. On a success, the spell ends. On a failure, the creature takes an additional 2d6 fire damage and remains blinded.\n",
        "higher_level": "When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them.",
        "range": "30 feet",
        "components": "V, S, M",
        "material": "a vial of blood",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "4th-level",
        "level_int": "4",
        "school": "necromancy",
        "class": "Sorcerer, Warlock, Wizard",
        "damage_type": [
            "fire"
        ]
    },
    {
        "name": "Boiling Oil",
        "desc": "You conjure a shallow, 15-foot-radius pool of boiling oil centered on a point within range. The pool is difficult terrain, and any creature that enters the pool or starts its turn there must make a Dexterity saving throw. On a failed save, the creature takes 3d8 fire damage and falls prone. On a successful save, a creature takes half as much damage and doesn’t fall prone.\n",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "a vial of oil",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "2nd-level",
        "level_int": "2",
        "school": "conjuration",
        "class": "Sorcerer, Wizard",
        "damage_type": [
            "fire"
        ]
    },
    {
        "name": "Bolster Undead",
        "desc": "You suffuse an area with negative energy to increase the difficulty of harming or affecting undead creatures.\n\nChoose up to three undead creatures within range. When a targeted creature makes a saving throw against being turned or against spells or effects that deal radiant damage, the target has advantage on the saving throw.\n",
        "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, you can affect one additional undead creature for each slot level above 1st.",
        "range": "60 feet",
        "components": "V, S, M",
        "material": "a sprinkle of unholy water",
        "ritual": "no",
        "duration": "1 hour",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "1st-level",
        "level_int": "1",
        "school": "necromancy",
        "class": "Cleric, Sorcerer, Warlock, Wizard",
        "damage_type": [
            "radiant"
        ]
    },
    {
        "name": "Booster Shot",
        "desc": "You imbue a two-handed ranged weapon (typically a shortbow, longbow, light crossbow, or heavy crossbow) that you touch with a random magical benefit. While the spell lasts, a projectile fired from the weapon has an effect that occurs on a hit in addition to its normal damage. Roll a d6 to determine the additional effect for each casting of this spell.\n||~ D6 ||~ EFFECT ||\n|| 1 || 2d10 acid damage to all creatures within 10 feet of the target ||\n|| 2 || 2d10 lightning damage to the target and 1d10 lightning damage to all creatures in a 5-foot-wide line between the weapon and the target ||\n|| 3 || 2d10 necrotic damage to the target, and the target has disadvantage on its first attack roll before the start of the weapon user’s next turn ||\n|| 4 || 2d10 cold damage to the target and 1d10 cold damage to all other creatures in a 60-foot cone in front of the weapon ||\n|| 5 || 2d10 force damage to the target, and the target is pushed 20 feet ||\n|| 6 || 2d10 psychic damage to the target, and the target is stunned until the start of the weapon user’s next turn ||\n",
        "higher_level": "When you cast this spell using a spell slot of 4th level or higher, all damage increases by 1d10 for each slot level above 3rd.",
        "range": "Touch",
        "components": "V, S",
        "ritual": "no",
        "duration": "Up to 1 minute",
        "concentration": "yes",
        "casting_time": "1 action",
        "level": "3rd-level",
        "level_int": "3",
        "school": "evocation",
        "class": "Ranger, Sorcerer, Warlock",
        "shape": " cone",
        "damage_type": [
            "acid",
            "cold",
            "force",
            "lightning",
            "necrotic",
            "psychic"
        ]
    },
    {
        "name": "Boreas’s Breath",
        "desc": "You freeze standing water in a 20-foot cube or running water in a 10-foot cube centered on you. The water turns to solid ice. The surface becomes difficult terrain, and any creature that ends its turn on the ice must make a successful DC 10 Dexterity saving throw or fall prone.\n\nCreatures that are partially submerged in the water when it freezes become restrained. While restrained in this way, a creature takes 1d6 cold damage at the end of its turn. It can break free by using an action to make a successful Strength check against your spell save DC.\n\nCreatures that are fully submerged in the water when it freezes become incapacitated and cannot breathe. While incapacitated in this way, a creature takes 2d6 cold damage at the end of its turn. A trapped creature makes a DC 20 Strength saving throw after taking this damage at the end of its turn, breaking free from the ice on a success.\n\nThe ice has AC 10 and 15 hit points. It is vulnerable to fire damage, has resistance to nonmagical slashing and piercing damage, and is immune to cold, necrotic, poison, psychic, and thunder damage.\n",
        "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the size of the cube increases by 10 feet for each slot level above 2nd.",
        "range": "Self",
        "components": "V, S",
        "ritual": "yes",
        "duration": "Instantaneous",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "2nd-level",
        "level_int": "2",
        "school": "transmutation",
        "class": "Cleric, Druid, Ranger, Wizard",
        "shape": " cube",
        "damage_type": [
            "cold"
        ]
    },
    {
        "name": "Bottled Arcana",
        "desc": "By touching an empty, stoppered glass container such as a vial or flask, you magically enable it to hold a single spell. To be captured, the spell must be cast within 1 round of casting //bottled arcana// and it must be intentionally cast into the container. The container can hold one spell of 3rd level or lower. The spell can be held in the container for as much as 24 hours, after which the container reverts to a mundane vessel and any magic inside it dissipates harmlessly.\n\nAs an action, any creature can unstop the container, thereby releasing the spell. If the spell has a range of self, the creature opening the container is affected; otherwise, the creature opening the container designates the target according to the captured spell’s description. If a creature opens the container unwittingly (not knowing that the container holds a spell), the spell targets the creature opening the container or is centered on its space instead (whichever is more appropriate). //[[[srd-spell:Dispel magic]]]// cast on the container targets //bottled arcana//, not the spell inside. If //bottled arcana// is dispelled, the container becomes mundane and the spell inside dissipates harmlessly.\n\nUntil the spell in the container is released, its caster can’t regain the spell slot used to cast that spell. Once the spell is released, its caster regains the use of that slot normally.\n",
        "higher_level": "When you cast this spell using a spell slot of 6th level or higher, the level of the spell the container can hold increases by one for every slot level above 5th.",
        "range": "Touch",
        "components": "V, S, M",
        "material": "an empty glass container",
        "ritual": "no",
        "duration": "See below",
        "concentration": "no",
        "casting_time": "1 action",
        "level": "5th-level",
        "level_int": "5",
        "school": "transmutation"
    }
]