[
  {
    "name": "Skysail",
    "desc": "These bat-like wings affixed to a pole are constructed out of either bone and leather or wood and cloth. While these wings are opened and the rung of the pole stepped into, you can use an action to cast _levitate_ on yourself at will.\nAdditionally, you can use an action to cast _fly_ on yourself for up to 1 minute (no concentration required). The _fly_ spell ends if you lose physical contact with the skysail. You cannot use this ability again until you complete a long rest, or you (and the Skysail) are immersed in extremely powerful air elemental magic, such as within the Elemental Plane of Air. When not in use, these wings can be easily folded together and worn beneath a cloak, and the pole used as a quarterstaff.",
    "type": "Wondrous item",
    "rarity": "rare",
    "requires-attunement": "requires attunement",
    "page_no": 45
  },
  {
    "name": "Cloak of Ruin",
    "desc": "This cloak of dark leather and gold trim seems to occasionally shimmer with small sparks of blue energy across the shadowed lining. This cloak has 4 charges, and regains 1d4 expended charges daily at dawn. When you are targeted by an enemy’s spell, you can use your reaction to have the cloak swallow part of the spell. The cloak gains a number of charges equal to the spell level of the triggering spell. You are still subject to whatever effects the spell would normally inflict on you. You cannot use this ability again until you finish a short or long rest. When you hit with an attack, you can choose to expend any number of charges from the cloak, dealing an additional 1d6 lightning damage per charge expended, which is inflicted on the target of that attack. If your attack strikes multiple targets, you must choose one target from the group to be subject to this damage.\n\n##### Awakened \nWhen a character awakens a cloak of ruin, apply the following changes to the item’s traits:\n\n* You gain advantage on all saving throws against spells and other magical effects while wearing this cloak.\n* The cloak’s maximum charges becomes 6, and it regains 1d4+2 charges daily at dawn.\n* When using the cloak’s ability to swallow a spell, you gain resistance to the damage of that spell.\n\n##### Exalted \nWhen a character exalts a cloak of ruin, apply the following changes to the item’s traits:\n\n* The cloak’s maximum charges becomes 10, and it regains 1d6+4 charges daily at dawn.",
    "type": "Wondrous item",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 112
  }
]
