[
  {
    "name": "Skysail",
    "desc": "These bat-like wings affixed to a pole are constructed out of either bone and leather or wood and cloth. While these wings are opened and the rung of the pole stepped into, you can use an action to cast _levitate_ on yourself at will.\nAdditionally, you can use an action to cast _fly_ on yourself for up to 1 minute (no concentration required). The _fly_ spell ends if you lose physical contact with the skysail. You cannot use this ability again until you complete a long rest, or you (and the Skysail) are immersed in extremely powerful air elemental magic, such as within the Elemental Plane of Air. When not in use, these wings can be easily folded together and worn beneath a cloak, and the pole used as a quarterstaff.",
    "type": "Wondrous item",
    "rarity": "rare",
    "requires-attunement": "requires attunement",
    "page_no": 45
  },
  {
    "name": "Cloak of Ruin",
    "desc": "This cloak of dark leather and gold trim seems to occasionally shimmer with small sparks of blue energy across the shadowed lining. This cloak has 4 charges, and regains 1d4 expended charges daily at dawn. When you are targeted by an enemy’s spell, you can use your reaction to have the cloak swallow part of the spell. The cloak gains a number of charges equal to the spell level of the triggering spell. You are still subject to whatever effects the spell would normally inflict on you. You cannot use this ability again until you finish a short or long rest. When you hit with an attack, you can choose to expend any number of charges from the cloak, dealing an additional 1d6 lightning damage per charge expended, which is inflicted on the target of that attack. If your attack strikes multiple targets, you must choose one target from the group to be subject to this damage.\n\n##### Awakened \nWhen a character awakens a cloak of ruin, apply the following changes to the item’s traits:\n\n* You gain advantage on all saving throws against spells and other magical effects while wearing this cloak.\n* The cloak’s maximum charges becomes 6, and it regains 1d4+2 charges daily at dawn.\n* When using the cloak’s ability to swallow a spell, you gain resistance to the damage of that spell.\n\n##### Exalted \nWhen a character exalts a cloak of ruin, apply the following changes to the item’s traits:\n\n* The cloak’s maximum charges becomes 10, and it regains 1d6+4 charges daily at dawn.",
    "type": "Wondrous item",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 112
  },
  {
    "name": "Armor of Warding Death",
    "desc": "This beautiful, black leather armor is covered in intricate scrollwork, the mantle bearing black feathers of ravens. You gain a +1 bonus to AC while wearing this armor. You have advantage on death saving throws made while wearing this armor.\n\n##### Awakened\nWhen a character awakens Armor of Warding Death, apply the following changes to the item’s traits:\n\n* Increase the bonus to AC to a +2.\n* While wearing this attuned armor, the wearer chooses and imbues this armor with resistance to a damage type of your choice: fire, cold, acid, lightning, or necrotic. This choice can be changed during a short rest.\n\n##### Exalted\nWhen a character exalts Armor of Warding Death, apply the following changes to the item’s traits:\n\n* Increase the bonus to AC to a +3.\n* As a bonus action, you can grow large, black raven wings. These last for 1 hour, and grant a fly speed of 60 feet. You cannot use this ability again until you finish a long rest.",
    "type": "Armor (studded leather)",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 113
  },
  {
    "name": "Everbark Longow",
    "desc": "This gorgeous longbow made of everbark from the Feywild seems to flex and shift like a living entity. You gain a +1 bonus to attack and damage rolls made with this weapon. When firing an arrow from this weapon, you can declare an oracle shot, allowing you to project your sight through the arrow you fire for up to 10 minutes. You cannot use this ability again until you finish a short rest. When a creature is killed by an arrow from this weapon, a single 6-ft tree rapidly grows out of their corpse over the next minute.\n\n##### Awakened\nWhen a character awakens an everbark longow, apply the following changes to the item’s traits:\n\n* Increase the bonus to attack and damage rolls to a +2. Additionally when you hit with an attack using this weapon, the target takes an additional 1d4 lightning damage.\n* When you hit with an attack, you can declare a bramble shot. The target takes an additional 3d8 piercing damage, and they must make a DC 15 Strength saving throw or become restrained by the suddenly sprouting steel-hard thorn brambles that immediately grow from the arrow. The restrained target can repeat the saving throw at the end of each of its turns, ending the effect on a success. You cannot use this ability again until you finish a short or long rest.\n\n##### Exalted\nWhen a character exalts an everbark longow, apply the following changes to the item’s traits:\n* Increase the bonus to attack and damage rolls to a +3.\n* The lightning damage dealt by attacks with this weapon increases to 1d6.\n* You can use your bramble shot ability twice between rests, and the saving throw DC increases to 17.",
    "type": "Weapon (longbow)",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 113
  }
]
