[
  {
    "name": "Skysail",
    "desc": "These bat-like wings affixed to a pole are constructed out of either bone and leather or wood and cloth. While these wings are opened and the rung of the pole stepped into, you can use an action to cast _levitate_ on yourself at will.\nAdditionally, you can use an action to cast _fly_ on yourself for up to 1 minute (no concentration required). The _fly_ spell ends if you lose physical contact with the skysail. You cannot use this ability again until you complete a long rest, or you (and the Skysail) are immersed in extremely powerful air elemental magic, such as within the Elemental Plane of Air. When not in use, these wings can be easily folded together and worn beneath a cloak, and the pole used as a quarterstaff.",
    "type": "Wondrous item",
    "rarity": "rare",
    "requires-attunement": "requires attunement",
    "page_no": 45
  },
  {
    "name": "The Decadent End",
    "desc": "This blade appears to be a beautiful cruciform sword of shining silver, inlaid with sparkling rubies.\nYou gain a +3 bonus to attack and damage rolls made with this magic weapon. It has the following properties.\n\n##### Corrosive Submission\nWhen you hit a humanoid with this weapon, you may force it to take an additional 3d6 acid damage and it must make a DC 14 Charisma saving throw. On a failure, the creature is charmed by you for up to 1 hour. If you attack the creature again while charmed, the acid damage increases to 10d6 and the charm ends. It cannot be charmed again for 24 hours after the charm is ended in this way.\n\n##### Hidden Nature\nThe acid damage dealt by this greatsword appears to be radiant damage; Any creature who is successfully charmed by it is under the illusion that the damage to it was merely an admonishing jostle. A true seeing spell or similar reveals that this sword is actually a rusted, pitted blade dripping with acid.\n\n##### Sentience\nThe Decadent End is a sentient evil weapon with an Intelligence of 14, a Wisdom of 12, and a Charisma of 18. It has hearing and darkvision out to a range of 120 feet. The weapon can speak, read, and understand Common, and can communicate with its wielder telepathically. Those who hold it hear the wise voice of a sorrowful king, beckoning the user to seize their destiny.\n\n##### Personality\nThe Decadent End slowly attempts to sway the character into sowing chaos, telling lies about great leaders, claiming that they are corrupt and must be overthrown. The voice of this blade is actually a demon prince, speaking from his Abyssal prison. Should the wielder continue to disobey the urges of the weapon for an extended period of time, it can attempt to charm the wielder. They must make a Charisma saving throw (DC 14). On a success, they are immune to the sword’s charm for 24 hours. Upon a failure, they become charmed by the sword for 24 hours. During this time, the sword can force the character to take an action of its choice once an hour, the wielder accepting this action as their own will. Should the chosen action lead to the harm of a non-hostile creature or ally, the charm immediately breaks.",
    "type": "Weapon (greatsword)",
    "rarity": "artifact",
    "requires-attunement": "requires attunement",
    "page_no": 65
  },
  {
    "name": "Flail of Agony",
    "desc": "Utilized in countless tortures and slow executions, the hooked chains of this brutal weapon still smell of dried blood and rot. You gain a +2 bonus to damage rolls made with this magic weapon.\nWhen you hit with an attack using this weapon, and that creature was injured with this weapon on your previous attack, you deal an additional 1d6 piercing damage.\n\n##### Awakened\nWhen a character awakens the Flail of Agony, apply the following changes to the item’s traits:\n\n* The bonus to damage rolls is increased to +3.\n* The damage bonus to striking a creature you have already injured increases to 1d8.\n* When a creature is damaged by this weapon, they suffer disadvantage on Strength ability checks until the beginning of your next turn.\n* When you drop a creature to 0 hit points with an attack using the Flail of Agony, you can immediately make an additional melee attack with this weapon as a bonus action.\n\n##### Exalted\nWhen a character exalts the Flail of Agony, apply the following changes to the item’s traits:\n\n* The bonus to damage rolls is increased to +4.\n* The damage bonus to striking a creature you have already injured increases to 2d6.\n* When you score a critical hit with this weapon, the target must make a DC 17 Wisdom saving throw or become frightened of you for 1 minute. If this saving throw is successful, not only does the target not become frightened, they become immune to this frightening effect for the next 24 hours.",
    "type": "Weapon (flail)",
    "rarity": "legendary",
    "requires-attunement": "requires attunement by a non-good character",
    "page_no": 111
  },
  {
    "name": "Valiant Mail",
    "desc": "This antique armor is forged from jade and black dragon scales. You have a +1 bonus to AC while wearing this armor.\nYou can cast the _command_ spell (save DC 13) while attuned to this armor. You cannot use this ability again until you have completed a long rest.\n\n##### Awakened\nWhen a character awakens the Valiant Mail, apply the following changes to the item’s traits:\n\n* Increase the bonus to AC to +2.\n* You gain resistance to acid damage while wear- ing this armor.\n* You gain immunity to the frightened condition while wearing this armor.\n* The spell save DC of the armor’s command spell becomes DC 15, and it can target two additional creatures.\n\n##### Exalted\nWhen a character exalts the Valiant Mail, apply the following changes to the item’s traits:\n\n* Increase the bonus to AC to +3.\n* Your immunity to the frightened condition extends to include all friendly creatures within 15 feet, as long as you are conscious.\n* You gain immunity to acid damage while you are wear- ing this armor.\n* The spell save DC of the armor’s command spell becomes DC 17, and it can target four additional creatures.",
    "type": "Armor (scale)",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 111
  },
  {
    "name": "Cloak of Ruin",
    "desc": "This cloak of dark leather and gold trim seems to occasionally shimmer with small sparks of blue energy across the shadowed lining. This cloak has 4 charges, and regains 1d4 expended charges daily at dawn. When you are targeted by an enemy’s spell, you can use your reaction to have the cloak swallow part of the spell. The cloak gains a number of charges equal to the spell level of the triggering spell. You are still subject to whatever effects the spell would normally inflict on you. You cannot use this ability again until you finish a short or long rest. When you hit with an attack, you can choose to expend any number of charges from the cloak, dealing an additional 1d6 lightning damage per charge expended, which is inflicted on the target of that attack. If your attack strikes multiple targets, you must choose one target from the group to be subject to this damage.\n\n##### Awakened \nWhen a character awakens a cloak of ruin, apply the following changes to the item’s traits:\n\n* You gain advantage on all saving throws against spells and other magical effects while wearing this cloak.\n* The cloak’s maximum charges becomes 6, and it regains 1d4+2 charges daily at dawn.\n* When using the cloak’s ability to swallow a spell, you gain resistance to the damage of that spell.\n\n##### Exalted \nWhen a character exalts a cloak of ruin, apply the following changes to the item’s traits:\n\n* The cloak’s maximum charges becomes 10, and it regains 1d6+4 charges daily at dawn.",
    "type": "Wondrous item",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 112
  },
  {
    "name": "Barbed Circlet of Vision",
    "desc": "Upon wearing this circlet of gnarled onyx, black barbs dig into your head, imparting power as it twists your appearance. While wearing this circlet, your Charisma score decreases by 2. You also have advantage on initiative rolls.\nWhen you make an attack roll, you can use your reaction to gain a +5 bonus to the roll. You make this choice after you see the roll, but before the DM says whether the attack hits or misses. You cannot use this ability again until you finish a short or long rest.\n\n##### Awakened\nWhen a character awakens the Barbed Circlet of Vision, apply the following changes to the item’s traits:\n\n* You also gain resistance to poison damage, and gain immunity to the poisoned condition.\n* Your ability to gain a bonus to an attack roll can be used twice between rests.\n\n##### Exalted\nWhen a character exalts the Barbed Circlet of Vision, apply the following changes to the item’s traits:\n\n* You gain immunity to poison damage in addition to the poisoned condition.\n* You can also see invisible creatures and objects.\n* Your ability to gain a bonus to an attack roll can be used three times between rests.",
    "type": "Wondrous item",
    "rarity": "legendary",
    "requires-attunement": "requires attunement by a non-good character",
    "page_no": 112
  },
  {
    "name": "Crossbow of Condemnation",
    "desc": "This shadow-touched hand crossbow once served as the weapon of choice for a legendary assassin. You have a +1 bonus to attack rolls made with this weapon.\nWhen you hit with an attack using this weapon, the target takes an additional 1d4 poison damage. If you hit with an attack using this weapon, instead of dealing damage, you can choose one of two effects to trigger: A _fog cloud_ spell centered on the target, or a _silence_ spell centered on the target. You can use each effect once, and cannot use them again until you finish a short rest.\n\n##### Awakened\nWhen a character awakens the Crossbow of Condemnation, apply the following changes to the item’s traits:\n\n* Increase the bonus to attack rolls to a +2.\n* Increase the poison damage inflicted on a hit to 1d6 poison damage.\n* You gain an additional effect that can be triggered in place of damage: the target can be affected by a hold person spell (spell save DC 15).\n\n##### Exalted\nWhen a character exalts the Crossbow of Condemnation, apply the following changes to the item’s traits:\n\n* Increase the bonus to attack rolls to a +3.\n* Increase the poison damage inflicted on a hit to 1d8 poison damage.\n* The spell save DC for the hold person spell increases to DC 17.\n* You gain an additional effect that can be triggered in place of damage: the blight spell (spell save DC 17).",
    "type": "Weapon (heavy crossbow)",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 112
  },
  {
    "name": "Armor of Warding Death",
    "desc": "This beautiful, black leather armor is covered in intricate scrollwork, the mantle bearing black feathers of ravens. You gain a +1 bonus to AC while wearing this armor. You have advantage on death saving throws made while wearing this armor.\n\n##### Awakened\nWhen a character awakens Armor of Warding Death, apply the following changes to the item’s traits:\n\n* Increase the bonus to AC to a +2.\n* While wearing this attuned armor, the wearer chooses and imbues this armor with resistance to a damage type of your choice: fire, cold, acid, lightning, or necrotic. This choice can be changed during a short rest.\n\n##### Exalted\nWhen a character exalts Armor of Warding Death, apply the following changes to the item’s traits:\n\n* Increase the bonus to AC to a +3.\n* As a bonus action, you can grow large, black raven wings. These last for 1 hour, and grant a fly speed of 60 feet. You cannot use this ability again until you finish a long rest.",
    "type": "Armor (studded leather)",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 113
  },
  {
    "name": "Everbark Longow",
    "desc": "This gorgeous longbow made of everbark from the Feywild seems to flex and shift like a living entity. You gain a +1 bonus to attack and damage rolls made with this weapon. When firing an arrow from this weapon, you can declare an oracle shot, allowing you to project your sight through the arrow you fire for up to 10 minutes. You cannot use this ability again until you finish a short rest. When a creature is killed by an arrow from this weapon, a single 6-ft tree rapidly grows out of their corpse over the next minute.\n\n##### Awakened\nWhen a character awakens an everbark longow, apply the following changes to the item’s traits:\n\n* Increase the bonus to attack and damage rolls to a +2. Additionally when you hit with an attack using this weapon, the target takes an additional 1d4 lightning damage.\n* When you hit with an attack, you can declare a bramble shot. The target takes an additional 3d8 piercing damage, and they must make a DC 15 Strength saving throw or become restrained by the suddenly sprouting steel-hard thorn brambles that immediately grow from the arrow. The restrained target can repeat the saving throw at the end of each of its turns, ending the effect on a success. You cannot use this ability again until you finish a short or long rest.\n\n##### Exalted\nWhen a character exalts an everbark longow, apply the following changes to the item’s traits:\n* Increase the bonus to attack and damage rolls to a +3.\n* The lightning damage dealt by attacks with this weapon increases to 1d6.\n* You can use your bramble shot ability twice between rests, and the saving throw DC increases to 17.",
    "type": "Weapon (longbow)",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 113
  },
  {
    "name": "Shield of Honor",
    "desc": "This massive, silvered shield bearing the crest of a platinum dragon never tarnishes. The metal is warm to the touch. While holding the shield, you have a +1 bonus to AC. This bonus is in addition to the shield’s normal bonus to AC. You are also immune to the prone condition while bearing this shield.\n\n##### Awakened\nWhen a character awakens the Shield of Honor, apply the following changes to the item’s traits:\n\n* Increase the bonus to AC to a +2.\n* Whenever a creature’s attack against you misses, you can use your reaction to immediately attempt to make a shove attack against that creature.\n\n##### Exalted\nWhen a character exalts the Shield of Honor, apply the following changes to the item’s traits:\n\n* Increase the bonus to AC to a +3.\n* Using a bonus action, you can protect an adjacent ally, imparting +3 to their AC until the beginning of your next turn, or they are no longer adjacent to you (whichever comes first).",
    "type": "Armor (shield)",
    "rarity": "legendary",
    "requires-attunement": "requires attunement by a non-evil character",
    "page_no": 114
  },
  {
    "name": "Amulet of Change",
    "desc": "A beautiful, glittering emerald is set within the center of this silver chain, humming with power and possibility. While wearing this amulet, you gain a +1 bonus to all saving throws, and are immune to the grappled condition.\n\n##### Awakened\nWhen a character awakens the Amulet of Change, apply the following changes to the item’s traits:\n\n* Increase the bonus to all saving throws to a +2.\n* You become immune to the restrained condition as well as the grappled condition.\n* You may use an action to cast the spell blink on yourself without needing any components. You cannot use this ability again until you finish a long rest.\n\n##### Exalted\nWhen a character exalts the Amulet of Change, apply the following changes to the item’s traits:\n\n* Increase the bonus to all saving throws to a +3.\n* You become immune to the paralyzed and petrified conditions, as well as the grappled and restrained conditions.\n* Whenever you make an attack roll, an ability check, or a saving throw, you can choose to roll an additional d20. You can choose to do this after you roll the die, but before the outcome is determined. You choose which of the d20s is used for the attack roll, ability check, or saving throws. You cannot use this ability again until you finish a short or long rest.",
    "type": "Wondrous item",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 114
  },
  {
    "name": "Sword of Mythic Tales",
    "desc": "This incredible silvered blade has belonged to many master bards. It resonates with nearby musical tones. You have a +1 bonus to attack and damage rolls made with this weapon. Whenever you use your Bardic Inspiration feature, you gain advantage on attacks with this weapon until the end of your turn.\n\n##### Awakened\nWhen a character awakens the Sword of Mythic Tales, apply the following changes to the item’s traits:\n\n* Increase the bonus to attack and damage rolls to +2. In addition, targets damaged with this weapon take an additional 1d6 points of force damage.\n* Whenever you use your Cutting Words feature while wielding this blade, the target has disadvantage on their next saving throw.\n\n##### Exalted\nWhen a character exalts the Sword of Mythic Tales, apply the following changes to the item’s traits:\n\n* Increase the bonus to attack and damage rolls to +3.\n* You can spend an action to let the spirit of the sword overtake you momentarily. You make four melee attacks with this sword, then suffer one point of exhaustion. You cannot use this ability again until you finish a long rest.",
    "type": "Weapon (longsword)",
    "rarity": "legendary",
    "requires-attunement": "requires attunement by a bard",
    "page_no": 114
  },
  {
    "name": "Plate of Martyred Dawn",
    "desc": "Beautiful silver scrolling and priceless, cut rubies adorn this set of brass-and-gold armor. You gain a +1 bonus to AC while wearing this armor. When you are struck by a melee attack, you may use your reaction to cause the attacker to suffer 1d6 points of fire damage.\n\n#####Awakened\nWhen a character awakens the Plate of the Dawnmartyr, apply the following changes to the item’s traits:\n\n* Increase the bonus to AC from this armor to a +2.\n* You gain immunity to the frightened condition.\n* You gain resistance to fire damage.\n* The damage inflicted on an attacker by the armor increases to 2d6 fire damage.\n\n#####Exalted\nWhen a character exalts the Plate of the Dawnmartyr, apply the following changes to the item’s traits:\n\n* Increase the bonus to AC from this armor to a +3.\n* If you are knocked unconscious by an attack or spell, a blast of healing flame surrounds you. You immediately regain 1 hit point and are lifted to your feet. All enemy creatures within 10 feet of you suffer 2d6 fire damage. You cannot use this ability again until you finish a long rest.",
    "type": "Armor (plate)",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 115
  },
  {
    "name": "Maul of the Pyre",
    "desc": "Forged from deep red iron, this massive hammer houses an ever-burning gemstone of orange flame. You have a +1 bonus to attack rolls made with this weapon. When you hit with an attack using this weapon, the target takes an additional 1d6 fire damage.\nYou can choose to have this weapon shed bright light in a 30 foot radius and dim light for an additional 30 feet. If you kill a creature with an attack using this weapon, the corpse is immolated, turning to ash.\n\n#####Awakened\nWhen a character awakens the Maul of the Pyre, apply the following changes to the item’s traits:\n\n* Increase the bonus to attack rolls to a +2.\n* Increase the additional fire damage inflicted by a hit to 2d6.\n* As an action, you can slam the Maul of the Pyre into the ground to cast the burning hands spell at 2nd level (spell save DC 15). You cannot use this ability again until you finish a short or long rest.\n* When you score a critical hit with this weapon, the target must succeed on a DC 15 Strength saving throw or be knocked prone.\n\n#####Exalted\nWhen a character exalts the Maul of the Pyre, apply the following changes to the item’s traits:\n\n* Increase the bonus to attack rolls to a +3.\n* Increase the additional fire damage inflicted by a hit to 3d6.\n* Your burning hands ability is now cast at 3rd level, and the spell save DC increases to 17.\n* When you score a critical hit with this weapon, the target must succeed on a DC 17 Strength saving throw or be knocked prone. You can also roll an additional 3d6 fire damage when determining the extra damage for the critical hit.",
    "type": "Weapon (maul)",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 115
  },
  {
    "name": "Staff of Elemental Confluence",
    "desc": "A powerful relic passed down from generation to generation. The staff has 8 charges and regains 1d4 + 2 expended charges daily at dawn. While holding the staff, you can expend some of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: burning hands (1 charge), fireball (3 charges).\n\n#####Awakened\nWhen a character awakens the Staff of Elemental Confluence, apply the following changes to the item’s traits:\n\n* The staff’s charges increase to a maximum of 12, and it regains 1d6+2 charges at dawn daily.\n* Add the following spells to the list of spells the staff may be used to cast: ice storm (4 charges), conjure elemental (5 charges).\n* Whenever you cast a spell that deals fire, ice, or lightning damage and you roll a 1 on a damage die, you can reroll the die and must use the new result.\n\n#####Exalted\nWhen a character exalts the Staff of Elemental Confluence, apply the following changes to the item’s traits:\n\n* The staff’s charges increase to a maximum of 20, and it regains 1d6+4 charges at dawn daily.\n* Add the following spells to the list of spells the staff may be used to cast: chain lightning (6 charges), fire storm (7 charges).\n* While holding this staff, you gain a +1 bonus to spell attack rolls, and your spell save DC increases by 1.",
    "type": "Staff",
    "rarity": "legendary",
    "requires-attunement": "requires attunement by a spellcaster",
    "page_no": 115
  },
  {
    "name": "Knuckles of the Titan’s Stone",
    "desc": "Carved from the heartstone of a ruined earth primordial, these gauntlets bestow immeasurable might to the wearer. Your Strength score becomes 22.\n_Siege._ You deal double damage against objects and structures.\n\n#####Awakened\nWhen a character awakens the Knuckles of the Titan’s Stone, apply the following changes to the item’s traits:\n\n* Your Strength score becomes 24.\n* You can use an action to grow in size as per the enlarge spell for 10 minutes. You cannot use this ability again until you finish a long rest.\n\n#####Exalted\nWhen a character exalts the Knuckles of the Titan’s Stone, apply the following changes to the item’s traits:\n\n* Your Strength score becomes 26.\n* While you are under the effects of the enlarge spell granted by this item, you gain resistance to fire, cold, and lightning damage. This lasts as long as you are affected by the spell.",
    "type": "Wondrous item",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 116
  },
  {
    "name": "Whispering Blade",
    "desc": "Forged with a mercurial metal pulled from the Far Realm, light dances and shifts across this curved blade. You have a +1 bonus to attack and damage rolls made with this weapon. Whenever you strike a creature with a critical hit using the Whispering Blade, the target must make a DC 13 Wisdom saving throw or become frightened of you for 1 minute. On a success, they are immune to being frightened by this effect for the next 24 hours.\n\n#####Awakened\nWhen a character awakens the Whispering Blade, apply the following changes to the item’s traits:\n\n* Increase the bonus to attack and damage to a +2. Additionally, when you hit a target with this weapon, the target takes an additional 1d6 psychic damage.\n* Increase the DC to resist being frightened from a critical hit to 15.\n\n#####Exalted\nWhen a character exalts the Whispering Blade, apply the following changes to the item’s traits:\n\n* Increase the bonus to attack and damage to a +3, and increase the additional damage taken to 1d8 psychic damage.\n* Increase the DC to resist being frightened from a critical hit to 17.\n* Whenever Whisper is thrown but before it hits, you can choose to transform into shadow and merge with the blade, teleporting instantly to wherever the blade impacts. If the target is a creature, you emerge adjacent to the tar- get in a space of your choice. If you miss with the attack, the DM determines where you teleport accordingly.",
    "type": "Weapon (dagger)",
    "rarity": "legendary",
    "requires-attunement": "requires attunement",
    "page_no": 116
  },
  {
    "name": "Wraps of Dueling",
    "desc": "Created and wielded by the ancient warrior, these thick cloth strips of enchanted material appear to be stained with blood of unknown origin. You have a +1 bonus to attack and damage rolls made with your unarmed strikes.\nWhenever you finish a short or long rest, you gain a number of temporary hit points equal to your full ki points.\n\n#####Awakened\nWhen a character awakens the Wraps of Dueling, apply the following changes to the item’s traits:\n\n* Increase your bonus to attack and damage rolls to +2.\n* As a bonus action, you can cast the spell misty step. You cannot use this ability again until you score a critical hit with an unarmed strike, or you complete a short or long rest.\n\n#####Exalted\nWhen a character exalts the Wraps of Dueling, apply the following changes to the item’s traits:\n\n* Increase your bonus to attack and damage rolls to +3.\n* When you hit with an unarmed strike, you can choose to make the attack a Ravenous Strike. The target takes an additional 6d6 necrotic damage, and you regain hit points equal to the additional necrotic damage dealt. You cannot use this ability again until you complete a short or long rest.",
    "type": "Wondrous item",
    "rarity": "legendary",
    "requires-attunement": "requires attunement by a monk",
    "page_no": 116
  }
]
