[
    {
        "name": "Plainscow",
        "desc": "The hulking plainscow is an exceptionally sturdy beast of burden used for centuries. Though herds of wild plainscows still roam the prairies, domesticated plainscows are now used as mounts, pack animals, and sometimes even livestock. Plainscows are unusually empathetic for beasts, and often bond with a rider for life. Plainscows stand 6 feet tall, weigh about two tons, and live for 70 years. They can be bought for 200 gp and have a carrying capacity of 1,500 pounds.",
        "size": "Large",
        "type": "Beast",
        "alignment": "unaligned",
        "armor_class": 13,
        "armor_desc": "natural armor",
        "hit_points": 42,
        "hit_dice": "5d10+15",
        "speed": "40 ft.",
        "speed_json": {
            "walk": 40
        },
        "strength": 18,
        "dexterity": 8,
        "constitution": 16,
        "intelligence": 2,
        "wisdom": 10,
        "charisma": 6,
        "skills": {
            "insight": 2
        },
        "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
        "senses": "passive Perception 10",
        "languages": "—",
        "challenge_rating": 2,
        "special_abilities": [
            {
                "name": "Trampling Charge",
                "desc": "If the plainscow moves at least 20 feet straight toward a creature and then hits it with a hooves attack on the same turn, that target must succeed on a DC 14 Strength saving throw or be knocked prone. If the target is prone, the plainscow can make another attack with its hooves as a bonus action."
            }
        ],
        "actions": [
            {
                "name": "Hooves",
                "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage.",
                "attack_bonus": 6,
                "damage_dice": "1d6+4d6",
                "damage_bonus": 2
            }
        ],
        "page_no": 59
    },
    {
        "name": "Firetamer",
        "desc": "Firetamers are the elite elementalists of the fire elemental wardens, using their attunement to the primordial forces of the world to not just create fire, not just command it, but tame it to their will. A firetamer is nothing like the manic pyromancers; while the latter recklessly wields fire as a weapon, firetamers use their talent to protect others from fire’s destructive power—or to use that same power to destroy those who threaten their people. Firetamers are almost always accompanied by a salamander, a fire elemental, or a small herd of magma or smoke mephits.",
        "size": "Medium",
        "type": "Humanoid",
        "subtype": "any race",
        "alignment": "neutral good",
        "armor_class": 17,
        "armor_desc": "red dragon scale mail",
        "hit_points": 92,
        "hit_dice": "16d8+20",
        "speed": "30 ft.",
        "speed_json": {
            "walk": 30
        },
        "strength": 8,
        "dexterity": 15,
        "constitution": 14,
        "intelligence": 12,
        "wisdom": 18,
        "charisma": 11,
        "skills": {
            "arcana": 5,
            "nature": 9
        },
        "damage_resistances": "fire",
        "senses": "passive Perception 14",
        "languages": "Common, Druidic, Primordial (Ignan)",
        "challenge_rating": 7,
        "special_abilities": [
            {
                "name": "Flameform",
                "desc": "As a bonus action, the firetamer can transform into a **fire elemental**. While in this form, the firetamer cannot cast spells, but can expend a spell slot as a bonus action to regain 1d8 hit points per level of the spell slot expended. When the firetamer is reduced to 0 hit points, falls unconscious, or dies in this form, it reverts to its humanoid form. It can remain in flameform for up to 5 hours, and can enter flameform twice, regaining expended uses after completing a short or long rest."
            },
            {
                "name": "Spellcasting",
                "desc": "The firetamer is a 9th-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 16, +8 to hit with spell attacks). It has the following druid spells prepared:\n\n* Cantrips (at will): druidcraft, mending, produce flame\n* 1st level (4 slots): cure wounds, faerie fire, longstrider, jump\n* 2nd level (3 slots): flame blade, heat metal, lesser restoration\n* 3rd level (3 slots): daylight, dispel magic, protection from energy\n* 4th level (3 slots): blight, freedom of movement, wall of fire 5th level (1 slot): conjure elemental"
            }
        ],
        "spells": [
            "druidcraft",
            "mending",
            "produce flame",
            "cure wounds",
            "faerie fire",
            "longstrider",
            "jump",
            "flame blade",
            "heat metal",
            "lesser restoration",
            "daylight",
            "dispel magic",
            "protection from energy",
            "blight",
            "freedom of movement",
            "wall of fire",
            "conjure elemental"
        ],
        "actions": [
            {
                "name": "Scimitar",
                "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 5 (1d6 + 2) slashing damage plus 14 (4d6) fire damage. Flamecharm (Recharges after a Short or Long Rest). The firetamer can cast dominate monster (save DC 16) on a fire elemental or other fire elemental creature. If the elemental has 150 or more hit points, it has advantage on the saving throw.",
                "attack_bonus": 6,
                "damage_dice": "1d6+4d6",
                "damage_bonus": 2
            },
            {
                "name": "Flamecharm (Recharges after a Short or Long Rest)",
                "desc": "The firetamer can cast _dominate monster_ (save DC 16) on a fire elemental or other fire elemental creature. If the elemental has 150 or more hit points, it has advantage on the saving throw."
            }
        ],
        "group": "Elemental Wardens",
        "page_no": 128
    },
    {
        "name": "Stoneguard",
        "desc": "The elemental wardens of earth are a stoic people, slow to change socially, and more likely to fight defensive battles and outlast enemies than wage offensive wars. The stoneguard are the perfect embodiment of this ideal; their druidic training has been augmented by ancient combat techniques, allowing them to hold fast against a tide of enemies. They craft arms and armor from the granite around them, and their magical stonecraft rivals that of the dwarves.",
        "size": "Medium",
        "type": "Humanoid",
        "subtype": "any race",
        "alignment": "lawful neutral",
        "armor_class": 15,
        "armor_desc": "granite half plate",
        "hit_points": 152,
        "hit_dice": "16d8+80",
        "speed": "30 ft.",
        "speed_json": {
            "walk": 30
        },
        "strength": 18,
        "dexterity": 10,
        "constitution": 20,
        "intelligence": 10,
        "wisdom": 14,
        "charisma": 9,
        "strength_save": 8,
        "constitution_save": 9,
        "wisdom_save": 6,
        "skills": {
            "athletics": 8,
            "intimidation": 3
        },
        "condition_immunities": "petrified",
        "senses": "tremorsense 30 ft., passive Perception 12",
        "languages": "Common, Druidic, Primordial (Terran)",
        "challenge_rating": 7,
        "special_abilities": [
            {
                "name": "Spellcasting",
                "desc": "The stoneguard is a 3rd-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 14, +6 to hit with spell attacks). It has the following druid spells prepared:\n\n* Cantrips (at will): druidcraft, resistance\n* 1st level (4 slots): goodberry, speak with animals, thunderwave\n* 2nd level (2 slots): hold person, spike growth"
            }
        ],
        "spells": [
            "druidcraft",
            "resistance",
            "goodberry",
            "speak with animals",
            "thunderwave",
            "hold person",
            "spike growth"
        ],
        "actions": [
            {
                "name": "Multiattack",
                "desc": "The stoneguard makes three granite maul attacks."
            },
            {
                "name": "Granite Maul",
                "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) bludgeoning damage. If the attack hits, the stoneguard may also immediately cast _thunderwave_ as a bonus action. This casting uses a spell slot, but no material components.",
                "attack_bonus": 8,
                "damage_dice": "2d6",
                "damage_bonus": 4
            }
        ],
        "reactions": [
            {
                "name": "Sentinel",
                "desc": "When a creature within 5 feet of the stoneguard attacks a target other than the stoneguard, it can make a single attack roll against the attacker."
            },
            {
                "name": "Skin to Stone",
                "desc": "When the stoneguard is attacked, it may gain resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks until the end of the attacker’s turn."
            }
        ],
        "group": "Elemental Wardens",
        "page_no": 128
    },
    {
        "name": "Waverider",
        "desc": "The waveriders know firsthand the dangers of the open ocean, and dedicate their lives to protecting seafarers from storms, pirates, and sea monsters. Though they are not warriors, they are accomplished healers and aquatic empaths, using their powers to seek out and rescue survivors of marine disasters, sometimes returning critically wounded survivors to the tribe of elemental wardens itself. The isolationists among the water wardens condemn this practice, fearing that the refugees threaten their way of life. The waveriders take their peers’ scorn in stride, for they would rather be righteous than popular.\nA waverider turns to violence only as a last resort, and prefer to fight in fishform than with their fishing harpoon, using hit-and-run tactics as a shark or their octopus form’s natural camouflage to harry opponents. When patrolling the open seas, waveriders skim across the water on personal waveboards with folding sails, similar in function to the _skysails_ of the wind wardens.",
        "size": "Medium",
        "type": "Humanoid",
        "subtype": "any race",
        "alignment": "neutral good",
        "armor_class": 14,
        "armor_desc": "hide armor of cold resistance",
        "hit_points": 77,
        "hit_dice": "14d8+14",
        "speed": "30 ft.",
        "speed_json": {
            "walk": 30
        },
        "strength": 15,
        "dexterity": 14,
        "constitution": 12,
        "intelligence": 10,
        "wisdom": 16,
        "charisma": 13,
        "constitution_save": 4,
        "wisdom_save": 6,
        "skills": {
            "athletics": 8,
            "nature": 3
        },
        "damage_resistances": "cold",
        "senses": "passive Perception 13",
        "languages": "Common, Druidic, Primordial (Aquan)",
        "challenge_rating": 4,
        "special_abilities": [
            {
                "name": "Fishform",
                "desc": "As a bonus action, the waverider can transform into a **hunter shark** or **giant octopus**. While in this form, the waverider cannot cast spells, but can expend a spell slot as a bonus action to regain 1d8 hit points per level of the spell slot expended. When the waverider is reduced to 0 hit points, falls unconscious, or dies in this form, it reverts to its humanoid form. It can remain in fishform for up to 3 hours, and can enter fishform twice, regaining expended uses after completing a short or long rest."
            },
            {
                "name": "Healing Tides",
                "desc": "Whenever the waverider casts a spell of 1st level or higher that affects a nonhostile creature, that creature regains 3 hit points (in addition to any healing the spell may provide)."
            },
            {
                "name": "Marine Empathy",
                "desc": "The waverider can speak with and understand aquatic plants and animals."
            },
            {
                "name": "Spellcasting",
                "desc": "The waverider is a 7th-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 14, +6 to hit with spell attacks). It has the following druid spells prepared:\n\n* Cantrips (at will): druidcraft, poison spray, resistance\n* 1st level (4 slots): cure wounds, create or destroy water, healing word\n* 2nd level (3 slots): animal messenger, enhance ability, lesser restoration\n* 3rd level (3 slots): conjure animals (aquatic beasts only), water walk, water breathing\n* 4th level (1 slots): control water"
            }
        ],
        "spells": [
            "druidcraft",
            "poison spray",
            "resistance",
            "cure wounds",
            "create or destroy water",
            "healing word",
            "animal messenger",
            "enhance ability",
            "lesser restoration",
            "conjure animals",
            "water walk",
            "water breathing",
            "control water"
        ],
        "actions": [
            {
                "name": "Harpoon",
                "desc": "Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft., range 20/60 ft., one target. Hit: 5 (1d6 + 2) piercing damage. Attacks with this weapon while underwater are not made with disadvantage.",
                "attack_bonus": 5,
                "damage_dice": "1d6",
                "damage_bonus": 2
            }
        ],
        "group": "Elemental Wardens",
        "page_no": 129
    },
    {
        "name": "Skydancer",
        "desc": "Air elemental warden children learn to fly before they learn to walk, accompanying their parents through the snow-fattened clouds on _skysails_ (see pg. 45). While all air wardens love the sensation of flight, few hone their skills as rigorously as the skydancers. These graceful masters of the wind are at once artists, performers, and warriors; they are beloved heroes of their people, both defending them in times of danger and bringing them happiness in times of peace.",
        "size": "Medium",
        "type": "Humanoid",
        "subtype": "any race",
        "alignment": "chaotic neutral",
        "armor_class": 14,
        "hit_points": 63,
        "hit_dice": "14d8",
        "speed": "30 ft., fly 60 ft. (with skysail)",
        "speed_json": {
            "walk": 30,
            "fly": 60
        },
        "strength": 10,
        "dexterity": 18,
        "constitution": 10,
        "intelligence": 12,
        "wisdom": 16,
        "charisma": 11,
        "dexterity_save": 7,
        "skills": {
            "acrobatics": 7,
            "perception": 6
        },
        "senses": "passive Perception 16",
        "languages": "Common, Druidic, Primordial (Auran)",
        "challenge_rating": 5,
        "special_abilities": [
            {
                "name": "Evasion",
                "desc": "If the skydancer is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, the skydancer instead takes no damage if it succeeds on the saving throw, and only half damage if it fails."
            },
            {
                "name": "Flyby",
                "desc": "The skydancer doesn’t provoke opportunity attacks when it flies out of an enemy’s reach."
            },
            {
                "name": "Skysail",
                "desc": "The skydancer flies with a special weapon called a _skysail_ (see pg. 45). While the _skysail’s_ wings are extended, the skydancer can cast _levitate_ at will, and can spend an action to cast _fly_ on itself (no concentration required) for up to 1 minute once per day. This use of _fly_ instantly replenishes when in an area of powerful air elemental magic."
            },
            {
                "name": "Spellcasting",
                "desc": "The skydancer is a 3rd-level spellcaster. Its spellcasting ability is Wisdom (spell save DC 14, +6 to hit with spell attacks). It has the following druid spells prepared:\n\n* Cantrips (at will): guidance, shillelagh\n* 1st level (4 slots): fog cloud, entangle, jump\n* 2nd level (2 slots): gust of wind, skywrite"
            }
        ],
        "spells": [
            "guidance",
            "shillelagh",
            "fog cloud",
            "entangle",
            "jump",
            "gust of wind"
        ],
        "actions": [
            {
                "name": "Multiattack",
                "desc": "The skydancer makes two skysail staff attacks."
            },
            {
                "name": "Skysail Staff",
                "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) bludgeoning damage. If the skydancer makes this attack while flying, the target must make a DC 14 Dexterity saving throw, taking 21 (6d6) lightning damage on a failure or half as much damage on a success.",
                "attack_bonus": 7,
                "damage_dice": "1d6",
                "damage_bonus": 4
            }
        ],
        "bonus_actions": null,
        "reactions": [
            {
                "name": "Slow Fall",
                "desc": "When the skydancer takes falling damage, it may reduce the damage by half."
            }
        ],
        "group": "Elemental Wardens",
        "page_no": 129
    },
    {
        "name": "Cinderslag Elemental",
        "desc": "Cinderslag elementals are pure manifestations of hatred and furor. A cinderslag’s molten gaze is a weapon of incredible power, capable of melting steel and stone with a single glance. If an elemental’s gaze were focused on buildings over the course of a few hours, or if several elementals worked in unison, entire cities could be leveled in a tide of molten stone. Fortunately, these elemental spawn are mindless and incapable of unified action—but what if someone were able to bend them to their will?",
        "size": "Large",
        "type": "Elemental",
        "subtype": "",
        "alignment": "chaotic evil",
        "armor_class": 15,
        "armor_desc": "natural armor",
        "hit_points": 102,
        "hit_dice": "12d10+36",
        "speed": "20 ft., burrow 40 ft.",
        "speed_json": {
            "walk": 20,
            "burrow": 40
        },
        "strength": 15,
        "dexterity": 12,
        "constitution": 20,
        "intelligence": 1,
        "wisdom": 10,
        "charisma": 3,
        "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks",
        "damage_immunities": "fire, poison",
        "condition_immunities": "exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious",
        "senses": "darkvision 60 ft., passive Perception 10",
        "languages": "—",
        "challenge_rating": 5,
        "special_abilities": [
            {
                "name": "Molten Form",
                "desc": "The elemental can move through a space as narrow as 1 inch wide without squeezing. A creature that touches the elemental or hits it with a melee attack while within 5 feet of it takes 5 (1d10) fire damage. In addition, the elemental can enter a hostile creature’s space and stop there. The first time it enters a creature’s space on a turn, that creature takes 5 (1d10) fire damage and must make a DC 14 Strength saving throw, becoming restrained on a failure. When the begins its turn while restrained in this way, it takes 5 (1d10) fire damage."
            },
            {
                "name": "Water Susceptibility",
                "desc": "For every 5 feet that elemental moves in water, or for every gallon of water splashed on it, it takes 1 cold damage."
            }
        ],
        "actions": [
            {
                "name": "Multiattack",
                "desc": "The elemental makes two slam attacks."
            },
            {
                "name": "Slam",
                "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 13 (3d6 + 2) bludgeoning damage plus 5 (1d10) fire damage. If the target is a creature or a flammable object, it ignites. Until a creature takes an action to douse the fire, the target takes 5 (1d10) fire damage at the start of each of its turns.",
                "attack_bonus": 5,
                "damage_dice": "3d6+1d10",
                "damage_bonus": 2
            },
            {
                "name": "Molten Gaze",
                "desc": "Ranged Spell Attack: +8 to hit, range 30 ft., one target. Hit: 21 (6d6) fire damage and the target must makze a DC 14 Constitution saving throw. On a failure, one nonmagical item the target is carrying instantly melts or burns to cinders.",
                "attack_bonus": 8,
                "damage_dice": "6d6"
            }
        ],
        "page_no": 130
    }
    {
        "name": "Syndicate Cutthroat",
        "desc": "When the thieves and assassins of a syndicate need to “acquire” additional funds or “relieve” specific people of their possessions, their cutthroats are the first to be called. Syndicate cutthroats can also represent any number of different rogues within the thieves’ guilds of the region.",
        "size": "Medium",
        "type": "Humanoid",
        "subtype": "any race",
        "alignment": "any nonlawful alignment",
        "armor_class": 14,
        "armor_desc": "leather",
        "hit_points": 44,
        "hit_dice": "8d8+8",
        "speed": "30 ft.",
        "speed_json": {
            "walk": 30
        },
        "strength": 10,
        "dexterity": 16,
        "constitution": 12,
        "intelligence": 8,
        "wisdom": 14,
        "charisma": 9,
        "dexterity_save": 5,
        "skills": {
            "deception": 3,
            "stealth": 7
        },
        "senses": "passive Perception 12",
        "languages": "Common, Thieves’ Cant",
        "challenge_rating": 3,
        "special_abilities": [
            {
                "name": "Cunning Action",
                "desc": "On each of its turns, the cutthroat can use a bonus action to take the Dash, Disengage, or Hide action."
            },
            {
                "name": "Sneak Attack (1/Turn)",
                "desc": "The cutthroat deals an extra 14 (4d6) damage when it hits a target with a weapon attack and has advantage on the attack roll, or when the target is within 5 feet of an ally of the cutthroat that isn’t incapacitated and the cutthroat doesn’t have disadvantage on the attack roll."
            }
        ],
        "actions": [
            {
                "name": "Multiattack",
                "desc": "The cutthroat makes two shortsword or dagger attacks."
            },
            {
                "name": "Shortsword",
                "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) piercing damage.",
                "attack_bonus": 6,
                "damage_dice": "1d6",
                "damage_bonus": 3
            },
            {
                "name": "Dagger",
                "desc": "Melee or Ranged Weapon Attack: +6 to hit, reach 5 ft., range 20/60 ft., one target. Hit: 5 (1d4 + 3) piercing damage.",
                "attack_bonus": 6,
                "damage_dice": "1d4",
                "damage_bonus": 3
            }
        ],
        "reactions": [
            {
                "name": "Uncanny Dodge",
                "desc": "When an attacker that the cutthroat can see hits it with an attack, the cutthroat takes half damage instead."
            }
        ],
        "group": "Syndicate",
        "page_no": 131
    },
    {
        "name": "Syndicate Enforcer",
        "desc": "Syndicates prefer to operate within the shadows, but sometimes targets of blackmail need a little “convincing.” Whenever scare tactics and brute force are needed, these musclebound enforcers make quite an impression.",
        "size": "Medium",
        "type": "Humanoid",
        "subtype": "any race",
        "alignment": "any nonlawful alignment",
        "armor_class": 16,
        "armor_desc": "half plate",
        "hit_points": 102,
        "hit_dice": "12d8+48",
        "speed": "30 ft.",
        "speed_json": {
            "walk": 30
        },
        "strength": 16,
        "dexterity": 12,
        "constitution": 18,
        "intelligence": 8,
        "wisdom": 11,
        "charisma": 14,
        "skills": {
            "athletics": 6,
            "intimidation": 8
        },
        "senses": "passive Perception 10",
        "languages": "Common, Thieves’ Cant",
        "challenge_rating": 5,
        "special_abilities": [
            {
                "name": "Intimidating Presence",
                "desc": "Whenever the enforcer hits with a melee attack, the target must make a DC 15 Wisdom saving throw. On a failure, the target is frightened of the enforcer until the end of its next turn. The enforcer’s allies have advantage on attack rolls against creatures frightened in this way."
            },
            {
                "name": "Second Wind (Recharges after a Short or Long Rest)",
                "desc": "As a bonus action, the enforcer can regain 12 hit points."
            }
        ],
        "actions": [
            {
                "name": "Multiattack",
                "desc": "The enforcer makes three warhammer attacks."
            },
            {
                "name": "Warhammer",
                "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 8 (1d10 + 3) bludgeoning damage.",
                "attack_bonus": 6,
                "damage_dice": "1d10",
                "damage_bonus": 3
            }
        ],
        "group": "Syndicate",
        "page_no": 131
    }
    {
        "name": "Cyclops Stormcaller",
        "desc": "When a cyclops is born beneath a raging storm, the child is sometimes born different. Smaller than the rest, sickly and weak. Most of these stormborn cyclopes are relentlessly bullied and beaten for their tiny stature, and most die before adulthood. Those who survive do so because of the magic the stormlord has bestowed upon them—intentionally or otherwise. As cyclopes are a simple-minded and magically-inert people, the power of a stormcaller awes and terrifies them. They believe that a stormcaller is nothing short of a god.",
        "size": "Large",
        "type": "Giant",
        "alignment": "neutral evil",
        "armor_class": 18,
        "armor_desc": "chainmail, _ring of protection_, _cloak of protection_",
        "hit_points": 119,
        "hit_dice": "12d10+48",
        "speed": "30 ft., fly 60 ft. (storm only)",
        "speed_json": {
            "walk": 30,
            "fly": 60
        },
        "strength": 16,
        "dexterity": 10,
        "constitution": 18,
        "intelligence": 15,
        "wisdom": 8,
        "charisma": 20,
        "strength_save": 4,
        "dexterity_save": 1,
        "constitution_save": 5,
        "intelligence_save": 0,
        "wisdom_save": 4,
        "charisma_save": 10,
        "skills": {
            "arcana": 6
        },
        "senses": "passive Perception 9",
        "languages": "Common, Elven, Giant",
        "challenge_rating": 10,
        "special_abilities": [
            {
                "name": "Poor Depth Perception",
                "desc": "The cyclops has disadvantage on any attack roll against a target more than 30 feet away."
            },
            {
                "name": "Storm Wings",
                "desc": "While within 1 mile of a storm, the cyclops gains a fly speed of 60 feet."
            },
            {
                "name": "Supernatural Focus",
                "desc": "The cyclops has advantage on Constitution saving throws made to maintain concentration on a spell, and cannot lose concentration because of turbulent weather."
            },
            {
                "name": "Innate Spellcasting",
                "desc": "The cyclops’s innate spellcasting ability is Charisma (spell save DC 17). The cyclops can innately cast the following spells, requiring no material components:\n\n* At-will: ray of frost (3d8), water walk\n* 3/day each: ice storm, sleet storm, wind wall\n* 1/day each: control weather, storm of vengeance"
            }
        ],
        "spells": [
            "ray of frost",
            "water walk",
            "ice storm",
            "sleet storm",
            "wind wall",
            "control weather",
            "storm of vengeance"
        ],
        "actions": [
            {
                "name": "Multiattack",
                "desc": "The cyclops makes two ice claws attacks."
            },
            {
                "name": "Ice Claws",
                "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 13 (3d6 +3) slashing damage plus 3 (1d6) cold damage.",
                "attack_bonus": 7,
                "damage_dice": "3d6+1d6",
                "damage_bonus": 3
            }
        ],
        "page_no": 132
    },
    {
        "name": "Goliath Stormborn",
        "desc": "Countless goliath legends tell of heroes born beneath a raging storm. These stormborn grow to become peerless warriors, blessed with preternatural skill with a blade and the uncanny ability to command lightning itself. As warriors destined to become mythic heroes, stormborn fight with reckless abandon and are often distressingly prideful. Little do they know that destiny is a fickle thing, and that the songs of defeated stormborn (or worse, tyrannical ones) are rarely sung by the bards.",
        "size": "Medium",
        "type": "Humanoid",
        "subtype": "goliath",
        "alignment": "chaotic neutral",
        "armor_class": 13,
        "armor_desc": "hide armor",
        "hit_points": 102,
        "hit_dice": "12d8+48",
        "speed": "30 ft.",
        "speed_json": {
            "walk": 30
        },
        "strength": 18,
        "dexterity": 12,
        "constitution": 18,
        "intelligence": 9,
        "wisdom": 11,
        "charisma": 9,
        "constitution_save": 6,
        "skills": {
            "athletics": 6,
            "intimidation": 3
        },
        "damage_resistances": "lightning",
        "senses": "passive Perception 10",
        "languages": "Common, Giant",
        "challenge_rating": 4,
        "special_abilities": [
            {
                "name": "Reckless",
                "desc": "At the start of its turn, the stormborn can gain advantage on all melee weapon attack rolls during that turn, but attack rolls against it have advantage until the start of its next turn."
            },
            {
                "name": "Innate Spellcasting",
                "desc": "The stormborn’s innate spellcasting ability is Charisma (spell save DC 9). The stormborn can innately cast the following spells, requiring no material components:\n\n* 3/day: lightning bolt\n* 1/day: call lightning"
            }
        ],
        "spells": [
            "lightning bolt",
            "call lightning"
        ],
        "actions": [
            {
                "name": "Multiattack",
                "desc": "The stormborn makes two greataxe attacks."
            },
            {
                "name": "Greataxe",
                "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 10 (1d12 + 4) slashing damage plus 7 (2d6) lightning damage. Miss: 3 (1d6) lightning damage.",
                "attack_bonus": 6,
                "damage_dice": "1d12+2d6",
                "damage_bonus": 4
            }
        ],
        "reactions": [
            {
                "name": "Endurance",
                "desc": "When the stormborn takes damage, it may reduce the damage by 10 (1d12 + 4). It cannot use this trait again until it completes a short or long rest."
            }
        ],
        "group": "Goliaths",
        "page_no": 133
    },
    {
        "name": "Goliath Brawler",
        "desc": "Some prideful goliaths are so assured in their own strength that they refuse to use weapons. Most goliaths learn how to fist-fight from a young age, but goliath brawlers go so far as to eschew weapons even on the battlefield. Goliath brawlers usually lead the charge on the battlefield, using their exceptional speed and brute strength to throw the enemy vanguard into chaos.",
        "size": "Medium",
        "type": "Humanoid",
        "subtype": "goliath",
        "alignment": "chaotic neutral",
        "armor_class": 15,
        "hit_points": 65,
        "hit_dice": "10d8+20",
        "speed": "40 ft.",
        "speed_json": {
            "walk": 40
        },
        "strength": 17,
        "dexterity": 14,
        "constitution": 15,
        "intelligence": 9,
        "wisdom": 16,
        "charisma": 7,
        "skills": {
            "acrobatics": 4,
            "athletics": 5,
            "perception": 5
        },
        "senses": "passive Perception 15",
        "languages": "Common, Giant",
        "challenge_rating": 3,
        "special_abilities": [
            {
                "name": "Unarmored Defense",
                "desc": "While the brawler is wearing no armor and not wielding a shield, its AC equals 10 + its Dexterity modifier + its Wisdom modifier."
            }
        ],
        "actions": [
            {
                "name": "Multiattack",
                "desc": "The brawler makes three unarmed strikes."
            },
            {
                "name": "Unarmed Strike",
                "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) bludgeoning damage. If the target is a creature, the brawler can choose one of the following additional effects:\n\n* Bruise. The target must succeed on a DC 13 Constitution saving throw. On a failure, its speed is reduced by 5 feet until it receives at least 1 point of magical healing. A DC 15 Wisdom (Medicine) check performed as an action can also restore any lost speed.\n* Disarm. The target must succeed on a DC 13 Strength saving throw or drop one item it is holding. The brawler may choose which item is dropped, and may choose to pick it up.\n* Suplex. The target must succeed on a DC 13 Strength saving throw or be knocked prone.",
                "attack_bonus": 5,
                "damage_dice": "1d8",
                "damage_bonus": 3
            }
        ],
        "reactions": [
            {
                "name": "Endurance",
                "desc": "When the stormborn takes damage, it may reduce the damage by 8 (1d12 + 2). It cannot use this trait again until it completes a short or long rest."
            }
        ],
        "group": "Goliaths",
        "page_no": 134
    }
    {
        "name": "Goat-Knight",
        "desc": "The sheer cliff faces and winding winding mountainside roads are nearly impossible to traverse by normal means with any speed. However, the goat-knights are enforcers of peace and justice across the mountain range, and their giant goat steeds can easily traverse the harsh mountain slopes and climb nearly vertical slopes at their full pace. Travelers lost within the mountains are sometimes saved by a traveling goat-knight, who is able to lead them through dangerous-but-traversable mountain roads.",
        "size": "Medium",
        "type": "Humanoid",
        "subtype": "dwarf",
        "alignment": "neutral good",
        "armor_class": 20,
        "armor_desc": "plate, shield",
        "hit_points": 52,
        "hit_dice": "8d8+16",
        "speed": "25 ft., mounted 40 ft.",
        "speed_json": {
            "walk": 25
        },
        "strength": 16,
        "dexterity": 8,
        "constitution": 14,
        "intelligence": 10,
        "wisdom":11,
        "charisma": 14,
        "strength_save": 5,
        "dexterity_save": 1,
        "constitution_save": 4,
        "intelligence_save": 2,
        "wisdom_save": 2,
        "charisma_save": 4,
        "skills": {
            "nature": 3,
            "religion": 6
        },
        "damage_resistances": "poison",
        "condition_immunities": "diseases",
        "senses": "darkvision 60 ft., passive Perception 12",
        "languages": "Common, Dwarvish",
        "challenge_rating": 0,
        "special_abilities": [
            {
                "name": "Aura of Protection",
                "desc": "Whenever the goat-knight or a friendly creature within 10 feet of it makes a saving throw, the creature gains a +2 bonus (included above). The knight must be conscious to grant this bonus."
            },
            {
                "name": "Dwarven Resilience",
                "desc": "The goat-knight has advantage on saving throws against poison."
            },
            {
                "name": "Spellcasting",
                "desc": "The goat-knight is a 6th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 16, +8 to hit with spell attacks). The goat-knight has the following paladin spells prepared:\n\n* 1st level (4 slots): bless, cure wounds, protection from evil and good, sanctuary, shield of faith\n* 2nd level (2 slots): branding smite, lesser restoration, locate object, zone of truth"
            }
        ],
        "spells": [
            "bless",
            "cure wounds",
            "protection from evil and good",
            "sanctuary",
            "shield of faith",
            "branding smite",
            "lesser restoration",
            "locate object",
            "zone of truth"
        ],
        "actions": [
            {
                "name": "Multiattack",
                "desc": "The goat-knight makes two warhammer attacks."
            },
            {
                "name": "Warhammer",
                "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) bludgeoning damage, or 8 (1d10 + 3) bludgeoning damage if used with two hands.",
                "attack_bonus": 6,
                "damage_dice": "1d8",
                "damage_bonus": 3
            }
        ],
        "page_no": 134
    },
    {
        "name": "Goat-Knight Steed",
        "size": "Large",
        "type": "Celestial",
        "alignment": "unaligned",
        "armor_class": 11,
        "armor_desc": "natural armor",
        "hit_points": 19,
        "hit_dice": "3d10+3",
        "speed": "40 ft.",
        "speed_json": {
            "walk": 40
        },
        "strength": 17,
        "dexterity": 11,
        "constitution": 12,
        "intelligence": 6,
        "wisdom": 12,
        "charisma": 6,
        "senses": "passive Perception 11",
        "languages": "Dwarvish (comprehends, but cannot speak)",
        "challenge_rating": 0.5,
        "special_abilities": [
            {
                "name": "Charge",
                "desc": "If the goat-knight steed moves at least 20 feet straight toward a target and then hits it with a ram attack on the same turn, the target takes a extra 5 (2d4) bludgeoning damage. If the target is a creature, it must succeed on a DC 13 Strength saving throw or be knocked prone."
            },
            {
                "name": "Sure-Footed",
                "desc": "The goat-knight steed has advantage on Strength and Dexterity saving throws made against effects that would knock it prone."
            },
            {
                "name": "Rider and Steed",
                "desc": "Any spell with a range of Self cast by a goat-knight rider who is mounted on a goat-knight steed also targets the goat-knight steed."
            },
            {
                "name": "Divine Provenance",
                "desc": "When the goat-knight steed drops to 0 hit points it disappears, leaving behind no physical form. A goat knight can also dismiss his steed at any point as an action, causing it to disappear. In either case, the same steed is summoned when the goat-knight casts find steed."
            }
        ],
        "actions": [
            {
                "name": "Ram",
                "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 8 (2d4 + 3) bludgeoning damage.",
                "attack_bonus": 5,
                "damage_dice": "2d4",
                "damage_bonus": 3
            }
        ],
        "page_no": 135
    },
    {
        "name": "Orc Slaughter Lord",
        "desc": "A Slaughter Lord craves combat like it craves food, and leads raids as often as possible, but is frequently forced to remain at its stronghold because of its strict regimen of alchemical treatments. A small army of shamans and alchemists attend to the Slaughter Lords in order to artificially enhance their already-tremendous strength. The blessings and concoctions crafted by the orc-lords’ lackeys grow their muscular forms to mountainous size, sharpen their tactical reasoning, and bestow upon them divine protection.",
        "size": "Large",
        "type": "Humanoid",
        "subtype": "orc",
        "alignment": "lawful evil",
        "armor_class": 17,
        "hit_points": 152,
        "hit_dice": "16d8+80",
        "speed": "30 ft.",
        "speed_json": {
            "walk": 30
        },
        "strength": 22,
        "dexterity": 14,
        "constitution": 20,
        "intelligence": 12,
        "wisdom": 16,
        "charisma": 16,
        "strength_save": 10,
        "constitution_save": 9,
        "wisdom_save": 7,
        "skills": {
            "intimidation": 11,
            "religion": 5
        },
        "senses": "darkvision 60 ft., passive Perception 13",
        "languages": "Common, Orc",
        "challenge_rating": 9,
        "special_abilities": [
            {
                "name": "Aggressive",
                "desc": "As a bonus action, the Slaughter Lord can move up to its speed toward a hostile creature it can see."
            },
            {
                "name": "Blessings of the Ruiner",
                "desc": "The Slaughter Lord has been showered with a cocktail of divine blessings, and can call upon them at any time. Its innate spellcasting ability is Wisdom (spell save DC 15). The Slaughter Lord can innately cast the following spells, requiring no material components:\n\n* At will: thaumaturgy\n* 3/day each: flame strike, spirit guardians\n* 1/day each: control weather, divine word, fire storm"
            },
            {
                "name": "Legendary Resistance (2/Day)",
                "desc": "If the Slaughter Lord fails a saving throw, it can choose to succeed instead."
            },
            {
                "name": "Unarmored Defense",
                "desc": "While the Slaughter Lord is wearing no armor and not wielding a shield, its AC equals 10 + its Dexterity modifier + its Constitution modifier."
            }
        ],
        "spells": [
            "thaumaturgy",
            "flame strike",
            "spirit guardians",
            "control weather",
            "divine word",
            "fire storm"
        ],
        "actions": [
            {
                "name": "Multiattack",
                "desc": "The Slaughter Lord makes four attacks with its greatswords or three attacks with its spear."
            },
            {
                "name": "Dual Greatswords",
                "desc": "Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) piercing damage plus 3 (1d6) fire damage.",
                "attack_bonus": 10,
                "damage_dice": "2d6+1d6",
                "damage_bonus": 6
            },
            {
                "name": "Spear",
                "desc": "Melee or Ranged Weapon Attack: +10 to hit, range 20/60 ft., one target. Hit: 13 (2d6 + 6) piercing damage plus 3 (1d6) fire damage, or 15 (2d8 + 6) piercing damage plus 3 (1d6) fire damage if used with both hands to make a melee attack.",
                "attack_bonus": 10,
                "damage_dice": "2d6+1d6",
                "damage_bonus": 6
            }
        ],
        "legendary_desc": "The Slaughter Lord can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature’s turn. The Slaughter Lord regains spent legendary actions at the start of its turn.",
        "legendary_actions": [
            {
                "name": "Attack",
                "desc": "The Slaughter Lord makes a spear or greatsword attack."
            },
            {
                "name": "Move",
                "desc": "The Slaughter Lord moves up to half its speed."
            },
            {
                "name": "Cast a Spell (Costs 3 Actions)",
                "desc": "The Slaughter Lord casts an innate spell."
            }
        ],
        "page_no": 137
    },
    {
        "name": "Goblin Stabby-Stabber",
        "desc": "Goblins that show exceptional skill are brought before their Slaughter Lord and forced to drink a terrible brew the orcs call skullfire. The concoction burns what little reason the goblins had away, turning them into perfectly obedient, flesh-hungry monsters. In battle, stabby-stabbers swarm like rats, eviscerating fleeing innocents and warriors alike in seconds.",
        "size": "Small",
        "type": "Humanoid",
        "subtype": "goblinoid",
        "alignment": "chaotic evil",
        "armor_class": 15,
        "armor_desc": "studded leather",
        "hit_points": 36,
        "hit_dice": "8d6+8",
        "speed": "30 ft.",
        "speed_json": {
            "walk": 30
        },
        "strength": 10,
        "dexterity": 16,
        "constitution": 12,
        "intelligence": 10,
        "wisdom": 8,
        "charisma": 7,
        "wisdom_save": 1,
        "condition_immunities": "charmed",
        "senses": "darkvision 60 ft., passive Perception 9",
        "languages": "Common, Goblin",
        "challenge_rating": 2,
        "special_abilities": [
            {
                "name": "Nimble Escape",
                "desc": "The goblin can take the Disengage or Hide action as a bonus action on each of its turns."
            },
            {
                "name": "Stabby Frenzy",
                "desc": "When the goblin hits with a melee attack, it may attack again. It can continue making additional attacks until it does not hit. The goblin cannot move between attacks made with this trait."
            }
        ],
        "actions": [
            {
                "name": "Shortsword",
                "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d6 + 3) piercing damage.",
                "attack_bonus": 5,
                "damage_dice": "1d6",
                "damage_bonus": 3
            },
            {
                "name": "Dagger",
                "desc": "Melee or Ranged Weapon Attack: +5 to hit, reach 5 ft., range 20/60 ft., one target. Hit: 5 (1d4 + 3) piercing damage.",
                "attack_bonus": 5,
                "damage_dice": "1d4",
                "damage_bonus": 3
            }
        ],
        "page_no": 137
    }
    {
        "name": "One-Eyed Cultist",
        "desc": "All one-eyed cultists endure horrific rites of initiation that forever shackle them to the will of the cult leaders. Every cultist can feel the presence of their foul god just beyond the fabric of the physical world, and many claim to hear him speaking to them when the rest of the world is silent, urging them to prepare for his resurrection, either by secretly molding society to accept his return, or by concocting rituals that hasten his rebirth.",
        "size": "Medium",
        "type": "Humanoid",
        "subtype": "any race",
        "alignment": "neutral evil",
        "armor_class": 13,
        "armor_desc": "16 with mage armor",
        "hit_points": 60,
        "hit_dice": "11d8+11",
        "speed": "30 ft.",
        "speed_json": {
            "walk": 30
        },
        "strength": 10,
        "dexterity": 16,
        "constitution": 12,
        "intelligence": 18,
        "wisdom": 8,
        "charisma": 8,
        "wisdom_save": 3,
        "skills": {
            "deception": 7,
            "stealth": 7
        },
        "damage_resistances": "psychic, necrotic",
        "senses": "passive Perception 9",
        "languages": "Common, Infernal",
        "challenge_rating": 7,
        "special_abilities": [
            {
                "name": "Spellcasting",
                "desc": "The one-eyed cultist is an 11th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 16, +8 to hit with spell attacks). The cultist has the following wizard spells prepared:\n\n* Cantrips (at will): chill touch, message, minor illusion, prestidigitation, ray of frost\n* 1st level (4 slots): detect magic, hideous laughter, mage armor, shield\n* 2nd level (3 slots): detect thoughts, suggestion\n* 3rd level (3 slots): counterspell, fear, vampiric touch\n* 4th level (3 slots): greater invisibility, phantasmal killer\n* 5th level (2 slot): dream, mislead\n* 6th level (1 slot): circle of death"
            },
            {
                "name": "Unknowable Secrets",
                "desc": "Any attempt to form a mental link with the one-eyed cultist, scry the cultist, or cast speak with dead on a cultist instantly fails, and the creature that initiated the attempt takes 6d6 psychic damage."
            },
            {
                "name": "One-Eyed",
                "desc": "The cultist has disadvantage on any attack roll made against a target more than 30 feet away."
            }
        ],
        "spells": [
            "chill touch",
            "message",
            "minor illusion",
            "prestidigitation",
            "ray of frost",
            "detect magic",
            "hideous laughter",
            "mage armor",
            "shield",
            "detect thoughts",
            "suggestion",
            "counterspell",
            "fear",
            "vampiric touch",
            "greater invisibility",
            "phantasmal killer",
            "dream",
            "mislead",
            "circle of death"
        ],
        "actions": [
            {
                "name": "Dagger of Wounding",
                "desc": "Melee or Ranged Weapon Attack: +7 to hit, reach 5 ft., range 20/60 ft., one target. Hit: 5 (1d4 + 3) piercing damage. Hit points lost to this weapon’s damage can be regained only through a short or long rest, rather than by regeneration, magic, or any other means.\nOnce per turn, the cultist may choose to wound its target. At the start of each of the wounded creature’s turns, it takes 1d4 necrotic damage for each time the cultist wounded it, and it can then make a DC 15 Constitution saving throw, ending the effect of all such wounds on itself on a success. Alternatively, the wounded creature, or a creature within 5 feet of it, can use an action to make a DC 15 Wisdom (Medicine) check, ending the effect of such wounds on it on a success.",
                "attack_bonus": 7,
                "damage_dice": "1d4",
                "damage_bonus": 3
            }
        ],
        "group": "",
        "page_no": 139
    },
    {
        "name": "One-Eyed Chosen",
        "desc": "Every cultist spends hours in silent meditation, hoping to hear their long-dead master whisper a commandment from beyond the veil. For most, this meditation is fruitless. But some do hear the whispers. In the silence of their meditation, the spectral voice worms its way into their emptied minds, filling their heads with words of power. Fragments of ancient arcane might boils within their blood, granting them spells unseen for ages.",
        "size": "Medium",
        "type": "Humanoid",
        "subtype": "any race",
        "alignment": "neutral evil",
        "armor_class": 12,
        "armor_desc": "15 with mage armor",
        "hit_points": 117,
        "hit_dice": "18d8 + 36",
        "speed": "30 ft.",
        "speed_json": {
            "walk": 30
        },
        "strength": 10,
        "dexterity": 14,
        "constitution": 14,
        "intelligence": 15,
        "wisdom": 16,
        "charisma": 20,
        "wisdom_save": 6,
        "charisma_save": 9,
        "skills": {
            "arcana": 11,
            "deception": 9
        },
        "damage_resistances": "damage from spells",
        "damage_immunities": "necrotic",
        "senses": "truesight 60 ft., passive Perception 13",
        "languages": "Common, Infernal, Abyssal",
        "challenge_rating": 12,
        "special_abilities": [
            {
                "name": "All-Seeing Eye",
                "desc": "As a bonus action, the Chosen may select a creature or object affected by an illusion spell of 4th level or lower. One illusion of the Chosen’s choice affecting that creature is instantly dispelled."
            },
            {
                "name": "Magic Resistance",
                "desc": "The Chosen has advantage on saving throws against spells and other magical effects."
            },
            {
                "name": "Spellcasting",
                "desc": "The Chosen is an 18th-level spellcaster. Its spellcasting ability is Charisma (spell save DC 17, +9 to hit with spell attacks). The Chosen has the following sorcerer spells prepared:\n\n* Cantrips (at will): chill touch, dancing lights, mage hand, message, shocking grasp\n* 1st level (4 slots): charm person, expeditious retreat, mage armor,* shield\n* 2nd level (3 slots): blindness/deafness, darkness, detect thoughts\n* 3rd level (3 slots): counterspell, fly, hypnotic pattern\n* 4th level (3 slots): confusion, greater invisibility*\n* 5th level (3 slots): dominate person, scrying, seeming\n* 6th level (1 slot): eyebite\n* 7th level (1 slot): finger of death\n* 8th level (1 slot): power word stun\n* 9th level (1 slot): power word kill\n\n*The Chosen typically casts these spells on itself before combat."
            }
        ],
        "spells": [
            "chill touch",
            "dancing lights",
            "mage hand",
            "message",
            "shocking grasp",
            "charm person",
            "expeditious retreat",
            "mage armor",
            "shield",
            "blindnessdeafness",
            "darkness",
            "detect thoughts",
            "counterspell",
            "fly",
            "hypnotic pattern",
            "confusion",
            "greater invisibility",
            "phantasmal killer",
            "dominate person",
            "scrying",
            "seeming",
            "eyebite",
            "finger of death",
            "power word stun",
            "power word kill"
        ],
        "actions": [
            {
                "name": "Withered Hand",
                "desc": "Melee Spell Attack: +6 to hit, reach 5 ft., one target. Hit: 37 (5d6 + 20) force damage. If this damage reduces the target to 0 hit points, it is disintegrated.",
                "attack_bonus": 6,
                "damage_dice": "5d6",
                "damage_bonus": 20
            }
        ],
        "page_no": 139
    }
]
