[
    {
        "name": "Optional Campaign Rules and Guidelines",
        "desc": "Every campaign embarks on its heroic tale in its own way. Simple beginnings for a ragtag lot of sellswords. Students of the world falling into the wrong crowd. Unwitting pawns of destiny thrust into something bigger than themselves. However you wish to formulate your story and world, the existing rules for your game help set a very clear vision of how to run it with consistency and intended design.\nThat being said, sometimes the experienced group wishes to add some new flavor to the existing structure of the world. Bring in new options to how old rules function, or adjust to an advanced difficulty in a mystical world where danger, and even death, can be circumvented. This section outlines a number of homebrew rules and guidelines you, and your campaign, can adopt to further customize your gaming experience.\nLike any homebrew or non-standard rules and option, should any of these elements presented before you be of interest, they must be approved and implemented by the dungeon master of your campaign. They may or may not fit their intended game balance. Dungeon Masters, discuss the possible inclusion of any of these elements with your players beforehand to ensure everyone can enjoy any changes you intend. Talk them over and make sure everyone is both aware, and fully understands, the new rules.\nThese guidelines can also be implemented into an existing campaign, just ensure discussion and approval resounds within your gaming group. Any of these proposed rules, as with any rules in a roleplaying game, can be altered, adjusted, and tailored to your personal preference.\n\n## Combat With Larger Parties \n\nWhen running games of larger party size (generally 6 or more players), the combat action economy can become difficult for some players to feel as involved or active due to fewer rounds of combat generally occurring per encounter. Here are a couple of possible recommendations to better allow characters some freer choices during their turn at the proverbial bat.\n\n### Rapid Quaffing \n\nChange the time required to pull free and quaff a potion from one action to one bonus action, or hand out the Rapid Drinker feat to the entire party. This enables many classes, especially more melee/combat focused classes, the ability to down a healing potion or enhancing liquid without sacrificing their entire round of attacks. Administering a potion to an unconscious character would still require an action. Don’t forget: enemies can also drink their potions as quickly!\n\n### Multi-Spell \n\nAt around 8th level, gift the Spelldriver feat to your players. This will allow spellcasting classes more options to aid themselves and the party at higher levels without a comparably sluggish per-round ability set, spending their solitary action on a bonus action spell. This would also apply to enemy spellcasters, leading to additional chaos and challenge.\n\n## Accelerated Downtime \n\nCertain adventures thrive on the adrenaline of the chase, or the ever-present fear of ambush. As it stands, the need to take a short rest can prove difficult during long dungeon crawls, and this lends itself to a nice tone of personal stress and risk-vs-reward. However, sometimes a rest is necessary for the party to even continue, but the current rush of the story’s clock won’t allow for a standard short rest. You could consider lessening the required time to complete a short rest to 30 minutes or less for the moment, or your entire campaign, as an option. Another possibility is to allow the party to take an Arduous Rally if they so choose.\n\n### Arduous Rally \n\nThe party spends 5 minutes to rally their resolve in the face of coming peril, the adrenaline fueling their need to push on. The party benefits from the completion of a full Short Rest, but all healing gained by spending hit dice is halved, and all rallying characters suffer 1 point of Exhaustion (p. 291 PHB).\n\n## Alternative Resurrection Rules \n\nCharacter death can often prove to become a minor inconvenience in some campaigns once the adventuring party reaches a certain level, with spells being available to return fallen comrades from the afterlife with temporary setbacks, robbing a small element of danger and threat to future conflicts and challenges within the story. If you wish to elevate the gravity of character death, you can introduce any of these optional rules.\n\n### A Taxing Return \n\nThis rule calls to the old D&D rules where every time a character is restored to life, the process corrodes a fraction of their vitality, slowly consuming the body until it can no longer sustain life.\nEach time a character is brought back to life via a spell or ritual, that character suffers a permanent loss of 1 point of their Constitution ability score. This loss cannot be restored outside of a carefully worded _wish_ spell. Use of the spell _true resurrection_ to restore a character does not impose this loss of Constitution. Characters that reach a Constitution ability score of 0 are permanently dead and cannot be resurrected.\n\n### Didn’t Come Back Right \n\nWithin this rule, the process of dying and being pulled back into your body is a harrowing experience. The magic itself pulls you from beyond the dark veil of death, taking its toll on your body and psyche each time, leaving you less and less the person you were.\nWhen a character is brought back to life via magic, that character must make a Wisdom saving throw, DC (22 - level of the magic used to return the character to life). A failure on this check inflicts long term madness (see DMG, p260), except that the duration is measured in days rather than hours. A _lesser restoration_ or _remove curse_ will alleviate the madness itself, though it returns any time that character drops to 0 hit points or awakens from sleep, until its full duration has expired.\n\n### Didn’t Come Back Right (advanced) \n\nFor additional consequences and player difficulty, you can implement a further stage of corruption. If a character has died a number of times equal to their Constitution modifier, and they fail their Wisdom saving throw upon being brought back to life, they instead suffer an indefinite madness (see DMG p.260). Any subsequent deaths inflict an additional indefinite madness with each resurrection. A _greater restoration_ spell can temporarily suppress a type of indefinite madness, with it returning anytime that character drops to 0 hit points.\n\n### The Fading Spirit \n\nThis resurrection rule set is designed to add an element of party roleplaying and narrative to the resurrection attempt, as well as the creeping threat of permanent death to a character. Any of the following DC modifiers are easily adjusted to fit your campaign needs.\n\n#### Resurrection Challenge \n\nIf a character is dead, and a return from death is attempted by a spell or spell effect with longer than a one action casting time, a Resurrection Challenge is initiated. Up to 3 members of the adventuring party can offer to contribute to the ritual via skill checks. The DM asks them each to make a skill check based on their form of contribution, with the DC of the check adjusting to how helpful/impactful the DM feels the contribution would be.\nFor example, praying to the god of the devout, fallen character may require an Intelligence (Religion) check at an easy to medium difficulty, where loudly demanding the soul of the fallen to return from the aether may require a Charisma (Intimidation) check at a very hard or nearly impossible difficulty. Advantage and disadvantage can apply here based on how perfect, or off base, the contribution offered is. #### Resurrection Check \nAfter all contributions are completed, the DM then rolls a single, final Resurrection success check with no modifier. The base DC for the final resurrection check is 10, increasing by 1 for each previous successful resurrection the character has undergone (signifying the slow erosion of the soul’s connection to this world). For each successful contribution skill check, this DC is decreased by 3, whereas each failed contribution skill check increases the DC by 1. Upon a successful resurrection check, the player’s soul (should it be willing) will be returned to the body, and the ritual succeeded. On a failed check, the soul does not return and the character is lost.\nOnly the strongest of magical incantations can bypass this resurrection challenge, in the form of the _true resurrection_ or _wish_ spells. These spells can also restore a character to life who was lost due to a failed resurrection ritual, should you allow it. #### Quick Resurrections \nIf a spell with a casting time of 1 action is used to attempt to restore life (via the Revivify spell or similar effects), no contribution skill checks are allowed. The character cast- ing the spell makes a Rapid Resurrection check, rolling a d20 and adding their spellcasting ability modifier. The DC is 10, increasing by 1 for each previous successful resurrection the character has undergone. On a failure, the character’s soul is not lost, but the resurrection fails and increases any future Resurrection checks’ DC by 1. No further attempts can be made to restore this character to life until a resurrection spell with a casting time higher than 1 action is attempted.",
        "parent": "Character Options"
    },
    {
        "name": "The Advancement of a Vestige",
        "desc": "The conditions in which a vestige progresses to the next stage of capability can vary, and many times revolve around the nature of the vestige and its enchantments. Many times the attuned bearer must themselves symbolically progress to a new state of self-discovery or accomplishment. Other times, the artifact will respond to a moment of extreme personal duress or desperation. These triggering moments are entirely up to the DM to identify and enforce, and many times may manifest in ways you had not expected. Allow the organic narrative moments you feel may exemplify such an advance- ment to occur, and tailor your triggering moment accordingly. Some examples may include:\n\n* A character finally surmounts one of their greatest fears, bravely facing an otherwise crippling phobia to save a party member.\n* A character is beaten within an inch of their life by a long-hated foe, and in the face of such defeat, they feel a deep, dormant strength grow from within.\n* A character loses a close ally in battle, and the anguish and fury stirs the power within their vestige.\n* A character discovers a facet of their destiny that guides them towards a dangerous cause and, against their fears, they accept their fate and responsibility.\n* A character gains vengeance against a rival who has tormented them for ages.\n* A character known for restraint gives in to the amoral, violent urges that the artifact was forged in.\n\nGenerally, a vestige will remain dormant between levels 1-8, become awakened early between levels 9-15, and achieve exalted between levels 16-20. However, the moment of advancement ultimately lies within the preference of the DM, and when the appropriate moment presents itself.",
        "parent": "Character Options"
    }
]
