[
{
  "model": "api.magicitem",
  "pk": "argent-mantle",
  "fields": {
    "name": "Argent Mantle",
    "desc": "Often reserved for ranking knights of more dogmatic or monastic military orders, these finely made, hood-and-shoulder pieces endow the wearer with exceptional battlefield, statecraft, and leadership skills. You can use a bonus action to speak a command word, causing a nimbus of golden light to surround your head. This nimbus sheds bright light in a 20-foot radius and dim light for an additional 20 feet. Friendly creatures in the bright light shed by this nimbus have advantage on initiative checks and can't be surprised except when incapacitated. The nimbus lasts until you use a bonus action to speak the command word again or you remove the mantle.\n  ***Endearing Leader.*** While wearing this mantle, you can use an action to increase your Charisma score to 20 for 10 minutes. This has no effect on you if your Charisma is already 20 or higher. This property of the mantle can't be used again until the next dawn.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.580",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "axe-of-many-strikes",
  "fields": {
    "name": "Axe of Many Strikes",
    "desc": "You gain a +1 bonus to attack and damage rolls made with this magic weapon.\nWhen you hit a creature with it, you can choose to deal no damage to the target and instead store the energy of the attack within the blade for 1 minute. You can store up to three attacks in this way. When you hit a creature with this axe while you have at least one attack stored, you can release one or more stored attacks, adding the damage of those stored attacks to the damage of the current attack.\nEach time you release one or more stored attacks from the axe, you have a 10 percent chance of causing the axe to explode. The explosion deals 2d6 force damage to you for each attack you released from the axe, and it destroys the axe.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.580",
    "page_no": null,
    "type": "Weapon (any axe)",
    "rarity": "uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "beads-of-contemplation",
  "fields": {
    "name": "Beads of Contemplation",
    "desc": "This strand of eight wooden beads, each cleverly carved with geometric patterns, hangs from a stout length of cording. The beads store ki energy placed into them, holding the ki until you use it. The beads can store up to 8 ki points. At the end of a short or long rest, you can place ki energy into the beads by touching them and expending a number of ki points equal to half your proficiency bonus.\nWhile wearing or carrying the beads, you can use a bonus action to remove any number of ki points from the beads, regaining that amount of ki points and freeing up space in the beads.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.581",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "uncommon",
    "requires_attunement": "requires attunement by a monk",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "bloodspeed-elixir",
  "fields": {
    "name": "Bloodspeed Elixir",
    "desc": "When you drink this potion, your speed triples for 1 minute, but if you take the Dash action, you take 2d6 poison damage as your body is pushed beyond its normal limits. The murky, crimson liquid smells of ozone and has a thick, sludge-like consistency.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.581",
    "page_no": null,
    "type": "Potion",
    "rarity": "rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "campaign-field-tent",
  "fields": {
    "name": "Campaign Field Tent",
    "desc": "You can use an action to place this 1-inch cloth cube on the ground and speak its command word. The cube rapidly grows into a field tent with open or closed sides (your choice) that remains until you use an action to speak the command word that dismisses it, which works only if the tent is empty.\n  The field tent is a canvas tent, 15 feet on a side and 10 feet high. It remains firmly fixed to the ground, even when standing on bare stone, a ship's deck, or loose sand, and its magic prevents it from being tipped over.\n  Each creature in the area where the tent appears must make a DC 15 Dexterity saving throw, taking 5d10 bludgeoning damage on a failed save, or half as much damage on a successful one. In either case, the creature is pushed to an unoccupied space outside but next to the tent. Objects in the area that aren't being worn or carried take this damage and are pushed automatically.\n  The tent has 50 hit points, immunity to nonmagical attacks, excluding siege weapons, and resistance to all other damage. The tent contains a small table with a chair and five simple beds made of cloth and foldable wooden frames.\n  The field tent can hold up to six Medium or smaller creatures. When a creature finishes a short rest in the tent, it regains double the hit points from any Hit Dice it spends. When a creature finishes a long rest in the tent, it reduces its exhaustion level by 2 instead of 1. In addition, a creature has advantage on saving throws it makes against disease and poison while it rests in the tent.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.581",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "cestus",
  "fields": {
    "name": "Cestus",
    "desc": "These leather hand wraps are padded across the knuckles. You have a bonus to attack and damage rolls made with unarmed strikes while wearing these hand wraps. The bonus is determined by the item's rarity.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.582",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "uncommon (+1), rare (+2), or very rare (+3)",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "chain-cilice",
  "fields": {
    "name": "Chain Cilice",
    "desc": "This bracelet made of spiked chain is designed to fit around the ankle, wrist, or thigh. While wearing the cilice, you can use an action to speak its command word, causing it to tighten on your skin and dealing 1d6 piercing damage to you at the start of each of your turns until you use a bonus action to end it. If you have the Ki class feature or ki points from another source, such as the Inner Resilience feat (see the Backgrounds and Feats chapter), you regain 1 ki point for every 5 damage caused by the cilice. If the cilice would reduce you to 0 hit points, it reduces you to 1 hit point instead and the effect ends.\n  If the cilice's effect was ended in this way, it can't be used again until the next dawn.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.582",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "cloak-of-tentacles",
  "fields": {
    "name": "Cloak of Tentacles",
    "desc": "This cloak settles around your shoulders like a writhing creature, somehow simultaneously warm to the touch and icy cold against your skin.\n  ***Shimmering Skin.*** While wearing this cloak, you can use an action to expose its shimmering inner lining. Each creature within 10 feet of you and that can see you must make a DC 15 Wisdom saving throw. On a failed save, a creature is incapacitated until the end of its next turn. Once used, this property of the cloak can't be used again until the next dawn.\n  ***Writhing Tentacles.*** While wearing this cloak, you can use a bonus action to command the cloak to sprout four writhing tentacles for 1 minute. When a creature hits you with a melee attack while within 10 feet of you, one of the tentacles lashes out and makes an attack roll at your attacker with a +7 bonus. On a hit, the tentacle deals 2d10 bludgeoning damage then falls still, becoming inert. When the duration ends or once all four tentacles become inert, this property of the cloak can't be used again until the next dawn",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.582",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "deepstone-cestus",
  "fields": {
    "name": "Deepstone Cestus",
    "desc": "These leather hand wraps are fitted with round, flat stones engraved with runes. While wearing these wraps, your ki save DC increases by 2.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.583",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "very rare",
    "requires_attunement": "requires attunement by a monk",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "esquires-rowels",
  "fields": {
    "name": "Esquire's Rowels",
    "desc": "While riding a mount and wearing these silver-chased spurs, you have a +1 bonus to initiative rolls, and your mount1s Armor Class increases by 2. In addition, while riding a mount and wearing these spurs, you and your mount have advantage on Constitution saving throws against exhaustion caused by traveling more than 8 hours in a day.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.583",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "fletchers-retort-gloves",
  "fields": {
    "name": "Fletcher's Retort Gloves",
    "desc": "When you use the Deflect Missiles reaction while wearing these gloves, you can spend 1 ki point to reduce the damage you take from the attack by 1d10 + your Dexterity modifier + twice your monk level instead. If you reduce the damage to 0 in this way and spend 1 ki point to throw the missile, the attack has a normal range of 30 feet and a long range of 120 feet.\n  In addition, when a friendly creature within 5 feet of you is hit with a ranged weapon attack while you are wearing these gloves, you can use Deflect Missiles to deflect or catch the missile.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.583",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "rare",
    "requires_attunement": "requires attunement by a monk",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "giantstrike-cestus",
  "fields": {
    "name": "Giantstrike Cestus",
    "desc": "These leather hand wraps are fitted with iron plates engraved with runes. When you make unarmed strikes while wearing these wraps, your Martial Arts die is one die higher.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.584",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "very rare",
    "requires_attunement": "requires attunement by a monk",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "heartglow-lantern",
  "fields": {
    "name": "Heartglow Lantern",
    "desc": "Fashioned from a single piece of specially grown, hexagonal crystal fitted within a metal frame, a heartglow lantern doesn1t use burning fuel or ignited material to generate light, making it ideal in caverns where air supplies can be precious. You can use an action while holding one of these lanterns to cause it to shed bright light in a 20-foot radius and dim light for an additional 20 feet. The light lasts until you use a bonus action to repeat the command word or until the lantern is no longer being held or carried by a living creature.\n  Each lantern can create an additional effect when it is infused with vitality. Any creature touching a lantern can use an action to infuse it with some of the creature1s vitality. The creature1s hit-point maximum is reduced by an amount equal to the creature1s proficiency bonus, and the lantern gains charges equal to that amount. This reduction lasts until the creature finishes a long rest. Each lantern can hold any number of charges from any number of creatures, but each creature can infuse a lantern with vitality only once between long rests.\n  ***Deadbane (Uncommon).*** While holding this lantern, you can use an action and expend 1 or more of its charges to cause the lantern to detect undead for 1 hour. When an undead is within 20 feet of the lantern, the light it sheds changes to blue, growing brighter the closer the undead is to the lantern. For each charge you spend beyond the first, the duration increases by 30 minutes, and the distance the lantern can detect undead increases by 5 feet. Increasing this distance doesn't increase the radius of the light shed by the lantern.\n  ***Floodmote (Very Rare).*** If you are submerged while holding or carrying this lantern, you can use a reaction and expend 1 or more of its charges to create a small bubble of air for yourself for 1 hour. For each charge you spend beyond the first, the duration increases by 1 hour, and you can choose one additional creature within 30 feet of you to also be protected with a bubble of air. The bubble of air surrounds only a creature's head or other airbreathing organ and provides breathable air to the creature for the duration.\n  ***Tumblesafe (Rare).*** If you or a friendly creature you can see within 40 feet of you falls while you are holding or carrying this lantern, you can use a reaction and expend 1 or more of its charges to slow the fall. For each charge you spend beyond the first, you can extend the light shed by the lantern by 5 feet. Each falling creature and object in the lantern's light descends at a rate of 60 feet per round and takes no damage from falling. It continues to descend at this rate until it lands, even if it exits the lantern's light before it lands.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.584",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "rarity varies",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "javelin-of-teleportation",
  "fields": {
    "name": "Javelin of Teleportation",
    "desc": "This short-hafted javelin bears a long, metal head. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit a creature with this weapon, you can speak its command word and force the target to make a DC 13 Wisdom saving throw. On a failed save, the target is teleported to an unoccupied space you can see within 60 feet of you. That space must be on the ground or on a floor.\n  The javelin’s property can’t be used again until the next dawn. In the meantime, the javelin can still be used as a magic weapon.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.584",
    "page_no": null,
    "type": "Weapon (javelin)",
    "rarity": "uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "knight-sergeants-surcoat",
  "fields": {
    "name": "Knight-Sergeant's Surcoat",
    "desc": "Fashioned from durable canvas and fine silk, this long, padded knight’s tabard bears the colors and heraldry of a long-forgotten order of knights. While wearing this surcoat, you have advantage on Wisdom (Animal Handling) checks when interacting with horses, and you have advantage on Charisma (Persuasion) checks made to interact with humanoids of a higher social rank than you, such as an army’s general or a region’s monarch.\n  ***Knight’s Livery.*** While attuned to and wearing both the *knightsergeant’s surcoat* and the *argent mantle*, your Charisma score is 20. This has no effect on you if your Charisma is already 20 or higher.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.585",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "medics-sash",
  "fields": {
    "name": "Medic's Sash",
    "desc": "While wearing this sash, your carrying capacity doubles. In addition, your movement doesn’t provoke opportunity attacks if you are carrying a friendly creature that has 0 hit points or is dying.\n  ***First Aid.*** The sash has 3 charges. While wearing the sash, you can expend 1 charge as an action to cast the spare the dying spell, and you can expend 2 charges as an action to cast the cure wounds spell, using your Charisma modifier as your spellcasting ability modifier (minimum of +1). The sash recovers all expended charges daily at dawn.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.585",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "momentblade",
  "fields": {
    "name": "Momentblade",
    "desc": "You gain a +1 bonus to attack and damage rolls made with this magic weapon.\n  When you roll a 20 on an attack roll made with this weapon, the target disappears and shuffles forward in time. At the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. When the target returns, it is unaware that any time has passed. If the target is concentrating on a spell and succeeds on the check to maintain concentration after taking damage from your attack with this weapon, the round it disappeared doesn’t count against the spell’s remaining duration.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.585",
    "page_no": null,
    "type": "Weapon (any axe or sword)",
    "rarity": "rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ninefold-swarmdagger",
  "fields": {
    "name": "Ninefold Swarmdagger",
    "desc": "You gain a +1 bonus to attack and damage rolls made with this magic weapon.\n  When you hit a creature with this weapon, you can use a bonus action to launch ghostly duplicates of the dagger at nearby creatures. Ghostly duplicates of the dagger fly at up to three creatures you can see within 30 feet of the creature you hit. Make a ranged attack with this dagger at each target. On a hit, a target takes 1d4 force damage. Once you hit six creatures with these ghostly daggers, you can’t launch ghostly daggers from this weapon again until the next dawn.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.586",
    "page_no": null,
    "type": "Weapon (dagger)",
    "rarity": "rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "paired-gauntlets-of-striking",
  "fields": {
    "name": "Paired Gauntlets of Striking",
    "desc": "These leather gloves are reinforced with steel plates and decorated with images of two humanoids fighting side-by-side. While you and another creature are each wearing one of the gauntlets and are each within 5 feet of the same creature, you both have advantage on the first attack roll you make against that creature on each of your turns.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.587",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "phase-arrow",
  "fields": {
    "name": "Phase Arrow",
    "desc": "When you make a ranged attack with this arrow, the attack ignores half and three-quarters cover as the arrow dips briefly into the Plane of Shadow on its way to the target. If the target has full cover and you are aware the target is in a particular space, you can fire this arrow at the target with disadvantage on the attack roll.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.587",
    "page_no": null,
    "type": "Weapon (arrow)",
    "rarity": "uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-belt",
  "fields": {
    "name": "Potion Belt",
    "desc": "One or more thin bands of flexible, pale blue crystal run along this plain, brown leather belt. As an action, you can pour a potion onto a band of crystal, which absorbs the potion and turns a deep blue. Each band of crystal can store only one potion at a time.\n  ***Potion Belt (Common).*** This belt contains only one band of crystal. While wearing the belt, you can use an action to speak the belt’s command word and gain the benefits of the potion as if you drank it.\n  ***Greater Potion Belt (Rare).*** This belt contains three bands of crystal. While wearing the belt, you can use a bonus action to speak the belt’s command word and the name of one of the potions and gain the benefits of the named potion as if you drank it.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.587",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "rarity varies",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-infinite-possibilities",
  "fields": {
    "name": "Potion of Infinite Possibilities",
    "desc": "This deep purple potion swirls with glittering flashes of red, green, and blue and smells faintly of ozone. For 1 hour after drinking this potion, you gain the following benefits:\n* You have blindsight out to a range of 60 feet.\n* When you roll a 1 on an ability check, saving throw, or attack roll, you can reroll the die and must use the new roll.\n *You can see into the Ethereal Plane. Ethereal creatures and objects appear ghostly and translucent.\nWhen the duration ends, you are stunned until the end of your next turn as your mind reels from the loss of the mind-altering effects.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.588",
    "page_no": null,
    "type": "Potion",
    "rarity": "very rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "pouch-of-runestones",
  "fields": {
    "name": "Pouch of Runestones",
    "desc": "This ordinary bag, made from cured animal hide, appears empty. Reaching inside the bag, however, reveals the presence of a number of flat, bone tiles. The bag weighs 1/2 pound.\n  You can use an action to pull one of the tiles from the bag and throw it into the air in front of you. The tile floats 5 feet off the ground and displays a runic symbol. Make a DC 12 Wisdom check. The symbol on the tile is upright on a successful save, and it is reversed on a failed save. Roll a d12 and consult the appropriate table to determine the rune’s effect. If a result requires a saving throw, the DC is 15. The tile vanishes after it displays a rune, but the bag never runs out of tiles.\n  Once used, the bag shouldn’t be used again until the next dawn. Each time it is used again before then, the DC of the Wisdom check increases by 5 for each tile drawn after the first. You can be affected by more than one rune’s effect at a time.\n  Unless otherwise noted, each rune’s effect lasts until you finish a long rest.\n\n ***Upright Runestone*** \n\n| d12  | Rune     | Meaning       | Effect |\n|------|----------|---------------|--------|\n| 1    | Ansuz    | Truth         | When this rune appears, a zone of truth spell is triggered, centered on you, and it moves with you for 1 hour. |\n| 2    | Naudiz   | Necessity     | You have advantage on the next saving throw you make before this effect ends. |\n| 3    | Hagalaz  | Winter        | You can cast the ice storm spell once before this effect ends. |\n| 4    | Laukaz   | Sea           | You can breathe air and water for 5 hours. |\n| 5    | Algiz    | Protection    | You gain a +2 bonus to AC. |\n| 6    | Mannaz   | Teamwork      | You and up to five creatures of your choice that you can see gain 10 temporary hit points. |\n| 7    | Isaz     | Ice           | When you hit with an attack, the attack deals an extra 1d6 cold damage. |\n| 8    | Berkanan | Bear Maiden   | You can use an action to cast polymorph on yourself, transforming into a brown bear. While you are in the form of the brown bear, you retain your Intelligence, Wisdom, and Charisma scores. You can end this effect early as a bonus action. |\n| 9    | Perto    | Mystery       | You can cast disguise self at will. |\n| 10   | Ehwaz    | Freedom       | Until this effect ends, you can spend 5 feet of movement to automatically escape from nonmagical restraints, such as manacles or a creature that has you grappled. |\n| 11   | Raido    | Easy Travel   | Your walking speed increases by 10 feet. |\n| 12   | Kaunen   | Enlightenment | You can cast the lesser restoration spell as a bonus action once before this effect ends. |\n\n ***Reversed Runestone*** \n\n| d12  | Rune     | Meaning             | Effect |\n|------|----------|---------------------|--------|\n| 1    | Ansuz    | Falsehood           | You believe everything you hear to be a lie. |\n| 2    | Naudiz   | Consequence         | You have disadvantage on the next saving throw you make before this effect ends. |\n| 3    | Hagalaz  | Blizzard            | When this rune appears, a freezing sphere spell is triggered, centered on you. |\n| 4    | Laukaz   | Sky                 | When this rune appears, a reverse gravity spell is triggered, centered on you. The effect ends at the start of your next turn. |\n| 5    | Algiz    | Vulnerability       | Your Armor Class is reduced by 2. |\n| 6    | Mannaz   | Dissension          | You and friendly creatures within 30 feet of you have disadvantage on attack rolls while within 10 feet of each other. |\n| 7    | Isaz     | Ice                 | You have vulnerability to cold damage. |\n| 8    | Berkanan | Bear Matron         | When this rune appears, a brown bear also appears an unoccupied space nearest to you, and it attacks you. |\n| 9    | Perto    | Unwanted Revelation | You have disadvantage on Charisma checks. |\n| 10   | Ehwaz    | Shackles            | When this rune appears, a maze spell is triggered, targeting you. The effect lasts for 10 minutes or until you escape the maze. |\n| 11   | Raido    | Hard Travel         | Your walking speed is reduced by 10 feet. |\n| 12   | Kaunen   | Insanity            | You suffer a long-term madness. |\n\n",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.588",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "serpentine-sandals",
  "fields": {
    "name": "Serpentine Sandals",
    "desc": "While wearing these glistening, snake-skin sandals, you ignore difficult terrain created by marsh, swamps, or other shallow water, such as a rain-soaked rooftop. In addition, you have advantage on ability checks and saving throws made to escape a grapple or the restrained condition while wearing these sandals.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.588",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "shattershot-arrow",
  "fields": {
    "name": "Shattershot Arrow",
    "desc": "When you hit a creature with this weapon, the target takes an extra 3d6 thunder damage as the arrow releases a sudden, loud ringing. Each creature made of inorganic material such as stone, crystal, or metal that is within 10 feet of the target must make a DC 13 Constitution saving throw, taking 3d6 thunder damage on a failed save, or half as much damage on a successful one. A nonmagical object that isn’t being worn or carried also takes the damage if it’s within 10 feet of the target.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.589",
    "page_no": null,
    "type": "Weapon (arrow)",
    "rarity": "uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "soulbound-wraps",
  "fields": {
    "name": "Soulbound Wraps",
    "desc": "These cloth hand wraps are embroidered with symbols of balance and meditation. When you hit a creature with an unarmed strike while wearing these wraps, you can choose to reduce the damage you deal by up to 10, pulling some of the energy of the hit back into you through the wraps. You regain 1 ki point for every 10 damage you choose not to deal to a creature you hit. Once you regain a number of ki points equal to half your proficiency bonus, the wraps unravel and can’t be worn again until the next dawn.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.589",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "rare",
    "requires_attunement": "requires attunement by a monk",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "stasis-stone",
  "fields": {
    "name": "Stasis Stone",
    "desc": "This small, crystalline, purple stone measures 3/4 of an inch in diameter and weighs an ounce. Typically, 1d4 + 2 *stasis stones* can be found together.\n  You can use an action to throw the stone up to 30 feet. The stone explodes on impact and is destroyed. Each creature within a 10-foot radius of where the stone landed must succeed on a DC 15 Constitution saving throw or be petrified until the end of its next turn as the stone releases temporal magic and freezes it in time.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.589",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "very rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "stormheart-bow",
  "fields": {
    "name": "Stormheart Bow",
    "desc": "This bow is made from dragon bone and fey heartstring. When you hit with an attack using this magic bow, the target takes an extra 1d6 lightning damage. The bow has 5 charges for the following other properties. It regains 1d4 + 1 expended charges daily at dawn.\n  ***Iceshard Arrow.*** You can expend 3 charges when you hit with an attack using this magic bow to cause the arrow to turn to ice and shatter in mid-air. Choose up to three targets within 30 feet of your original target. Your original target takes damage as normal, and each chosen target takes 1d6 cold damage.\n  ***Thunder Arrow.*** You can expend 2 charges when you hit with an attack using this magic bow to cause the attack to release a peal of thunder. The target takes damage as normal, and each creature within 15 feet of the target must make a DC 15 Constitution saving throw, taking 2d6 thunder damage on a failed save, or half as much damage on a successful one.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.590",
    "page_no": null,
    "type": "Weapon (shortbow or longbow)",
    "rarity": "rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "victory-banner",
  "fields": {
    "name": "Victory Banner",
    "desc": "This small banner is mounted on a short haft and can be attached to a backpack, saddle, or similar equipment. The banner has 3 charges. It regains all expended charges daily at dawn. You can expend 1 of its charges to give yourself advantage on weapon attacks for 1 minute. When you roll a 20 on an attack roll made with a weapon, you can expend 1 charge to move up to your speed without provoking opportunity attacks.\n  You must be within 5 feet of the banner to expend any of its charges.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.590",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "very rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
}
]
