[
{
  "model": "api.race",
  "pk": "alseid",
  "fields": {
    "name": "Alseid",
    "desc": "## Alseid Traits\nYour alseid character has certain characteristics in common with all other alseid.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.674",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Dexterity score increases by 2, and your Wisdom score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Dexterity\"], \"value\": 2}, {\"attributes\": [\"Wisdom\"], \"value\": 1}]",
    "age": "***Age.*** Alseid reach maturity by the age of 20. They can live well beyond 100 years, but it is unknown just how old they can become.",
    "alignment": "***Alignment.*** Alseid are generally chaotic, flowing with the unpredictable whims of nature, though variations are common, particularly among those rare few who leave their people.",
    "size": "***Size.*** Alseid stand over 6 feet tall and weigh around 300 pounds. Your size is Medium.",
    "size_raw": "Medium",
    "speed_json": "{\"walk\": 40}",
    "speed_desc": "***Speed.*** Alseid are fast for their size, with a base walking speed of 40 feet.",
    "languages": "***Languages.*** You can speak, read, and write Common and Elvish.",
    "vision": "***Darkvision.*** Accustomed to the limited light beneath the forest canopy, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "traits": "***Alseid Weapon Training.*** You have proficiency with spears and shortbows.\n\n***Light Hooves.*** You have proficiency in the Stealth skill.\n\n***Quadruped.*** The mundane details of the structures of humanoids can present considerable obstacles for you. You have to squeeze when moving through trapdoors, manholes, and similar structures even when a Medium humanoid wouldn't have to squeeze. In addition, ladders, stairs, and similar structures are difficult terrain for you.\n\n***Woodfriend.*** When in a forest, you leave no tracks and can automatically discern true north.",
    "route": "races/"
  }
},
{
  "model": "api.race",
  "pk": "catfolk",
  "fields": {
    "name": "Catfolk",
    "desc": "## Catfolk Traits\nYour catfolk character has the following traits.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.674",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Dexterity score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Dexterity\"], \"value\": 2}]",
    "age": "***Age.*** Catfolk mature at the same rate as humans and can live just past a century.",
    "alignment": "***Alignment.*** Catfolk tend toward two extremes. Some are free-spirited and chaotic, letting impulse and fancy guide their decisions. Others are devoted to duty and personal honor. Typically, catfolk deem concepts such as good and evil as less important than freedom or their oaths.",
    "size": "***Size.*** Catfolk have a similar stature to humans but are generally leaner and more muscular. Your size is Medium.",
    "size_raw": "Medium",
    "speed_json": "{\"walk\": 30}",
    "speed_desc": "***Speed.*** Your base walking speed is 30 feet.",
    "languages": "***Languages.*** You can speak, read, and write Common.",
    "vision": "***Darkvision.*** You have a cat's keen senses, especially in the dark. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "traits": "***Cat's Claws.*** Your sharp claws can cut with ease. Your claws are natural melee weapons, which you can use to make unarmed strikes. When you hit with a claw, your claw deals slashing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.\n\n***Hunter's Senses.*** You have proficiency in the Perception and Stealth skills.",
    "route": "races/"
  }
},
{
  "model": "api.race",
  "pk": "darakhul",
  "fields": {
    "name": "Darakhul",
    "desc": "## Darakhul Traits\nYour darakhul character has certain characteristics in common with all other darakhul.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.675",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Constitution score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Constitution\"], \"value\": 1}]",
    "age": "***Age.*** An upper limit of darakhul age has never been discovered; most darakhul die violently.",
    "alignment": "***Alignment.*** Your alignment does not change when you become a darakhul, but most darakhul have a strong draw toward evil.",
    "size": "***Size.*** Your size is determined by your Heritage Subrace.",
    "size_raw": "Medium",
    "speed_json": "{\"walk\": 30}",
    "speed_desc": "***Speed.*** Your base walking speed is determined by your Heritage Subrace.",
    "languages": "***Languages.*** You can speak, read, and write Common, Darakhul, and a language associated with your Heritage Subrace.",
    "vision": "***Darkvision.*** You can see in dim light within 60 feet as though it were bright light and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "traits": "***Hunger for Flesh.*** You must consume 1 pound of raw meat each day or suffer the effects of starvation. If you go 24 hours without such a meal, you gain one level of exhaustion. While you have any levels of exhaustion from this trait, you can't regain hit points or remove levels of exhaustion until you spend at least 1 hour consuming 10 pounds of raw meat.\n\n***Imperfect Undeath.*** You transitioned into undeath, but your transition was imperfect. Though you are a humanoid, you are susceptible to effects that target undead. You can regain hit points from spells like cure wounds, but you can also be affected by game effects that specifically target undead, such as a cleric's Turn Undead feature. Game effects that raise a creature from the dead work on you as normal, but they return you to life as a darakhul. A true resurrection or wish spell can restore you to life as a fully living member of your original race.\n\n***Powerful Jaw.*** Your heavy jaw is powerful enough to crush bones to powder. Your bite is a natural melee weapon, which you can use to make unarmed strikes. When you hit with it, your bite deals piercing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.\n\n***Sunlight Sensitivity.*** You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight.\n\n***Undead Resilience.*** You are infused with the dark energy of undeath, which frees you from some frailties that plague most creatures. You have resistance to necrotic damage and poison damage, you are immune to disease, and you have advantage on saving throws against being charmed or poisoned. When you finish a short rest, you can reduce your exhaustion level by 1, provided you have ingested at least 1 pound of raw meat in the last 24 hours (see Hunger for Flesh).\n\n***Undead Vitality.*** You don't need to breathe, and you don't sleep the way most creatures do. Instead, you enter a dormant state that resembles death, remaining semiconscious, for 6 hours a day. While dormant, you have disadvantage on Wisdom (Perception) checks. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.\n\n***Heritage Subrace.*** You were something else before you became a darakhul. This heritage determines some of your traits. Choose one Heritage Subrace below and apply the listed traits.",
    "route": "races/"
  }
},
{
  "model": "api.race",
  "pk": "derro",
  "fields": {
    "name": "Derro",
    "desc": "## Derro Traits\nYour derro character has certain characteristics in common with all other derro.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.680",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Dexterity score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Dexterity\"], \"value\": 2}]",
    "age": "***Age.*** Derro reach maturity by the age of 15 and live to be around 75.",
    "alignment": "***Alignment.*** The derro's naturally unhinged minds are nearly always chaotic, and many, but not all, are evil.",
    "size": "***Size.*** Derro stand between 3 and 4 feet tall with slender limbs and wide shoulders. Your size is Small.",
    "size_raw": "Medium",
    "speed_json": "{\"walk\": 30}",
    "speed_desc": "***Speed.*** Derro are fast for their size. Your base walking speed is 30 feet.",
    "languages": "***Languages.*** You can speak, read, and write Dwarvish and your choice of Common or Undercommon.",
    "vision": "***Superior Darkvision.*** Accustomed to life underground, you can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "traits": "***Eldritch Resilience.*** You have advantage on Constitution saving throws against spells.\n\n***Sunlight Sensitivity.*** You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight.",
    "route": "races/"
  }
},
{
  "model": "api.race",
  "pk": "drow",
  "fields": {
    "name": "Drow",
    "desc": "## Drow Traits\nYour drow character has certain characteristics in common with all other drow.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.682",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Intelligence score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Intelligence\"], \"value\": 2}]",
    "age": "***Age.*** Drow physically mature at the same rate as humans, but they aren't considered adults until they reach the age of 50. They typically live to be around 500.",
    "alignment": "***Alignment.*** Drow believe in reason and rationality, which leads them to favor lawful activities. However, their current dire situation makes them more prone than their ancestors to chaotic behavior. Their vicious fight for survival makes them capable of doing great evil in the name of self-preservation, although they are not, by nature, prone to evil in other circumstances.",
    "size": "***Size.*** Drow are slightly shorter and slimmer than humans. Your size is Medium.",
    "size_raw": "Medium",
    "speed_json": "{\"walk\": 25}",
    "speed_desc": "***Speed.*** Your base walking speed is 30 feet.",
    "languages": "***Languages.*** You can speak, read, and write Elvish and your choice of Common or Undercommon.",
    "vision": "***Superior Darkvision.*** Accustomed to life in the darkest depths of the world, you can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "traits": "***Fey Ancestry.*** You have advantage on saving throws against being charmed, and magic can't put you to sleep.\n\n***Mind of Steel.*** You understand the complexities of minds, as well as the magic that can affect them. You have advantage on Wisdom, Intelligence, and Charisma saving throws against spells.\n\n***Sunlight Sensitivity.*** You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight.",
    "route": "races/"
  }
},
{
  "model": "api.race",
  "pk": "erina",
  "fields": {
    "name": "Erina",
    "desc": "## Erina Traits\nYour erina character has traits which complement its curiosity, sociability, and fierce nature.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.684",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Dexterity score increases by 2, and you can choose to increase either your Wisdom or Charisma score by 1.",
    "asi_json": "[{\"attributes\": [\"Dexterity\"], \"value\": 2}]",
    "age": "***Age.*** Erina reach maturity around 15 years and can live up to 60 years, though some erina burrow elders have memories of events which suggest erina can live much longer.",
    "alignment": "***Alignment.*** Erina are good-hearted and extremely social creatures who have a difficult time adapting to the laws of other species.",
    "size": "***Size.*** Erina average about 3 feet tall and weigh about 50 pounds. Your size is Small.",
    "size_raw": "Medium",
    "speed_json": "{\"walk\": 25}",
    "speed_desc": "***Speed.*** Your base walking speed is 25 feet.",
    "languages": "***Languages.*** You can speak Erina and either Common or Sylvan.",
    "vision": "***Darkvision.*** Accustomed to life in the dark burrows of your people, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "traits": "***Hardy.*** The erina diet of snakes and venomous insects has made them hardy. You have advantage on saving throws against poison, and you have resistance against poison damage.\n\n***Spines.*** Erina grow needle-sharp spines in small clusters atop their heads and along their backs. While you are grappling a creature or while a creature is grappling you, the creature takes 1d4 piercing damage at the start of your turn.\n\n***Keen Senses.*** You have proficiency in the Perception skill.\n\n***Digger.*** You have a burrowing speed of 20 feet, but you can use it to move through only earth and sand, not mud, ice, or rock.",
    "route": "races/"
  }
},
{
  "model": "api.race",
  "pk": "gearforged",
  "fields": {
    "name": "Gearforged",
    "desc": "## Gearforged Traits\nThe range of gearforged anatomy in all its variants is remarkable, but all gearforged share some common parts.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.684",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Two different ability scores of your choice increase by 1.",
    "asi_json": "[{\"attributes\": [\"Any\"], \"value\": 1}, {\"attributes\": [\"Any\"], \"value\": 1}]",
    "age": "***Age.*** The soul inhabiting a gearforged can be any age. As long as its new body is kept in good repair, there is no known limit to how long it can function.",
    "alignment": "***Alignment.*** No single alignment typifies gearforged, but most gearforged maintain the alignment they had before becoming gearforged.",
    "size": "***Size.*** Your size is determined by your Race Chassis.",
    "size_raw": "Medium",
    "speed_json": "{\"walk\": 30}",
    "speed_desc": "***Speed.*** Your base walking speed is determined by your Race Chassis.",
    "languages": "***Languages.*** You can speak, read, and write Common, Machine Speech (a whistling, clicking language that's incomprehensible to non-gearforged), and a language associated with your Race Chassis.",
    "vision": "",
    "traits": "***Construct Resilience.*** Your body is constructed, which frees you from some of the limits of fleshand- blood creatures. You have resistance to poison damage, you are immune to disease, and you have advantage on saving throws against being poisoned.\n\n***Construct Vitality.*** You don't need to eat, drink, or breathe, and you don't sleep the way most creatures do. Instead, you enter a dormant state where you resemble a statue and remain semiconscious for 6 hours a day. During this time, the magic in your soul gem and everwound springs slowly repairs the day's damage to your mechanical body. While in this dormant state, you have disadvantage on Wisdom (Perception) checks. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.\n\n***Living Construct.*** Your consciousness and soul reside within a soul gem to animate your mechanical body. As such, you are a living creature with some of the benefits and drawbacks of a construct. Though you can regain hit points from spells like cure wounds, you can also be affected by game effects that specifically target constructs, such as the shatter spell. As long as your soul gem remains intact, game effects that raise a creature from the dead work on you as normal, repairing the damaged pieces of your mechanical body (restoring lost sections only if the spell normally restores lost limbs) and returning you to life as a gearforged. Alternatively, if your body is destroyed but your soul gem and memory gears are intact, they can be installed into a new body with a ritual that takes one day and 10,000 gp worth of materials. If your soul gem is destroyed, only a wish spell can restore you to life, and you return as a fully living member of your original race.\n\n***Race Chassis.*** Four races are known to create unique gearforged, building mechanical bodies similar in size and shape to their people: dwarf, gnome, human, and kobold. Choose one of these forms.",
    "route": "races/"
  }
},
{
  "model": "api.race",
  "pk": "minotaur",
  "fields": {
    "name": "Minotaur",
    "desc": "Your minotaur character has certain characteristics in common with all other minotaurs.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.686",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Strength score increases by 2, and your Constitution score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Strength\"], \"value\": 2}, {\"attributes\": [\"Constitution\"], \"value\": 1}]",
    "age": "***Age.*** Minotaurs age at roughly the same rate as humans but mature 3 years earlier. Childhood ends around the age of 10 and adulthood is celebrated at 15.",
    "alignment": "***Alignment.*** Minotaurs possess a wide range of alignments, just as humans do. Mixing a love for personal freedom and respect for history and tradition, the majority of minotaurs fall into neutral alignments.",
    "size": "***Size.*** Adult males can reach a height of 7 feet, with females averaging 3 inches shorter. Your size is Medium.",
    "size_raw": "Medium",
    "speed_json": "{\"walk\": 30}",
    "speed_desc": "***Speed.*** Your base walking speed is 30 feet.",
    "languages": "***Languages.*** You can speak, read, and write Common and Minotaur.",
    "vision": "***Darkvision.*** You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "traits": "***Natural Attacks.*** Your horns are sturdy and sharp. Your horns are a natural melee weapon, which you can use to make unarmed strikes. When you hit with your horns, they deal piercing damage equal to 1d6 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.\n\n***Charge.*** Once per turn, if you move at least 10 feet toward a target and hit it with a horn attack in the same turn, you deal an extra 1d6 piercing damage and you can shove the target up to 5 feet as a bonus action. At 11th level, when you shove a creature with Charge, you can push it up to 10 feet instead. You can use this trait a number of times per day equal to your Constitution modifier (minimum of once), and you regain all expended uses when you finish a long rest.\n\n***Labyrinth Sense.*** You can retrace without error any path you have previously taken, with no ability check.",
    "route": "races/"
  }
},
{
  "model": "api.race",
  "pk": "mushroomfolk",
  "fields": {
    "name": "Mushroomfolk",
    "desc": "Your mushroomfolk character has characteristics in common with all other mushroomfolk.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.687",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Wisdom score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Wisdom\"], \"value\": 2}]",
    "age": "***Age.*** Mushroomfolk reach maturity by the age of 5 and rarely live longer than 50 years.",
    "alignment": "***Alignment.*** The limited interaction mushroomfolk have with other creatures leaves them with a fairly neutral view of the world in terms of good and evil, while their societal structure makes them more prone to law than chaos.",
    "size": "***Size.*** A mushroomfolk's size is determined by its subrace.",
    "size_raw": "Medium",
    "speed_json": "{\"walk\": 30}",
    "speed_desc": "***Speed.*** Your base walking speed is 30 feet.",
    "languages": "***Languages.*** You can speak, read, and write Mushroomfolk and your choice of Common or Undercommon.",
    "vision": "***Darkvision.*** Accustomed to life underground, you can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "traits": "***Fungoid Form.*** You are a humanoid, though the fungal nature of your body and your unique diet of decayed vegetable and animal matter marks you with some plant-like characteristics. You have advantage on saving throws against poison, and you have resistance to poison damage. In addition, you are immune to disease.\n\n***Hardy Survivor.*** Your upbringing in mushroomfolk society has taught you how to defend yourself and find food. You have proficiency in the Survival skill.\n\n***Subrace.*** Three subraces of mushroomfolk are known to wander the world: acid cap, favored, and morel. Choose one of these subraces.",
    "route": "races/"
  }
},
{
  "model": "api.race",
  "pk": "satarre",
  "fields": {
    "name": "Satarre",
    "desc": "Your satarre heritage is apparent in a variety of traits you share with other satarre.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.688",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Constitution score increases by 2, and your Intelligence score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Constitution\"], \"value\": 2}, {\"attributes\": [\"Intelligence\"], \"value\": 1}]",
    "age": "***Age.*** Satarre grow quickly, walking soon after hatching and reaching the development of a 15-year-old human by age 6. They maintain the same appearance until about 50, then begin a rapid decline. Satarre often die violently, but those who live longer survive to no more than 65 years of age.",
    "alignment": "***Alignment.*** Satarre are born with a tendency toward evil akin to that of rapacious dragons, and, when raised among other satarre or darakhul, they are usually evil. Those raised among other cultures tend toward the norm for those cultures.",
    "size": "***Size.*** Satarre are tall but thin, from 6 to 7 feet tall with peculiar, segmented limbs. Your size is Medium.",
    "size_raw": "Medium",
    "speed_json": "{\"walk\": 30}",
    "speed_desc": "***Speed.*** Your base walking speed is 30 feet.",
    "languages": "***Languages.*** You can speak, read, and write Common and one of the following: Abyssal, Infernal, or Void Speech. Void Speech is a language of dark gods and ancient blasphemies, and the mere sound of its sibilant tones makes many other creatures quite uncomfortable.",
    "vision": "***Darkvision.*** Thanks to your dark planar parentage, you have superior vision in darkness. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "traits": "***A Friend to Death.*** You have resistance to necrotic damage.\n\n***Keeper of Secrets.*** You have proficiency in the Arcana skill, and you have advantage on Intelligence (Arcana) checks related to the planes and planar travel. In addition, you have proficiency in one of the following skills of your choice: History, Insight, and Religion.\n\n***Carrier of Rot.*** You can use your action to inflict rot on a creature you can see within 10 feet of you. The creature must make a Constitution saving throw. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 1d4 necrotic damage on a failed save, and half as much damage on a successful one. A creature that fails the saving throw also rots for 1 minute. A rotting creature takes 1d4 necrotic damage at the end of each of its turns. The target or a creature within 5 feet of it can use an action to excise the rot with a successful Wisdom (Medicine) check. The DC for the check equals the rot's Constitution saving throw DC. The rot also disappears if the target receives magical healing. The damage for the initial action and the rotting increases to 2d4 at 6th level, 3d4 at 11th level, and 4d4 at 16th level. After you use your Carrier of Rot trait, you can't use it again until you complete a short or long rest.",
    "route": "races/"
  }
},
{
  "model": "api.race",
  "pk": "shade",
  "fields": {
    "name": "Shade",
    "desc": "Your shade character has a number of traits that arise from being a shade as well as a few drawn from life.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.689",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Charisma score increases by 1, and one other ability score of your choice increases by 1. Choose one ability score that is increased by your Living Origin or by one of its subraces. That ability score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Charisma\"], \"value\": 1}]",
    "age": "***Age.*** Shades appear as the age they were when they died. They potentially have no limit to their lifespan, but, realistically, ancient shades grow weary and lose their hold on their memories, fading away near 750 years old.",
    "alignment": "***Alignment.*** Shades come from all walks of life but tend toward neutrality. Shades that lack contact with other people grow more selfish over time and slip toward evil.",
    "size": "***Size.*** Your size is determined by your Living Origin.",
    "size_raw": "Medium",
    "speed_json": "{\"walk\": 30}",
    "speed_desc": "***Speed.*** Your speed is determined by your Living Origin.",
    "languages": "***Languages.*** You can speak, read, and write Common and one other language spoken by your Living Origin.",
    "vision": "***Darkvision.*** Your existence beyond death makes you at home in the dark. You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.",
    "traits": "***Ghostly Flesh.*** Starting at 3rd level, you can use your action to dissolve your physical body into the ephemeral stuff of spirits. You become translucent and devoid of color, and the air around you grows cold. Your transformation lasts for 1 minute or until you end it as a bonus action. During it, you have a flying speed of 30 feet with the ability to hover, and you have resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks that aren't made with silvered weapons. In addition, you have advantage on ability checks and saving throws made to escape a grapple or against being restrained, and you can move through creatures and solid objects as if they were difficult terrain. If you end your turn inside an object, you take 1d10 force damage. Once you use this trait, you can't use it again until you finish a long rest.\n\n***Imperfect Undeath.*** You are a humanoid, but your partial transition into undeath makes you susceptible to effects that target undead. Though you can regain hit points from spells like cure wounds, you can also be affected by game effects that specifically target undead, such as a cleric's Turn Undead feature. Game effects that raise a creature from the dead work on you as normal, but they return you to life as a shade. A true resurrection or wish spell can restore you to life as a fully living member of your original race.\n\n***Life Drain.*** When you damage a creature with an attack or a spell, you can choose to deal extra necrotic damage to the target equal to your level. If the creature's race matches your Living Origin, you gain temporary hit points equal to the necrotic damage dealt. Once you use this trait, you can't use it again until you finish a short or long rest.\n\n***Spectral Resilience.*** You have advantage on saving throws against poison and disease, and you have resistance to necrotic damage.\n\n***Living Origin.*** As living echoes of who they once were, shades maintain some of the traits they bore in life. Choose another race as your Living Origin. This is the race you were in life. Your size and speed are those of your Living Origin, and you know one language spoken by your Living Origin.",
    "route": "races/"
  }
}
]
