[
{
  "model": "api.spell",
  "pk": "ambush-chute",
  "fields": {
    "name": "Ambush Chute",
    "desc": "You touch a wooden, plaster, or stone surface and create a passage with two trapdoors. The first trapdoor appears where you touch the surface, and the other appears at a point you can see up to 30 feet away. The two trapdoors can be wooden with a metal ring handle, or they can match the surrounding surfaces, each with a small notch for opening the door. The two trapdoors are connected by an extradimensional passage that is up to 5 feet wide, up to 5 feet tall, and up to 30 feet long. The trapdoors don't need to be on the same surface, allowing the passage to connect two separated locations, such as the two sides of a chasm or river. The passage is always straight and level for creatures inside it, and the creatures exit the tunnel in such a way that allows them to maintain the same orientation as when they entered the passage. No more than five creatures can transit the passage at the same time.\n  When the spell ends and the trapdoors disappear, any creatures or objects still in the passage created by the spell are safely ejected to an unoccupied space nearest the end of the passage closest to them.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.595",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Sorceror, Warlock, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the length of the passage and the distance you can place the second trapdoor increases by 10 feet for each slot level above 3rd.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 10 minutes",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "armored-formation",
  "fields": {
    "name": "Armored Formation",
    "desc": "You bolster the defenses of those nearby. Choose up to twelve willing creatures in range. When an affected creature is within 5 feet of at least one other affected creature, they create a formation. The formation must be a contiguous grouping of affected creatures, and each affected creature must be within 5 feet of at least one other affected creature within the formation. If the formation ever has less than two affected creatures, it ends, and an affected creature that moves further than 5 feet from other creatures in formation is no longer in that formation. Affected creatures don't have to all be in the same formation, and they can create or end as many formations of various sizes as they want for the duration of the spell. Each creature in a formation gains a bonus depending on how many affected creatures are in that formation.\n  ***Two or More Creatures.*** Each creature gains a +2 bonus to AC.\n  ***Four or More Creatures.*** Each creature gains a +2 bonus to AC, and when it hits with any weapon, it deals an extra 1d6 damage of the weapon's type.\n  ***Six or More Creatures.*** Each creature gains a +3 bonus to AC, and when it hits with any weapon, it deals an extra 2d6 damage of the weapon's type.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.595",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Bard, Sorceror, Warlock, Wizard",
    "school": "abjuration",
    "casting_time": "1 bonus action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 10 minutes",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "babble",
  "fields": {
    "name": "Babble",
    "desc": "This spell causes the speech of affected creatures to sound like nonsense. Each creature in a 30-foot-radius sphere centered on a point you choose within range must succeed on an Intelligence saving throw when you cast this spell or be affected by it.\n  An affected creature cannot communicate in any spoken language that it knows. When it speaks, the words come out as gibberish. Spells with verbal components cannot be cast. The spell does not affect telepathic communication, nonverbal communication, or sounds emitted by any creature that does not have a spoken language. As an action, a creature under the effect of this spell can attempt another Intelligence saving throw against the effect. On a successful save, the spell ends.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.595",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Bard, Sorceror, Wizard",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 10 minutes",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "battle-mind",
  "fields": {
    "name": "Battle Mind",
    "desc": "You gain a preternatural sense of the surrounding area, allowing you insights you can share with comrades to provide them with an edge in combat. You gain advantage on Wisdom (Perception) checks made when determining surprise at the beginning of a combat encounter. If you are not surprised, then neither are your allies. When you are engaged in combat while the spell is active, you can use a bonus action on your turn to produce one of the following effects (allies must be able to see or hear you in order to benefit):\n* One ally gains advantage on its next attack roll, saving throw, or ability check.\n* An enemy has disadvantage on the next attack roll it makes against you or an ally.\n* You divine the location of an invisible or hidden creature and impart that knowledge to any allies who can see or hear you. This knowledge does not negate any advantages the creature has, it only allows your allies to be aware of its location at the time. If the creature moves after being detected, its new location is not imparted to your allies.\n* Three allies who can see and hear you on your turn are given the benefit of a *bless*, *guidance*, or *resistance spell* on their turns; you choose the benefit individually for each ally. An ally must use the benefit on its turn, or the benefit is lost.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.597",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Bard, Paladin, Sorceror, Wizard",
    "school": "divination",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": true,
    "duration": "Up to 10 minutes",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "beast-within",
  "fields": {
    "name": "Beast Within",
    "desc": "You imbue a willing creature with a touch of lycanthropy. The target gains a few bestial qualities appropriate to the type of lycanthrope you choose, such as tufts of fur, elongated claws, a fang-lined maw or tusks, and similar features. For the duration, the target has resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks that aren't silvered. In addition, the target has advantage on Wisdom (Perception) checks that rely on hearing or smell. Finally, the creature can use its new claws and jaw or tusks to make unarmed strikes. The claws deal slashing damage equal to 1d4 + the target's Strength modifier on a hit. The bite deals piercing damage equal to 1d6 + the target's Strength modifier on a hit. The target's bite doesn't inflict lycanthropy.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.597",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Druid, Ranger, Warlock",
    "school": "transmutation",
    "casting_time": "1 round",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each spell slot above 4th.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 hour",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "betraying-bauble",
  "fields": {
    "name": "Betraying Bauble",
    "desc": "When you cast this spell, you touch a pair of objects. Each object must be small enough to fit in one hand. While holding one of the objects, you can sense the direction to the other object's location.\n  If the paired object is in motion, you know the direction and relative speed of its movement (walking, running, galloping, or similar). When the two objects are within 30 feet of each other, they vibrate faintly unless they are touching. If you aren't holding either item and the spell hasn't ended, you can sense the direction of the closest of the two objects within 1,000 feet of you, and you can sense if it is in motion. If neither object is within 1,000 feet of you, you sense the closest object as soon as you come within 1,000 feet of one of them. If an inch or more of lead blocks a direct path between you and an affected object, you can't sense that object.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.598",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Sorceror, Warlock, Wizard",
    "school": "divination",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "24 hours",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "bloodlust",
  "fields": {
    "name": "Bloodlust",
    "desc": "You imbue a willing creature that you can see within range with vitality and fury. The target gains 1d6 temporary hit points, has advantage on Strength checks, and deals an extra 1d6 damage when it hits with a weapon attack. When the spell ends, the target suffers one level of exhaustion for 1 minute.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.599",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Wizard",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "blunted-edge",
  "fields": {
    "name": "Blunted Edge",
    "desc": "Choose a creature that you can see within range. The target must succeed on a Wisdom saving throw or have disadvantage on weapon attack rolls. In addition, when an affected creature rolls damage dice for a successful attack, it must roll the weapon's damage dice twice and use the lower total. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.599",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Cleric, Sorceror, Warlock, Wizard",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd. The creatures must be within 30 feet of each other when you target them.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "bolster-fortifications",
  "fields": {
    "name": "Bolster Fortifications",
    "desc": "You create a ward that bolsters a structure or a collection of structures that occupy up to 2,500 square feet of floor space. The bolstered structures can be up to 20 feet tall and shaped as you desire. You can ward several small buildings in a stronghold by dividing the area among them, as long as you can walk into each contiguous area while you are casting the spell. For the purpose of this spell, “structures” include walls, such as the palisade that might surround a small fort, provided the wall is no more than 20 feet tall.\n  For the duration, each structure you bolstered has a damage threshold of 5. If a structure already has a damage threshold, that threshold increases by 5.\n  This spell protects only the walls, support beams, roofs, and similar that make up the core components of the structure. It doesn't bolster objects within the structures, such as furniture.\n  The protected structure or structures radiate magic. A *dispel magic* cast on a structure removes the bolstering from only that structure. You can create a permanently bolstered structure or collection of structures by casting this spell there every day for one year.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.600",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Bard, Wizard",
    "school": "abjuration",
    "casting_time": "10 minutes",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the square feet of floor space you can bolster increases by 500 and the damage threshold increases by 2 for each slot level above 3rd.",
    "can_be_cast_as_ritual": false,
    "duration": "8 hours",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "bound-haze",
  "fields": {
    "name": "Bound Haze",
    "desc": "You cause a swirling gyre of dust, small rocks, and wind to encircle a creature you can see within range. The target must succeed on a Dexterity saving throw or have disadvantage on attack rolls and on Wisdom (Perception) checks. At the end of each of its turns, the target can make a Dexterity saving throw. On a success, the spell ends.\n  In addition, if the target is within a cloud or gas, such as the area of a *fog cloud* spell or a dretch's Fetid Cloud, the affected target has disadvantage on this spell's saving throws and on any saving throws associated with being in the cloud or gas, such as the saving throw to reduce the poison damage the target might take from starting its turn in the area of a *cloudkill* spell.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.601",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Sorceror, Warlock, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "If you cast this spell using a spell slot of 4th level or higher, the duration is 1 minute, and the spell doesn't require concentration.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "burst-stone",
  "fields": {
    "name": "Burst Stone",
    "desc": "You cause the ground at a point you can see within range to explode. The ground must be sand, earth, or unworked rock. Each creature within 10 feet of that point must make a Dexterity saving throw. On a failed save, the creature takes 4d8 bludgeoning damage and is knocked prone. On a successful save, the creature takes half as much damage and isn't knocked prone. The area then becomes difficult terrain with a 5-foot-deep pit centered on the point you chose.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.601",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Druid, Sorceror, Warlock, Wizard",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "butterfly-effect",
  "fields": {
    "name": "Butterfly Effect",
    "desc": "You cause a cloud of illusory butterflies to swarm around a target you can see within range. The target must succeed on a Charisma saving throw or be charmed for the duration. While charmed, the target can't take reactions and must roll a d10 at the start of each of its turns to determine its behavior for that turn.\n\n| d10  | Behavior          |\n|------|-------------------|\n| 1    | The creature uses all its movement to move in a random direction. To determine the direction, roll a d8 and assign a direction to each die face. The creature doesn't take an action this turn. |\n| 2-6  | The creature doesn't take an action this turn. |\n| 7-8  | The creature uses its action to make a melee attack against a randomly determined creature within its reach. If there is no creature within its reach, the creature does nothing this turn. |\n| 9-10 | The creature can act and move normally. |\n\nAt the end of each of its turns, and each time it takes damage, the target can make another Charisma saving throw. On a success, the spell ends on the target.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.602",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Bard, Druid, Sorceror, Warlock, Wizard",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd. The creatures must be within 30 feet of each other when you target them.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "calm-beasts",
  "fields": {
    "name": "Calm Beasts",
    "desc": "You attempt to calm aggressive or frightened animals. Each beast in a 20-foot-radius sphere centered on a point you choose within range must make a Charisma saving throw. If a creature fails its saving throw, choose one of the following two effects.\n  ***Suppress Hold.*** You can suppress any effect causing the target to be charmed or frightened. When this spell ends, any suppressed effect resumes, provided that its duration has not expired in the meantime.\n  ***Suppress Hostility.*** You can make a target indifferent about creatures of your choice that it is hostile toward. This indifference ends if the target is attacked or harmed by a spell or if it witnesses any of its allies being harmed. When the spell ends, the creature becomes hostile again, unless the GM rules otherwise.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.602",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Druid, Ranger",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "clear-the-board",
  "fields": {
    "name": "Clear the Board",
    "desc": "You send your allies and your enemies to opposite sides of the battlefield. Pick a cardinal direction. With a shout and a gesture, you and up to five willing friendly creatures within range are teleported up to 90 feet in that direction to spaces you can see. At the same time, up to six hostile creatures within range must make a Wisdom saving throw. On a failed save, the hostile creature is teleported up to 90 feet in the opposite direction of where you teleport yourself and the friendly creatures to spaces you can see. You can't teleport a target into dangerous terrain, such as lava or off the edge of a cliff, and each target must be teleported to an unoccupied space that is on the ground or on a floor.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.603",
    "page_no": null,
    "page": "",
    "spell_level": 7,
    "dnd_class": "Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "conjure-construct",
  "fields": {
    "name": "Conjure Construct",
    "desc": "You summon a construct of challenge rating 5 or lower to harry your foes. It appears in an unoccupied space you can see within range. It disappears when it drops to 0 hit points or when the spell ends.\n  The construct is friendly to you and your companions for the duration. Roll initiative for the construct, which has its own turns. It obeys any verbal commands that you issue to it (no action required by you). If you don't issue any commands to the construct, it defends itself from hostile creatures but otherwise takes no actions.\n  If your concentration is broken, the construct doesn't disappear. Instead, you lose control of the construct, it becomes hostile toward you and your companions, and it might attack. An uncontrolled construct can't be dismissed by you, and it disappears 1 hour after you summoned it.\n  The construct deals double damage to objects and structures.\n  The GM has the construct's statistics.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.603",
    "page_no": null,
    "page": "",
    "spell_level": 6,
    "dnd_class": "Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 7th level or higher, the challenge rating increases by 1 for each slot level above 6th.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "conjure-spectral-allies",
  "fields": {
    "name": "Conjure Spectral Allies",
    "desc": "You sprinkle some graveyard dirt before you and call forth vengeful spirits. The spirits erupt from the ground at a point you choose within range and sweep outward. Each creature in a 30-foot-radius sphere centered on that point must make a Wisdom saving throw. On a failed save, a creature takes 6d10 necrotic damage and becomes frightened for 1 minute. On a successful save, the creature takes half as much damage and isn't frightened.\n  At the end of each of its turns, a creature frightened by this spell can make another saving throw. On a success, this spell ends on the creature.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.604",
    "page_no": null,
    "page": "",
    "spell_level": 7,
    "dnd_class": "Cleric, Warlock, Wizard",
    "school": "necromancy",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 8th level or higher, the damage increases by 1d10 for each slot level above 7th.",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "convey-inner-peace",
  "fields": {
    "name": "Convey Inner Peace",
    "desc": "You imbue yourself and up to five willing creatures within range with the ability to enter a meditative trance like an elf. Once before the spell ends, an affected creature can complete a long rest in 4 hours, meditating as an elf does while in trance. After resting in this way, each creature gains the same benefit it would normally gain from 8 hours of rest.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.604",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Bard, Cleric, Druid, Sorceror, Warlock, Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "24 hours",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "crown-of-thorns",
  "fields": {
    "name": "Crown of Thorns",
    "desc": "You create a psychic binding on the mind of a creature within range. Until this spell ends, the creature must make a Charisma saving throw each time it casts a spell. On a failed save, it takes 2d6 psychic damage, and it fails to cast the spell. It doesn't expend a spell slot if it fails to cast the spell.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.605",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Druid, Sorceror, Warlock, Wizard",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "damaging-intel",
  "fields": {
    "name": "Damaging Intel",
    "desc": "You study a creature you can see within range, learning its weaknesses. The creature must make a Charisma saving throw. If it fails, you learn its damage vulnerabilities, damage resistances, and damage immunities, and the next attack one of your allies in range makes against the target before the end of your next turn has advantage.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.605",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Bard, Warlock",
    "school": "divination",
    "casting_time": "1 action",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 round",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "deadly-salvo",
  "fields": {
    "name": "Deadly Salvo",
    "desc": "When you cast this spell, the ammunition flies from your hand with a loud bang, targeting up to five creatures or objects you can see within range. You can launch the bullets at one target or several. Make a ranged spell attack for each bullet. On a hit, the target takes 3d6 piercing damage. This damage can experience a burst, as described in the gunpowder weapon property (see the Adventuring Gear chapter), but this spell counts as a single effect for the purposes of determining how many times the damage can burst, regardless of the number of targets affected.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.606",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Sorceror, Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "divine-retribution",
  "fields": {
    "name": "Divine Retribution",
    "desc": "With a last word before you fall unconscious, this spell inflicts radiant damage to your attacker equal to 1d8 + the amount of damage you took from the triggering attack. If the attacker is a fiend or undead, it takes an extra 1d8 radiant damage. The creature then must succeed on a Constitution saving throw or become stunned for 1 minute. At the end of each of its turns, the creature can make another Constitution saving throw. On a successful save, it is no longer stunned.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.608",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Cleric, Paladin",
    "school": "evocation",
    "casting_time": "1 reaction, which you take when a weapon attack reduces you to 0 hit points",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "dreamwine",
  "fields": {
    "name": "Dreamwine",
    "desc": "You imbue a bottle of wine with fey magic. While casting this spell, you and up to seven other creatures can drink the imbued wine. At the completion of the casting, each creature that drank the wine can see invisible creatures and objects as if they were visible, can see into the Ethereal plane, and has advantage on Charisma checks and saving throws for the duration. Ethereal creatures and objects appear ghostly and translucent.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.609",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Bard, Wizard",
    "school": "divination",
    "casting_time": "1 minute",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "emerald-eyes",
  "fields": {
    "name": "Emerald Eyes",
    "desc": "You attempt to convince a creature to enter a paranoid, murderous rage. Choose a creature that you can see within range. The target must succeed on a Wisdom saving throw or be convinced those around it intend to steal anything and everything it possesses, from its position of employment, to the affections of its loved ones, to its monetary wealth and possessions, no matter how trusted those nearby might be or how ludicrous such a theft might seem. While affected by this spell, the target must use its action to attack the nearest creature other than itself or you. If the target starts its turn with no other creature near enough to move to and attack, the target can make another Wisdom saving throw. On a success, the target's head clears momentarily and it can act freely that turn. If the target starts its turn a second time with no other creature near enough to move to and attack, it can make another Wisdom saving throw. On a success, the spell ends on the target.\n  Each time the target takes damage, it can make another Wisdom saving throw. On a success, the spell ends on the target.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.610",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Sorceror, Warlock, Wizard",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd. The creatures must be within 30 feet of each other when you target them.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "enchanted-bloom",
  "fields": {
    "name": "Enchanted Bloom",
    "desc": "You spend an hour anointing a rose with scented oils and imbuing it with fey magic. The first creature other than you that touches the rose before the spell ends pricks itself on the thorns and must make a Charisma saving throw. On a failed save, the creature falls into a deep slumber for 24 hours, and it can be awoken only by the greater restoration spell or similar magic or if you choose to end the spell as an action. While slumbering, the creature doesn't need to eat or drink, and it doesn't age.\n  Each time the creature takes damage, it makes a new Charisma saving throw. On a success, the spell ends on the creature.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.611",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Bard, Druid, Sorceror, Warlock, Wizard",
    "school": "enchantment",
    "casting_time": "1 hour",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of a higher level, the duration of the slumber increases to 7 days with a 6th-level slot, to 30 days with a 7th-level slot, to 180 days with an 8th-level slot, and to a year with a 9th-level spell slot.",
    "can_be_cast_as_ritual": false,
    "duration": "24 hours",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "eruption",
  "fields": {
    "name": "Eruption",
    "desc": "You create a furiously erupting volcano centered on a point you can see within range. The ground heaves violently as a cinder cone that is 2 feet wide and 5 feet tall bursts up from it. Each creature within 30 feet of the cinder cone when it appears must make a Strength saving throw. On a failed save, a creature takes 8d6 bludgeoning damage and is knocked prone. On a successful save, a creature takes half as much damage and isn't knocked prone.\n  Each round you maintain concentration on this spell, the cinder cone produces additional effects on your turn.\n  ***Round 2.*** Smoke pours from the cinder cone. Each creature within 10 feet of the cinder cone when the smoke appears takes 4d6 poison damage. Afterwards, each creature that enters the smoky area for the first time on a turn or starts its turn there takes 2d6 poison damage. The smoke spreads around corners, and its area is heavily obscured. A wind of moderate or greater speed (at least 10 miles per hour) disperses the smoke until the start of your next turn, when the smoke reforms.\n  ***Round 3.*** Lava bubbles out from the cinder cone, spreading out to cover the ground within 20 feet of the cinder cone. Each creature and object in the area when the lava appears takes 10d10 fire damage and is on fire. Afterwards, each creature that enters the lava for the first time on a turn or starts its turn there takes 5d10 fire damage. In addition, the smoke spreads to fill a 20-foot-radius sphere centered on the cinder cone.\n  ***Round 4.*** The lava continues spreading and covers the ground within 30 feet of the cinder cone in lava that is 1-foot-deep. The lava-covered ground becomes difficult terrain. In addition, the smoke fills a 30-footradius sphere centered on the cinder cone.\n  ***Round 5.*** The lava expands to cover the ground within 40 feet of the cinder cone, and the smoke fills a 40-foot radius sphere centered on the cinder cone. In addition, the cinder cone begins spewing hot rocks. Choose up to three creatures within 90 feet of the cinder cone. Each target must succeed on a Dexterity saving throw or take 3d6 bludgeoning damage and 3d6 fire damage.\n  ***Rounds 6-10.*** The lava and smoke continue to expand in size by 10 feet each round. In addition, each round you can direct the cinder cone to spew hot rocks at three targets, as described in Round 5.\n  When the spell ends, the volcano ceases erupting, but the smoke and lava remain for 1 minute before cooling and dispersing. The landscape is permanently altered by the spell.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.611",
    "page_no": null,
    "page": "",
    "spell_level": 9,
    "dnd_class": "Druid, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "feint",
  "fields": {
    "name": "Feint",
    "desc": "You create a momentary, flickering duplicate of yourself just as you make an attack against a creature. You have advantage on the next attack roll you make against the target before the end of your next turn as it's distracted by your illusory copy.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.612",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Cleric, Paladin, Warlock, Wizard",
    "school": "illusion",
    "casting_time": "1 bonus action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 round",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "fey-food",
  "fields": {
    "name": "Fey Food",
    "desc": "You enchant up to 1 pound of food or 1 gallon of drink within range with fey magic. Choose one of the effects below. For the duration, any creature that consumes the enchanted food or drink, up to four creatures per pound of food or gallon of drink, must succeed on a Charisma saving throw or succumb to the chosen effect.\n  ***Slumber.*** The creature falls asleep and is unconscious for 1 hour. This effect ends for a creature if the creature takes damage or someone uses an action to wake it.\n  ***Friendly Face.*** The creature is charmed by you for 1 hour. If you or your allies do anything harmful to it, the creature can make another Charisma saving throw. On a success, the spell ends on the creature.\n  ***Muddled Memory.*** The creature remembers only fragments of the events of the past hour. A remove curse or greater restoration spell cast on the creature restores the creature's memory.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.613",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Sorceror, Warlock, Wizard",
    "school": "enchantment",
    "casting_time": "10 minutes",
    "range": "10 Feet",
    "target_range_sort": 10,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, you can enchant an additional pound of food or gallon of drink for each slot level over 3rd.",
    "can_be_cast_as_ritual": false,
    "duration": "8 hours",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "fey-touched-blade",
  "fields": {
    "name": "Fey-Touched Blade",
    "desc": "You touch a nonmagical weapon and imbue it with the magic of the fey. Choose one of the following damage types: force, psychic, necrotic, or radiant. Until the spell ends, the weapon becomes a magic weapon and deals an extra 1d4 damage of the chosen type to any target it hits.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.613",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Bard, Sorceror",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can imbue one additional weapon for each slot level above 2nd.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 hour",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "forced-reposition",
  "fields": {
    "name": "Forced Reposition",
    "desc": "One creature of your choice that you can see within range is teleported to an unoccupied space you can see up to 60 feet above you. The space can be open air or a balcony, ledge, or other surface above you. An unwilling creature that succeeds on a Constitution saving throw is unaffected. A creature teleported to open air immediately falls, taking falling damage as normal, unless it can fly or it has some other method of catching itself or preventing a fall. A creature can't be teleported into a solid object.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.613",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Cleric, Sorceror, Warlock, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "If you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The targets must be within 30 feet of each other when you target them, but they don't need to be teleported to the same locations.",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "furious-wail",
  "fields": {
    "name": "Furious Wail",
    "desc": "You let out a scream of white-hot fury that pierces the minds of up to five creatures within range. Each target must make a Charisma saving throw. On a failed save, it takes 10d10 + 30 psychic damage and is stunned until the end of its next turn. On a success, it takes half as much damage.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.615",
    "page_no": null,
    "page": "",
    "spell_level": 9,
    "dnd_class": "Bard, Druid, Sorceror, Warlock, Wizard",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "fuse-armor",
  "fields": {
    "name": "Fuse Armor",
    "desc": "Choose a manufactured metal object with movable parts, such as a drawbridge pulley or winch or a suit of heavy or medium metal armor, that you can see within range. You cause the object's moveable parts to fuse together for the duration. The object's movable aspects can't be moved: a pulley's wheel won't turn and the joints of armor won't bend.\n  A creature wearing armor affected by this spell has its speed reduced by 10 feet and has disadvantage on weapon attacks and ability checks that use Strength or Dexterity. At the end of each of its turns, the creature wearing the armor can make a Strength saving throw. On a success, the spell ends on the armor.\n  A creature in physical contact with an affected object that isn't a suit of armor can use its action to make a Strength check against your spell save DC. On a success, the spell ends on the object.\n  If you target a construct with this spell, it must succeed on a Strength saving throw or have its speed reduced by 10 feet and have disadvantage on weapon attacks. At the end of each of its turns, the construct can make another Strength saving throw. On a success, the spell ends on the construct.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.615",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Bard, Cleric, Sorceror, Warlock, Wizard",
    "school": "evocation",
    "casting_time": "1 bonus action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional object for each slot level above 2nd. The objects must be within 30 feet of each other when you target them.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "gale",
  "fields": {
    "name": "Gale",
    "desc": "You summon a storm to batter your oncoming enemies. Until the spell ends, freezing rain and turbulent winds fill a 20-foot-tall cylinder with a 300- foot radius centered on a point you choose within range. You must be outdoors to cast this spell. Moving to a place where you don't have a clear path to the sky ends the spell early.\n  The spell's area is heavily obscured, and exposed flames in the area are doused. The ground in the area becomes slick, difficult terrain, and a flying creature in the area must land at the end of its turn or fall. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a Constitution saving throw as the wind and rain assail it. On a failed save, the creature takes 1d6 cold damage.\n  If a creature is concentrating in the spell's area, the creature must make a successful Constitution saving throw against your spell save DC or lose concentration.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.615",
    "page_no": null,
    "page": "",
    "spell_level": 6,
    "dnd_class": "Wizard",
    "school": "conjuration",
    "casting_time": "1 minute",
    "range": "1 mile",
    "target_range_sort": 5280,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "glare",
  "fields": {
    "name": "Glare",
    "desc": "You cast a disdainful glare at up to two creatures you can see within range. Each target must succeed on a Wisdom saving throw or take no actions on its next turn as it reassesses its life choices. If a creature fails the saving throw by 5 or more, it can't take actions on its next two turns.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.617",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Bard, Sorceror, Warlock",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "high-ground",
  "fields": {
    "name": "High Ground",
    "desc": "With a word, you gesture across an area and cause the terrain to rise up into a 10-foot-tall hillock at a point you choose within range. You must be outdoors to cast this spell. The hillock is up to 30 feet long and up to 15 feet wide, and it must be in a line. If the hillock cuts through a creature's space when it appears, the creature is pushed to one side of the hillock or to the top of the hillock (your choice). The ranged attack distance for a creature on top of the hillock is doubled, provided the target is at a lower elevation than the creature on the hillock. At the GM's discretion, creatures on top of the hillock gain any additional bonuses or penalties that higher elevation might provide, such as advantage on attacks against those on lower elevations, being easier to spot, longer sight distance, or similar.\n  The steep sides of the hillock are difficult to climb. A creature at the bottom of the hillock that attempts to move up to the top must succeed on a Strength (Athletics) or Dexterity (Acrobatics) check against your spell save DC to climb to the top of the hillock.\n  This spell can't manipulate stone construction, and rocks and structures shift to accommodate the hillock. If the hillock's formation would make a structure unstable, the hillock fails to form in the structure's spaces. Similarly, this spell doesn't directly affect plant growth. The hillock carries any plants along with it.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.622",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Sorceror, Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell at 4th level or higher, you can increase the width of the hillock by 5 feet or the length by 10 feet for each slot above 3rd.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "immolating-gibbet",
  "fields": {
    "name": "Immolating Gibbet",
    "desc": "You cause up to three creatures you can see within range to be yanked into the air where their blood turns to fire, burning them from within. Each target must succeed on a Dexterity saving throw or be magically pulled up to 60 into the air. The creature is restrained there until the spell ends. A restrained creature must make a Constitution saving throw at the start of each of its turns. The creature takes 7d6 fire damage on a failed save, or half as much damage on a successful one.\n  At the end of each of its turns, a restrained creature can make another Dexterity saving throw. On a success, the spell ends on the creature, and the creature falls to the ground, taking falling damage as normal. Alternatively, the restrained creature or someone else who can reach it can use an action to make an Intelligence (Arcana) check against your spell save DC. On a success, the restrained effect ends, and the creature falls to the ground, taking falling damage as normal.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.627",
    "page_no": null,
    "page": "",
    "spell_level": 7,
    "dnd_class": "Cleric, Warlock, Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "inexorable-summons",
  "fields": {
    "name": "Inexorable Summons",
    "desc": "You reach out toward a creature and call to it. The target teleports to an unoccupied space that you can see within 5 feet of you. An unwilling creature can make a Wisdom saving throw, and if it succeeds, it isn't affected by this spell. You can't teleport a target into dangerous terrain, such as lava, and the target must be teleported to a space on the ground or on a floor.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.627",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Cleric, Sorceror, Warlock, Wizard",
    "school": "transmutation",
    "casting_time": "1 bonus action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "instant-armored-vehicle",
  "fields": {
    "name": "Instant Armored Vehicle",
    "desc": "You transform a handful of materials into a Huge armored vehicle. The vehicle can take whatever form you want, but it has AC 18 and 100 hit points. If it is reduced to 0 hit points, it is destroyed. If it is a ground vehicle, it has a speed of 90 feet. If it is an airborne vehicle, it has a flying speed of 45 feet. If it is a waterborne vehicle, it has a speed of 2 miles per hour. The vehicle can hold up to four Medium creatures within it.\n  A creature inside it has three-quarters cover from attacks outside the vehicle, which contains arrow slits, portholes, and other small openings. A creature piloting the armored vehicle can take the Careen action. To do so, the vehicle must move at least 10 feet in a straight line and enter or pass through the space of at least one Large or smaller creature. This movement doesn't provoke opportunity attacks. Each creature in the armored vehicle's path must make a Dexterity saving throw against your spell save DC. On a failed save, the creature takes 5d8 bludgeoning damage and is knocked prone. On a successful save, the creature can choose to be pushed 5 feet away from the space through which the vehicle passed. A creature that chooses not to be pushed suffers the consequences of a failed saving throw. If the creature piloting the armored vehicle isn't proficient in land, water, or air vehicles (whichever is appropriate for the vehicle's type), each target has advantage on the saving throw against the Careen action.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.629",
    "page_no": null,
    "page": "",
    "spell_level": 6,
    "dnd_class": "Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "invested-champion",
  "fields": {
    "name": "Invested Champion",
    "desc": "You touch one creature and choose either to become its champion, or for it to become yours. If you choose a creature to become your champion, it fights on your behalf. While this spell is in effect, you can cast any spell with a range of touch on your champion as if the spell had a range of 60 feet. Your champion's attacks are considered magical, and you can use a bonus action on your turn to encourage your champion, granting it advantage on its next attack roll.\n  If you become the champion of another creature, you gain advantage on all attack rolls against creatures that have attacked your charge within the last round. If you are wielding a shield, and a creature within 5 feet of you attacks your charge, you can use your reaction to impose disadvantage on the attack roll, as if you had the Protection fighting style. If you already have the Protection fighting style, then in addition to imposing disadvantage, you can also push an enemy 5 feet in any direction away from your charge when you take your reaction. You can use a bonus action on your turn to reroll the damage for any successful attack against a creature that is threatening your charge.\n  Whichever version of the spell is cast, if the distance between the champion and its designated ally increases to more than 60 feet, the spell ends.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.630",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Cleric, Paladin",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 hour",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "iron-gut",
  "fields": {
    "name": "Iron Gut",
    "desc": "For the duration, one willing creature you touch has resistance to poison damage and advantage on saving throws against poison. When the affected creature makes a Constitution saving throw against an effect that deals poison damage or that would cause the creature to become poisoned, the creature can choose to succeed on the saving throw. If it does so, the spell ends on the creature.\n  While affected by this spell, a creature can't gain any benefit from consuming magical foodstuffs, such as those produced by the goodberry and heroes' feast spells, and it doesn't suffer ill effects from consuming potentially harmful, nonmagical foodstuffs, such as spoiled food or non-potable water. The creature is affected normally by other consumable magic items, such as potions. The creature can identify poisoned food by a sour taste, with deadlier poisons tasting more sour.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.630",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Bard, Cleric, Sorceror, Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "jagged-forcelance",
  "fields": {
    "name": "Jagged Forcelance",
    "desc": "You create a magical tether of pulsing, golden force between two willing creatures you can see within range. The two creatures must be within 15 feet of each other. The tether remains as long as each tethered creature ends its turn within 15 feet of the other tethered creature. If a tethered creature ends its turn more than 15 feet away from its tethered partner, the spell ends. Though the tether appears as a thin line, its effect extends the full height of the tethered creatures and can affect prone or hovering creatures, provided the hovering creature hovers no higher than the tallest tethered creature.\n  Any creature that touches the tether or ends its turn in a space the tether passes through must make a Strength saving throw. On a failure, a creature takes 3d6 force damage and is knocked prone. On a success, a creature takes half as much damage and isn't knocked prone. A creature that makes this saving throw, whether it succeeds or fails, can't be affected by the tether again until the start of your next turn.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.631",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Bard, Sorceror, Warlock, Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the maximum distance between the tethered creatures increases by 5 feet, and the damage increases by 1d6 for each slot level above 3rd.",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "jarring-growl",
  "fields": {
    "name": "Jarring Growl",
    "desc": "You loose a growl from deep within the pit of your stomach, causing others who can hear it to become unnerved. You have advantage on Charisma (Intimidation) checks you make before the beginning of your next turn. In addition, each creature within 5 feet of you must make a Wisdom saving throw. On a failure, you have advantage on attack rolls against that creature until the end of your turn. You are aware of which creatures failed their saving throws.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.631",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Ranger, Warlock",
    "school": "enchantment",
    "casting_time": "1 bonus action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "lance",
  "fields": {
    "name": "Lance",
    "desc": "You create a shimmering lance of force and hurl it toward a creature you can see within range. Make a ranged spell attack against the target. On a hit, the target takes 5d6 force damage, and it is restrained by the lance until the end of its next turn.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.632",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Paladin, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "less-fool-i",
  "fields": {
    "name": "Less Fool, I",
    "desc": "A creature you touch becomes less susceptible to lies and magical influence. For the duration, other creatures have disadvantage on Charisma checks to influence the protected creature, and the creature has advantage on spells that cause it to become charmed or frightened.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.634",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Bard, Cleric",
    "school": "divination",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "If you cast this spell using a spell slot of 3rd level or higher, the duration is concentration, up to 1 hour. If you use a spell slot of 5th level or higher, the duration is 8 hours. If you use a spell slot of 7th level or higher, the duration is 24 hours. If you use a 9th level spell slot, the duration is 1 year. Using a spell slot of 5th level or higher grants a duration that doesn't require concentration.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 10 minutes",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "life-burst",
  "fields": {
    "name": "Life Burst",
    "desc": "You make a jubilant shout when you cast this spell, releasing your stores of divine energy in a wave of healing. You distribute the remaining power of your Lay on Hands to allies within 30 feet of you, restoring hit points and curing diseases and poisons. This healing energy removes diseases and poisons first (starting with the nearest ally), removing 5 hit points from the hit point total for each disease or poison cured, until all the points are spent or all diseases and poisons are cured. If any hit points remain, you regain hit points equal to that amount.\n  This spell expends all of the healing energy in your Lay on Hands, which replenishes, as normal, when you finish a long rest.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.634",
    "page_no": null,
    "page": "",
    "spell_level": 5,
    "dnd_class": "Paladin",
    "school": "evocation",
    "casting_time": "1 reaction, which you take when you are reduced to 0 hit points",
    "range": "Self (30-foot radius)",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "lightless-torch",
  "fields": {
    "name": "Lightless Torch",
    "desc": "You touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds a shadowy miasma in a 30-foot radius. A creature with darkvision inside the radius sees the area as if it were filled with bright light. The miasma doesn't shed light, and a creature with darkvision inside the radius can still see outside the radius as normal. A creature with darkvision outside the radius or a creature without darkvision sees only that the object is surrounded by wisps of shadow.\n  Completely covering the affected object with an opaque object, such as a bowl or a helm, blocks the effect. Though the effect doesn't shed light, it can be dispelled if the area of a darkness spell overlaps the area of this spell.\n  If you target an object held or worn by a hostile creature, that creature must succeed on a Dexterity saving throw to avoid the spell.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.635",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Bard, Cleric, Sorceror, Warlock, Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, the duration increases by 2 hours for each slot level above 1st.",
    "can_be_cast_as_ritual": false,
    "duration": "1 hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "long-game",
  "fields": {
    "name": "Long Game",
    "desc": "While casting this spell, you must engage your target in conversation. At the completion of the casting, the target must make a Charisma saving throw. If it fails, you place a latent magical effect in the target's mind for the duration. If the target succeeds on the saving throw, it realizes that you used magic to affect its mind and might become hostile toward you, at the GM's discretion.\n  Once before the spell ends, you can use an action to trigger the magical effect in the target's mind, provided you are on the same plane of existence as the target. When the effect is triggered, the target takes 5d8 psychic damage plus an extra 1d8 psychic damage for every 24 hours that has passed since you cast the spell, up to a total of 12d8 psychic damage. The spell has no effect on the target if it ends before you trigger the magical effect.\n  *A greater restoration* or *wish* spell cast on the target ends the spell early. You know if the spell is ended early, provided you are on the same plane of existence as the target.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.636",
    "page_no": null,
    "page": "",
    "spell_level": 7,
    "dnd_class": "Bard, Sorceror, Warlock, Wizard",
    "school": "enchantment",
    "casting_time": "1 minute",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "7 days",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "magma-spray",
  "fields": {
    "name": "Magma Spray",
    "desc": "A 5-foot-diameter, 5-foot-tall cylindrical fountain of magma erupts from the ground in a space of your choice within range. A creature in that space takes 3d8 fire damage, or half as much damage with a successful Dexterity saving throw. A creature that enters the area on its turn or ends its turn there also takes 3d8 fire damage, or half as much damage with a successful Dexterity saving throw. A creature can take this damage only once per turn.\n  A creature killed by this spell is reduced to ash.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.637",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Druid, Sorceror, Warlock, Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "40 Feet",
    "target_range_sort": 40,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "mantle-of-the-brave",
  "fields": {
    "name": "Mantle of the Brave",
    "desc": "You touch up to four individuals, bolstering their courage. The next time a creature affected by this spell must make a saving throw against a spell or effect that would cause the frightened condition, it has advantage on the roll. Once a creature has received this benefit, the spell ends for that creature.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.638",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Cleric, Paladin",
    "school": "abjuration",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "martyrs-rally",
  "fields": {
    "name": "Martyr's Rally",
    "desc": "With a hopeful rallying cry just as you fall unconscious, you rouse your allies to action. Each ally within 60 feet of you that can see and hear you has advantage on attack rolls for the duration. If you regain hit points, the spell immediately ends.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.639",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Paladin",
    "school": "enchantment",
    "casting_time": "1 reaction, which you take when you are reduced to 0 hit points",
    "range": "Self (60-foot radius)",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "mass-faerie-fire",
  "fields": {
    "name": "Mass Faerie Fire",
    "desc": "You can place up to three 20-foot cubes each centered on a point you can see within range. Each object in a cube is outlined in blue, green, or violet light (your choice). Any creature in a cube when the spell is cast is also outlined in light if it fails a Dexterity saving throw. A creature in the area of more than one cube is affected only once. Each affected object and creature sheds dim light in a 10-foot radius for the duration.\n  Any attack roll against an affected object or creature has advantage if the attacker can see it, and the affected creature or object can't benefit from being invisible.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.640",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Bard, Druid",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "90 Feet",
    "target_range_sort": 90,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "misdirection",
  "fields": {
    "name": "Misdirection",
    "desc": "You create a brief flash of light, loud sound, or other distraction that interrupts a creature's attack. When a creature you can see within range makes an attack, you can impose disadvantage on its attack roll.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.642",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Wizard",
    "school": "illusion",
    "casting_time": "1 reaction, which you take when you see a creature within 30 feet of you make an attack",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": false,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "mud",
  "fields": {
    "name": "Mud",
    "desc": "The ground in a 20-foot radius centered on a point within range becomes thick, viscous mud. The area becomes difficult terrain for the duration. When a creature enters the affected area for the first time on a turn or starts its turn there, the creature must make a Strength saving throw. On a failed save, its movement speed is reduced to 0 until the start of its next turn.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.642",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Druid, Wizard",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "muted-foe",
  "fields": {
    "name": "Muted Foe",
    "desc": "You touch a nonmagical weapon. The next time a creature hits with the affected weapon before the spell ends, the weapon booms with a thunderous peal as the weapon strikes. The attack deals an extra 1d6 thunder damage to the target, and the target becomes deafened, immune to thunder damage, and unable to cast spells with verbal components for 1 minute. At the end of each of its turns, the target can make a Wisdom saving throw. On a success, the effect ends.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.643",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Bard, Cleric, Sorceror, Warlock, Wizard",
    "school": "abjuration",
    "casting_time": "1 bonus action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, the extra damage increases by 1d6 for each slot level above 1st.",
    "can_be_cast_as_ritual": false,
    "duration": "1 minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "never-surrender",
  "fields": {
    "name": "Never Surrender",
    "desc": "When the target is reduced to 0 hit points, it can fight looming death to stay in the fight. The target doesn't fall unconscious but must still make death saving throws, as normal. The target doesn't need to make a death saving throw until the end of its next turn, but it has disadvantage on that first death saving throw. In addition, massive damage required to kill the target outright must equal or exceed twice the target's hit point maximum instead. If the target regains 1 or more hit points, this spell ends.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.643",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Bard, Cleric, Paladin, Ranger",
    "school": "abjuration",
    "casting_time": "1 reaction, which you take when you or a creature within 60 feet of you drops to 0 hit points.",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "If you cast this spell using a spell slot of 6th level or higher, the target doesn't have disadvantage on its first death saving throw.",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "oathbound-implement",
  "fields": {
    "name": "Oathbound Implement",
    "desc": "You place a magical oath upon a creature you can see within range, compelling it to complete a specific task or service that involves using a weapon as you decide. If the creature can understand you, it must succeed on a Wisdom saving throw or become bound by the task. When acting to complete the directed task, the target has advantage on the first attack roll it makes on each of its turns using a weapon. If the target attempts to use a weapon for a purpose other than completing the specific task or service, it has disadvantage on attack rolls with a weapon and must roll the weapon's damage dice twice, using the lower total.\n  Completing the task ends the spell early. Should you issue a suicidal task, the spell ends. You can end the spell early by using an action to dismiss it. A *remove curse*, *greater restoration*, or *wish* spell also ends it.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.644",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Bard, Cleric",
    "school": "enchantment",
    "casting_time": "1 minute",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "10 days",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "outmaneuver",
  "fields": {
    "name": "Outmaneuver",
    "desc": "When a creature provokes an opportunity attack from an ally you can see within range, you can force the creature to make a Wisdom saving throw. On a failed save, the creature's movement is reduced to 0, and you can move up to your speed toward the creature without provoking opportunity attacks. This spell doesn't interrupt your ally's opportunity attack, which happens before the effects of this spell.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.644",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Bard, Cleric, Paladin, Sorceror, Warlock, Wizard",
    "school": "enchantment",
    "casting_time": "1 reaction, which you take when a creature within 30 feet of you provokes an opportunity attack",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": false,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "oversized-paws",
  "fields": {
    "name": "Oversized Paws",
    "desc": "Until this spell ends, the hands and feet of one willing creature within range become oversized and more powerful. For the duration, the creature adds 1d4 to damage it deals with its unarmed strike.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.644",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Druid, Ranger",
    "school": "transmutation",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each spell slot above 2nd.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "pincer",
  "fields": {
    "name": "Pincer",
    "desc": "You force your enemies into a tight spot. Choose two points you can see within range. The points must be at least 30 feet apart from each other. Each point then emits a thunderous boom in a 30-foot cone in the direction of the other point. The boom is audible out to 300 feet.\n  Each creature within a cone must make a Constitution saving throw. On a failed save, a creature takes 5d10 thunder damage and is pushed up to 10 feet away from the point that emitted the cone. On a successful save, the creature takes half as much damage and isn't pushed. Objects that aren't being worn or carried within each cone are automatically pushed.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.646",
    "page_no": null,
    "page": "",
    "spell_level": 6,
    "dnd_class": "Wizard",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 7th level or higher, the damage increases by 1d10 for each slot level above 6th.",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "pipers-lure",
  "fields": {
    "name": "Piper's Lure",
    "desc": "You touch a nonmagical pipe or horn instrument and imbue it with magic that lures creatures toward it. Each creature that enters or starts its turn within 150 feet of the affected object must succeed on a Wisdom saving throw or be charmed for 10 minutes. A creature charmed by this spell must take the Dash action and move toward the affected object by the safest available route on each of its turns. Once a charmed creature moves within 5 feet of the object, it is also incapacitated as it stares at the object and sways in place to a mesmerizing tune only it can hear. If the object is moved, the charmed creature attempts to follow it.\n  For every 10 minutes that elapse, the creature can make a new Wisdom saving throw. On a success, the spell ends on that creature. If a charmed creature is attacked, the spell ends immediately on that creature. Once a creature has been charmed by this spell, it can't be charmed by it again for 24 hours.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.646",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Ranger, Sorceror, Wizard",
    "school": "enchantment",
    "casting_time": "1 minute",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 hour",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "portal-jaunt",
  "fields": {
    "name": "Portal Jaunt",
    "desc": "You touch a specially prepared key to a door or gate, turning it into a one-way portal to another such door within range. This spell works with any crafted door, doorway, archway, or any other artificial opening, but not natural or accidental openings such as cave entrances or cracks in walls. You must be aware of your destination or be able to see it from where you cast the spell.\n  On completing the spell, the touched door opens, revealing a shimmering image of the location beyond the destination door. You can move through the door, emerging instantly out of the destination door. You can also allow one other willing creature to pass through the portal instead. Anything you carry moves through the door with you, including other creatures, willing or unwilling.\n  For the purpose of this spell, any locks, bars, or magical effects such as arcane lock are ineffectual for the spell's duration. You can travel only to a side of the door you can see or have physically visited in the past (divinations such as clairvoyance count as seeing). Once you or a willing creature passes through, both doors shut, ending the spell. If you or another creature does not move through the portal within 1 round, the spell ends.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.647",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Sorceror, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "300 Feet",
    "target_range_sort": 300,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the range increases by 100 feet and the duration increases by 1 round for each slot level above 3rd. Each round added to the duration allows one additional creature to move through the portal before the spell ends.",
    "can_be_cast_as_ritual": false,
    "duration": "1 round",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "portal-trap",
  "fields": {
    "name": "Portal Trap",
    "desc": "You create a magical portal on a surface in an unoccupied space you can see within range. The portal occupies up to 5 square feet of the surface and is instantly covered with an illusion. The illusion looks like the surrounding terrain or surface features, such as mortared stone if the portal is placed on a stone wall, or a simple image of your choice like those created by the *minor illusion* spell. A creature that touches, steps on, or otherwise interacts with or enters the portal must succeed on a Wisdom saving throw or be teleported to an unoccupied space up to 30 feet away in a random direction. To determine the direction, roll a d8 and assign a direction to each die face. The creature can't be teleported into a solid object.\n  Physical interaction with the illusion reveals it to be an illusion, but such touching triggers the portal's effect. A creature that uses an action to examine the area where the portal is located can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.647",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Bard, Cleric, Sorceror, Warlock, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can create one additional portal for each slot level above 2nd.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "power-word-fling",
  "fields": {
    "name": "Power Word Fling",
    "desc": "You mutter a word of power that causes a creature you can see within range to be flung vertically or horizontally. The creature must succeed on a Strength saving throw or be thrown up to 15 feet vertically or horizontally. If the target impacts a surface, such as a ceiling or wall, it stops moving and takes 3d6 bludgeoning damage. If the target was thrown vertically, it plummets to the ground, taking falling damage as normal, unless it has a flying speed or other method of preventing a fall. If the target impacts a creature, the target stops moving and takes 3d6 bludgeoning damage, and the creature the target hits must succeed on a Strength saving throw or be knocked prone. After the target is thrown horizontally or it falls from being thrown vertically, regardless of whether it impacted a surface, it is knocked prone.\n  As a bonus action on each of your subsequent turns, you can attempt to fling the same creature again. The target must succeed on another Strength saving throw or be thrown.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.647",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Sorceror, Warlock, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the distance you can fling the target increases by 5 feet, and the damage from impacting a surface or creature increases by 1d6 for each slot level above 3rd.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "power-word-rend",
  "fields": {
    "name": "Power Word Rend",
    "desc": "You speak a word of power that causes the internal organs of a creature you can see within range to rupture. The target must make a Constitution saving throw. It takes 4d6 + 20 force damage on a failed save, or half as much damage on a successful one. If the target is below half its hit point maximum, it has disadvantage on this saving throw. This spell has no effect on creatures without vital internal organs, such as constructs, oozes, and undead.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.648",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Bard, Sorceror, Warlock, Wizard",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "90 Feet",
    "target_range_sort": 90,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them.",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "reapers-knell",
  "fields": {
    "name": "Reaper's Knell",
    "desc": "As the bell rings, a burst of necrotic energy ripples out in a 20-foot-radius sphere from a point you can see within range. Each creature in that area must make a Wisdom saving throw. On a failed save, the creature is marked with necrotic energy for the duration. If a marked creature is reduced to 0 hit points or dies before the spell ends, you regain hit points equal to 2d8 + your spellcasting ability modifier. Alternatively, you can choose for one ally you can see within range to regain the hit points instead.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.649",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Bard, Cleric, Sorceror, Warlock, Wizard",
    "school": "necromancy",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 5th level or higher, the healing increases by 1d8 for each slot level above 4th.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "rebounding-bolt",
  "fields": {
    "name": "Rebounding Bolt",
    "desc": "You fire a vibrant blue beam of energy at a creature you can see within range. The beam then bounces to a creature of your choice within 30 feet of the target, losing some of its vibrancy and continuing to bounce to other creatures of your choice until it sputters out. Each subsequent target must be within 30 feet of the target affected before it, and the beam can't bounce to a target it has already affected.\n  Each target must make a Constitution saving throw. The first target takes 5d6 force damage on a failed save, or half as much damage on a successful one. The beam loses some of its power then bounces to the second target. The beam deals 1d6 force damage less (4d6, then 3d6, then 2d6, then 1d6) to each subsequent target with the final target taking 1d6 force damage on a failed save, or half as much damage on a successful one.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.650",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Wizard",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d6 for each slot level above 3rd. This increase allows the beam to jump an additional time, reducing the damage it deals by 1d6 with each bounce as normal.",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "repulsing-wall",
  "fields": {
    "name": "Repulsing Wall",
    "desc": "You create a shimmering wall of light on a solid surface within range. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is translucent, and creatures have disadvantage on Wisdom (Perception) checks to look through the wall.\n  One side of the wall, selected by you when you cast this spell, deals 5d8 radiant damage when a creature enters the wall for the first time on a turn or ends its turn there. A creature attempting to pass through the wall must make a Strength saving throw. On a failed save, a creature is pushed 10 feet away from the wall and falls prone. A creature that is undead, a fiend, or vulnerable to radiant damage has disadvantage on this saving throw. The other side of the wall deals no damage and doesn't restrict movement through it.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.653",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Cleric, Paladin, Warlock, Wizard",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d8 for each slot level above 4th.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "retribution",
  "fields": {
    "name": "Retribution",
    "desc": "You wrap yourself in shimmering ethereal armor. The next time a creature hits you with a melee attack, it takes force damage equal to half the damage it dealt to you, and it must make a Strength saving throw. On a failed save, the creature is pushed up to 5 feet away from you. Then the spell ends.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.654",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Wizard",
    "school": "abjuration",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "rockfall-ward",
  "fields": {
    "name": "Rockfall Ward",
    "desc": "You temporarily halt the fall of up to a 10-foot cube of nonmagical objects or debris, saving those who might have been crushed. The falling material's rate of descent slows to 60 feet per round and comes to a stop 5 feet above the ground, where it hovers until the spell ends. This spell can't prevent missile weapons from striking a target, and it can't slow the descent of an object larger than a 10-foot cube. However, at the GM's discretion, it can slow the descent of a section of a larger object, such as the wall of a falling building or a section of sail and rigging tied to a falling mast.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.656",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Cleric, Druid, Sorceror, Warlock, Wizard",
    "school": "transmutation",
    "casting_time": "1 reaction, which you take when nonmagical debris fall within 120 feet of you",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 2nd level or higher, the cube of debris and objects you can halt increases by 5 feet for each slot level above 1st.",
    "can_be_cast_as_ritual": false,
    "duration": "1 minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "sacrifice-pawn",
  "fields": {
    "name": "Sacrifice Pawn",
    "desc": "Sometimes one must fall so others might rise. When a friendly creature you can see within range drops to 0 hit points, you can harness its escaping life energy to heal yourself. You regain hit points equal to the fallen creature's level (or CR for a creature without a level) + your spellcasting ability modifier.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.656",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Warlock, Wizard",
    "school": "necromancy",
    "casting_time": "1 reaction, which you take when a friendly creature within 60 feet drops to 0 hit points",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "sacrificial-healing",
  "fields": {
    "name": "Sacrificial Healing",
    "desc": "You heal another creature's wounds by taking them upon yourself or transferring them to another willing creature in range. Roll 4d8. The number rolled is the amount of damage healed by the target and the damage you take, as its wounds close and similar damage appears on your body (or the body of the other willing target of the spell).",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.656",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Bard, Sorceror, Wizard",
    "school": "necromancy",
    "casting_time": "1 action",
    "range": "Touch",
    "target_range_sort": 1,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "safe-transposition",
  "fields": {
    "name": "Safe Transposition",
    "desc": "You cast this spell when an ally below half its hit point maximum within range is attacked. You swap places with your ally, each of you instantly teleporting into the space the other just occupied. If there isn't room for you in the new space or for your ally in your former space, this spell fails. After the two of you teleport, the triggering attack roll is compared to your AC to determine if it hits you.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.657",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Paladin",
    "school": "conjuration",
    "casting_time": "1 reaction, which you take when an injured ally is attacked",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": false,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "secret-blind",
  "fields": {
    "name": "Secret Blind",
    "desc": "A 5-foot-radius immobile sphere springs into existence around you and remains stationary for the duration. You and up to four Medium or smaller creatures can occupy the sphere. If its area includes a larger creature or more than five creatures, each larger creature and excess creature is pushed to an unoccupied space outside of the sphere.\n  Creatures and objects within the sphere when you cast this spell may move through it freely. All other creatures and objects are barred from passing through the sphere after it forms. Spells and other magical effects can't extend through the sphere, with the exception of transmutation or conjuration spells and magical effects that allow you or the creatures inside the sphere to willingly leave it, such as the *dimension door* and *teleport* spells. The atmosphere inside the sphere is cool, dry, and filled with air, regardless of the conditions outside.\n  Until the effect ends, you can command the interior to be dimly lit or dark. The sphere is opaque from the outside and covered in an illusion that makes it appear as the surrounding terrain, but it is transparent from the inside. Physical interaction with the illusion reveals it to be an illusion as the creature touches the cool, firm surface of the sphere. A creature that uses an action to examine the sphere can determine it is covered by an illusion with a successful Intelligence (Investigation) check against your spell save DC.\n  The effect ends if you leave its area, or if the sphere is hit with the *disintegration* spell or a successful *dispel magic* spell.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.657",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Sorceror, Warlock, Wizard",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "Self (5-foot-radius sphere)",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "10 minutes",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "shared-frenzy",
  "fields": {
    "name": "Shared Frenzy",
    "desc": "You yell defiantly as part of casting this spell to encourage a battle fury among your allies. Each friendly creature in range must make a Charisma saving throw; a creature can choose to fail this saving throw if it wishes. If a creature fails its saving throw, it has resistance to bludgeoning, piercing, and slashing damage and has advantage on attack rolls for the duration. However, attack rolls made against an affected creature have advantage.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.659",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Bard",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, this spell no longer causes creatures to have advantage against the spell's targets.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "shocking-volley",
  "fields": {
    "name": "Shocking Volley",
    "desc": "You draw back and release an imaginary bowstring while aiming at a point you can see within range. Bolts of arrow-shaped lightning shoot from the imaginary bow, and each creature within 20 feet of that point must make a Dexterity saving throw. On a failed save, a creature takes 2d8 lightning damage and is incapacitated until the end of its next turn. On a successful save, a creature takes half as much damage.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.660",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Druid, Ranger, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "sightburst",
  "fields": {
    "name": "Sightburst",
    "desc": "A wave of echoing sound emanates from you. Until the start of your next turn, you have blindsight out to a range of 100 feet, and you know the location of any natural hazards within that area. You have advantage on saving throws made against hazards detected with this spell.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.660",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Cleric, Sorceror, Warlock, Wizard",
    "school": "divination",
    "casting_time": "1 action",
    "range": "Self (100-foot radius)",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the duration is concentration, up to 1 minute. When you use a spell slot of 5th level or higher, the duration is concentration, up to 10 minutes. When you use a spell slot of 7th level or higher, the duration is concentration, up to 1 hour.",
    "can_be_cast_as_ritual": false,
    "duration": "1 round",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "silvershout",
  "fields": {
    "name": "Silvershout",
    "desc": "You unleash a shout that coats all creatures in a 30'foot cone in silver dust. If a creature in that area is a shapeshifter, the dust covering it glows. In addition, each creature in the area must make a Constitution saving throw. On a failed save, weapon attacks against that creature are considered to be silvered for the purposes of overcoming resistance and immunity to nonmagical attacks that aren't silvered for 1 minute.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.661",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Bard, Cleric",
    "school": "abjuration",
    "casting_time": "1 action",
    "range": "Self (30-foot cone)",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "smelting-blast",
  "fields": {
    "name": "Smelting Blast",
    "desc": "You unleash a bolt of red-hot liquid metal at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 2d8 fire damage and must succeed on a Constitution saving throw or be coated in cooling, liquid metal for the duration. A creature coated in liquid metal takes 1d8 fire damage at the start of each of its turns as the metal scorches while it cools. At the end of each of its turns, the creature can make another Constitution saving throw. On a success, the spell ends and the liquid metal disappears.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.661",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Sorceror, Warlock, Wizard",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage (both initial and later) increases by 1d8 for each slot level above 2nd.",
    "can_be_cast_as_ritual": false,
    "duration": "1 minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "sneer",
  "fields": {
    "name": "Sneer",
    "desc": "You curl your lip in disgust at a creature you can see within range. The target must succeed on a Charisma saving throw or take psychic damage equal to 2d4 + your spellcasting ability modifier.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.662",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Bard, Sorceror, Warlock, Wizard",
    "school": "evocation",
    "casting_time": "1 bonus action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": false,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "spiked-barricade",
  "fields": {
    "name": "Spiked Barricade",
    "desc": "With a word, you create a barricade of pointed, wooden poles, also known as a cheval de frise, to block your enemies' progress. The barricade is composed of six 5-foot cube barriers made of wooden spikes mounted on central, horizontal beams.\n  Each barrier doesn't need to be contiguous with another barrier, but each barrier must appear in an unoccupied space within range. Each barrier is difficult terrain, and a barrier provides half cover to a creature behind it. When a creature enters a barrier's area for the first time on a turn or starts its turn there, the creature must succeed on a Strength saving throw or take 3d6 piercing damage.\n  The barriers are objects made of wood that can be damaged and destroyed. Each barrier has AC 13, 20 hit points, and is vulnerable to bludgeoning and fire damage. Reducing a barrier to 0 hit points destroys it.\n  If you maintain your concentration on this spell for its whole duration, the barriers become permanent and can't be dispelled. Otherwise, the barriers disappear when the spell ends.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.662",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Cleric, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "90 Feet",
    "target_range_sort": 90,
    "requires_verbal_components": true,
    "requires_somatic_components": false,
    "requires_material_components": true,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the number of barriers you create increases by two for each slot level above 3rd.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 10 minutes",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "spite",
  "fields": {
    "name": "Spite",
    "desc": "You prick your finger and anoint your forehead with your own blood, taking 1 piercing damage and warding yourself against hostile attacks. The first time a creature hits you with an attack during this spell's duration, it takes 3d6 psychic damage. Then the spell ends.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.662",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Bard, Sorceror, Wizard",
    "school": "abjuration",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": false,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.",
    "can_be_cast_as_ritual": false,
    "duration": "1 hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "steam-gout",
  "fields": {
    "name": "Steam Gout",
    "desc": "You create a gout of billowing steam in a 40-foottall cylinder with a 5-foot radius centered on a point on the ground you can see within range. Exposed flames in the area are doused. Each creature in the area when the gout first appears must make a Dexterity saving throw. On a failed save, the creature takes 2d8 fire damage and falls prone. On a successful save, the creature takes half as much damage and doesn't fall prone.\n  The gout then covers the area in a sheen of slippery water. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a Dexterity saving throw. On a failed save, it falls prone.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.663",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Druid, Sorceror, Warlock, Wizard",
    "school": "evocation",
    "casting_time": "1 action",
    "range": "120 Feet",
    "target_range_sort": 120,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8, and you can create one additional gout of steam for each slot level above 3rd. A creature in the area of more than one gout of steam is affected only once.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "stone-aegis",
  "fields": {
    "name": "Stone Aegis",
    "desc": "A rocky coating covers your body, protecting you. Until the start of your next turn, you gain 5 temporary hit points and a +2 bonus to Armor Class, including against the triggering attack.\n  At the start of each of your subsequent turns, you can use a bonus action to extend the duration of the AC bonus until the start of your following turn, for up to 1 minute.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.664",
    "page_no": null,
    "page": "",
    "spell_level": 1,
    "dnd_class": "Cleric, Druid, Warlock",
    "school": "transmutation",
    "casting_time": "1 reaction, which you take when you are hit by an attack",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "stone-fetch",
  "fields": {
    "name": "Stone Fetch",
    "desc": "You create a stony duplicate of yourself, which rises out of the ground and appears next to you. The duplicate looks like a stone carving of you, including the clothing you're wearing and equipment you're carrying at the time of the casting. It uses the statistics of an earth elemental.\n  For the duration, you have a telepathic link with the duplicate. You can use this telepathic link to issue commands to the duplicate while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as “Run over there” or “Fetch that object.” If the duplicate completes the order and doesn't receive further direction from you, it takes the Dodge or Hide action (your choice) on its turn. The duplicate can't attack, but it can speak in a gravelly version of your voice and mimic your mannerisms with exact detail.\n  As a bonus action, you can see through the duplicate's eyes and hear what it hears as if you were in the duplicate's space, gaining the benefits of the earth elemental's darkvision and tremorsense until the start of your next turn. During this time, you are deaf and blind with regard to your own senses. As an action while sharing the duplicate's senses, you can make the duplicate explode in a shower of jagged chunks of rock, destroying the duplicate and ending the spell. Each creature within 10 feet of the duplicate must make a Dexterity saving throw. A creature takes 4d10 slashing damage on a failed save, or half as much damage on a successful one.\n  The duplicate explodes at the end of the duration, if you didn't cause it to explode before then. If the duplicate is killed before it explodes, you suffer one level of exhaustion.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.664",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Cleric, Sorceror, Warlock, Wizard",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "Self",
    "target_range_sort": 0,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 5th level or higher, the explosion damage increases by 1d10 for each slot level above 4th. In addition, when you cast this spell using a spell slot of 6th level or higher, the duration is 1 hour. When you cast this spell using a spell slot of 8th level or higher, the duration is 8 hours. Using a spell slot of 6th level or higher grants a duration that doesn't require concentration.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 10 minutes",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "sudden-slue",
  "fields": {
    "name": "Sudden Slue",
    "desc": "With a growl, you call forth dozens of bears to overrun all creatures in a 20-foot cube within range. Each creature in the area must make a Dexterity saving throw. On a failed save, a creature takes 6d6 bludgeoning damage and is knocked prone. On a successful save, a creature takes half the damage and isn't knocked prone. The bears disappear after making their charge.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.666",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Druid",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "sudden-stampede",
  "fields": {
    "name": "Sudden Stampede",
    "desc": "You conjure up a multitude of fey spirits that manifest as galloping horses. These horses run in a 10-foot'wide, 60-foot-long line, in a given direction starting from a point within range, trampling all creatures in their path, before vanishing again. Each creature in the line takes 6d10 bludgeoning damage and is knocked prone. A successful Dexterity saving throw reduces the damage by half, and the creature is not knocked prone.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.667",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Bard, Druid, Ranger",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "Instantaneous",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "toadstool-ring",
  "fields": {
    "name": "Toadstool Ring",
    "desc": "You coax a toadstool ring to sprout from the ground. A creature of your choice can sit in the center of the ring and meditate for the duration, catching glimpses of the past, present, and future. The creature can ask up to three questions: one about the past, one about the present, and one about the future. The GM offers truthful answers in the form of dreamlike visions that may be subject to interpretation. When the spell ends, the toadstools turn black and dissolve back into the earth.\n  If you cast the spell two or more times before finishing your next long rest, there is a cumulative 25 percent chance for each casting after the first that the meditating creature gets a random vision unrelated to the question. The GM makes this roll in secret.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.669",
    "page_no": null,
    "page": "",
    "spell_level": 6,
    "dnd_class": "Druid, Sorceror, Wizard",
    "school": "divination",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "toothless-beast",
  "fields": {
    "name": "Toothless Beast",
    "desc": "You hinder the natural attacks of a creature you can see within range. The creature must make a Wisdom saving throw. On a failed save, any time the creature attacks with a bite, claw, slam, or other weapon that isn't manufactured, it must roll the weapon's damage dice twice and use the lower total. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target. This spell has no effect on constructs.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.669",
    "page_no": null,
    "page": "",
    "spell_level": 2,
    "dnd_class": "Druid, Ranger, Sorceror, Warlock, Wizard",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "60 Feet",
    "target_range_sort": 60,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd. The creatures must be within 30 feet of each other when you target them.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "trollish-charge",
  "fields": {
    "name": "Trollish Charge",
    "desc": "You veil a willing creature you can see within range in an illusion others perceive as their worst nightmares given flesh. When the affected creature moves at least 10 feet straight toward a creature and attacks it, that creature must succeed on a Wisdom saving throw or become frightened for 1 minute. If the affected creature’s attack hits the frightened target, the affected creature can roll the attack’s damage dice twice and use the higher total.\n  At the end of each of its turns, a creature frightened by this spell can make another Wisdom saving throw. On a success, the creature is no longer frightened and can’t be frightened by this spell again for 24 hours.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.671",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Bard, Cleric, Sorceror, Warlock, Wizard",
    "school": "illusion",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them.",
    "can_be_cast_as_ritual": false,
    "duration": "Up to 1 minute",
    "requires_concentration": true,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "vine-carpet",
  "fields": {
    "name": "Vine Carpet",
    "desc": "You cause a thick carpet of vines to grow from a point on the ground within range. The vines cover objects and prone creatures within 20 feet of that point. While covered in this way, objects and creatures have total cover as long as they remain motionless. A creature that moves while beneath the carpet has only three-quarters cover from attacks on the other side of the carpet. A covered creature that stands up from prone stands atop the carpet and is no longer covered. The carpet of vines is plush enough that a Large or smaller creature can walk across it without harming or detecting those covered by it.\n  When the spell ends, the vines wither away into nothingness, revealing any objects and creatures that were still covered.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.671",
    "page_no": null,
    "page": "",
    "spell_level": 3,
    "dnd_class": "Druid, Ranger",
    "school": "conjuration",
    "casting_time": "1 action",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": false,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 hour",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "war-horn",
  "fields": {
    "name": "War Horn",
    "desc": "You blow a blast on your war horn, sending a ripple of fear through your enemies and bolstering your allies. Choose up to three hostile creatures in range and up to three friendly creatures in range. Each hostile target must succeed on a Wisdom saving throw or become frightened for the duration. At the end of each of its turns, a frightened creature can make another Wisdom saving throw. On a success, the spell ends on that creature.\n  Each friendly target gains a number of temporary hit points equal to 2d4 + your spellcasting ability modifier and has advantage on the next attack roll it makes before the spell ends. The temporary hit points last for 1 hour.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.672",
    "page_no": null,
    "page": "",
    "spell_level": 4,
    "dnd_class": "Cleric, Paladin, Wizard",
    "school": "enchantment",
    "casting_time": "1 action",
    "range": "Self (30-foot radius)",
    "target_range_sort": 0,
    "requires_verbal_components": false,
    "requires_somatic_components": false,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "1 minute",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
},
{
  "model": "api.spell",
  "pk": "wild-hunt",
  "fields": {
    "name": "Wild Hunt",
    "desc": "While casting this spell, you must chant and drum, calling forth the spirit of the hunt. Up to nine other creatures can join you in the chant.\n  For the duration, each creature that participated in the chant is filled with the fervent bloodlust of the wild hunt and gains several benefits. The creature is immune to being charmed and frightened, it deals one extra die of damage on the first weapon or spell attack it makes on each of its turns, it has advantage on Strength or Dexterity saving throws (the creature's choice), and its Armor Class increases by 1.\n  When this spell ends, a creature affected by it suffers one level of exhaustion.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.672",
    "page_no": null,
    "page": "",
    "spell_level": 7,
    "dnd_class": "Druid, Sorceror, Warlock",
    "school": "enchantment",
    "casting_time": "1 hour",
    "range": "30 Feet",
    "target_range_sort": 30,
    "requires_verbal_components": true,
    "requires_somatic_components": true,
    "requires_material_components": true,
    "material": "",
    "higher_level": "",
    "can_be_cast_as_ritual": false,
    "duration": "24 hours",
    "requires_concentration": false,
    "archetype": "",
    "circles": "",
    "route": "spells/"
  }
}
]
