[
{
  "model": "api.subrace",
  "pk": "acid-cap",
  "fields": {
    "name": "Acid Cap",
    "desc": "You were one of the warriors and guardians of your clan, using your strength and acid spores to protect your clanmates and your territory.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.687",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Strength score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Strength\"], \"value\": 1}]",
    "traits": "***Acid Cap Resistance.*** You have resistance to acid damage.\n\n***Acid Spores.*** When you are hit by a melee weapon attack within 5 feet of you, you can use your reaction to emit acidic spores. If you do, the attacker takes acid damage equal to half your level (rounded up). You can use your acid spores a number of times equal to your Constitution modifier (a minimum of once). You regain any expended uses when you finish a long rest.\n\n***Clan Athlete.*** You have proficiency in the Athletics skill.",
    "parent_race": "mushroomfolk",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "bhain-kwai",
  "fields": {
    "name": "Bhain Kwai",
    "desc": "You are a minotaur adapted to life in the bogs and wetlands of the world.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.686",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Constitution score increases by 2, and your Strength score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Constitution\"], \"value\": 2}, {\"attributes\": [\"Strength\"], \"value\": 1}]",
    "traits": "***Strong Back.*** Your carrying capacity is your Strength score multiplied by 20, instead of by 15.\n\n***Wetland Dweller.*** You are adapted to your home terrain. Difficult terrain composed of mud or from wading through water up to waist deep doesn't cost you extra movement. You have a swimming speed of 25 feet.",
    "parent_race": "minotaur",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "boghaid",
  "fields": {
    "name": "Boghaid",
    "desc": "You are a minotaur adapted to life in cold climates and high altitudes.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.687",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Wisdom score increases by 2, and your Constitution score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Wisdom\"], \"value\": 2}, {\"attributes\": [\"Constitution\"], \"value\": 1}]",
    "traits": "***Highlander.*** You are adapted to life at high altitudes, and you suffer no ill effects or penalties from elevations above 8,000 feet.\n\n***Storied Culture.*** You have proficiency in the Performance skill, and you gain proficiency with one of the following musical instruments: bagpipes, drum, horn, or shawm.\n\n***Wooly.*** Your thick, wooly coat of hair keeps you warm, allowing you to function in cold weather without special clothing or gear. You have advantage on saving throws against spells and other effects that deal cold damage.",
    "parent_race": "minotaur",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "delver",
  "fields": {
    "name": "Delver",
    "desc": "You are one of the workers whose labors prop up most of drow society. You were trained from birth to follow orders and serve the collective. You learned your trade well, whether it was building or fighting or erecting the traps that protected passages to your population centers.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.683",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Strength or Dexterity score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Strength\"], \"value\": 1}, {\"attributes\": [\"Dexterity\"], \"value\": 1}]",
    "traits": "***Rapport with Insects.*** Your caste's years of working alongside the giant spiders and beetles that your people utilized in building and defending cities has left your caste with an innate affinity with the creatures. You can communicate simple ideas with insect-like beasts with an Intelligence of 3 or lower, such as spiders, beetles, wasps, scorpions, and centipedes. You can understand them in return, though this understanding is often limited to knowing the creature's current or most recent state, such as “hungry,” “content,” or “in danger.” Delver drow often keep such creatures as pets, mounts, or beasts of burden.\n\n***Specialized Training.*** You are proficient in one skill and one tool of your choice.\n\n***Martial Excellence.*** You are proficient with one martial weapon of your choice and with light armor.",
    "parent_race": "drow",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "derro-heritage",
  "fields": {
    "name": "Derro Heritage",
    "desc": "Your darakhul character was a derro before transforming into a darakhul. For you, the quieting of the otherworldly voices did not bring peace and tranquility. The impulses simply became more focused, and the desire to feast on flesh overwhelmed other urges. The darkness is still there; it just has a new, clearer form.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.676",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Charisma score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Charisma\"], \"value\": 2}]",
    "traits": "***Calculating Insanity.*** The insanity of your race was compressed into a cold, hard brilliance when you took on your darakhul form. These flashes of brilliance come to you at unexpected moments. You know the true strike cantrip. Charisma is your spellcasting ability for it. You can cast true strike as a bonus action a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest.",
    "parent_race": "darakhul",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "dragonborn-heritage",
  "fields": {
    "name": "Dragonborn Heritage",
    "desc": "Your darakhul character was a dragonborn before transforming into a darakhul. The dark power of undeath overwhelmed your elemental nature, replacing it with the foul energy and strength of the undead. Occasionally, your draconic heritage echoes a peal of raw power through your form, but it is quickly converted into necrotic waves.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.676",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Strength score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Strength\"], \"value\": 2}]",
    "traits": "***Corrupted Bite.*** The inherent breath weapon of your draconic heritage is corrupted by the necrotic energy of your new darakhul form. Instead of forming a line or cone, your breath weapon now oozes out of your ghoulish maw. As a bonus action, you breathe necrotic energy onto your fangs and make one bite attack. If the attack hits, it deals extra necrotic damage equal to your level. You can't use this trait again until you finish a long rest.",
    "parent_race": "darakhul",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "drow-heritage",
  "fields": {
    "name": "Drow Heritage",
    "desc": "Your darakhul character was a drow before transforming into a darakhul. Your place within the highly regimented drow society doesn't feel that much different from your new place in the darakhul empires. But an uncertainty buzzes in your mind, and a hunger gnaws at your gut. You are now what you once hated and feared. Does it feel right, or is it something you fight against?",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.676",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Intelligence score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Intelligence\"], \"value\": 2}]",
    "traits": "***Poison Bite.*** When you hit with your bite attack, you can release venom into your foe. If you do, your bite deals an extra 1d6 poison damage. The damage increases to 3d6 at 11th level. After you release this venom into a creature, you can't do so again until you finish a short or long rest.",
    "parent_race": "darakhul",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "dwarf-chassis",
  "fields": {
    "name": "Dwarf Chassis",
    "desc": "The original dwarven gearforged engineers valued function over form, eschewing aesthetics in favor of instilling their chassis with toughness and strength. The chassis' metal face is clearly crafted to look dwarven, but its countenance is entirely unactuated and forged of a dark metal—often brass—sometimes with a lighter-colored mane of hair and a braided beard and mustaches made of fine metal strands. The gearforged's eyes glow a dark turquoise, staring dispassionately with a seemingly blank expression. Armor and helms worn by the gearforged are often styled to appear as if they were integrated into its chassis, making it all-but-impossible to tell where the armor ends and the gearforged begins.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.684",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Constitution score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Constitution\"], \"value\": 1}]",
    "traits": "***Always Armed.*** Every dwarf knows that it's better to leave home without pants than without your weapon. Choose a weapon with which you are proficient and that doesn't have the two-handed property. You can integrate this weapon into one of your arms. While the weapon is integrated, you can't be disarmed of it by any means, though you can use an action to remove the weapon. You can draw or sheathe the weapon as normal, the weapon folding into or springing from your arm instead of a sheath. While the integrated weapon is drawn in this way, it is considered held in that arm's hand, which can't be used for other actions such as casting spells. You can integrate a new weapon or replace an integrated weapon as part of a short or long rest. You can have up to two weapons integrated at a time, one per arm. You have advantage on Dexterity (Sleight of Hand) checks to conceal an integrated weapon.\n\n***Remembered Training.*** You remember some of your combat training from your previous life. You have proficiency with two martial weapons of your choice and with light and medium armor.",
    "parent_race": "gearforged",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "dwarf-heritage",
  "fields": {
    "name": "Dwarf Heritage",
    "desc": "Your darakhul character was a dwarf before transforming into a darakhul. The hum of the earth, the tranquility of the stone and the dust, drained from you as the darakhul fever overwhelmed your once-resilient body. The stone is still there, but its touch has gone from a welcome embrace to a cold grip of death. But it's all the same to you now. ",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.677",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Wisdon score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Wisdom\"], \"value\": 2}]",
    "traits": "***Dwarven Stoutness.*** Your hit point maximum increases by 1, and it increases by 1 every time you gain a level.",
    "parent_race": "darakhul",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "elfshadow-fey-heritage",
  "fields": {
    "name": "Elf/Shadow Fey Heritage",
    "desc": "Your darakhul character was an elf or shadow fey (see *Midgard Heroes Handbook*) before transforming into a darakhul. The deathly power coursing through you reminds you of the lithe beauty and magic of your former body. If you just use your imagination, the blood tastes like wine once did. The smell of rotting flesh has the bouquet of wildflowers. The moss beneath the surface feels like the leaves of the forest.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.677",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Dexterity score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Dexterity\"], \"value\": 2}]",
    "traits": "***Supernatural Senses.*** Your keen elven senses are honed even more by the power of undeath and the hunger within you. You can now smell when blood is in the air. You have proficiency in the Perception skill, and you have advantage on Wisdom (Perception) checks to notice or find a creature within 30 feet of you that doesn't have all of its hit points.",
    "parent_race": "darakhul",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "far-touched",
  "fields": {
    "name": "Far-Touched",
    "desc": "You grew up firmly ensconced in the mad traditions of the derro, your mind touched by the raw majesty and power of your society's otherworldly deities. Your abilities in other areas have made you more than a typical derro, of course. But no matter how well-trained and skilled you get in other magical or martial arts, the voices of your gods forever reverberate in your ears, driving you forward to do great or terrible things.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.681",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Charisma score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Charisma\"], \"value\": 1}]",
    "traits": "***Insanity.*** You have advantage on saving throws against being charmed or frightened. In addition, you can read and understand Void Speech, but you can speak only a few words of the dangerous and maddening language—the words necessary for using the spells in your Mad Fervor trait.\n\n***Mad Fervor.*** The driving force behind your insanity has blessed you with a measure of its power. You know the vicious mockery cantrip. When you reach 3rd level, you can cast the enthrall spell with this trait, and starting at 5th level, you can cast the fear spell with it. Once you cast a non-cantrip spell with this trait, you can't do so again until you finish a long rest. Charisma is your spellcasting ability for these spells. If you are using Deep Magic for 5th Edition, these spells are instead crushing curse, maddening whispers, and alone, respectively.",
    "parent_race": "derro",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "favored",
  "fields": {
    "name": "Favored",
    "desc": "A few special mushroomfolk grow to become shamans, generals, and other types of leaders. Your spores invite cooperation, peace, and healing among your allies. Others look to you for guidance and succor in the harsh underground environs.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.688",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Charisma score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Charisma\"], \"value\": 1}]",
    "traits": "***Blessed Help.*** Your intuition and connection to your allies allows you to assist and protect them. You know the spare the dying cantrip. When you reach 3rd level, you can cast the bless spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells.\n\n***Clan Leader.*** You have proficiency in the Persuasion skill.\n\n***Restful Spores.*** If you or any friendly creatures within 30 feet of you regain hit points at the end of a short rest by spending one or more Hit Dice, each of those creatures regains additional hit points equal to your proficiency bonus. Once a creature benefits from your restful spores, it can't do so again until it finishes a long rest.",
    "parent_race": "mushroomfolk",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "fever-bit",
  "fields": {
    "name": "Fever-Bit",
    "desc": "You were once a typical drow, then you fell victim to the ravaging claws and teeth of a darakhul. The deadly darakhul fever almost took your life, but, when you were on the verge of succumbing, you rallied and survived. You were changed, however, in ways that even the greatest healers of your people can't fathom. But now that you are immune to darakhul fever, your commanders have a job for you.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.683",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Constitution score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Constitution\"], \"value\": 1}]",
    "traits": "***Deathly Resilience.*** Your long exposure to the life-sapping energies of darakhul fever has made you more resilient. You have resistance to necrotic damage, and advantage on death saving throws.\n\n***Iron Constitution.*** You are immune to disease.\n\n***Near-Death Experience.*** Your brush with death has made you more stalwart in the face of danger. You have advantage on saving throws against being frightened.",
    "parent_race": "drow",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "gnome-chassis",
  "fields": {
    "name": "Gnome Chassis",
    "desc": "Crafted for both exceptional functionality and aesthetic beauty, a gnome chassis' skin is clearly metallic but is meticulously colored to closely match gnomish skin tones, except at the joints, where gears and darker steel pistons are visible. Gnome chassis are almost always bald, with elaborate artistic patterns painted or etched on the face and skull in lieu of hair. Their eyes are vivid and lifelike, as is the chassis' gnomish face, which has a sculpted metal nose and articulated mouth and jaw. The gnome artisans who pioneered the first gearforged chassis saw it as an opportunity to not merely build a better body but to make it a work of art.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.685",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Intelligence score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Intelligence\"], \"value\": 1}]",
    "traits": "***Mental Fortitude.*** When creating their first gearforged, gnome engineers put their efforts toward ensuring that the gnomish mind remained a mental fortress, though they were unable to fully replicate the gnomish mind's resilience once transferred to a soul gem. Choose Intelligence, Wisdom, or Charisma. You have advantage on saving throws made with that ability score against magic.\n\n***Quick Fix.*** When you are below half your hit point maximum, you can use a bonus action to apply a quick patch up to your damaged body. You gain temporary hit points equal to your proficiency bonus. You can't use this trait again until you finish a short or long rest.",
    "parent_race": "gearforged",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "gnome-heritage",
  "fields": {
    "name": "Gnome Heritage",
    "desc": "Your darakhul character was a gnome before transforming into a darakhul. The spark of magic that drove you before your transformation still burns inside of you, but now it is a constant ache instead of a source of creation and inspiration. This ache is twisted by your hunger, making you hunger for magic itself. ",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.678",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Intelligence score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Intelligence\"], \"value\": 2}]",
    "traits": "***Magical Hunger.*** When a creature you can see within 30 feet of you casts a spell, you can use your reaction to consume the spell's residual magic. Your consumption doesn't counter or otherwise affect the spell or the spellcaster. When you consume this residual magic, you gain temporary hit points (minimum of 1) equal to your Constitution modifier, and you can't use this trait again until you finish a short or long rest.",
    "parent_race": "darakhul",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "halfling-heritage",
  "fields": {
    "name": "Halfling Heritage",
    "desc": "Your darakhul character was a halfling before transforming into a darakhul. Everything you loved as a halfling—food, drink, exploration, adventure— still drives you in your undead form; it is simply a more ghoulish form of those pleasures now: raw flesh instead of stew, warm blood instead of cold mead. You still want to explore the dark corners of the world, but now you seek something different. ",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.678",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Dexterity score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Dexterity\"], \"value\": 2}]",
    "traits": "***Ill Fortune.*** Your uncanny halfling luck has taken a dark turn since your conversion to an undead creature. When a creature rolls a 20 on the d20 for an attack roll against you, the creature must reroll the attack and use the new roll. If the second attack roll misses you, the attacking creature takes necrotic damage equal to twice your Constitution modifier (minimum of 2).",
    "parent_race": "darakhul",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "human-chassis",
  "fields": {
    "name": "Human Chassis",
    "desc": "As humans invented the first gearforged, it should be no surprise that the human chassis remains the one that is most frequently encountered. However, it would be a mistake to assume that simply because the original chassis is more commonplace that there is anything common about them. While dwarves, gnomes, and kobolds have made clever additions and changes to the base model, the human chassis remains extremely versatile and is battle-proven.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.685",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** One ability score of your choice increases by 1.",
    "asi_json": "[{\"attributes\": [\"Any\"], \"value\": 1}]",
    "traits": "***Adaptable Acumen.*** You gain proficiency in two skills or tools of your choice. Choose one of those skills or tools or another skill or tool proficiency you have. Your proficiency bonus is doubled for any ability check you make that uses the chosen skill or tool.\n\n***Inspired Ingenuity.*** When you roll a 9 or lower on the d20 for an ability check, you can use a reaction to change the roll to a 10. You can't use this trait again until you finish a short or long rest.",
    "parent_race": "gearforged",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "humanhalf-elf-heritage",
  "fields": {
    "name": "Human/Half-Elf Heritage",
    "desc": "Your darakhul character was a human or half-elf before transforming into a darakhul. Where there was once light there is now darkness. Where there was once love there is now hunger. You know if the darkness and hunger become all-consuming, you are truly lost. But the powers of your new form are strangely comfortable. How much of your old self is still there, and what can this new form give you that your old one couldn't? ",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.679",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** One ability score of your choice, other than Constitution, increases by 2.",
    "asi_json": "[{\"attributes\": [\"Any\"], \"value\": 2}]",
    "traits": "***Versatility.*** The training and experience of your early years was not lost when you became a darakhul. You have proficiency in two skills and one tool of your choice.",
    "parent_race": "darakhul",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "kobold-chassis",
  "fields": {
    "name": "Kobold Chassis",
    "desc": "Kobolds are naturally curious tinkerers, constantly modifying their devices and tools. As such, kobolds, in spite of what many dwarf or gnome engineers might say, were the second race to master the nuances of gearforged creation after studying human gearforged. However, most of these early kobold gearforged no longer exist, as the more draconic forms (homages to the kobolds' draconic masters) proved too alien to the kobold soul gems to maintain stable, long-term connections with the bodies. Kobold engineers have since resolved that problem, and kobold gearforged can be found among many kobold communities, aiding its members and tinkering right alongside their scale-and-blood brethren.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.685",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Dexterity score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Dexterity\"], \"value\": 1}]",
    "traits": "***Clutch Aide.*** Kobolds spend their lives alongside their clutchmates, both those hatched around the same time as them and those they choose later in life, and you retain much of this group-oriented intuition. You can take the Help action as a bonus action.\n\n***Resourceful.*** If you have at least one set of tools, you can cobble together one set of makeshift tools of a different type with 1 minute of work. For example, if you have cook's utensils, you can use them to create a temporary set of thieves' tools. The makeshift tools last for 10 minutes then collapse into their component parts, returning your tools to their normal forms. While the makeshift tools exist, you can't use the set of tools you used to create the makeshift tools. At the GM's discretion, you might not be able to replicate some tools, such as an alchemist's alembic or a disguise kit's cosmetics. A creature other than you that uses the makeshift tools has disadvantage on the check.",
    "parent_race": "gearforged",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "kobold-heritage",
  "fields": {
    "name": "Kobold Heritage",
    "desc": "Your darakhul character was a kobold before transforming into a darakhul. The dark, although it was often your home, generally held terrors that you needed to survive. Now you are the dark, and its pull on your soul is strong. You fight to keep a grip on the intellect and cunning that sustained you in your past life. Sometimes it is easy, but often the driving hunger inside you makes it hard to think as clearly as you once did.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.679",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Intelligence score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Intelligence\"], \"value\": 2}]",
    "traits": "***Devious Bite.*** When you hit a creature with your bite attack and you have advantage on the attack roll, your bite deals an extra 1d4 piercing damage.",
    "parent_race": "darakhul",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "malkin",
  "fields": {
    "name": "Malkin",
    "desc": "It's often said curiosity killed the cat, and this applies with equal frequency to catfolk. As a malkin catfolk you are adept at finding clever solutions to escape difficult situations, even (or perhaps especially) situations of your own making. Your diminutive size also gives you an uncanny nimbleness that helps you avoid the worst consequences of your intense inquisitiveness. Most often found in densely populated regions, these catfolk are as curious about the comings and goings of other humanoids as they are about natural or magical phenomena and artifacts. While malkins are sometimes referred to as \"housecats\" by other humanoids and even by other catfolk, doing so in a malkin's hearing is a surefire way to get a face full of claws...",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.675",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Intelligence score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Intelligence\"], \"value\": 1}]",
    "traits": "***Curiously Clever.*** You have proficiency in the Investigation skill.\n\n***Charmed Curiosity.*** When you roll a 1 on the d20 for a Dexterity check or saving throw, you can reroll the die and must use the new roll.",
    "parent_race": "catfolk",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "morel",
  "fields": {
    "name": "Morel",
    "desc": "Your specialty for your clan was acting as a scout and a wayfinder. Your abilities to avoid problems and locate new sources of food for your clan was instrumental in their survival, and your interactions with other clans helped keep your people alive and well.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.688",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Dexterity score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Dexterity\"], \"value\": 1}]",
    "traits": "***Adaptable Camouflage.*** If you spend at least 1 minute in an environment with ample naturally occurring plants or fungi, such as a grassland, a forest, or an underground fungal cavern, you can adjust your natural coloration to blend in with the local plant life. If you do so, you have advantage on Dexterity (Stealth) checks for the next 24 hours while in that environment.\n\n***Clan Scout.*** You have proficiency in the Stealth skill.",
    "parent_race": "mushroomfolk",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "mutated",
  "fields": {
    "name": "Mutated",
    "desc": "Most derro go through the process of indoctrination into their society and come out of it with visions and delusion, paranoia and mania. You, on the other hand, were not affected as much mentally as you were physically. The connection to the dark deities of your people made you stronger and gave you a physical manifestation of their gift that other derro look upon with envy and awe.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.681",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Strength score increases by 1. ",
    "asi_json": "[{\"attributes\": [\"Strength\"], \"value\": 1}]",
    "traits": "***Athletic Training.*** You have proficiency in the Athletics skill, and you are proficient with two martial weapons of your choice.\n\n***Otherworldly Influence.*** Your close connection to the strange powers that your people worship has mutated your form. Choose one of the following:\n* **Alien Appendage.** You have a tentacle-like growth on your body. This tentacle is a natural melee weapon, which you can use to make unarmed strikes. When you hit with it, your tentacle deals bludgeoning damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. This tentacle has a reach of 5 feet and can lift a number of pounds equal to double your Strength score. The tentacle can't wield weapons or shields or perform tasks that require manual precision, such as performing the somatic components of a spell, but it can perform simple tasks, such as opening an unlocked door or container, stowing or retrieving an object, or pouring the contents out of a vial.\n* **Tainted Blood.** Your blood is tainted by your connection with otherworldly entities. When you take piercing or slashing damage, you can use your reaction to force your blood to spray out of the wound. You and each creature within 5 feet of you take necrotic damage equal to your level. Once you use this trait, you can't use it again until you finish a short or long rest.\n* **Tenebrous Flesh.** Your skin is rubbery and tenebrous, granting you a +1 bonus to your Armor Class.",
    "parent_race": "derro",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "pantheran",
  "fields": {
    "name": "Pantheran",
    "desc": "Pantheran catfolk are a wise, observant, and patient people who pride themselves on being resourceful and self-sufficient. Less social than many others of their kind, these catfolk typically dwell in small, close-knit family groups in the forests, jungles, and grasslands of the world, away from larger population centers or cities. Their family clans teach the importance of living off of and protecting the natural world, and pantherans act swiftly and mercilessly when their forest homes are threatened by outside forces. Conversely, pantherans can be the most fierce and loyal of neighbors to villages who respect nature and who take from the land and forest no more than they need. As a pantheran, you value nature and kinship, and your allies know they can count on your wisdom and, when necessary, your claws.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.675",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Wisdom score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Wisdom\"], \"value\": 1}]",
    "traits": "***Hunter's Charge.*** Once per turn, if you move at least 10 feet toward a target and hit it with a melee weapon attack in the same turn, you can use a bonus action to attack that creature with your Cat's Claws. You can use this trait a number of times per day equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n\n***One With the Wilds.*** You have proficiency in one of the following skills of your choice: Insight, Medicine, Nature, or Survival.",
    "parent_race": "catfolk",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "purified",
  "fields": {
    "name": "Purified",
    "desc": "You were born into the caste that produces the leaders and planners, the priests and wizards, the generals and officers of drow society. Your people, it is believed, were tested by the beneficent powers you worship, and you passed those tests to become something more. Your innate magic proves your superiority over your fellows.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.683",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Charisma score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Charisma\"], \"value\": 1}]",
    "traits": "***Innate Spellcasting.*** You know the poison spray cantrip. When you reach 3rd level, you can cast suggestion once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the tongues spell once and regain the ability to do so when you finish a long rest. Intelligence is your spellcasting ability for these spells.\n\n***Born Leader.*** You gain proficiency with two of the following skills of your choice: History, Insight, Performance, and Persuasion.",
    "parent_race": "drow",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "ravenfolk",
  "fields": {
    "name": "Ravenfolk",
    "desc": "Your darakhul character was a ravenfolk (see Midgard Heroes Handbook) before transforming into a darakhul. Your new form feels different. It is more powerful and less fidgety, and your beak has become razor sharp. There is still room for trickery, of course. But with your new life comes a disconnection from the All Father. Does this loss gnaw at you like your new hunger or do you feel freed from the destiny of your people?",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.679",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Dexterity score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Dexterity\"], \"value\": 2}]",
    "traits": "***Sudden Bite and Flight.*** If you surprise a creature during the first round of combat, you can make a bite attack as a bonus action. If it hits, you can immediately take the Dodge action as a reaction.",
    "parent_race": "darakhul",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "tiefling-heritage",
  "fields": {
    "name": "Tiefling Heritage",
    "desc": "Your darakhul character was a tiefling before transforming into a darakhul. You are no stranger to the pull of powerful forces raging through your blood. You have traded one dark pull for another, and this one seems much stronger. Is that a good feeling, or do you miss your old one?",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.680",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Charisma score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Charisma\"], \"value\": 1}]",
    "traits": "***Necrotic Rebuke.*** When you are hit by a weapon attack, you can use a reaction to envelop the attacker in shadowy flames. The attacker takes necrotic damage equal to your Charisma modifier (minimum of 1), and it has disadvantage on attack rolls until the end of its next turn. You must finish a long rest before you can use this feature again.",
    "parent_race": "darakhul",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "trollkin-heritage",
  "fields": {
    "name": "Trollkin Heritage",
    "desc": "Your darakhul character was a trollkin (see *Midgard Heroes Handbook*) before transforming into a darakhul. Others saw you as a monster because of your ancestry. You became inured to the fearful looks and hurried exits of those around you. If only they could see you now. Does your new state make you seek revenge on them, or are you able to maintain your self-control despite the new urges you feel?",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.680",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Strength score increases by 2.",
    "asi_json": "[{\"attributes\": [\"Strength\"], \"value\": 2}]",
    "traits": "***Regenerative Bite.*** The regenerative powers of your trollkin heritage are less potent than they were in life and need a little help. As an action, you can make a bite attack against a creature that isn't undead or a construct. On a hit, you regain hit points (minimum of 1) equal to half the amount of damage dealt. Once you use this trait, you can't use it again until you finish a long rest.",
    "parent_race": "darakhul",
    "route": "subraces/"
  }
},
{
  "model": "api.subrace",
  "pk": "uncorrupted",
  "fields": {
    "name": "Uncorrupted",
    "desc": "Someone in your past failed to do their job of driving you to the brink of insanity. It might have been a doting parent that decided to buck tradition. It might have been a touched seer who had visions of your future without the connections to the mad gods your people serve. It might have been a whole outcast community of derro rebels who refused to serve the madness of your ancestors. Whatever happened in your past, you are quite sane—or at least quite sane for a derro.",
    "document": 44,
    "created_at": "2023-11-05T00:01:41.682",
    "page_no": null,
    "asi_desc": "***Ability Score Increase.*** Your Wisdom score increases by 1.",
    "asi_json": "[{\"attributes\": [\"Wisdom\"], \"value\": 1}]",
    "traits": "***Psychic Barrier.*** Your time among your less sane brethren has inured you to their madness. You have resistance to psychic damage, and you have advantage on ability checks and saving throws made against effects that inflict insanity, such as spells like contact other plane and symbol, and effects that cause short-term, long-term, or indefinite madness.\n\n***Studied Insight.*** You are skilled at discerning other creature's motives and intentions. You have proficiency in the Insight skill, and, if you study a creature for at least 1 minute, you have advantage on any initiative checks in combat against that creature for the next hour.",
    "parent_race": "derro",
    "route": "subraces/"
  }
}
]
