[
    {
        "name": "Con Artist",
        "desc": "You have always had a knack for getting people to see your point of view, often to their own detriment. You know how people think, what they want, and how to best use that to your advantage.\n\nPeople should know better than to trust you when you offer exactly what they need for exactly as much money as they have, but for the desperate caution is a resource in short supply. Your mysterious bottles, unlikely rumors, and secret maps offer to deliver the salvation they need. When they realize they've been had, you're nowhere to be found",
        "skill-proficiencies": "Deception, Sleight of Hand",
        "tool-proficiencies": "Two of your choice",
        "equipment": "A set of fine clothes, a disguise kit, tools for your typical con (such as bottles full of colored water, a set of weighted dice, a deck of marked or filed cards, or a seal from an imaginary-or real-noble), and a pouch containing 15gp",
        "feature-name": "Cover Story",
        "feature-desc": "You have create a secondary persona that includes documents, mannerisms, a social presence and acquaintances. This also includes an alternate set of clothing and accessories as well as any elements needed for the disguise such as a wig or false teeth. Additionally, you can duplicate or fake documents-including official documents or personal correspondence-as long as you have seen a similar document and have an appropriate handwriting sample.",
        "suggested-characteristics": "Coming soon!"
    },
    {
        "name": "Scoundrel",
        "desc": "You have lived in the underbelly of society, doing whatever job came your way. You know other criminal elements and gangs, and still have contacts from your old life... if it even is old. You know far more than most people would expect about the nuances of thieving, assassination, and good old ultraviolence than most, and know how far one can go if they move outside the rules of society.",
        "skill-proficiencies": "Deception, Stealth",
        "tool-proficiencies": "Thieves' tools and one gaming set",
        "equipment": "A crowbar, a set of common clothes with a hood, and a belt pouch containing 15gp.",
        "feature-name": "Old Friends and Old Debts",
        "feature-desc": "You have one or more contacts from your time in the underworld. One such contact owes you an unfulfilled debt, and you owe a favor to another such contact. Work with your DM to establish the nature of these debts.\n\n Additionally, you know how to get messages to your contacts, and they can pass on those messages to others including members of related criminal organizations. You know how to send messages to your contacts from long distances through a mix of legitimate and seedy travellers and organizations, which you can use to request favors. But remember that in the cutthroat underbelly of society, every favor comes with a debt.",
        "suggested-characteristics": "Coming soon!"
    }
]