[
    {
        "name": "Barbarian",
        "subtypes": [
        ]
    },
    {
        "name": "Bard",
        "subtypes": [
        ]
    },
    {
        "name": "Cleric",
        "subtypes": [
            {
                "name": "Storm Domain",
                "desc": "Nothing inspires fear in mortals quite like a raging storm. This domain encompasses deities such as Enlil, Indra, Raijin, Taranis, Zeus, and Zojz. Many of these are the rulers of their respective pantheons, wielding the thunderbolt as a symbol of divine might. Most reside in the sky, but the domain also includes lords of the sea (like Donbettyr) and even the occasional chthonic fire deity (such as Pele). They can be benevolent (like Tlaloc), nourishing crops with life-giving rain; they can also be martial deities (such as Perun and Thor), splitting oaks with axes of lightning or battering their foes with thunderous hammers; and some (like Tiamat) are fearsome destroyers, spoken of only in whispers so as to avoid drawing their malevolent attention. Whatever their character, the awesome power of their wrath cannot be denied.\n\n**Storm Domain Spells (table)**\n\n| Cleric Level | Spells                               |\n|--------------|---------------------------------|\n| 1st          | fog cloud, thunderwave          |\n| 3rd          | gust of wind, shatter           |\n| 5th          | call lightning, sleet storm     |\n| 7th          | control water, ice storm        |\n| 9th          | destructive wave, insect plague |\n\n##### Bonus Proficiency\n\nWhen you choose this domain at 1st level, you gain proficiency with heavy armor as well as with martial weapons.\n\n##### Tempest’s Rebuke\n\nAlso starting at 1st level, you can strike back at your adversaries with thunder and lightning. If a creature hits you with an attack, you can use your reaction to target it with this ability. The creature must be within 5 feet of you, and you must be able to see it. The creature must make a Dexterity saving throw, taking 2d8 damage on a failure. On a success, the creature takes only half damage. You may choose to deal either lightning or thunder damage with this ability.\n\nYou may use this feature a number of times equal to your Wisdom modifier (at least once). When you finish a long rest, you regain your expended uses.\n\n##### Channel Divinity: Full Fury\n\nStarting at 2nd level, you can use your Channel Divinity to increase the fury of your storm based attacks. Whenever you would deal lightning or thunder damage from an attack, rather than roll damage, you can use the Channel Divinity feature to deal the maximum possible damage.\n\n##### Storm Blast\n\nBeginning at 6th level, you can choose to push a Large or smaller creature up to 10 feet away from you any time you deal lightning damage to it.\n\n##### Divine Strike\n\nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8.\n\n##### Sky’s Blessing\n\nStarting at 17th level, you gain a flying speed whenever you are outdoors. Your flying speed is equal to your present walking speed."
            }
        ]
    }
]
