[
    {
        "name": "Barbarian",
        "subtypes": [
        ]
    },
    {
        "name": "Bard",
        "subtypes": [
        ]
    },
    {
        "name": "Cleric",
        "subtypes": [
            {
                "name": "Storm Domain",
                "desc": "Nothing inspires fear in mortals quite like a raging storm. This domain encompasses deities such as Enlil, Indra, Raijin, Taranis, Zeus, and Zojz. Many of these are the rulers of their respective pantheons, wielding the thunderbolt as a symbol of divine might. Most reside in the sky, but the domain also includes lords of the sea (like Donbettyr) and even the occasional chthonic fire deity (such as Pele). They can be benevolent (like Tlaloc), nourishing crops with life-giving rain; they can also be martial deities (such as Perun and Thor), splitting oaks with axes of lightning or battering their foes with thunderous hammers; and some (like Tiamat) are fearsome destroyers, spoken of only in whispers so as to avoid drawing their malevolent attention. Whatever their character, the awesome power of their wrath cannot be denied.\n\n**Storm Domain Spells (table)**\n\n| Cleric Level | Spells                               |\n|--------------|---------------------------------|\n| 1st          | fog cloud, thunderwave          |\n| 3rd          | gust of wind, shatter           |\n| 5th          | call lightning, sleet storm     |\n| 7th          | control water, ice storm        |\n| 9th          | destructive wave, insect plague |\n\n##### Bonus Proficiency\n\nWhen you choose this domain at 1st level, you gain proficiency with heavy armor as well as with martial weapons.\n\n##### Tempest’s Rebuke\n\nAlso starting at 1st level, you can strike back at your adversaries with thunder and lightning. If a creature hits you with an attack, you can use your reaction to target it with this ability. The creature must be within 5 feet of you, and you must be able to see it. The creature must make a Dexterity saving throw, taking 2d8 damage on a failure. On a success, the creature takes only half damage. You may choose to deal either lightning or thunder damage with this ability.\n\nYou may use this feature a number of times equal to your Wisdom modifier (at least once). When you finish a long rest, you regain your expended uses.\n\n##### Channel Divinity: Full Fury\n\nStarting at 2nd level, you can use your Channel Divinity to increase the fury of your storm based attacks. Whenever you would deal lightning or thunder damage from an attack, rather than roll damage, you can use the Channel Divinity feature to deal the maximum possible damage.\n\n##### Storm Blast\n\nBeginning at 6th level, you can choose to push a Large or smaller creature up to 10 feet away from you any time you deal lightning damage to it.\n\n##### Divine Strike\n\nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8.\n\n##### Sky’s Blessing\n\nStarting at 17th level, you gain a flying speed whenever you are outdoors. Your flying speed is equal to your present walking speed."
            }
        ]
    },
    {
        "name": "Druid",
        "subtypes": [
        ]
    },
    {
        "name": "Fighter",
        "subtypes": [
        ]
    },
    {
        "name": "Monk",
        "subtypes": [
        ]
    },
    {
        "name": "Paladin",
        "subtypes": [
            {
                "name": "Oathless Betrayer",
                "desc": "Those who fall from the loftiest heights may reach the darkest depths. A paladin who breaks their oath and turns their back on redemption may instead pledge themselves to a dark power or cause. Sometimes known as antipaladins, such betrayers may gain abilities in a mockery of their former goodness, spreading evil where once they fought for the cause of right.\n\nAt 3rd level or higher, a paladin of evil alignment may become an Oathless Betrayer. Unlike other oaths, paladins who take this path can do so in spite of having taken a previous oath, and the features of this subclass replace those of their former Sacred Oath.\n\nNote: this subclass is primarily for NPCs, but a player can choose it at their DM’s discretion.\n\n##### Tenets of the Betrayer\n\nBy their very nature, Oathless Betrayers do not share any common ideals, but may hold to one of the following tenets.\n\n**_Twisted Honor._** You still cling to your former oath, but distorted to serve your new purpose. For instance, you may still demand a fair fight against a worthy adversary, but show only contempt to those you deem weak.\n\n**_Utter Depravity._** You follow some part of your former oath to the opposite extreme. If you were once honest to a fault, you might now tell lies for the simple pleasure of causing others pain.\n\n**_Misguided Revenge._** You blame your fall not on your own failings but on the actions of another, possibly one who remained righteous where you wavered. Your all-consuming hate clouds your reason, and you’ve dedicated yourself to revenge at any cost for imagined wrongs.\n\n##### Oath Spells\n\nYou gain oath spells at the paladin levels listed.\n\n| Level | Paladin Spells                 |\n|-------|--------------------------------|\n| 3rd   | hellish rebuke, inflict wounds |\n| 5th   | crown of madness, darkness     |\n| 9th   | animate dead, bestow curse     |\n| 13th  | blight, confusion              |\n| 17th  | contagion, dominate person     |\n\n##### Channel Divinity\n\nAs an Oathless Betrayer paladin of 3rd level or higher, you gain the following two Channel Divinity options.\n\n**_Command the Undead._** As an action, you may target one undead creature within 30 feet that you can see. If the target creature fails a Wisdom saving throw against your spellcasting DC, it is compelled to obey you for the next 24 hours. The effect ends on the target creature if you use this ability on a different target, and you cannot use this ability on an undead creature if its challenge rating exceeds or is equal to your paladin class level.\n\n**_Frightful Bearing._** As an action, you take on a menacing aspect to terrify your enemies. You target any number of creatures within 30 feet that can see you to make a Wisdom saving throw. Each target that fails its save becomes frightened of you. The creature remains frightened for 1 minute, but it may make a new Wisdom saving throw to end the effect if it is more than 30 feet away from you at the end of its turn.\n\n##### Aura of Loathing\n\nStarting at 7th level, you add your Charisma modifier to damage rolls from melee weapons (with a minimum bonus of +1). Creatures of the fiend or undead type within 10 feet of you also gain this bonus, but the bonus does not stack with the same bonus from another paladin.\n\nAt 18th level, the range of this aura increases to 30 feet.\n\n##### Unearthly Barrier\n\nBeginning at 15th level, you receive resistance to nonmagical bludgeoning, piercing, and slashing damage.\n\n##### Master of Doom\n\nAt 20th level, as an action, you can cloak yourself and any allied creatures of your choice within 30-feet in an aura of darkness. For 1 minute, bright light in this radius becomes dim light, and any creatures that use primarily sight suffer disadvantage on attack rolls against you and the others cloaked by you.\n\nIf an enemy that starts its turn in the aura is frightened of you, it suffers 4d10 psychic damage. You may also use a bonus action to lash out with malicious energy against one creature on your turn during the duration of the aura. If you succeed on a melee spell attack against the target, you deal 3d10 + your Charisma modifier in necrotic damage.\n\nOnce you use this feature, you can't use it again until you finish a long rest."

            }
        ]
    }
]
