[
{
  "model": "api.archetype",
  "pk": "champion",
  "fields": {
    "name": "Champion",
    "desc": "The archetypal Champion focuses on the development of raw physical power honed to deadly perfection. Those who model themselves on this archetype combine rigorous training with physical excellence to deal devastating blows. \n \n##### Improved Critical \n \nBeginning when you choose this archetype at 3rd level, your weapon attacks score a critical hit on a roll of 19 or 20. \n \n##### Remarkable Athlete \n \nStarting at 7th level, you can add half your proficiency bonus (round up) to any Strength, Dexterity, or Constitution check you make that doesn't already use your proficiency bonus. \n \nIn addition, when you make a running long jump, the distance you can cover increases by a number of feet equal to your Strength modifier. \n \n##### Additional Fighting Style \n \nAt 10th level, you can choose a second option from the Fighting Style class feature. \n \n##### Superior Critical \n \nStarting at 15th level, your weapon attacks score a critical hit on a roll of 18-20. \n \n##### Survivor \n \nAt 18th level, you attain the pinnacle of resilience in battle. At the start of each of your turns, you regain hit points equal to 5 + your Constitution modifier if you have no more than half of your hit points left. You don't gain this benefit if you have 0 hit points.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.217",
    "page_no": null,
    "char_class": "fighter",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "circle-of-the-land",
  "fields": {
    "name": "Circle of the Land",
    "desc": "The Circle of the Land is made up of mystics and sages who safeguard ancient knowledge and rites through a vast oral tradition. These druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle's wisest members preside as the chief priests of communities that hold to the Old Faith and serve as advisors to the rulers of those folk. As a member of this circle, your magic is influenced by the land where you were initiated into the circle's mysterious rites. \n \n##### Bonus Cantrip \n \nWhen you choose this circle at 2nd level, you learn one additional druid cantrip of your choice. \n \n##### Natural Recovery \n \nStarting at 2nd level, you can regain some of your magical energy by sitting in meditation and communing with nature. During a short rest, you choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level \n(rounded up), and none of the slots can be 6th level or higher. You can't use this feature again until you finish a long rest. \n \nFor example, when you are a 4th-level druid, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level slot or two 1st-level slots. \n \n##### Circle Spells \n \nYour mystical connection to the land infuses you with the ability to cast certain spells. At 3rd, 5th, 7th, and 9th level you gain access to circle spells connected to the land where you became a druid. Choose that land-arctic, coast, desert, forest, grassland, mountain, or swamp-and consult the associated list of spells. \n \nOnce you gain access to a circle spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you. \n \n**Arctic (table)** \n \n| Druid Level | Circle Spells                     | \n|-------------|-----------------------------------| \n| 3rd         | hold person, spike growth         | \n| 5th         | sleet storm, slow                 | \n| 7th         | freedom of movement, ice storm    | \n| 9th         | commune with nature, cone of cold | \n \n**Coast (table)** \n \n| Druid Level | Circle Spells                      | \n|-------------|------------------------------------| \n| 3rd         | mirror image, misty step           | \n| 5th         | water breathing, water walk        | \n| 7th         | control water, freedom of movement | \n| 9th         | conjure elemental, scrying         | \n \n**Desert (table)** \n \n| Druid Level | Circle Spells                                 | \n|-------------|-----------------------------------------------| \n| 3rd         | blur, silence                                 | \n| 5th         | create food and water, protection from energy | \n| 7th         | blight, hallucinatory terrain                 | \n| 9th         | insect plague, wall of stone                  | \n \n**Forest (table)** \n \n| Druid Level | Circle Spells                    | \n|-------------|----------------------------------| \n| 3rd         | barkskin, spider climb           | \n| 5th         | call lightning, plant growth     | \n| 7th         | divination, freedom of movement  | \n| 9th         | commune with nature, tree stride | \n \n**Grassland (table)** \n \n| Druid Level | Circle Spells                    | \n|-------------|----------------------------------| \n| 3rd         | invisibility, pass without trace | \n| 5th         | daylight, haste                  | \n| 7th         | divination, freedom of movement  | \n| 9th         | dream, insect plague             | \n \n**Mountain (table)** \n \n| Druid Level | Circle Spells                   | \n|-------------|---------------------------------| \n| 3rd         | spider climb, spike growth      | \n| 5th         | lightning bolt, meld into stone | \n| 7th         | stone shape, stoneskin          | \n| 9th         | passwall, wall of stone         | \n \n**Swamp (table)** \n \n| Druid Level | Circle Spells                        | \n|-------------|--------------------------------------| \n| 3rd         | acid arrow, darkness                 | \n| 5th         | water walk, stinking cloud           | \n| 7th         | freedom of movement, locate creature | \n| 9th         | insect plague, scrying               | \n \n##### Land's Stride \n \nStarting at 6th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard. \n \nIn addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the *entangle* spell. \n \n##### Nature's Ward \n \nWhen you reach 10th level, you can't be charmed or frightened by elementals or fey, and you are immune to poison and disease. \n \n##### Nature's Sanctuary \n \nWhen you reach 14th level, creatures of the natural world sense your connection to nature and become hesitant to attack you. When a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours. \n \nThe creature is aware of this effect before it makes its attack against you. \n \n> ### Sacred Plants and Wood \n> \n> A druid holds certain plants to be sacred, particularly alder, ash, birch, elder, hazel, holly, juniper, mistletoe, oak, rowan, willow, and yew. Druids often use such plants as part of a spellcasting focus, incorporating lengths of oak or yew or sprigs of mistletoe. \n> \n> Similarly, a druid uses such woods to make other objects, such as weapons and shields. Yew is associated with death and rebirth, so weapon handles for scimitars or sickles might be fashioned from it. Ash is associated with life and oak with strength. These woods make excellent hafts or whole weapons, such as clubs or quarterstaffs, as well as shields. Alder is associated with air, and it might be used for thrown weapons, such as darts or javelins. \n> \n> Druids from regions that lack the plants described here have chosen other plants to take on similar uses. For instance, a druid of a desert region might value the yucca tree and cactus plants. \n \n> ### Druids and the Gods \n> \n> Some druids venerate the forces of nature themselves, but most druids are devoted to one of the many nature deities worshiped in the multiverse (the lists of gods in appendix B include many such deities). The worship of these deities is often considered a more ancient tradition than the faiths of clerics and urbanized peoples.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.216",
    "page_no": null,
    "char_class": "druid",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "college-of-lore",
  "fields": {
    "name": "College of Lore",
    "desc": "Bards of the College of Lore know something about most things, collecting bits of knowledge from sources as diverse as scholarly tomes and peasant tales. Whether singing folk ballads in taverns or elaborate compositions in royal courts, these bards use their gifts to hold audiences spellbound. When the applause dies down, the audience members might find themselves questioning everything they held to be true, from their faith in the priesthood of the local temple to their loyalty to the king. \n \nThe loyalty of these bards lies in the pursuit of beauty and truth, not in fealty to a monarch or following the tenets of a deity. A noble who keeps such a bard as a herald or advisor knows that the bard would rather be honest than politic. \n \nThe college's members gather in libraries and sometimes in actual colleges, complete with classrooms and dormitories, to share their lore with one another. They also meet at festivals or affairs of state, where they can expose corruption, unravel lies, and poke fun at self-important figures of authority. \n \n##### Bonus Proficiencies \n \nWhen you join the College of Lore at 3rd level, you gain proficiency with three skills of your choice. \n \n##### Cutting Words \n \nAlso at 3rd level, you learn how to use your wit to distract, confuse, and otherwise sap the confidence and competence of others. When a creature that you can see within 60 feet of you makes an attack roll, an ability check, or a damage roll, you can use your reaction to expend one of your uses of Bardic Inspiration, rolling a Bardic Inspiration die and subtracting the number rolled from the creature's roll. You can choose to use this feature after the creature makes its roll, but before the GM determines whether the attack roll or ability check succeeds or fails, or before the creature deals its damage. The creature is immune if it can't hear you or if it's immune to being charmed. \n \n##### Additional Magical Secrets \n \nAt 6th level, you learn two spells of your choice from any class. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you but don't count against the number of bard spells you know. \n \n##### Peerless Skill \n \nStarting at 14th level, when you make an ability check, you can expend one use of Bardic Inspiration. Roll a Bardic Inspiration die and add the number rolled to your ability check. You can choose to do so after you roll the die for the ability check, but before the GM tells you whether you succeed or fail.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.214",
    "page_no": null,
    "char_class": "bard",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "draconic-bloodline",
  "fields": {
    "name": "Draconic Bloodline",
    "desc": "Your innate magic comes from draconic magic that was mingled with your blood or that of your ancestors. Most often, sorcerers with this origin trace their descent back to a mighty sorcerer of ancient times who made a bargain with a dragon or who might even have claimed a dragon parent. Some of these bloodlines are well established in the world, but most are obscure. Any given sorcerer could be the first of a new bloodline, as a result of a pact or some other exceptional circumstance. \n \n##### Dragon Ancestor \n \nAt 1st level, you choose one type of dragon as your ancestor. The damage type associated with each dragon is used by features you gain later. \n \n**Draconic Ancestry (table)** \n \n| Dragon | Damage Type | \n|--------|-------------| \n| Black  | Acid        | \n| Blue   | Lightning   | \n| Brass  | Fire        | \n| Bronze | Lightning   | \n| Copper | Acid        | \n| Gold   | Fire        | \n| Green  | Poison      | \n| Red    | Fire        | \n| Silver | Cold        | \n| White  | Cold        | \n \nYou can speak, read, and write Draconic. Additionally, whenever you make a Charisma check when interacting with dragons, your proficiency bonus is doubled if it applies to the check. \n \n##### Draconic Resilience \n \nAs magic flows through your body, it causes physical traits of your dragon ancestors to emerge. At 1st level, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class. \n \nAdditionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren't wearing armor, your AC equals 13 + your Dexterity modifier. \n \n##### Elemental Affinity \n \nStarting at 6th level, when you cast a spell that deals damage of the type associated with your draconic ancestry, you can add your Charisma modifier to one damage roll of that spell. At the same time, you can spend 1 sorcery point to gain resistance to that damage type for 1 hour. \n \n##### Dragon Wings \n \nAt 14th level, you gain the ability to sprout a pair of dragon wings from your back, gaining a flying speed equal to your current speed. You can create these wings as a bonus action on your turn. They last until you dismiss them as a bonus action on your turn. \n \nYou can't manifest your wings while wearing armor unless the armor is made to accommodate them, and clothing not made to accommodate your wings might be destroyed when you manifest them. \n \n##### Draconic Presence \n \nBeginning at 18th level, you can channel the dread presence of your dragon ancestor, causing those around you to become awestruck or frightened. As an action, you can spend 5 sorcery points to draw on this power and exude an aura of awe or fear (your choice) to a distance of 60 feet. For 1 minute or until you lose your concentration (as if you were casting a concentration spell), each hostile creature that starts its turn in this aura must succeed on a Wisdom saving throw or be charmed (if you chose awe) or frightened (if you chose fear) until the aura ends. A creature that succeeds on this saving throw is immune to your aura for 24 hours.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.221",
    "page_no": null,
    "char_class": "sorcerer",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "hunter",
  "fields": {
    "name": "Hunter",
    "desc": "Emulating the Hunter archetype means accepting your place as a bulwark between civilization and the terrors of the wilderness. As you walk the Hunter's path, you learn specialized techniques for fighting the threats you face, from rampaging ogres and hordes of orcs to towering giants and terrifying dragons. \n \n##### Hunter's Prey \n \nAt 3rd level, you gain one of the following features of your choice. \n \n**_Colossus Slayer._** Your tenacity can wear down the most potent foes. When you hit a creature with a weapon attack, the creature takes an extra 1d8 damage if it's below its hit point maximum. You can deal this extra damage only once per turn. \n \n**_Giant Killer._** When a Large or larger creature within 5 feet of you hits or misses you with an attack, you can use your reaction to attack that creature immediately after its attack, provided that you can see the creature. \n \n**_Horde Breaker._** Once on each of your turns when you make a weapon attack, you can make another attack with the same weapon against a different creature that is within 5 feet of the original target and within range of your weapon. \n \n##### Defensive Tactics \n \nAt 7th level, you gain one of the following features of your choice. \n \n**_Escape the Horde._** Opportunity attacks against you are made with disadvantage. \n \n**_Multiattack Defense._** When a creature hits you with an attack, you gain a +4 bonus to AC against all subsequent attacks made by that creature for the rest of the turn. \n \n**_Steel Will._** You have advantage on saving throws against being frightened. \n \n##### Multiattack \n \nAt 11th level, you gain one of the following features of your choice. \n \n**_Volley._** You can use your action to make a ranged attack against any number of creatures within 10 feet of a point you can see within your weapon's range. You must have ammunition for each target, as normal, and you make a separate attack roll for each target. \n \n**_Whirlwind Attack._** You can use your action to make a melee attack against any number of creatures within 5 feet of you, with a separate attack roll for each target. \n \n##### Superior Hunter's Defense \n \nAt 15th level, you gain one of the following features of your choice. \n \n**_Evasion._** When you are subjected to an effect, such as a red dragon's fiery breath or a *lightning bolt* spell, that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail. \n \n**_Stand Against the Tide._** When a hostile creature misses you with a melee attack, you can use your reaction to force that creature to repeat the same attack against another creature (other than itself) of your choice. \n \n**_Uncanny Dodge._** When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.220",
    "page_no": null,
    "char_class": "ranger",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "life-domain",
  "fields": {
    "name": "Life Domain",
    "desc": "The Life domain focuses on the vibrant positive energy-one of the fundamental forces of the universe-that sustains all life. The gods of life promote vitality and health through healing the sick and wounded, caring for those in need, and driving away the forces of death and undeath. Almost any non-evil deity can claim influence over this domain, particularly agricultural deities (such as Chauntea, Arawai, and Demeter), sun gods (such as Lathander, Pelor, and Re-Horakhty), gods of healing or endurance (such as Ilmater, Mishakal, Apollo, and Diancecht), and gods of home and community (such as Hestia, Hathor, and Boldrei). \n \n**Life Domain Spells (table)** \n \n| Cleric Level | Spells                               | \n|--------------|--------------------------------------| \n| 1st          | bless, cure wounds                   | \n| 3rd          | lesser restoration, spiritual weapon | \n| 5th          | beacon of hope, revivify             | \n| 7th          | death ward, guardian of faith        | \n| 9th          | mass cure wounds, raise dead         | \n \n##### Bonus Proficiency \n \nWhen you choose this domain at 1st level, you gain proficiency with heavy armor. \n \n##### Disciple of Life \n \nAlso starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell's level. \n \n##### Channel Divinity: Preserve Life \n \nStarting at 2nd level, you can use your Channel Divinity to heal the badly injured. \n \nAs an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can't use this feature on an undead or a construct. \n \n##### Blessed Healer \n \nBeginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell's level. \n \n##### Divine Strike \n \nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8. \n \n##### Supreme Healing \n \nStarting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.215",
    "page_no": null,
    "char_class": "cleric",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "oath-of-devotion",
  "fields": {
    "name": "Oath of Devotion",
    "desc": "The Oath of Devotion binds a paladin to the loftiest ideals of justice, virtue, and order. Sometimes called cavaliers, white knights, or holy warriors, these paladins meet the ideal of the knight in shining armor, acting with honor in pursuit of justice and the greater good. They hold themselves to the highest standards of conduct, and some, for better or worse, hold the rest of the world to the same standards. Many who swear this oath are devoted to gods of law and good and use their gods' tenets as the measure of their devotion. They hold angels-the perfect servants of good-as their ideals, and incorporate images of angelic wings into their helmets or coats of arms. \n \n##### Tenets of Devotion \n \nThough the exact words and strictures of the Oath of Devotion vary, paladins of this oath share these tenets. \n \n**_Honesty._** Don't lie or cheat. Let your word be your promise. \n \n**_Courage._** Never fear to act, though caution is wise. \n \n**_Compassion._** Aid others, protect the weak, and punish those who threaten them. Show mercy to your foes, but temper it with wisdom. \n \n**_Honor._** Treat others with fairness, and let your honorable deeds be an example to them. Do as much good as possible while causing the least amount of harm. \n \n**_Duty._** Be responsible for your actions and their consequences, protect those entrusted to your care, and obey those who have just authority over you. \n \n##### Oath Spells \n \nYou gain oath spells at the paladin levels listed. \n \n | Level | Paladin Spells                           | \n|-------|------------------------------------------| \n| 3rd   | protection from evil and good, sanctuary | \n| 5th   | lesser restoration, zone of truth        | \n| 9th   | beacon of hope, dispel magic             | \n| 13th  | freedom of movement, guardian of faith   | \n| 17th  | commune, flame strike                    | \n \n##### Channel Divinity \n \nWhen you take this oath at 3rd level, you gain the following two Channel Divinity options. \n \n**_Sacred Weapon._** As an action, you can imbue one weapon that you are holding with positive energy, using your Channel Divinity. For 1 minute, you add your Charisma modifier to attack rolls made with that weapon (with a minimum bonus of +1). The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that. If the weapon is not already magical, it becomes magical for the duration. \n \nYou can end this effect on your turn as part of any other action. If you are no longer holding or carrying this weapon, or if you fall unconscious, this effect ends. \n \n**_Turn the Unholy._** As an action, you present your holy symbol and speak a prayer censuring fiends and undead, using your Channel Divinity. Each fiend or undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes damage. \n \nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action. \n \n##### Aura of Devotion \n \nStarting at 7th level, you and friendly creatures within 10 feet of you can't be charmed while you are conscious. \n \nAt 18th level, the range of this aura increases to 30 feet. \n \n##### Purity of Spirit \n \nBeginning at 15th level, you are always under the effects of a *protection from evil and good* spell. \n \n##### Holy Nimbus \n \nAt 20th level, as an action, you can emanate an aura of sunlight. For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that. \n \nWhenever an enemy creature starts its turn in the bright light, the creature takes 10 radiant damage. \n \nIn addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead. \n \nOnce you use this feature, you can't use it again until you finish a long rest.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.219",
    "page_no": null,
    "char_class": "paladin",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "path-of-the-berserker",
  "fields": {
    "name": "Path of the Berserker",
    "desc": "For some barbarians, rage is a means to an end- that end being violence. The Path of the Berserker is a path of untrammeled fury, slick with blood. As you enter the berserker's rage, you thrill in the chaos of battle, heedless of your own health or well-being. \n \n##### Frenzy \n \nStarting when you choose this path at 3rd level, you can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion (as described in appendix A). \n \n##### Mindless Rage \n \nBeginning at 6th level, you can't be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage. \n \n##### Intimidating Presence \n \nBeginning at 10th level, you can use your action to frighten someone with your menacing presence. When you do so, choose one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you. \n \nIf the creature succeeds on its saving throw, you can't use this feature on that creature again for 24 hours. \n \n##### Retaliation \n \nStarting at 14th level, when you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.212",
    "page_no": null,
    "char_class": "barbarian",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "school-of-evocation",
  "fields": {
    "name": "School of Evocation",
    "desc": "You focus your study on magic that creates powerful elemental effects such as bitter cold, searing flame, rolling thunder, crackling lightning, and burning acid. Some evokers find employment in military forces, serving as artillery to blast enemy armies from afar. Others use their spectacular power to protect the weak, while some seek their own gain as bandits, adventurers, or aspiring tyrants. \n \n##### Evocation Savant \n \nBeginning when you select this school at 2nd level, the gold and time you must spend to copy an evocation spell into your spellbook is halved. \n \n##### Sculpt Spells \n \nBeginning at 2nd level, you can create pockets of relative safety within the effects of your evocation spells. When you cast an evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 + the spell's level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage if they would normally take half damage on a successful save. \n \n##### Potent Cantrip \n \nStarting at 6th level, your damaging cantrips affect even creatures that avoid the brunt of the effect. When a creature succeeds on a saving throw against your cantrip, the creature takes half the cantrip's damage (if any) but suffers no additional effect from the cantrip. \n \n##### Empowered Evocation \n \nBeginning at 10th level, you can add your Intelligence modifier to one damage roll of any wizard evocation spell you cast. \n \n##### Overchannel \n \nStarting at 14th level, you can increase the power of your simpler spells. When you cast a wizard spell of 1st through 5th level that deals damage, you can deal maximum damage with that spell. \n \nThe first time you do so, you suffer no adverse effect. If you use this feature again before you finish a long rest, you take 2d12 necrotic damage for each level of the spell, immediately after you cast it. Each time you use this feature again before finishing a long rest, the necrotic damage per spell level increases by 1d12. This damage ignores resistance and immunity.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.223",
    "page_no": null,
    "char_class": "wizard",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "the-fiend",
  "fields": {
    "name": "The Fiend",
    "desc": "You have made a pact with a fiend from the lower planes of existence, a being whose aims are evil, even if you strive against those aims. Such beings desire the corruption or destruction of all things, ultimately including you. Fiends powerful enough to forge a pact include demon lords such as Demogorgon, Orcus, Fraz'Urb-luu, and Baphomet; archdevils such as Asmodeus, Dispater, Mephistopheles, and Belial; pit fiends and balors that are especially mighty; and ultroloths and other lords of the yugoloths. \n \n##### Expanded Spell List \n \nThe Fiend lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you. \n \n**Fiend Expanded Spells (table)** \n \n| Spell Level | Spells                            | \n|-------------|-----------------------------------| \n| 1st         | burning hands, command            | \n| 2nd         | blindness/deafness, scorching ray | \n| 3rd         | fireball, stinking cloud          | \n| 4th         | fire shield, wall of fire         | \n| 5th         | flame strike, hallow              | \n \n##### Dark One's Blessing \n \nStarting at 1st level, when you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum of 1). \n \n##### Dark One's Own Luck \n \nStarting at 6th level, you can call on your patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add a d10 to your roll. You can do so after seeing the initial roll but before any of the roll's effects occur. \n \nOnce you use this feature, you can't use it again until you finish a short or long rest. \n \n##### Fiendish Resilience \n \nStarting at 10th level, you can choose one damage type when you finish a short or long rest. You gain resistance to that damage type until you choose a different one with this feature. Damage from magical weapons or silver weapons ignores this resistance. \n \n##### Hurl Through Hell \n \nStarting at 14th level, when you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. The creature disappears and hurtles through a nightmare landscape. \n \nAt the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. If the target is not a fiend, it takes 10d10 psychic damage as it reels from its horrific experience. \n \nOnce you use this feature, you can't use it again until you finish a long rest.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.222",
    "page_no": null,
    "char_class": "warlock",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "thief",
  "fields": {
    "name": "Thief",
    "desc": "You hone your skills in the larcenous arts. Burglars, bandits, cutpurses, and other criminals typically follow this archetype, but so do rogues who prefer to think of themselves as professional treasure seekers, explorers, delvers, and investigators. In addition to improving your agility and stealth, you learn skills useful for delving into ancient ruins, reading unfamiliar languages, and using magic items you normally couldn't employ. \n \n##### Fast Hands \n \nStarting at 3rd level, you can use the bonus action granted by your Cunning Action to make a Dexterity (Sleight of Hand) check, use your thieves' tools to disarm a trap or open a lock, or take the Use an Object action. \n \n##### Second-Story Work \n \nWhen you choose this archetype at 3rd level, you gain the ability to climb faster than normal; climbing no longer costs you extra movement. \n \nIn addition, when you make a running jump, the distance you cover increases by a number of feet equal to your Dexterity modifier. \n \n##### Supreme Sneak \n \nStarting at 9th level, you have advantage on a Dexterity (Stealth) check if you move no more than half your speed on the same turn. \n \n##### Use Magic Device \n \nBy 13th level, you have learned enough about the workings of magic that you can improvise the use of items even when they are not intended for you. You ignore all class, race, and level requirements on the use of magic items. \n \n##### Thief's Reflexes \n \nWhen you reach 17th level, you have become adept at laying ambushes and quickly escaping danger. You can take two turns during the first round of any combat. You take your first turn at your normal initiative and your second turn at your initiative minus 10. You can't use this feature when you are surprised.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.221",
    "page_no": null,
    "char_class": "rogue",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "way-of-the-open-hand",
  "fields": {
    "name": "Way of the Open Hand",
    "desc": "Monks of the Way of the Open Hand are the ultimate masters of martial arts combat, whether armed or unarmed. They learn techniques to push and trip their opponents, manipulate ki to heal damage to their bodies, and practice advanced meditation that can protect them from harm. \n \n##### Open Hand Technique \n \nStarting when you choose this tradition at 3rd level, you can manipulate your enemy's ki when you harness your own. Whenever you hit a creature with one of the attacks granted by your Flurry of Blows, you can impose one of the following effects on that target: \n* It must succeed on a Dexterity saving throw or be knocked prone. \n* It must make a Strength saving throw. If it fails, you can push it up to 15 feet away from you. \n* It can't take reactions until the end of your next turn. \n \n##### Wholeness of Body \n \nAt 6th level, you gain the ability to heal yourself. As an action, you can regain hit points equal to three times your monk level. You must finish a long rest before you can use this feature again. \n \n##### Tranquility \n \nBeginning at 11th level, you can enter a special meditation that surrounds you with an aura of peace. At the end of a long rest, you gain the effect of a *sanctuary* spell that lasts until the start of your next long rest (the spell can end early as normal). The saving throw DC for the spell equals 8 + your Wisdom modifier + your proficiency bonus. \n \n##### Quivering Palm \n \nAt 17th level, you gain the ability to set up lethal vibrations in someone's body. When you hit a creature with an unarmed strike, you can spend 3 ki points to start these imperceptible vibrations, which last for a number of days equal to your monk level. The vibrations are harmless unless you use your action to end them. To do so, you and the target must be on the same plane of existence. When you use this action, the creature must make a Constitution saving throw. If it fails, it is reduced to 0 hit points. If it succeeds, it takes 10d10 necrotic damage. \n \nYou can have only one creature under the effect of this feature at a time. You can choose to end the vibrations harmlessly without using an action.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.218",
    "page_no": null,
    "char_class": "monk",
    "route": "archetypes/"
  }
}
]
