[
{
  "model": "api.magicitem",
  "pk": "adamantine-armor",
  "fields": {
    "name": "Adamantine Armor",
    "desc": "This suit of armor is reinforced with adamantine, one of the hardest substances in existence. While you're wearing it, any critical hit against you becomes a normal hit.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.231",
    "page_no": null,
    "type": "Armor (medium or heavy)",
    "rarity": "uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "amulet-of-health",
  "fields": {
    "name": "Amulet of Health",
    "desc": "Wearing this amulet increases your Constitution score to 19\\. It has no effect if your Constitution is equal to or greater than 19.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.231",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "amulet-of-proof-against-detection-and-location",
  "fields": {
    "name": "Amulet of Proof against Detection and Location",
    "desc": "You are hidden from divination magic while wearing this amulet, including any form of _scrying_  (magical scrying sensors are unable to perceive you).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.231",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "amulet-of-the-planes",
  "fields": {
    "name": "Amulet of the Planes",
    "desc": "While wearing this amulet, you can use an action and name a location that you are familiar with on another plane of existence, making a DC 15 Intelligence check. On a success you cast the _plane shift_  spell, but on a failure you and every creature and object within a 15-foot radius are transported to a random location determined with a d100 roll. On a 1–60 you transport to a random location on the plane you named, or on a 61–100 you are transported to a randomly determined plane of existence.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.232",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "animated-shield",
  "fields": {
    "name": "Animated Shield",
    "desc": "As a bonus action, you can verbally command the shield to animate and float in your space, or for it to stop doing so. The shield continues to act as if you were wielding it, but with your hands free. The shield remains animated for 1 minute, or until you are _incapacitated_  or die. It then returns to your free hand, if you have one, or else it falls to the ground. You can benefit from only one shield at a time.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.232",
    "page_no": null,
    "type": "Armor",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "apparatus-of-the-crab",
  "fields": {
    "name": "Apparatus of the Crab",
    "desc": "This ingeniously crafted item (known by some as the crabaratus) is a tightly shut 500 pound iron barrel. Making a DC 20 Investigation check reveals a hidden catch which unlocks one end of the barrel—a hatch. Two Medium or smaller creatures can crawl inside where there are 10 levers in a row at the far end. Each lever is in a neutral position but can move up or down. Use of these levers makes the barrel reconfigure to resemble a giant metal crab.\n\nThis item is a Large object with the following statistics:\n\n**Armor Class:** 20\n\n**Hit Points:** 200\n\n**Speed:** 30 ft., swim 30 ft. (both are 0 ft. without legs and tail extended)\n\n**Damage Immunities:** poison, psychic\n\nThe item requires a pilot to be used as a vehicle. The hatch must be closed for it to be airtight and watertight. The apparatus holds 10 hours worth of air for breathing, dividing by the number of breathing creatures inside.\n\nThe apparatus floats on water and may dive underwater down to 900 feet, taking 2d6 bludgeoning damage at the end of each minute spent at a lower depth.\n\nAny creature inside the apparatus can use an action to position up to two of the levers either up or down, with the lever returning to its neutral position upon use. From left to right, the Apparatus of the Crab table shows how each lever functions.\n\n  \n**Table: Apparatus of the Crab**\n\n| **Lever** | **Up**                                                                                                                            | **Down**                                                                                                                    |\n| --------- | --------------------------------------------------------------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------------- |\n| 1         | Extends legs and tail.                                                                                                            | Retracts legs and tail. Speed is 0 ft. and it cannot benefit from bonuses to Speed.                                         |\n| 2         | Shutter on forward window opens.                                                                                                  | Shutter on forward window closes.                                                                                           |\n| 3         | Shutters (two each side) on side windows open.                                                                                    | Shutters on side windows close.                                                                                             |\n| 4         | Two claws extend, one on each front side.                                                                                         | The claws retract.                                                                                                          |\n| 5         | Each extended claw makes a melee attack: +8 to hit, reach 5 ft., one target. Hit: 7 (2d6) bludgeoning damage.                     | Each extended claw makes a melee attack: +8 to hit, reach 5 ft., one target. Hit: The target is _grappled_  (escape DC 15). |\n| 6         | The apparatus moves forward.                                                                                                      | The apparatus moves backward.                                                                                               |\n| 7         | The apparatus turns 90 degrees left.                                                                                              | The apparatus turns 90 degrees right.                                                                                       |\n| 8         | Bright light shines from fixtures resembling eyes, shedding bright light in a 30-foot radius and dim light an additional 30 feet. | The light extinguishes.                                                                                                     |\n| 9         | If in liquid, the apparatus sinks 20 feet.                                                                                        | If in liquid, the apparatus rises 20 feet.                                                                                  |\n| 10        | The hatch opens.                                                                                                                  | The hatch closes.                                                                                                           |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.232",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "armor-of-invulnerability",
  "fields": {
    "name": "Armor of Invulnerability",
    "desc": "This armor grants you resistance to nonmagical damage. Once between _long rests_ , you can use an action to become immune to nonmagical damage for 10 minutes or until you are no longer wearing the armor.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.233",
    "page_no": null,
    "type": "Armor",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "armor-of-resistance",
  "fields": {
    "name": "Armor of Resistance",
    "desc": "This armor grants you resistance to one type of damage. The type of damage is determined when the armor is created, from the following list: acid, cold, fire, force, lightning, necrotic, poison, psychic, radiant, thunder.\n\nA suit of light or medium _armor of resistance_ is rare, and a heavy suit is very rare.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.233",
    "page_no": null,
    "type": "Armor",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "armor-of-vulnerability",
  "fields": {
    "name": "Armor of Vulnerability",
    "desc": "This armor grants you resistance to one of the following damage types: bludgeoning, piercing, or slashing. The type of damage is determined when the armor is created.\n\n**Cursed.** Once attuned to this armor, you are _cursed_  until you are targeted by __remove curse_ or similar magic; removing the armor does not end it. While cursed, you have vulnerability to the other two damage types this armor does not protect against.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.233",
    "page_no": null,
    "type": "Armor",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "arrow-catching-shield",
  "fields": {
    "name": "Arrow-Catching Shield",
    "desc": "This shield grants you +2 to AC against ranged attacks, in addition to the shield’s normal bonus to AC. In addition, whenever a target within 5 feet of you is targeted by a ranged attack, you can use your reaction to become the target of the attack instead.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.234",
    "page_no": null,
    "type": "Armor",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "arrow-of-slaying",
  "fields": {
    "name": "Arrow of Slaying",
    "desc": "A particular kind of creature is chosen when this magic arrow is created. When the _arrow of slaying_ damages a creature belonging to the chosen type, heritage, or group, the creature makes a DC 17 Constitution _saving throw_ , taking an extra 6d10 piercing damage on a failed save, or half as much extra damage on a successful one. Once the _arrow of slaying_ deals its extra damage to a creature, it loses its magical properties. \n\nOther types of magic ammunition of this kind exist, such as bolts meant for a crossbow, or bullets for a firearm or sling.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.234",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "bag-of-beans",
  "fields": {
    "name": "Bag of Beans",
    "desc": "This cloth bag contains 3d4 dry beans and weighs ½ pound plus ¼ pound for each bean inside.\n\nDumping the bag’s contents on the ground creates a fiery 10-foot radius explosion. The fire ignites unattended flammable objects. Each creature in the area makes a DC 15 Dexterity _saving throw_ , taking 5d4 fire damage on a failure, or half damage on a success. \n\nYou may also take a bean from the bag and plant it in dirt or sand and water it, producing an effect 1 minute later centered on where it was planted.\n\nTo determine the effect the Narrator may create something entirely new, choose one from the following table, or roll.\n\nTable: Bag of Beans\n\n| 1     | 5d4 toadstools with strange markings appear. When a creature eats a toadstool (raw or cooked), roll any die. An even result grants 5d6 temporary hit points for 1 hour, and an odd result requires the creature to make a DC 15 Constitution _saving throw_  or take 5d6 poison damage and become _poisoned_  for 1 hour.                                                                                                                                                                                                                                                                                                                                                                                                                                        |\n| ----- | ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| 2–10  | 1d4+1 geysers erupt. Each one spews a different liquid (chosen by the Narrator) 30 feet into the air for 1d6 rounds: beer, berry juice, cooking oil, tea, vinegar, water, or wine.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |\n| 11–20 | A fully developed _treant_  appears. There is a 50% chance it is chaotic evil, in which case it immediately attacks the nearest creature.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        |\n| 21–30 | A stone statue in your likeness with an angry countenance rises. The statue is immobile except for its mouth, which can move and speak. It constantly rails threats and insults against you. If you leave the statue, it knows where you are (if you are on the same plane of existence) and tells anyone who comes near that you are the worst of villains, urging them to kill you. The statue attempts to cast _geas_ (save DC 10) on any nearby creature that can speak a language you do (and isn’t your friend or companion) with the command to find and kill you. After 24 hours, the statue loses the ability to speak and cast geas, becoming completely inanimate.                                                                                    |\n| 31–40 | A campfire with green flames appears for 24 hours or until it is extinguished. The area in a 10-foot radius is a haven.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |\n| 41–50 | 1d6+6 fully developed _shriekers_  appear.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       |\n| 51–60 | 1d4+8 small pods sprout, which then unfurl to allow a luminescent pink toad to crawl out of each one. A toad transforms into a Large or smaller beast (determined by the Narrator) whenever touched. The beast remains for 1 minute, then disappears in a puff of luminescent pink smoke.                                                                                                                                                                                                                                                                                                                                                                                                                                                                        |\n| 61–70 | A fully developed _shambling mound_  appears. It is not hostile but appears perplexed as it is _stunned_  for 1d4 rounds. Once the stun effect ends, it is _frightened_  for 1d10+1 rounds. The source of its fear is one randomly determined creature it can see.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |\n| 71–80 | A tree with tantalizing fruit appears, but then turns into glass that refracts light in a dazzlingly beautiful manner. The glass tree evaporates over the next 24 hours.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |\n| 81–90 | A nest appears containing 1d4+3 vibrantly multicolored eggs with equally multicolored yolks. Any creature that eats an egg (raw or cooked) makes a DC 20 Constitution _saving throw_ . On a success, the creature's lowest ability score permanently increases by 1 (randomly choosing among equally low scores). On a failure, the creature takes 10d6 force damage from an internal magical explosion.                                                                                                                                                                                                                                                                                                                                                         |\n| 91–99 | A 5-foot hole with swirling multicolored vapors inside appears. All creatures within 10 feet of the hole that have an Intelligence of 6 or higher hear urgent, loving whispers from within in a language they understand. Each creature makes a DC 15 Wisdom _saving throw_  or try to leap into the hole. The first creature to jump into the hole (or more than one, if multiple creatures jump in simultaneously) disappears for 1 day before reappearing. A creature has no memory of the previous 24 hours when it reappears, but finds a new randomly determined magic item of uncommon rarity among its possessions. It also gains the benefits of a _long rest_ . The hole disappears after 1 minute, or as soon as a creature jumps completely into it. |\n| 100   | A fantastic, gargantuan beanstalk erupts and grows to a height determined by the Narrator. The Narrator also chooses where the top leads. These options (and more) are possible: the castle of a giant, a magnificent view, a different plane of existence.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.234",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "bag-of-devouring",
  "fields": {
    "name": "Bag of Devouring",
    "desc": "This item is actually an aperture for the mouth of an immense extradimensional creature and is often mistaken for a _bag of holding_ . \n\nThe creature can perceive everything placed inside the bag. Up to a cubic foot of inanimate objects can be stored inside, however once per day the creature swallows any inanimate objects inside and spews them into another plane of existence (with the Narrator deciding the plane and time of day). Animal or vegetable matter placed completely inside is instead ingested and destroyed. \n\nThis item can be very dangerous. When part of a creature is inside the bag (including a creature reaching a hand inside) there is a 50% chance the bag pulls it inside. A creature that ends its turn inside the bag is ingested and destroyed. \n\nA creature inside the bag can try to escape by using an action and making a DC 15 Strength check. Creatures outside the bag may use an action to attempt to reach in and pull a creature out with a DC 20 Strength check. This rescue attempt is subject to the same 50% chance to be pulled inside.\n\nPiercing or tearing the item destroys it, with anything currently inside shifted to a random location on the Astral Plane. Turning the bag inside out closes the mouth.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.235",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "bag-of-holding",
  "fields": {
    "name": "Bag of Holding",
    "desc": "This bag’s interior space is significantly larger than its apparent size of roughly 2 feet at the mouth and 4 feet deep. The bag can hold up to 500 pounds and has an internal volume of 64 cubic feet. Regardless of its contents, it weighs 15 pounds. Retrieving an item from the bag requires an action. If you have never interacted with a specific bag of holding before, the first time you use it, it requires 1d4 rounds to take stock of its contents before anything can be retrieved from the bag.\n\nFood or water placed in the bag immediately and permanently lose all nourishing qualities—after being in the bag, water no longer slakes thirst and food does not sate hunger or nourish. In a similar fashion, the body of a dead creature placed in the bag cannot be restored to life by __revivify , raise dead ,_ or other similar magic. Breathing creatures inside the bag can survive for up to 2d4 minutes divided by the number of creatures (minimum 1 minute), after which time they begin to suffocate.\n\nThe bag cannot hold any item that would not fit in a normal bag of its apparent size or any item with the Bulky quality. \n\nIf the bag is punctured, torn, or otherwise structurally damaged, it ruptures and is destroyed, and the contents are scattered throughout the Astral Plane.\n\nPlacing a _bag of holding_ inside another extradimensional storage device such as a _portable hole_  or __handy haversack_ results in planar rift that destroys both items and pulls everything within 10 feet into the Astral Plane. The rift then closes and disappears.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.235",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "bag-of-tricks",
  "fields": {
    "name": "Bag of Tricks",
    "desc": "This seemingly empty cloth bag comes in several colors and has a small, fuzzy object inside. \n\nYou can use an action to pull a fuzzy object from the bag and throw it up to 20 feet. Upon landing, it becomes a creature determined by a roll on the Bag of Tricks table (depending on the bag’s color). \n\nThe resulting creature is friendly to you and any companions you have. It acts on your turn, during which you can use a bonus action to give it simple commands such as “attack that creature” or “move over there”. If the creature dies or if you use the bag again, it disappears without a trace. After the first use each day, there is a 50% chance that a creature from the bag is hostile instead of friendly and obedient.\n\nOnce you have used the bag three times, you cannot do so again until the next dawn.\n\n__**Table: Bags of Tricks**__\n| Blue bag of tricks (uncommon; cost 400 gp) |                     | Gray bag of tricks (uncommon; cost 350 gp) |                | Green bag of tricks (rare; cost 800 gp) |                   | Rust bag of tricks (uncommon; cost 400 gp**)** |              | Tan bag of tricks (uncommon; cost 300 gp) |                |\n| ------------------------------------------ | ------------------- | ------------------------------------------ | -------------- | --------------------------------------- | ----------------- | ---------------------------------------------- | ------------ | ----------------------------------------- | -------------- |\n| **d8**                                     | **Creatu**re        | d8                                         | **Creature**   | **d8**                                  | **Creature**      | **d8**                                         | **Creature** | **d8**                                    | **Creature**   |\n| 1                                          | _Quipper_           | 1                                          | _Weasel_       | 1                                       | _Giant Crocodile_ | 1                                              | _Rat_        | 1                                         | _Jackal_       |\n| 2                                          | _Octopus_           | 2                                          | _Giant rat_    | 2                                       | _Allosaurus_      | 2                                              | _Owl_        | 2                                         | _Ape_          |\n| 3                                          | _Seahorse_          | 3                                          | _Badger_       | 3                                       | _Ankylosaurus_    | 3                                              | _Mastiff_    | 3                                         | _Baboon_       |\n| 4                                          | _Hunter Shark_      | 4                                          | _Boar_         | 4                                       | _Raptor_          | 4                                              | _Goat_       | 4                                         | _Axe Beak_     |\n| 5                                          | _Swarm of quippers_ | 5                                          | _Panther_      | 5                                       | _Giant lizard_    | 5                                              | _Giant Goat_ | 5                                         | _Black Bear_   |\n| 6                                          | _Reef shark_        | 6                                          | _Giant Badger_ | 6                                       | _Triceratops_     | 6                                              | _Giant Boar_ | 6                                         | _Giant Weasel_ |\n| 7                                          | _Giant Seahorse_    | 7                                          | _Dire Wolf_    | 7                                       | _Plesiosaurus_    | 7                                              | _Lion_       | 7                                         | _Giant Hyena_  |\n| 8                                          | _Giant Octopus_     | 8                                          | _Giant Elk_    | 8                                       | _Pteranodon_      | 8                                              | _Brown Bear_ | 8                                         | _Tiger_        |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.235",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "bead-of-force",
  "fields": {
    "name": "Bead of Force",
    "desc": "This sphere of black glass is ¾ an inch in diameter and can be thrown up to 60 feet as an action. On impact it creates a 10-foot radius explosion. Creatures in the area make a DC 15 Dexterity _saving throw_ , taking 5d4 force damage on a failure. A sphere of force then encloses the same area for 1 minute. Any creature that is completely in the area and fails its save is trapped within the sphere. Creatures that succeed on the save or that are only partially within the area are pushed away from the point of impact until they are outside the sphere instead. \n\nThe wall of the sphere only allows air to pass, stopping all other attacks and effects. A creature inside the sphere can use its action to push against the sides of the sphere, moving up to half its Speed. The sphere only weighs 1 pound if lifted, regardless of the weight of the creatures inside.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.236",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "belt-of-dwarvenkind",
  "fields": {
    "name": "Belt of Dwarvenkind",
    "desc": "While wearing this belt, you gain the following benefits:\n\n* Your Constitution score increases by 2, to a maximum of 20.\n* _Advantage_  on Charisma (Persuasion) checks made against dwarves.\n* _Advantage_  on saving throws against poison, and resistance to poison damage.\n* Darkvision to a range of 60 feet.\n* The ability to speak, read, sign, and write Dwarvish.\n\nIn addition, while you are attuned to this belt there is a 50% chance at dawn each day that you grow a full beard (or a noticeably thicker beard if you have one already).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.236",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "belt-of-giant-strength",
  "fields": {
    "name": "Belt of Giant Strength",
    "desc": "Braided rope made of hair from the same kind of giant as the belt to be made\n\nWearing this belt increases your Strength score to the score granted by the belt. It has no effect if your Strength is equal to or greater than the belt’s score.\n\nEach variety of belt corresponds with a different kind of giant.\n\n__**Table: Belts of Giant Strength**__\n| **Type**                  | **Strength** | **Rarity** | **Cost**   |\n| ------------------------- | ------------ | ---------- | ---------- |\n| _Hill giant_              | 20           | Rare       | 4,000 gp   |\n| _Frost_  or _stone giant_ | 23           | Very rare  | 9,000 gp   |\n| _Fire giant_              | 25           | Very rare  | 20,000 gp  |\n| _Cloud giant_             | 27           | Legendary  | 55,000 gp  |\n| _Storm giant_             | 29           | Legendary  | 150,000 gp |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.236",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "berserker-axe",
  "fields": {
    "name": "Berserker Axe",
    "desc": "You gain +1 bonus to attack and damage rolls made with this magic axe, and while you are attuned to it your hit point maximum is increased by 1 for each level you have attained. \n\n**Curse.** After you attune to this axe you are unwilling to part with it, keeping it within reach at all times. In addition, you have _disadvantage_  on attack rolls with weapons other than this one unless the nearest foe you are aware of is 60 feet or more away from you.\n\nIn addition, when you are damaged by a hostile creature you make a DC 15 Wisdom _saving throw_  or go berserk. While berserk, on your turn each round you move to the nearest creature and take the Attack action against it, moving to attack the next nearest creature after you _incapacitate_  your current target. When there is more than one possible target, you randomly determine which to attack. You continue to be berserk until there are no creatures you can see or hear within 60 feet of you at the start of your turn. ",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.237",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "boots-of-elvenkind",
  "fields": {
    "name": "Boots of Elvenkind",
    "desc": "These boots cause your steps to make no sound, no matter the material stepped upon. While wearing these boots, you gain _advantage_  on Dexterity (Stealth) checks to move silently.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.237",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "boots-of-levitation",
  "fields": {
    "name": "Boots of Levitation",
    "desc": "While wearing these boots, up to 3 times between _long rests_  you can use an action to cast __levitate_  on yourself.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.237",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "boots-of-speed",
  "fields": {
    "name": "Boots of Speed",
    "desc": "While wearing these boots, you can use a bonus action to click the heels together. You double your base Speed, and opportunity attacks made against you have _disadvantage_ . You can end the effect as a bonus action.\n\nOnce the boots have been used in this way for a total of 10 minutes (each use expends a minimum of 1 minute), they cease to function until you finish a _long rest_ .",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.238",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "boots-of-striding-and-springing",
  "fields": {
    "name": "Boots of Striding and Springing",
    "desc": "While wearing these boots, your Speed increases to 30 feet, unless it is higher, regardless of encumbrance or armor. In addition, your jump distances increase 15 feet vertically and 30 feet horizontally (as the _jump_  spell).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.238",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "boots-of-the-winterlands",
  "fields": {
    "name": "Boots of the Winterlands",
    "desc": "While wearing these boots, you gain the following benefits:\n\n* Resistance to cold damage.\n* You ignore _difficult terrain_  caused by ice or snow.\n* You can survive temperatures as low as –50° Fahrenheit (–46° Celsius) without effect, or as low as –100° Fahrenheit (–74° Celsius) with heavy clothes.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.238",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "bowl-of-commanding-water-elementals",
  "fields": {
    "name": "Bowl of Commanding Water Elementals",
    "desc": "This heavy glass bowl weighs 3 pounds and can hold 3 gallons of water. While it is filled, you can use an action to summon a _water elemental_  as if you had cast the _conjure elemental_  spell. Once used, you must wait until the next dawn to use it again.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.239",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "bracers-of-archery",
  "fields": {
    "name": "Bracers of Archery",
    "desc": "While wearing these bracers, you gain proficiency with the longbow and shortbow, and you gain a +2 bonus on damage rolls on ranged attacks made with them.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.239",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "bracers-of-defense",
  "fields": {
    "name": "Bracers of Defense",
    "desc": "While wearing these bracers, you gain a +2 bonus to AC if you are not wearing armor or using a shield.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.239",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "brazier-of-commanding-fire-elementals",
  "fields": {
    "name": "Brazier of Commanding Fire Elementals",
    "desc": "While fire burns in this 5 pound brass brazier, you can use an action to summon a _fire elemental_  as if you had cast the __conjure elemental_  spell. Once used, you must wait until the next dawn to use it again.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.240",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "brooch-of-shielding",
  "fields": {
    "name": "Brooch of Shielding",
    "desc": "While wearing this brooch, you gain resistance to force damage and immunity to the _magic missile_  spell.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.240",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "broom-of-flying",
  "fields": {
    "name": "Broom of Flying",
    "desc": "You can sit astride this ordinary-seeming 3 pound broom and speak its command word, causing it to hover. While it is hovering you can ride the broom to fly through the air. The broom can carry up to 200 pounds at a speed of 40 feet, or up to 400 pounds at a speed of 20 feet. It stops hovering if you land.\n\nYou can send the broom up to 1 mile from you by speaking its command word and naming a location you are familiar with. It can also be called back from up to a mile away with a different command word.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.240",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "candle-of-invocation",
  "fields": {
    "name": "Candle of Invocation",
    "desc": "This golden candle is infused with raw divine magic. When attuned to by a cleric or druid, it takes on a color appropriate to the cleric’s deity. \n\nYou can use an action to light the candle and activate its magic. The candle can burn for a total of 4 hours in 1 minute increments before being used up. \n\nWhile lit, the candle sheds dim light in a 30-foot radius. Any creature within the area who worships the same deity as the attuned creature (or at the Narrator’s discretion, an allied deity) has _advantage_  on _attack rolls_ , _saving throws_ , and ability checks. If one of the creatures gaining the prior benefit is also a cleric, druid, or herald, they can cast 1st-level spells from one of those classes at that spell level without expending spell slots.\n\nAlternatively, one of these candles that has not yet been lit can be used to cast the __gate_ spell. Doing so consumes the candle.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.241",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "cape-of-the-mountebank",
  "fields": {
    "name": "Cape of the Mountebank",
    "desc": "While wearing this cape, you can use an action to cast _dimension door_  once between _long rests_ . You disappear and reappear in a cloud of smoke which dissipates at the end of your next turn, or sooner if conditions are windy.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.241",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "carpet-of-flying",
  "fields": {
    "name": "Carpet of Flying",
    "desc": "You can use an action to speak this carpet’s command word, making it hover and fly. It moves according to your verbal commands as long as you are within 30 feet of it. \n\nThese carpets come in four sizes. The Narrator can choose or randomly determine which size a given carpet is.\n\nIf the carpet is carrying half its capacity or less, its Speed is doubled.\n\n__**Table: Carpet of Flying**__\n| **d20** | **Size**      | **Capacity** | **Flying Speed** | **Cost**  |\n| ------- | ------------- | ------------ | ---------------- | --------- |\n| 1-4     | 3 ft. x 5 ft. | 250 lb.      | 30 ft.           | 15,000 gp |\n| 5-11    | 4 ft. x 6 ft. | 500 lb.      | 25 ft.           | 20,000 gp |\n| 12-16   | 5 ft. x 7 ft. | 800 lb.      | 20 ft.           | 25,000 gp |\n| 17-20   | 6 ft. x 9 ft. | 1,000 lb.    | 15 ft.           | 30,000 gp |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.241",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "censer-of-controlling-air-elementals",
  "fields": {
    "name": "Censer of Controlling Air Elementals",
    "desc": "While incense burns in this 1 pound censer, you can use an action to summon an _air elemental_  as if you had cast the __conjure elemental_ spell. Once used, you must wait until the next dawn to use it again.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.242",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "chime-of-opening",
  "fields": {
    "name": "Chime of Opening",
    "desc": "You can use an action to strike this foot-long metal tube while pointing it at an object that can be opened (such as a lid, lock, or window) within 120 feet. The chime sounds and one lock or latch on the object opens as long as the sound can reach the object. If no closures remain, the object itself opens. After being struck 10 times, the chime cracks and becomes useless.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.242",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "circlet-of-blasting",
  "fields": {
    "name": "Circlet of Blasting",
    "desc": "Once per dawn, while wearing this circlet you can use an action to cast _scorching ray_ . The attack bonus for the spell when cast this way is +5.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.242",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "cloak-of-arachnida",
  "fields": {
    "name": "Cloak of Arachnida",
    "desc": "While wearing this cloak, you gain the following benefits:\n\n* Resistance to poison damage.\n* A climbing speed equal to your base Speed, allowing hands-free movement across vertical and upside down surfaces.\n* The ability to ignore the effects of webs and move through them as if they were _difficult terrain_ .\n\nOnce between long rests you can use an action to cast the __web_  spell (save DC 13), except it fills double the normal area.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.243",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "cloak-of-displacement",
  "fields": {
    "name": "Cloak of Displacement",
    "desc": "This cloak creates a visual illusion that distorts your position. _Attack rolls_  against you have _disadvantage_  unless the attacker does not rely on sight. When you take damage, this property stops until the start of your next turn, and it is otherwise negated if you are _incapacitated_ , _restrained_ , or unable to move.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.243",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "cloak-of-elvenkind",
  "fields": {
    "name": "Cloak of Elvenkind",
    "desc": "While you wear this cloak with its hood up, its color changes to camouflage you. While camouflaged, you gain _advantage_  on Dexterity (Stealth) checks made to hide and creatures have _disadvantage_  on Wisdom (Perception) checks made to see you. You can use an action to put the hood up or down.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.243",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "cloak-of-protection",
  "fields": {
    "name": "Cloak of Protection",
    "desc": "While wearing this cloak, you gain a +1 bonus to Armor Class and _saving throws_ .",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.244",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "cloak-of-the-bat",
  "fields": {
    "name": "Cloak of the Bat",
    "desc": "While wearing this cloak, you gain _advantage_  on Dexterity (Stealth) checks. In addition, while in an area of _dim light or darkness_ , you gain the following benefits:\n\n* A fly speed of 40 feet while gripping the edges of the cloak with both hands.\n* Once between _long rests_  you can use an action to cast _polymorph_  on yourself, transforming into a bat. Unlike normal, you retain your Intelligence, Wisdom, and Charisma scores.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.244",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "cloak-of-the-manta-ray",
  "fields": {
    "name": "Cloak of the Manta Ray",
    "desc": "While you wear this cloak with its hood up, you gain a swim speed of 60 feet and can breathe water. You can use an action to put the hood up or down.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.244",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "crystal-ball",
  "fields": {
    "name": "Crystal Ball",
    "desc": "A typical enchanted _crystal ball_ can be used to cast the __scrying_ spell (save DC 17) once between _short rests_  while touching it. \n\nThree legendary variations exist. In all cases, the legendary variants have an alignment (Chaotic, Evil, Good, or Lawful). If you do not have an alignment trait that matches the _crystal ball’s_, after using it you take 6d6 psychic damage and gain a level of _strife_ .\n\n**Crystal Ball of Mind Reading**. You can use an action to cast __detect thoughts_  (save DC 17) on a creature within 30 feet of the spell’s sensor. This effect does not require concentration, but it ends when the _scrying_ does.\n\n**Crystal Ball of Telepathy**. While the __scrying_ is active, you can communicate telepathically with creatures within 30 feet of the spell’s sensor, and you can use an action to cast sugges_tion_ (save DC 17) through the sensor on one of them. This effect does not require concentration, but it ends when the _scrying_ does.\n\n**Crystal Ball of True Seeing**. In addition to the normal benefits of __scrying_ , you gain _truesight_ through the spell’s sensor out to a range of 120 feet.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.245",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "cube-of-force",
  "fields": {
    "name": "Cube of Force",
    "desc": "This inch-long cube has a recessed button with a distinct marking on each face. It starts with 36 charges and regains 1d20 of them at dawn. \n\nYou can use an action to press one of the buttons, expending charges as shown on the Cube of Force table. If the cube has insufficient charges, nothing happens.\n\nOtherwise, the cube creates a 15-foot cube of force that is centered on you and moves with you. It lasts for 1 minute, until you use an action to press another button, or the cube’s charges are depleted. \n\nYou can change the cube’s effect by pressing a different button. Doing so expends the requisite number of charges and resets the duration.\n\nIf moving causes the cube to come into contact with a solid object that can't pass through the cube, you cannot move any closer to that object while the cube is active.\n\nThe cube loses charges when targeted by effects from the following spells or magic items: _disintegrate_ (1d12 charges), __horn of blasting_ (1d10 charges), __passwall_  (1d6 charges), __prismatic spray_  (1d20 charges), __wall of fire_  (1d4 charges).\n\n__**Table: Cube of Force**__\n| **Face** | **Charges** | **Effect**                                                                                              |\n| -------- | ----------- | ------------------------------------------------------------------------------------------------------- |\n| 1        | 1           | Gasses, wind, and fog can’t penetrate the cube.                                                         |\n| 2        | 2           | Nonliving matter can’t penetrate the cube, except for walls, floors, and ceilings (at your discretion). |\n| 3        | 3           | Living matter can’t penetrate the cube.                                                                 |\n| 4        | 4           | Spell effects can’t penetrate the cube.                                                                 |\n| 5        | 5           | Nothing penetrates the cube (exception for walls, floors, and ceilings at your discretion).             |\n| 6        | 0           | Deactivate the cube.                                                                                    |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.245",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "cubic-gate",
  "fields": {
    "name": "Cubic Gate",
    "desc": "This 3-inch cube has 3 charges and regains 1d3 charges each dawn. Each side of the cube is keyed to a different plane, one of which is the Material Plane. The other five sides are determined by the Narrator.\n\nAs an action, you may press one side of the cube and spend a charge to cast the _gate  s_pell, expending a charge and opening a portal to the associated plane. You may instead press a side twice, expending 2 charges and casting _plane shift_ (save DC 17) which sends the targets to the associated plane.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.245",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "dagger-of-venom",
  "fields": {
    "name": "Dagger of Venom",
    "desc": "You gain a +1 bonus to attack and damage rolls made with this magic blade. In addition, once each dawn you can use an action to poison the dagger’s blade for 1 minute or until it is used to damage a creature. When a creature is damaged by the blade’s poison, it makes a DC 15 Constitution _saving throw_  or takes 2d10 poison damage and becomes _poisoned_  for 1 minute.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.246",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "dancing-sword",
  "fields": {
    "name": "Dancing Sword",
    "desc": "While you are attuned to this magic sword, you can use a bonus action to speak the command word and throw it into the air. The sword hovers, flies up to 30 feet, and attacks one creature of your choice within 5 feet of it (using your _attack roll_  and ability score modifier to damage rolls). On each of your turns you can use a bonus action to make the sword fly up to 30 feet to attack another creature within 5 feet of it. \n\nAfter the sword attacks for the fourth time, it tries to return to your hand. It flies 30 feet towards you, moving as close as it can before either being caught in your free hand or falling to the ground.\n\nThe sword ceases to hover if you move more than 30 feet away from it or grasp it.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.246",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "decanter-of-endless-water",
  "fields": {
    "name": "Decanter of Endless Water",
    "desc": "This flask sloshes when shaken as if full of water. You can use an action to remove the stopper and speak a command word, causing undrinkable water to flow out of the flask. It stops at the start of your next turn. \n\n**Stream**. This command word produces 1 gallon of water.\n\n**Fountain.** This command word produces 5 gallons of water.\n\n**Geyser.** This command word produces 30 gallons of water that manifests as a geyser 30 feet long and 1 foot wide. As a bonus action, you can aim the geyser at a target within 30 feet, forcing it to make a DC 13 Strength _saving throw_  or take 1d4 bludgeoning damage and be knocked _prone_ . Any object less than 200 pounds is knocked over or pushed up to 15 feet away.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.246",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "deck-of-illusions",
  "fields": {
    "name": "Deck of Illusions",
    "desc": "This box houses a set of 34 illustrated cards when new. A found deck is typically missing 1d20 cards. \n\nAs an action, you can draw a random card (one manually selected does nothing) and throw it up to 30 feet from you. \n\nUpon landing, the card creates an illusion of one or more creatures. These illusions are of normal size for the creatures depicted and act normally, but are insubstantial and harmless. While you are within 120 feet of the illusion, you can use an action to move it anywhere within 30 feet from its card. \n\nThe illusions are revealed to a creature when it uses an action to make a DC 15 Investigation check or automatically upon any physical interaction. Once revealed, an illusion becomes translucent.\n\nThe illusion lasts until its card is moved or it is dispelled. In either case the card disappears and cannot be reused.\n\n__**Table: Deck of Illusions**__\n| **Playing Card**    | **Illusion**                 |\n| ------------------- | ---------------------------- |\n| ♣ Ace of Clubs      | Iron golem                   |\n| ♣ King of Clubs     | Erinyes                      |\n| ♣ Jack of Clubs     | Berserker                    |\n| ♣ Ten of Clubs      | Hill giant                   |\n| ♣ Nine of Clubs     | Ogre                         |\n| ♣ Eight of Clubs    | Orc                          |\n| ♣ Two of Clubs      | Kobold                       |\n| ♦ Ace of Diamonds   | Murmuring worm               |\n| ♦ King of Diamonds  | Archmage and mage apprentice |\n| ♦ Queen of Diamonds | Night hag                    |\n| ♦ Jack of Diamonds  | Assassin                     |\n| ♦ Ten of Diamonds   | Fire giant                   |\n| ♦ Nine of Diamonds  | Ogre mage                    |\n| ♦ Eight of Diamonds | Gnoll                        |\n| ♦ Two of Diamonds   | Kobold                       |\n| ♥ Ace of Hearts     | Red dragon                   |\n| ♥ King of Hearts    | Knight and 4 guards          |\n| ♥ Queen of Hearts   | Incubus/Succubus             |\n| ♥ Jack of Hearts    | Druid                        |\n| ♥ Ten of Hearts     | Cloud giant                  |\n| ♥ Nine of Hearts    | Ettin                        |\n| ♥ Eight of Hearts   | Bugbear                      |\n| ♥ Two of Hearts     | Goblin                       |\n| ♠ Ace of Spades     | Lich                         |\n| ♠ King of Spades    | Priest and 2 acolytes        |\n| ♠ Queen of Spades   | Medusa                       |\n| ♠ Jack of Spades    | Veteran                      |\n| ♠ Ten of Spades     | Frost giant                  |\n| ♠ Nine of Spades    | Troll                        |\n| ♠ Eight of Spades   | Hobgoblin                    |\n| ♠ Two of Spades     | Goblin                       |\n| 🃏 Joker (2)        | The deck’s wielder           |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.247",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "deck-of-many-things",
  "fields": {
    "name": "Deck of Many Things",
    "desc": "A legend of ruination and wonder to those that have heard of it, the _Deck of Many Things_ is the fickle power of fate distilled. Most were created by gods of luck and are found in small and ornately carved coffers and have only 13 cards, but some have the full 22\\. The Narrator may decide, or roll 1d4 to determine randomly (a partial deck on a 1–3, or a full deck on a 4).\n\nBefore drawing, you must declare the number of cards that you intend to draw. A modified poker deck can be used to create your own physical deck using the substitutions below. A card's magic takes effect as soon as it is drawn. Once you begin drawing, each subsequent card must be drawn within an hour of the card that came before it. Failure to do so causes all of your remaining draws to fly out of the deck and take effect immediately. Once a card is drawn, if it is not a joker it is reshuffled into the deck, making it possible to draw the same card twice.\n\nOnce you have drawn the number of cards that you’ve declared, the deck resets and you may never draw from that deck again. Once all individuals present when the deck is discovered have drawn their cards, roll 1d4\\. On a 1–3 the deck vanishes, or on a 4 it returns to its coffer, allowing you to transport it should you so choose.\n\nThe Balance, Comet, Donjon, Fates, Fool, Gem, Idiot, Talons, and Vizier cards only appear in the 22 card deck.\n\n---\n\n♣ **Ace of Clubs: Talons.** Every magical item that you own is immediately destroyed. Artifacts are not destroyed and are instead cast into the multiverse.\n\n♣ **King of Clubs: Void.** Your soul is torn from your body and trapped in an object in a location of the Narrator’s choosing where it is guarded by powerful beings. While your soul is trapped, your body is incapacitated. Even a _wish_ cannot restore your soul, but it can reveal its location. Any remaining draws from the deck are lost.\n\n♣ **Queen of Clubs: Flames.** You gain the enmity of a powerful devil. It seeks to destroy you along with all that you love or have built, inflicting as much misery upon you and your loved ones as possible before finally slaying you. This antagonism lasts until either you or the devil perish.\n\n♣ **Jack of Clubs: Skull.** A merciless harbinger of death appears and attempts to slay you. The harbinger appears in an unoccupied space within 10 feet and immediately attacks. A sense of mortal dread fills any allies present, warning them to stay away. The harbinger fights until you die or it is reduced to 0 hit points. It cannot be harmed by anyone other than you, and if anyone other than you attempts to harm it, another harbinger of death is summoned for them. Creatures slain by a harbinger cannot be restored to life by any means.\n\n♣ **Two of Clubs: Idiot.** Your Intelligence score is permanently reduced by 1d4+1, to a minimum of 1\\. You may draw one additional card beyond what you declared.\n\n♦ **Ace of Diamonds: Vizier.** At any point within a year of drawing this card, you may ask a question while meditating and immediately receive a truthful answer that helps you to solve a problem or dilemma as well as the wisdom and the knowledge to apply it.\n\n♦ **King of Diamonds: Sun.** You gain 50,000 XP, and a randomly determined wondrous item appears in your hands.\n\n♦ **Queen of Diamonds: Moon.** You are granted 1d3 wishes (as the __wish_ spell).\n\n♦ **Jack of Diamonds: Star.** Increase an ability score of your choice by 2\\. The score cannot exceed 24.\n\n♦ **Two of Diamonds: Comet.** Defeating the next hostile monster or group of monsters alone will grant you enough experience points to advance to the next level.\n\n♥ **Ace of Hearts: Fates.** You are granted the ability to reweave the fabric of reality, allowing you to circumvent or erase a single event as though it had never happened. You may use this ability immediately upon drawing the card or at any point prior to your death.\n\n♥ **King of Hearts: Throne.** You are granted proficiency in the Persuasion skill and gain a 1d6 expertise die on all Charisma (Persuasion) checks. You are also granted legal domain over a small keep or fortress on the plane that your character inhabits. Your new domain is overrun by monsters and must be liberated before it can be inhabited.\n\n♥ **Queen of Hearts: Key.** A magic weapon of at least rare rarity that you are proficient with appears in your hand. The weapon is chosen by the Narrator.\n\n♥ **Jack of Hearts: Knight.** A _veteran_  appears and offers you their service, believing it to be destiny, and will serve you loyalty unto death. You control this character.\n\n♥ **Two of Hearts: Gem.** You are showered in wealth. A total of 25 trinkets, easily portable pieces of art, or jewelry worth 2,000 gold each, or 50 gems worth 1,000 gold each appear directly in front of you. \n\n♠ **Ace of Spades: Donjon.** You vanish and are trapped in an extradimensional space. You are either unconscious in a sphere (50%) or trapped in a nightmare realm drawn from your own experiences and fears (50%). You remain in your prison until you are freed. While divination magics cannot locate you, a wish spell reveals the location of your prison. You cannot draw any more cards.\n\n♠ **King of Spades: Ruin.** All nonmagical wealth that you own is lost. Material items vanish. Property and other holdings are lost along with any documentation. You are destitute.\n\n♠ **Queen of Spades: Euryale.** You are _cursed_  by the card. You suffer a permanent –2 penalty to all _saving throws_ . Only a god or the Fates Card can end this curse.\n\n♠ **Jack of Spades: Rogue.** A trusted ally, friend, or other NPC (chosen by the Narrator) becomes a bitter enemy, although their identity is not revealed. They will act against you based upon their abilities and resources, and will try to utterly destroy you. Only a _wish_ spell or divine intervention can end the NPC’s hostility. \n\n♠ **Two of Spades: Balance.** Your history rewrites itself. You gain a randomly determined background, replacing your background feature with the new background feature. You do not change the skill proficiencies or ability score increases from your previous background, or gain new skill proficiencies or ability score increases.\n\n🃏 **Joker with Trademark: Fool.** You lose 10,000 xp and must immediately draw again. If the experience lost in this manner would cause you to lose a level, you are instead reduced to the beginning of your current level instead.\n\n🃏 **Joker without Trademark: Jester.** Fortune smiles on the foolish. Either gain 10,000 XP or draw twice more from the deck beyond what you declared.\n\n---\n\n**Harbinger of Death Challenge** —\n\n_Medium undead_ 0 XP\n\n**Armor Class** 20\n\n**Hit Points** half the hit point maximum of its summoner\n\n**Speed** 60 ft., fly 60 ft. (hover)\n\n**STR DEX CON INT WIS CHA**\n\n16 (+3) 16 (+3) 16 (+3) 16 (+3) 16 (+3) 16 (+3)\n\n**Proficiency** +3; **Maneuver** DC 14\n\n**Damage Immunities** necrotic, poison\n\n**Condition Immunities** _charmed_ , _frightened_ , _paralyzed_ , _petrified_ , _poisoned_ , _unconscious_ \n\n**Senses** darkvision 60 ft., truesight 60 ft., passive Perception 13\n\n**Languages** all languages known to its summoner\n\n_**Incorporeal Movement.**_ The harbinger can move through other creatures and objects as if they were _difficult terrain_ . It takes 5 (1d10) force damage if it ends its turn inside an object.\n\n_**Turning Immunity**_. The harbinger is immune to features that turn undead.\n\nACTIONS\n\n**_Reaping Scythe_**. The harbinger sweeps its spectral scythe through a creature within 5 feet of it, dealing 7 (1d8+3) slashing damage plus 4 (1d8) necrotic damage. The sixth time and each subsequent time that a creature is damaged by this attack, it makes a DC 14 Charisma _saving throw_  or becomes _doomed_ .",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.247",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "defender",
  "fields": {
    "name": "Defender",
    "desc": "You gain +3 bonus to attack and damage rolls made with this magic sword. In addition, while you are attuned to the sword, on each of your turns before you make your first attack with it you can transfer some or all of the +3 bonus to your Armor Class (instead of using it for attacks) until the start of your next turn or until you drop the sword (whichever comes first).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.247",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "demon-armor",
  "fields": {
    "name": "Demon Armor",
    "desc": "While wearing this armor, your Armor Class increases by +1 and you can understand and speak Abyssal. You can attack with the armor’s clawed gauntlets (which deal 1d8 slashing damage) and gain a +1 bonus to attack and damage rolls when doing so.\n\n**Cursed.** You cannot remove this armor until you are targeted by _remove curse_ or similar magic. You have _disadvantage_  on _attack rolls_  against demons and on _saving throws_  made against them.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.248",
    "page_no": null,
    "type": "Armor",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "dimensional-shackles",
  "fields": {
    "name": "Dimensional Shackles",
    "desc": "You can use an action to shackle an _incapacitated_  Small- to Large-sized creature using these manacles. Once shackled, the creature is incapable of using or being affected by any sort of extradimensional travel or effect (including teleportation or plane shift spells and effects, but not portals). \n\nYou and any creature you designate when you use the shackles can use an action to remove them. At the end of every 2 weeks that pass, a shackled creature can make a DC 30 Strength (Athletics) check to break free and destroy the shackles.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.248",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "dragon-scale-mail",
  "fields": {
    "name": "Dragon Scale Mail",
    "desc": "While wearing this armor, you gain following benefits:\n\n* Your Armor Class increases by +1.\n* _Advantage_  on _saving throws_  against the Frightful Presence and breath weapons of dragons.\n* Resistance to one damage type (determined by the type of dragon that provided the scales).\n\nIn addition, once between _long rests_  you can use an action to magically detect the distance and direction to the closest dragon of the same type as the armor that is within 30 miles.\n\n__**Table: Dragon Scale Mail**__\n| Dragon   | Resistance  |\n| -------- | ----------- |\n| Amethyst | Force       |\n| Black    | Acid        |\n| Blue     | Lightning   |\n| Brass    | Fire        |\n| Bronze   | Lightning   |\n| Copper   | Acid        |\n| Earth    | Slashing    |\n| Emerald  | Thunder     |\n| Gold     | Fire        |\n| Green    | Poison      |\n| Red      | Fire        |\n| River    | Bludgeoning |\n| Sapphire | Psychic     |\n| Shadow   | Necrotic    |\n| Silver   | Cold        |\n| Spirit   | Radiant     |\n| White    | Cold        |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.248",
    "page_no": null,
    "type": "Armor",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "dragon-slayer",
  "fields": {
    "name": "Dragon Slayer",
    "desc": "You gain a +3 bonus to attack and damage rolls made with this magic sword, and it deals an extra 3d6 damage against dragons (including any creature with the dragon type, such as _dragon turtles_  and _wyverns_ ).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.249",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "dust-of-disappearance",
  "fields": {
    "name": "Dust of Disappearance",
    "desc": "This shimmering dust is usually found in a small vial that contains enough for a single use. You can use an action to scatter the dust into the air, covering you and each creature and object within 10 feet and rendering them _invisible_  for 2d4 minutes. This consumes the dust. If an affected creature casts a spell or attacks, the effect ends for that creature.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.249",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "dust-of-dryness",
  "fields": {
    "name": "Dust of Dryness",
    "desc": "This small vial contains 1d6+4 pinches of dust. You can use an action to spread a pinch over water, transforming a 15-foot cube of water into a small pellet that weighs less than an ounce. \n\nUsing an action, you or another creature can break the pellet against any hard surface, releasing all of the water and destroying the pellet. \n\nA creature composed mostly of water that is exposed to a pinch of the dust makes a DC 13 Constitution _saving throw_ , taking 10d6 necrotic damage on a failure, or half damage on a success.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.249",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "dust-of-sneezing-and-choking",
  "fields": {
    "name": "Dust of Sneezing and Choking",
    "desc": "This fine gray dust is usually found in a vial and appears to be _dust of disappearance_ , even when magic is used to _identify_ it. Each vial contains enough for a single use.\n\nYou can use an action to throw the dust into the air. You and creatures within 30 feet of you that breathe make a DC 15 Constitution _saving throw_  or become wracked with violent coughing and sneezing, becoming _incapacitated_  and beginning to _suffocate_ . While conscious, a creature can repeat the saving throw at the end of each of its turns, ending the effects on a success. A _lesser restoration_  spell also ends the effects.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.250",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "dwarven-plate",
  "fields": {
    "name": "Dwarven Plate",
    "desc": "While wearing this armor, you gain the following benefits:\n\n* Your Armor Class increases by +1.\n* When an effect forces you to move along the ground, you can use your reaction to reduce the forced movement by up to 10 feet.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.250",
    "page_no": null,
    "type": "Armor",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "dwarven-thrower",
  "fields": {
    "name": "Dwarven Thrower",
    "desc": "You gain +3 bonus to attack and damage rolls made with this magic warhammer. In addition, while you are attuned to the hammer, you may throw it with a normal range of 20 feet and a maximum range of 60 feet. On a hit with a ranged attack using this hammer it deals an extra 1d8 damage (2d8 damage if the target is a giant). When thrown the warhammer immediately flies back to your hand after it hits or misses its target.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.250",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "efficient-quiver",
  "fields": {
    "name": "Efficient Quiver",
    "desc": "This quiver has three compartments that contain extradimensional spaces. The first compartment can hold up to 60 arrows or items of a similar size. The second compartment can hold up to 18 javelins or similar items. The third compartment can hold up to 6 items such as bows, quarterstaffs, or spears.\n\nYou can retrieve any item as if it were being drawn from a regular quiver or scabbard. No single item can weigh more than 2 pounds.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.251",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "efreeti-bottle",
  "fields": {
    "name": "Efreeti Bottle",
    "desc": "You can use an action to unstopper this intricately carved brass bottle, causing an _efreeti_  to appear in a cloud of acrid smoke in an unoccupied space within 30 feet. When you open the bottle, roll to d100 to determine the effect.\n\n__**Table: Efreeti Bottle**__\n| **d100** | **Effect**                                                                                                                                                                                                                                                                                                         |\n| -------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ |\n| 01–10    | The efreeti attacks you. The Efreeti departs after 5 rounds pass or losing half its hit points, whichever happens first, and the bottle becomes a mundane item.                                                                                                                                                    |\n| 11–90    | The efreeti serves you for up to 1 hour before being drawn back into the bottle. The bottle cannot be opened again for 24 hours. This effect occurs automatically the second and third time the bottle is opened. The fourth time the bottle is opened, the efreeti vanishes and the bottle loses its enchantment. |\n| 91–100   | The efreeti grants you 3 wishes (as the _wish_ spell) then vanishes after an hour or after granting the final wish, and the bottle becomes a mundane item.                                                                                                                                                         |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.251",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "elemental-gem",
  "fields": {
    "name": "Elemental Gem",
    "desc": "You can use an action to break this gem, releasing a burst of elemental energy that summons an elemental to you as if you had cast the _conjure elemental_ spell. The type of gem determines the elemental summoned. \n\nThe gem loses its enchantment when broken.\n\n__**Table: Elemental Gem**__\n| Corundum | _Fire elemental_  |\n| -------- | ----------------- |\n| Diamond  | _Earth elemental_ |\n| Emerald  | _Water elemental_ |\n| Sapphire | _Air elemental_   |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.251",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "elven-chain",
  "fields": {
    "name": "Elven Chain",
    "desc": "While wearing this armor your Armor Class increases by +1, and you are able to wear it without penalty even without proficiency. It only weighs 10 pounds, including the padding underneath, and can be stealthily worn under normal clothes.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.252",
    "page_no": null,
    "type": "Armor",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "eversmoking-bottle",
  "fields": {
    "name": "Eversmoking Bottle",
    "desc": "This glass bottle is filled with whirling smoke. You can use an action to remove the stopper, causing a thick cloud to pour out and fill a 60-foot radius centered on the bottle, making the area _heavily obscured_ . The cloud grows by 10 feet for each minute that the bottle remains open, to a maximum radius of 120 feet.\n\nThe cloud remains until the bottle is closed. Closing the bottle requires the item’s command word and an action, after which the smoke disperses after 10 minutes. Moderate winds disperse the smoke after 1 minute. Strong winds disperse the smoke after 1 round.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.252",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "eyes-of-charming",
  "fields": {
    "name": "Eyes of Charming",
    "desc": "These framed lenses are worn over the eyes and contain 3 charges. You can use an action to expend 1 charge and cast the __charm person_ spell (save DC 13). Both you and the target must be able to see each other. The lenses regain all expended charges at dawn.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.252",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "eyes-of-minute-seeing",
  "fields": {
    "name": "Eyes of Minute Seeing",
    "desc": "These wire-framed lenses are worn over the eyes and enhance your vision within 1 foot. You gain _advantage_  on any sight-based Investigation checks made to study an object or area within that range",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.253",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "eyes-of-the-eagle",
  "fields": {
    "name": "Eyes of the Eagle",
    "desc": "These wire-framed lenses fit over the eyes and grant you _advantage_  on sight-based Perception checks. When visibility is clear you can make out fine details at extreme ranges, easily discerning creatures and objects as small as 2 feet across.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.253",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "feather-token",
  "fields": {
    "name": "Feather Token",
    "desc": "The following are additional feather token options. Cloud (Uncommon). This white feather is shaped like a cloud. You can use an action to step on the token, which expands into a 10-foot-diameter cloud that immediately begins to rise slowly to a height of up to 20 feet. Any creatures standing on the cloud rise with it. The cloud disappears after 10 minutes, and anything that was on the cloud falls slowly to the ground. \nDark of the Moon (Rare). This black feather is shaped like a crescent moon. As an action, you can brush the feather over a willing creature’s eyes to grant it the ability to see in the dark. For 1 hour, that creature has darkvision out to a range of 60 feet, including in magical darkness. Afterwards, the feather disappears. \n Held Heart (Very Rare). This red feather is shaped like a heart. While carrying this token, you have advantage on initiative rolls. As an action, you can press the feather against a willing, injured creature. The target regains all its missing hit points and the feather disappears. \nJackdaw’s Dart (Common). This black feather is shaped like a dart. While holding it, you can use an action to throw it at a creature you can see within 30 feet of you. As it flies, the feather transforms into a blot of black ink. The target must succeed on a DC 11 Dexterity saving throw or the feather leaves a black mark of misfortune on it. The target has disadvantage on its next ability check, attack roll, or saving throw then the mark disappears. A remove curse spell ends the mark early.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.253",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "varies",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "figurine-of-wondrous-power",
  "fields": {
    "name": "Figurine of Wondrous Power",
    "desc": "The following are additional figurine of wondrous power options. \nAmber Bee (Uncommon). This amber statuette is of a honeybee. It can become a giant honey bee (see Tome of Beasts 2) for up to 6 hours. Once it has been used, it can’t be used again until 2 days have passed. \nBasalt Cockatrice (Uncommon). This basalt statuette is carved in the likeness of a cockatrice. It can become a cockatrice for up to 1 hour. Once it has been used, it can’t be used again until 2 days have passed. While it is in cockatrice form, you and your allies within 30 feet of it have advantage on saving throws against being petrified. \nCoral Shark (Rare). This coral statuette of a shark can become a hunter shark for up to 6 hours. It can be ridden as a mount, and the rider can breathe underwater while riding it. Once it has been used, it can’t be used again until 5 days have passed. \nHematite Aurochs (Rare). This hematite statuette can become a bull (see Tome of Beasts 2). It has 24 charges, and each hour or portion thereof it spends in beast form costs 1 charge. While it has charges, you can use it as often as you wish. When it runs out of charges, it reverts to a figurine and can’t be used again until 7 days have passed, when it regains all its charges. While in bull form, it is considered to be a Huge creature for the purpose of determining its carrying capacity, and nonmagical difficult terrain doesn’t cost it extra movement. \nLapis Camel (Rare). This lapis camel can become a camel. It has 24 charges, and each hour or portion thereof it spends in camel form costs 1 charge. While it has charges, you can use it as often as you wish. When it runs out of charges, it reverts to a figurine and can’t be used again until 7 days have passed, when it regains all its charges. While in camel form, the lapis camel has a blue tint to its fur, and it can spit globs of acid at a creature that attacks it or its rider. This spit works like the acid splash spell (save DC 9). \nMarble Mistwolf (Rare). This white marble statuette is of a wolf. It can become a dire wolf for up to 6 hours. At your command, it can cast the fog cloud spell. Each time it does, its duration is reduced by 1 hour. Once its duration ends, it can’t be used again until 5 days have passed. \nTin Dog (Common). This simple, tin statuette can become a dog for up to 8 hours, loyally following your commands to the best of its abilities. The dog uses the statistics of a jackal, except the dog has a Strength of 10. Once it has been used, the figurine can’t be used again until 2 days have passed. \nViolet Octopoid (Rare). A disturbing statuette carved in purple sugilite, the tentacled, violet octopoid can become an ambulatory, amphibious giant octopus for up to 6 hours. Use the statistics of a giant octopus, except it has 100 hit points and can make two tentacle attacks each turn. Once it has been used, it can’t be used again until 3 days have passed. If you speak the command word in Void Speech, the octopus has an Intelligence score of 9 and can make three tentacle attacks each turn.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.254",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "varies",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "flame-tongue",
  "fields": {
    "name": "Flame Tongue",
    "desc": "While you are attuned to this magic sword, you can use a bonus action and speak its command word to make flames erupt from the blade, shedding bright light in a 40-foot radius and dim light for an additional 40 feet. While lit, attacks using the sword deal an extra 2d6 fire damage. The flames last until you use a bonus action to put them out or until you drop or sheathe the sword.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.254",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "folding-boat",
  "fields": {
    "name": "Folding Boat",
    "desc": "This dark wood box with nautical-themed carvings measures 12 inches long, 6 inches wide, and 6 inches deep. It weighs 4 pounds and always floats in water. Three command words control its functions as follows:\n\n* The first command word turns the box into a 10-foot long boat that is 4 feet wide and 2 feet deep. It comes equipped with one pair of oars, an anchor, a mast, and a lateen sail, and can hold up to 4 Medium creatures comfortably.\n* The second command word causes the box to unfold into a 24-foot long ship that is 8 feet wide and 6 feet deep. This ship has a deck, rowing seats, 5 sets of oars, a steering oar, an anchor, a deck cabin, and a mast with a square sail. It can hold 15 Medium creatures comfortably.\n* A third command word causes the folding boat to revert to its original shape, provided that no creatures are aboard. Any objects in the vessel that can’t fit inside the box remain outside and any objects that can fit inside do.\n\nWhen the box becomes a vessel, its weight becomes that of a normal vessel its size, and anything that was stored in the box remains in the boat.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.254",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "frost-brand",
  "fields": {
    "name": "Frost Brand",
    "desc": "When exposed to freezing temperatures the blade of this magic sword sheds _bright light_  in a 10-foot radius and _dim light_  for an additional 10 feet. While you are attuned to the sword, attacks using it deal an extra 1d6 cold damage and you gain resistance to fire damage. Once per hour, when you draw the sword you can choose to extinguish all nonmagical flames within 30 feet. ",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.255",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "gauntlets-of-ogre-power",
  "fields": {
    "name": "Gauntlets of Ogre Power",
    "desc": "Wearing these gauntlets increases your Strength score to 19\\. They have no effect if your Strength is equal to or greater than 19.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.255",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "gem-of-brightness",
  "fields": {
    "name": "Gem of Brightness",
    "desc": "This prism has 50 charges. While you are holding it, you can speak one of three command words to cause one of the following effects:\n\n* The first command word can be used as a bonus action to cause the gem to shed _bright light_  in a 30-foot radius and _dim light_  for an additional 30 feet. This effect doesn’t expend any charges and lasts until you repeat the first command word or use one of the other two.\n* The second command word requires an action and expends 1 charge, causing the gem to fire a brilliant beam of light at one creature you can see within 60 feet. The creature makes a DC 15 Constitution _saving throw_  or becomes _blinded_  for 1 minute. The creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n* The third command word requires an action and expends 5 charges, causing the gem to flare with blinding light in a 30-foot cone. Each creature in the area makes a DC 15 Constitution _saving throw_  or becomes _blinded_  for 1 minute. A blinded creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\nWhen all of the gem’s charges are expended it loses all magical properties, becoming a mundane jewel worth 50 gold.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.255",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "gem-of-seeing",
  "fields": {
    "name": "Gem of Seeing",
    "desc": "This gem has 3 charges and regains 1d3 charges each dawn. You can use an action to speak the gem’s command word and expend 1 charge. For the next 10 minutes, you have truesight to a range of 120 feet when you peer through the gem.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.256",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "giant-slayer",
  "fields": {
    "name": "Giant Slayer",
    "desc": "You gain a +1 bonus to attack and damage rolls made with this magic weapon, and it deals an extra 2d6 damage against giants (including any creature with the giant type, such as _ettins_  and _trolls_ ). In addition, when the weapon deals damage to a giant, the giant makes a DC 15 Strength _saving throw_  or falls _prone_ .",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.256",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "glamoured-studded-leather",
  "fields": {
    "name": "Glamoured Studded Leather",
    "desc": "While wearing this armor, you gain a +1 bonus to AC. You can also use a bonus action to speak the armor's command word and cause the armor to assume the appearance of a normal set of clothing or some other kind of armor. You decide what it looks like, including color, style, and accessories, but the armor retains its normal bulk and weight. The illusory appearance lasts until you use this property again or remove the armor.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.256",
    "page_no": null,
    "type": "Armor (studded leather)",
    "rarity": "rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "gloves-of-missile-snaring",
  "fields": {
    "name": "Gloves of Missile Snaring",
    "desc": "While wearing these gloves, when you are hit by a ranged weapon attack you can use your reaction to reduce the damage by 1d10 + your Dexterity modifier, as long as you have a free hand. If the damage is reduced to 0, you can catch the missile if it is small enough to be held in that hand.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.257",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "gloves-of-swimming-and-climbing",
  "fields": {
    "name": "Gloves of Swimming and Climbing",
    "desc": "While wearing these gloves you gain the following benefits:\n\n* Climbing and swimming don’t cost extra movement.\n* +5 bonus to Athletics checks made to climb or swim.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.257",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "goggles-of-night",
  "fields": {
    "name": "Goggles of Night",
    "desc": "While wearing these goggles, you gain darkvision to a range of 60 feet, or increase your existing darkvision by 60 feet.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.257",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "hammer-of-thunderbolts",
  "fields": {
    "name": "Hammer of Thunderbolts",
    "desc": "You gain a +1 bonus to attack and damage rolls made with this magic maul. This weapon can only be attuned to when you are wearing a __belt of giant strength_ and __gauntlets of ogre power ._ The attunement ends if you remove or change attunement away from either of those items. \n\nWhile you are attuned to this weapon and holding it:\n\n* Your Strength score increases by 4 (and can exceed 20, but not 30).\n* When you make an attack roll with this weapon against a giant and roll a natural 20, the giant makes a DC 17 Constitution _saving throw_  or dies.\n\nYou can expend 1 charge and make a ranged weapon attack with the maul with a normal range of 20 feet and a maximum range of 60 feet. On a hit, the maul unleashes a thunderclap heard from up to 300 feet away. The target and every creature within 30 feet of it make a DC 17 Constitution _saving throw_  or become _stunned_  until the end of your next turn.\n\n  \nThe maul has 5 charges and regains 1d4+1 charges each dawn.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.258",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "handy-haversack",
  "fields": {
    "name": "Handy Haversack",
    "desc": "This backpack has a central pouch and two side pouches, each of which is an extradimensional space. Each side pouch can hold up to 20 pounds of material, not exceeding a volume of 2 cubic feet. The large central pouch can hold up to 8 cubic feet or 80 pounds of material. The backpack always weighs 5 pounds regardless of its contents.\n\nPlacing an object in the haversack follows the normal rules for interacting with objects. Retrieving an item from the haversack requires you to use an action. When you reach into the haversack for a specific item, the item is always magically on top. If the haversack is turned inside out, its contents spill forth, unharmed, and the haversack must be put right before it can be used again.\n\nFood or water placed in the bag immediately and permanently lose all nourishing qualities—after being in the bag, water no longer slakes thirst and food does not sate hunger or nourish. In a similar fashion, the body of a dead creature placed in the bag cannot be restored to life by __revivify , raise dead ,_ or other similar magic. Breathing creatures inside the bag can survive for up to 2d4 minutes divided by the number of creatures (minimum 1 minute), after which time they begin to _suffocate_ .\n\nThe bag cannot hold any item that would not fit in a normal bag of its apparent size or any item with the Bulky quality. \n\nIf the bag is punctured, torn, or otherwise structurally damaged, it ruptures and is destroyed, and the contents are scattered throughout the Astral Plane.\n\nPlacing a _handy haversack_ inside another extradimensional storage device such as a _bag of holding_ or __portable hole_ results in planar rift that destroys both items and pulls everything within 10 feet into the Astral Plane. The rift then closes and disappears.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.258",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "hat-of-disguise",
  "fields": {
    "name": "Hat of Disguise",
    "desc": "While wearing this hat, you can use an action to cast __disguise self_ at will. The spell ends if the hat is removed.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.258",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "headband-of-intellect",
  "fields": {
    "name": "Headband of Intellect",
    "desc": "Wearing this headband increases your Intelligence score to 19\\. It has no effect if your Intelligence is equal to greater than 19.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.259",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "helm-of-brilliance",
  "fields": {
    "name": "Helm of Brilliance",
    "desc": "This helm is set with 1d10 diamonds, 2d10 rubies, 3d10 fire opals, and 4d10 opals. Gems removed from the helm crumble to dust. The helm loses its magic when all the gems are removed.\n\nWhile wearing this helm, you gain the following benefits:\n\n* You can use an action to cast one of the following spells (save DC 18) with the listed gem as its component: _daylight_ (opal), __fireball_  (fire opal), _prismatic spray_ (diamond), or _wall of fire_  (ruby). The gem is then destroyed.\n* If at least one diamond remains, the helm casts dim light in a 30-foot radius if at least one undead is within 30 feet. Any undead that starts its turn in the light takes 1d6 radiant damage.\n* If at least one ruby remains, you have resistance to fire damage.\n* If at least one fire opal remains, you can use an action to speak a command word and cause a weapon you are holding to erupt in flames, causing it to deal an extra 1d6 fire damage on a hit. The flames cast bright light in a 10-foot radius and dim light for an additional 10 feet. The flames last until you use a bonus action to speak the command word or you release the weapon.\n* Whenever you fail a _saving throw_  against a spell and take fire damage as a result, roll a d20\\. On a 1, light blazes from the remaining gems. Each creature within 60 feet other than you must succeed on a DC 17 Dexterity saving throw or take radiant damage equal to the number of gems in the helm. The helm and the remaining gems are then destroyed.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.259",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "helm-of-comprehending-languages",
  "fields": {
    "name": "Helm of Comprehending Languages",
    "desc": "While wearing this helm, you can use an action to cast __comprehend languages_ at will.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.259",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "helm-of-telepathy",
  "fields": {
    "name": "Helm of Telepathy",
    "desc": "While wearing this helm, you gain the following benefits:\n\n* You can use an action to cast _detect thoughts_ (save DC 13) at will. While maintaining _concentration_ , you can use a bonus action to send a telepathic message to a creature you are focused on. It can reply with a bonus action while you are focused on it. If a creature successfully saves against this property, it becomes immune to it for 24 hours.\n\nOnce between _long rests_ , while focusing on a creature with _detect thoughts_ you can use an action to cast __suggestion_  (save DC 13) on that creature.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.259",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "helm-of-teleportation",
  "fields": {
    "name": "Helm of Teleportation",
    "desc": "While wearing this helm you can use an action to cast _teleport_ . The helm has 3 charges and regains 1d3 charges each dawn.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.260",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "holy-avenger",
  "fields": {
    "name": "Holy Avenger",
    "desc": "You gain a +3 bonus to attack and damage rolls made with this magic sword. While you are attuned to the sword and use it to attack a fiend or undead, on a hit it deals an extra 2d10 radiant damage. In addition, while drawn the sword creates an aura in a 10-foot radius around you. You and friendly creatures in the aura gain _advantage_  on _saving throws_  against spells and other magical effects. If you have 17 or more levels in the herald class, the aura increases to a 30-foot radius.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.260",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "horn-of-blasting",
  "fields": {
    "name": "Horn of Blasting",
    "desc": "You can use an action to speak the horn’s command word and blow it, emitting a thunderous blast in a 30-foot cone that is audible 600 feet away. Each creature in the area makes a DC 15 Constitution _saving throw_ . On a failed save, a creature takes 5d6 thunder damage and is _deafened_  for 1 minute. On a successful save, a creature takes half damage and isn’t deafened. Creatures and objects made of glass or crystal have disadvantage on the saving throw and take double damage.\n\nEach use of the horn’s magic has a 20% chance of making it explode, dealing 10d6 fire damage to you and destroying it.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.260",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "horn-of-valhalla",
  "fields": {
    "name": "Horn of Valhalla",
    "desc": "You can use an action to blow this horn and summon the spirits of fallen warriors. These spirits appear within 60 feet of you and use the statistics for _berserker hordes_ . They return to Valhalla after 1 hour or when they drop to 0 hit points. Once you use the horn, it can’t be used again for 7 days.\n\nFour types of _horn of Valhalla_ are known to exist, each made of a different metal. The horn’s type determines how many _berserker hordes_  answer its summons, as well as the requirement for its use. The Narrator chooses the horn’s type or determines it randomly.\n\n__**Table: Horn of Valhalla**__\n| **Horn**   | **Rarity** | **Cost**  | **Crafting Components**                                | **Berserker Hordes Summoned** |\n| ---------- | ---------- | --------- | ------------------------------------------------------ | ----------------------------- |\n| **Silver** | Rare       | 1,000 gp  | Silver sword pendant that has been carried into battle | 2                             |\n| **Brass**  | Rare       | 5,000 gp  | Horn of a celestial creature                           | 3                             |\n| **Bronze** | Very rare  | 10,000 gp | Horn of a _horned devil_                               | 4                             |\n| **Iron**   | Legendary  | 75,000 gp | Horn that has been blown by a _solar_                  | 5                             |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.261",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "horseshoes-of-a-zephyr",
  "fields": {
    "name": "Horseshoes of a Zephyr",
    "desc": "These iron horseshoes come in a set of four. While all four shoes are affixed to the hooves of a horse or similar creature, they allow the creature to perform the following feats:\n\n* Move normally while floating 4 inches above the ground, allowing it to cross or stand above nonsolid or unstable surfaces (such as lava or water).\n* Leave no tracks and ignore _difficult terrain_ .\n* Move its Speed for up to 12 hours a day without suffering _fatigue_  from a forced march.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.261",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "horseshoes-of-speed",
  "fields": {
    "name": "Horseshoes of Speed",
    "desc": "These iron horseshoes come in a set of four. Once all four are affixed to the hooves of a horse or similar creature, its Speed increases by 30 feet.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.261",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "immovable-rod",
  "fields": {
    "name": "Immovable Rod",
    "desc": "You can use an action to press this metal rod’s single button, magically fixing it in place where it defies gravity. To move the rod, you or another creature must use an action to press the button again.\n\nThe rod can support up to 8,000 pounds of weight (if this is exceeded, the rod deactivates and falls). A creature that attempts to move the rod needs to make a DC 30 Strength check, moving the rod up to 10 feet on a success.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.262",
    "page_no": null,
    "type": "Rod",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "instant-fortress",
  "fields": {
    "name": "Instant Fortress",
    "desc": "You can use an action to place this 1-inch metal cube on the ground and speak its command word. The cube rapidly grows into a fortress that remains until you use another action to speak the command word that dismisses it. The fortress can only be dismissed when it is empty. \n\nWhen activated, the cube transforms into a square tower, 20 feet on a side and 30 feet high, with arrow slits on all sides and a battlement atop it, with a small door on the side facing you. The door opens only at your command, which you can speak as a bonus action (it is immune to spells like _knock_  and related magic, such as a __chime of opening_ .) The tower’s interior has two floors, with a ladder connecting them and continuing on to a trapdoor to the roof. \n\nEach creature in the area where the fortress appears makes a DC 15 Dexterity _saving throw_ , taking 10d10 bludgeoning damage on a failure, or half damage on a success. In either case, the creature is pushed to an unoccupied space next to the fortress. Objects in the area that aren’t being worn or carried take full damage and are pushed automatically.\n\nThe tower is made of adamantine, and its magic prevents it from being tipped over. The roof, the door, and the walls each have AC 20, 100 hit points, immunity to damage from nonmagical weapons (excluding siege weapons), and resistance to all other damage. Only a _wish_  spell can repair the fortress (this use of the spell counts as replicating a spell of 8th-level or lower). Each casting causes the roof, the door, or one wall to regain 50 hit points.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.262",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ioun-stone",
  "fields": {
    "name": "Ioun Stone",
    "desc": "Some say these enchanted gems take their name from a deity of knowledge, others that they are named for the sound they make as they gently orbit their bearer’s head. Whatever the case, there are many types of _ioun stones_, each imbued with powerful beneficial magic.\n\nThe specifics of these stones vary but they all work in essentially the same way: once you have attuned to it you can use an action to set a stone in a gentle orbit around your head, 1d4 feet away from you. Another creature may use an action to try and take an orbiting stone, but must make a melee attack against AC 24 or make a DC 24 Dexterity (Acrobatics) check. An _ioun stone’s_ AC is 24, it has 10 hit points, and resistance to all damage. While orbiting your head, it is considered a worn item. You can use an action to seize and stow the stone, returning it to an inert and inactive state.\n\n__**Table: Ioun Stones**__\n| **Type**           | **Rarity** | **Cost**  | **Crafting Components**                                                               | **Property**                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           |\n| ------------------ | ---------- | --------- | ------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ |\n| Absorption         | Very rare  | 10,000 gp | Refined negative energy                                                               | While this white marble sphere orbits your head, when a creature you can see casts a spell of 4th-level or lower targeting only you, you can use your reaction to have the stone harmlessly absorb the spell, suffering no damage or negative effects. The stone can absorb 20 spell levels. If a spell is higher level than the available spell levels left in the stone, the spell cannot be absorbed. After absorbing 20 spell levels the stone loses its magic and turns a faded gray.                                                                                                                                                                                                                                                             |\n| Agility            | Very rare  | 15,000 gp | A cat’s dream captured in the Astral Plane                                            | While this ice-blue octahedron orbits your head your Dexterity score is increased by 2 (to a maximum of 20).                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           |\n| Awareness          | Rare       | 600 gp    | Phase spider’s eye                                                                    | While this bright red cylinder orbits your head, it chimes to keep you from being _surprised_ .                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        |\n| Fortitude          | Very rare  | 15,000 gp | Hoof or horn of a divine ox                                                           | While this bright pink dodecahedron orbits your head your Constitution score is increased by 2 (to a maximum of 20).                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   |\n| Greater Absorption | Legendary  | 50,000 gp | Refined negative energy, shards from a destroyed __staff of power_                    | This gold and onyx ellipsoid draws powerful magic into it. While this gem orbits your head, it functions as an _ioun stone_ of _absorption_, but can absorb spells of 8th-level or lower, up to a maximum of 50 total spell levels.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |\n| Insight            | Very rare  | 15,000 gp | Tail feathers from an awakened owl                                                    | While this clear octahedron orbits your head your Wisdom score is increased by 2 (to a maximum of 20).                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |\n| Intellect          | Very rare  | 15,000 gp | Canine teeth from an awakened fox                                                     | While this cobalt blue tetrahedron orbits your head your Intelligence score is increased by 2 (to a maximum of 20).                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |\n| Leadership         | Very rare  | 15,000 gp | Collar from a loyal dog that died of old age                                          | While this brilliant yellow cube orbits your head your Charisma score is increased 2 (to a maximum of 20).                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             |\n| Mastery            | Legendary  | 50,000 gp | The most treasured possession of a slain adventurer that redeemed themselves in death | While this jet icosahedron orbits your head, your proficiency bonus is increased by 1.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |\n| Protection         | Rare       | 1,000 gp  | Bone plate from a _stegosaurus_                                                       | While this dusty blue tetrahedron orbits your head, your AC is increased by +1.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        |\n| Regeneration       | Legendary  | 25,000 gp | _Basilisk's_  gizzard                                                                 | While this green and purple spindle orbits your head, you regain 15 hit points every hour, provided you have at least 1 hit point.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |\n| Reserve            | Rare       | 600 gp    | __Pearl of power_                                                                     | This radiant indigo prism encases a pearl and can store spells for later use. The stone can hold up to 3 spell levels and is typically found with 1d4 – 1 levels of stored spells. To store a spell in the stone, a creature must cast a 1st-, 2nd-, or 3rd-level spell while holding it. The spell is drawn into the stone with no other effect. If there aren’t enough available levels to hold a spell, it cannot be stored. While the stone is orbiting you, you can cast any spell stored in it using the appropriate action. The spell uses the spell level, spell save DC, attack bonus, and spellcasting ability of the creature that stored the spell, but you are considered to be the caster. Once a spell is cast, it is no longer stored. |\n| Strength           | Very rare  | 15,000 gp | Canine teeth from an awakened bear                                                    | While this bright pink pentagonal trapezohedron orbits your head your Strength score is increased by 2 (to a maximum of 20).                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           |\n| Sustenance         | Rare       | 525 gp    | Honeycomb from a giant bee beehive                                                    | While this delicate amber spindle orbits your head, when taking a long rest you can roll a d20\\. On an 11 or higher, you do not require Supply during that _long rest_ .                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.262",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "iron-bands-of-binding",
  "fields": {
    "name": "Iron Bands of Binding",
    "desc": "This smooth iron sphere conceals a formidable set of restraints that unfolds into metal bands when thrown. Once between long rests you can use an action to throw it at a creature within 60 feet, treating it as if it were a ranged weapon attack with which you are proficient. On a hit, if the creature is Huge-sized or smaller it becomes _restrained_  until you use a bonus action to speak a different command word and release it.\n\nA creature can try to break the bands by using an action to make a DC 20 Strength Check. On a success, the bands are broken and the _restrained_  creature is freed. On a failure, the creature cannot try again until 24 hours have passed.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.263",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "iron-flask",
  "fields": {
    "name": "Iron Flask",
    "desc": "This dark iron bottle feels heavy in your hand. Engraved with powerful runes of binding, it is capable of trapping otherworldly creatures. You can use an action to speak the command word and remove the silver stopper from the flask, targeting a creature within 60 feet that is not native to the plane of existence the flask is currently on.\n\n* If the _iron flask_ is empty and you can see the creature, it makes a DC 17 Wisdom _saving throw_  or becomes trapped in the flask. A creature that has previously been trapped in this flask has _advantage_  on this save. The trapped creature is held in stasis—it doesn’t breathe, eat, drink, or age.\n* As an action, you can release the creature trapped within. A released creature remains friendly to you and your allies for 1 hour, during which it obeys your verbal commands, and afterward it acts normally. Without any commands or when given a command likely to result in its death, the creature defends itself but otherwise takes no actions.\n* Casting _identify_ on this flask also reveals if a creature is trapped within, but will not reveal the type. The only way to determine an _iron flask’s_ contents is to open the flask and release its inhabitant.\n* Newly acquired _iron flasks_ may already have a trapped creature, either chosen by the Narrator or determined randomly.\n\n__**Table: Iron Flask**__\n| **d100** | **Contents**             |\n| -------- | ------------------------ |\n| 0-50     | Empty                    |\n| 51–55    | _Djinni_                 |\n| 56–60    | _Efreeti_                |\n| 61–65    | _Marid_                  |\n| 66–70    | _Divi_                   |\n| 71–80    | Angel (any)              |\n| 81–90    | _Elemental_  (any)       |\n| 91       | Lich from another plane  |\n| 92       | Chromatic dragon (any)   |\n| 93       | Metallic dragon (any)    |\n| 94       | Gem dragon (any)         |\n| 95       | Spirit dragon (any)      |\n| 96       | _Couatl_                 |\n| 97       | Succubus/Incubus         |\n| 98       | Ghost from another plane |\n| 99       | _Dragon turtle_          |\n| 100      | _Xorn_                   |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.263",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "javelin-of-lightning",
  "fields": {
    "name": "Javelin of Lightning",
    "desc": "Once per dawn, when you throw this magic weapon and speak its command word it transforms into a 5-foot wide line of electricity that is 120 feet long. Each creature in the area (excluding you) makes a DC 13 Dexterity _saving throw_ , taking 4d6 lightning damage on a failed save, or half damage on a success. The target of your attack takes the javelin’s normal damage plus 4d6 lightning damage.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.263",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "lantern-of-revealing",
  "fields": {
    "name": "Lantern of Revealing",
    "desc": "While lit, this hooded lantern casts bright light in a 30-foot radius, revealing _invisible_  creatures and objects in the area. It sheds dim light an additional 30 feet, or if you use an action to lower the hood only in a 5-foot radius. The lantern stays lit for 6 hours on 1 pint of oil.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.264",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "luck-blade",
  "fields": {
    "name": "Luck Blade",
    "desc": "You gain a +1 bonus to attack and damage rolls made with this magic sword. While you are attuned to the sword and holding it, you gain a +1 bonus to _saving throws_ . In addition, it has the following properties:\n\n**Luck.** Once per dawn, while the sword is on your person you may reroll one ability check, attack roll, or _saving throw_ . You must use the new roll.\n\n**Wish.** Once per dawn, while holding the weapon you can use an action to expend 1 charge and cast _wish_ . The weapon has 1d4 – 1 charges and loses this property when there are no charges left.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.264",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "mace-of-disruption",
  "fields": {
    "name": "Mace of Disruption",
    "desc": "Fiends and undead take an extra 2d6 radiant damage when hit with this weapon. When this weapon reduces a fiend or undead to 25 or fewer hit points, the creature makes a DC 15 Wisdom _saving throw_  or it is destroyed. On a successful save the creature becomes _frightened_  of you until the end of your next turn. \n\nWhile it is held, this weapon shines bright light in a 20-foot radius and dim light an additional 20 feet. ",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.264",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "mace-of-smiting",
  "fields": {
    "name": "Mace of Smiting",
    "desc": "You gain a +1 bonus to attack and damage rolls made with this magic weapon, which increases to +3 when used to attack a construct.\n\nWhen you use this weapon to make an attack and roll a natural 20, it deals an extra 2d6 bludgeoning damage, which increases to 4d6 against construct. When this weapon reduces a construct to 25 or fewer hit points, the creature is destroyed",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.265",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "mace-of-terror",
  "fields": {
    "name": "Mace of Terror",
    "desc": "This weapon has 3 charges and regains 1d3 charges each dawn. While you hold it, you can use an action to expend 1 charge and emanate terror in a 30-foot radius. Each creature you choose within the area makes a DC 15 Wisdom _saving throw_  or it becomes _frightened_  of you for 1 minute, moving away from you as fast as possible on its turns (it can only use the Dash action, try to escape anything preventing it from moving, or use the Dodge action if it cannot move or attempt escape) and remaining at least 30 feet from you. The creature cannot take reactions. At the end of each of its turns, a frightened creature can repeat the saving throw, ending the effect on a success.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.265",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "mantle-of-spell-resistance",
  "fields": {
    "name": "Mantle of Spell Resistance",
    "desc": "While wearing this cloak, you have _advantage_  on _saving throws_  against spells.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.265",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "manual-of-bodily-health",
  "fields": {
    "name": "Manual of Bodily Health",
    "desc": "This magical book contains surprisingly accurate advice on building endurance. Spending 48 hours over 6 days (or fewer) reading and following the book’s advice increases your Constitution score and your maximum Constitution score by 2\\. The manual then becomes a mundane item for a century before it regains its magic.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.266",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "manual-of-gainful-exercise",
  "fields": {
    "name": "Manual of Gainful Exercise",
    "desc": "This magical book outlines a vigorous exercise regimen. Spending 48 hours over 6 days (or fewer) reading and following the book’s regimen increases your Strength score and your maximum Strength score by 2\\. The manual then becomes a mundane item for a century before it regains its magic.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.266",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "manual-of-golems",
  "fields": {
    "name": "Manual of Golems",
    "desc": "This tome contains information and incantations necessary to make a particular type of golem. The GM chooses the type or determines it randomly. To decipher and use the manual, you must be a spellcaster with at least two 5th-level spell slots. A creature that can't use a _manual of golems_ and attempts to read it takes 6d6 psychic damage.\n\n| d20   | Golem | Time     | Cost       |\n|-------|-------|----------|------------|\n| 1-5   | Clay  | 30 days  | 65,000 gp  |\n| 6-17  | Flesh | 60 days  | 50,000 gp  |\n| 18    | Iron  | 120 days | 100,000 gp |\n| 19-20 | Stone | 90 days  | 80,000 gp  |\n\nTo create a golem, you must spend the time shown on the table, working without interruption with the manual at hand and resting no more than 8 hours per day. You must also pay the specified cost to purchase supplies.\n\nOnce you finish creating the golem, the book is consumed in eldritch flames. The golem becomes animate when the ashes of the manual are sprinkled on it. It is under your control, and it understands and obeys your spoken commands.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.266",
    "page_no": null,
    "type": "Wondrous item",
    "rarity": "very rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "manual-of-quickness-of-action",
  "fields": {
    "name": "Manual of Quickness of Action",
    "desc": "This magical book details workout routines for building coordination and speed. Spending 48 hours over 6 days (or fewer) reading and following the book’s regimen increases your Dexterity score and your maximum Dexterity score by 2\\. The manual then becomes a mundane item for a century before it regains its magic.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.267",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "marvelous-pigments",
  "fields": {
    "name": "Marvelous Pigments",
    "desc": "This boxed set of iridescent paints can be used to create inanimate objects, terrain features, doors, and even rooms with nothing but the stroke of a brush. When you touch the brush to a surface and concentrate on the image of the item you want to create, the paint flows from the brush, creating a painting. When complete, the object depicted becomes a real, three-dimensional object. \n\n* Small, simple objects take a single round. Larger objects, like doors or rooms, take more time. It takes 1 minute of concentration to cover 10 square feet of a surface, and 10 minutes to cover 100 square feet of a surface.\n* Objects created by the pigment are real and nonmagical—a door painted on a wall can be opened into whatever lies beyond. A pit becomes a real pit (be sure and note the depth for your total area). A tree will bloom and grow.\n* Objects created by the pigments are worth a maximum of 25 gold. Gemstones or fine clothing created by these pigments might look authentic, but close inspection reveals they are facsimiles made from cheaper materials.\n* When found the box contains 1d4 pots of pigment.\n* A pot of pigment can cover 1,000 square feet of a surface, creating a total area of 10,000 cubic feet of objects.\n* Energy created by the paints, such as a burst of radiant light or a wildfire, dissipates harmlessly and does not deal any damage.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.267",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "medallion-of-thoughts",
  "fields": {
    "name": "Medallion of Thoughts",
    "desc": "While you are wearing this ornate medallion, you can use an action to expend one of its three charges to cast __detect thoughts_  (DC 13). The medallion regains 1d3 expended charges every dawn.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.267",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "mirror-of-life-trapping",
  "fields": {
    "name": "Mirror of Life Trapping",
    "desc": "This elaborate 50 pound mirror hides an extradimensional prison beneath its smooth, silvery surface. \n\nYou can use an action to activate or deactivate the mirror by speaking its command word while within 5 feet. While active, when a creature other than you sees its reflection in the mirror while within 30 feet, it makes a DC 15 Charisma _saving throw_ . Creatures that are aware of the mirror’s nature have _advantage_ , and constructs automatically succeed. On a failure, the creature and all its possessions are trapped inside one of the mirror’s 12 extradimensional cells.\n\n* Each extradimensional cell is an infinite plane filled with thick fog. Creatures trapped within do not need to eat, drink, or sleep, nor do they age.\n* Creatures can escape via planar travel, but are otherwise trapped until freed.\n* If a creature is trapped but the mirror’s cells are already full, a randomly determined trapped creature is freed so the new creature may be trapped.\n* While within 5 feet of the mirror, you can use an action to call forth a trapped creature. The creature appears in the surface of the mirror, allowing you and the creature to communicate normally.\n* A trapped creature can be freed by using an action to speak a different command word. The creature appears in an unoccupied space near the mirror and facing away from it.\n\nWhen the mirror (AC 11, 10 hit points, vulnerability to bludgeoning damage) is reduced to 0 hit points it shatters, freeing all trapped creatures. The creatures appear in unoccupied spaces nearby.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.268",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "mithral-armor",
  "fields": {
    "name": "Mithral Armor",
    "desc": "Mithral is a light, flexible metal. A mithral chain shirt or breastplate can be worn under normal clothes. If the armor normally imposes disadvantage on Dexterity (Stealth) checks or has a Strength requirement, the mithral version of the armor doesn't.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.268",
    "page_no": null,
    "type": "Armor (medium or heavy)",
    "rarity": "uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "necklace-of-adaptation",
  "fields": {
    "name": "Necklace of Adaptation",
    "desc": "While wearing this finely-woven necklace, you can breathe normally in any environment and you have _advantage_  on _saving throws_  made against harmful gases, vapors, and other inhaled effects.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.268",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "necklace-of-fireballs",
  "fields": {
    "name": "Necklace of Fireballs",
    "desc": "This gorgeous necklace is affixed with 1d6+3 beads that radiate power. You can use an action to hurl a bead up to 60 feet. When the bead lands it detonates as a 3rd-level __fireball_ (save DC 15). \n\nYou can hurl multiple beads with the same action, increasing the spell level of the __fireball_  by 1 for each bead beyond the first.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.269",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "necklace-of-prayer-beads",
  "fields": {
    "name": "Necklace of Prayer Beads",
    "desc": "This many-beaded necklace helps mark prayers. Of the many types of gemstone beads, 1d4+2 are magical and can be removed from the necklace as a bonus action to cast a spell (described on Table: Necklace of Prayer Beads). There are 6 types of magic beads, and which are on the necklace are randomly determined or chosen by the Narrator.\n\nA necklace can have multiple beads of the same type. To use a bead, you must be wearing the necklace, and if it requires a spell save you use your spell save DC. Once a bead has been used, it loses its magic until the next dawn\n\n__**Table: Necklace of Prayer Beads**__\n| **d20** | **Bead of**  | **Spell**                                         |\n| ------- | ------------ | ------------------------------------------------- |\n| 1-6     | Blessing     | __bless_                                          |\n| 7-12    | Curing       | __cure wounds  (2nd-level) or lesser restoration_ |\n| 13-16   | Favor        | __greater restoration_                            |\n| 17-18   | Invigorating | __invigorated strikes_                            |\n| 19      | Summons      | __planar ally_                                    |\n| 20      | Wind         | __wind walk_                                      |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.269",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "nine-lives-stealer",
  "fields": {
    "name": "Nine Lives Stealer",
    "desc": "You gain a +2 bonus to attack and damage rolls made with this magic sword.\n\nThe sword has 1d8+1 charges. When you use the sword to score a critical hit against a creature that is not a construct or undead, if it has less than 100 hit points it makes a DC 15 Constitution _saving throw_  or it instantly dies as the sword rips the life force out of it. Each time a creature is killed in this manner the sword expends a charge. When all its charges are gone, the sword loses this property. ",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.269",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "oathbow",
  "fields": {
    "name": "Oathbow",
    "desc": "This bow whispers its urgent desire for the quick defeat of your enemies in Elvish when you nock an arrow. When you use this bow to make a _ranged weapon attack_  against a creature, you can swear an oath against the target of your attack and make it your sworn enemy until its death or dawn seven days later. You may choose a new sworn enemy following the next dawn after your current sworn enemy dies. \n\nYour ranged weapon attacks using this bow have advantage against your sworn enemy, and your sworn enemy cannot gain benefit from cover other than _total cover_ . You do not have _disadvantage_  on ranged weapon attacks with the bow that are at long range as long as your sworn enemy is your target, and on a hit your sworn enemy takes an extra 3d6 piercing damage.\n\nYou have _disadvantage_  on attacks made with weapons other than this bow while your sworn enemy lives.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.270",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "oil-of-etherealness",
  "fields": {
    "name": "Oil of Etherealness",
    "desc": "This misty white solution has turned to vapor in its vial, becoming liquid again when shaken. You can spend 10 minutes applying the ephemeral substance to a Medium or smaller creature, as well as its gear. One additional vial is required for each size category above Medium. A creature covered in the oil becomes ethereal (as the __etherealness_  spell) for 1 hour.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.270",
    "page_no": null,
    "type": "Potion",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "oil-of-sharpness",
  "fields": {
    "name": "Oil of Sharpness",
    "desc": "It takes 1 minute to use this glittering oil to cover a weapon that deals slashing or piercing damage, or 5 pieces of ammunition that deals slashing or piercing damage. For 1 hour the weapon or ammunition is magical, and when using it you gain a +3 bonus to attack and damage rolls.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.270",
    "page_no": null,
    "type": "Potion",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "oil-of-slipperiness",
  "fields": {
    "name": "Oil of Slipperiness",
    "desc": "You can spend 10 minutes applying this thick black oil to a Medium or smaller creature, as well as its gear. One additional vial is required for each size category above Medium. A creature covered in the oil gains the effect of a __freedom of movement_ spell for 2 hours. Alternatively, you can use an action to pour the oil on the ground next to you, making a 10-foot square slippery (as the _grease_ spell) for 8 hours.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.271",
    "page_no": null,
    "type": "Potion",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "orb-of-dragonkind",
  "fields": {
    "name": "Orb of Dragonkind",
    "desc": "Long ago the souls of five evil dragons were ripped from their corporeal bodies and captured with arcana by mages that sought to end the tyranny of wicked winged serpents. Each is contained within an intricately inscribed crystal globe 10 inches across—though when the magic within is called upon, an orb swells to double its size and glows with a faint light revealing the color of the scales that once belonged to what little remains of the creature that now resides in it. \n\nWhile you are attuned to and holding a_n Orb of Dragonkind,_ you can use an action and speak a command word to attempt to control the draconic soul within by making a DC 15 Charisma check. On a success, you can control the _Orb of Dragonkind,_ or on a failure you are charmed by it. Both effects last until you are no longer attuned to the orb.\n\nWhile you are charmed by the orb, you cannot choose to end your attunement to it. In addition, the orb can innately cast __suggestion_ on you at will (save DC 18) to compel you to commit evil acts that serve its purposes—exacting revenge, attaining its freedom, spread suffering and ruin, encourage the worship of foul draconic deities, collect the other _orbs of dragonkind_, or whatever else the Narrator deems fit. \n\n**Legends and Lore** Success on an Arcana or History check reveals the following:\n\n**DC 15** This is an _Orb of Dragonkind,_ an artifact with the power to control dragons. \n\n**DC 20** Five orbs were made, each containing the soul of an evil dragon.\n\n**DC 25** The orb can summon evil dragons, but does not actually control them.\n\n**Artifact Properties**\n\nAn _Orb of Dragonkind_ has two lesser artifact benefits, one lesser artifact detriment, and one greater artifact detriment.\n\n**Magic**\n\nWhile you are controlling an _Orb of Dragonkind,_ you can use an action to cast detect magic at will. You can also expend 1 or more charges to cast _detect magic_ (no charge), __daylight  (_1 charge), __death ward_  (2 charges), _cure wounds_  (5th-level version, 3 charges), or __scrying_ (save DC 18; 3 charges). \n\n**The orb has 7 charges and regains 1d4 + 3 expended charges each dawn.**\n\n**Call Dragons**\n\nWhile you are controlling an _Orb of Dragonkind_, you can use an action to send a telepathic message in a 40-mile radius. Evil dragons that are mortal and in the area are compelled to take the quickest and most direct route to the orb, though they may not be friendly or pleased with being forced to answer the call. Once this property has been used, you cannot use it again for 1 hour.\n\n**Destroying an Orb**\n\nDespite its glass appearance, an _Orb of Dragonkind_ is immune to most types of damage (including draconic breath weapons and natural attacks), but they can be destroyed by the __disintegrate_ spell or a single strike from a weapon with a +3 magical bonus to attack and damage rolls.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.310",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Artifact",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "pearl-of-power",
  "fields": {
    "name": "Pearl of Power",
    "desc": "While holding this lustrous pearl, you can use an action to speak its command word and regain one expended spell slot of up to 3rd-level. If restoring a higher level slot, the new slot is 3rd-level. Once used, the pearl loses its magic until the next dawn.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.271",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement by a spellcaster",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "periapt-of-health",
  "fields": {
    "name": "Periapt of Health",
    "desc": "While wearing this pendant, you are immune to _diseases_  (you cannot contract any disease, and the effects if any ongoing diseases are suppressed).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.271",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "periapt-of-proof-against-poison",
  "fields": {
    "name": "Periapt of Proof Against Poison",
    "desc": "A slick film surrounds this delicate pendant and makes it shimmer. While wearing this pendant, you are immune to poison damage and the _poisoned_  condition.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.272",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "periapt-of-wound-closure",
  "fields": {
    "name": "Periapt of Wound Closure",
    "desc": "Engraved with symbols of healing, this warm silver pendant prevents you from dying.\n\n* While wearing this pendant, you automatically stabilize when dying. You may still roll your Death _saving throw_  to try and roll a 20, but may only roll once on each of your turns and no more than three times.\n* Whenever you roll a Hit Die to regain hit points, you regain twice as many as normal.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.272",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "philter-of-love",
  "fields": {
    "name": "Philter of Love",
    "desc": "After drinking this philter, the next time you see a creature in the next 10 minutes, you become _charmed_  by that creature for 1 hour. If you would normally be attracted to the creature, while charmed you believe it to be your true love.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.272",
    "page_no": null,
    "type": "Potion",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "pipes-of-haunting",
  "fields": {
    "name": "Pipes of Haunting",
    "desc": "Using these pipes requires proficiency with wind instruments. You can use an action and expend 1 charge to play them and create an eerie, spellbinding tune. Each creature within 30 feet that hears you play makes a DC 15 Wisdom _saving throw_  or becomes _frightened_  of you for 1 minute. You may choose for nonhostile creatures in the area to automatically succeed on the saving throw. A frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. A creature that succeeds on its saving throw is immune to these _pipes of haunting_ for 24 hours. The pipes have 3 charges and regain 1d3 charges each dawn.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.273",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "pipes-of-the-sewers",
  "fields": {
    "name": "Pipes of the Sewers",
    "desc": "You must be proficient with wind instruments to use these pipes. The pipes have 3 charges and regain 1d3 expended charges at dawn. \n\nYou can use an action to expend 1 to 3 charges and play the pipes, summoning a _swarm of rats_  for each expended charge. Summoned swarms are not under anyone’s control and appear by the shortest available route, and if there are not enough rats within a half mile (at the Narrator’s discretion) for this to take effect the expended charges are wasted and no swarm is summoned.\n\nWhile you are using an action to play the pipes, you can make a Charisma check contested by the Wisdom check of a swarm of rats within 30 feet. On a failure, the swarm acts normally and is immune to the pipes for 24 hours. On a success, the swarm becomes friendly to you and your allies until you stop playing the pipes, following your commands. If not given any commands a friendly swarm defends itself but otherwise takes no actions. Any friendly swarm that begins its turn unable to hear music from the pipes breaks your control, behaving as normal and immune to the effects of the pipes for 24 hours.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.273",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "plate-armor-of-etherealness",
  "fields": {
    "name": "Plate Armor of Etherealness",
    "desc": "While wearing and attuned to this set of armor, once per dawn you can use an action to cast the __etherealness_  spell. The spell lasts for 10 minutes, until the armor is removed, or until you use an action to end it.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.273",
    "page_no": null,
    "type": "Armor",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "portable-hole",
  "fields": {
    "name": "Portable Hole",
    "desc": "While not in use, this item appears as a cloth the color of darkness. When unfolded, it opens up into a circular sheet that is 6 feet in diameter. \n\nYou can use an action to unfold the _portable hole_ on a stable solid surface. When unfolded, the item creates a hole 10 feet deep that leads to a cylindrical extra dimensional space which cannot be used to create open passages. Closing the hole requires an action and involves you taking a hold of the edges and folding it up. No matter its contents, the hole weighs next to nothing. \n\nFood or water placed in a closed _portable hole_ immediately and permanently lose all nourishing qualities—after being in the item, water no longer slakes thirst and food does not sate hunger or nourish. In a similar fashion, the body of a dead creature placed in the portable hole cannot be restored to life by __revivify , raise dead_ , or other similar magic. Breathing creatures inside a closed _portable hole_ can survive for up to 2d4 minutes divided by the number of creatures (minimum 1 minute), after which time they begin to _suffocate_ .\n\nCreatures inside the hole while it’s open can exit the hole by simply climbing out. A creature still within the hole can use an action to make a DC 10 Strength check to escape as it is being closed. On a success, the creature appears within 5 feet of the item or creature carrying it.\n\nPlacing a _portable hole_ inside another extradimensional storage device such as a _bag of holding_ or __handy haversack_  results in planar rift that destroys both items and pulls everything within 10 feet into the Astral Plane. The rift then closes and disappears.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.274",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-animal-friendship",
  "fields": {
    "name": "Potion of Animal Friendship",
    "desc": "After drinking this potion, for the next hour you can cast _animal friendship_ (save DC 13) at will.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.274",
    "page_no": null,
    "type": "Potion",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-clairvoyance",
  "fields": {
    "name": "Potion of Clairvoyance",
    "desc": "This dark liquid has a copper sheen. After drinking this potion, you are affected as if you had cast _clairvoyance_ .",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.274",
    "page_no": null,
    "type": "Potion",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-climbing",
  "fields": {
    "name": "Potion of Climbing",
    "desc": "After drinking this potion, for the next hour you gain a climbing speed equal to your Speed. While the effect lasts, you have _advantage_  on checks made to climb.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.275",
    "page_no": null,
    "type": "Potion",
    "rarity": "Common",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-diminution",
  "fields": {
    "name": "Potion of Diminution",
    "desc": "A golden acorn floats in the translucent liquid, dropping from the top of the vial and floating back up every few seconds. After drinking this potion, your size is reduced by half (as the __enlarge/reduce_  spell but without need for _concentration_ ) for 1d4 hours.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.275",
    "page_no": null,
    "type": "Potion",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-flying",
  "fields": {
    "name": "Potion of Flying",
    "desc": "The pale blue liquid in this vial floats leaving a gap at the bottom. After drinking this potion, for the next hour you gain a flying speed equal to your Speed and the ability to hover. If the effect ends while you are in midair you fall unless another item or effect stops you.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.275",
    "page_no": null,
    "type": "Potion",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-gaseous-form",
  "fields": {
    "name": "Potion of Gaseous Form",
    "desc": "The pale, translucent liquid in this vial causes the flask to float slightly. After drinking this potion, for the next hour you are affected as if you had cast __gaseous form_ (but without the need for _concentration_ ). You can use a bonus action to end the effect early.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.276",
    "page_no": null,
    "type": "Potion",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-giant-strength",
  "fields": {
    "name": "Potion of Giant Strength",
    "desc": "After you drink this potion, for the next hour your Strength score increases to match the giant whose parts were used to create it (see Table: Potion of Giant Strength). The potion has no effect if your Strength is equal to or greater than the giant’s Strength score.\n\n__**Table: Potion of Giant Strength**__\n| **Giant**     | **Strength Score** | **Rarity** | **Cost**  | **Appearance**       |\n| ------------- | ------------------ | ---------- | --------- | -------------------- |\n| _Hill giant_  | 20                 | Uncommon   | 300 gp    | Muddy, gray          |\n| _Frost giant_ | 22                 | Rare       | 800 gp    | Transparent, viscous |\n| _Stone giant_ | 23                 | Rare       | 800 gp    | Silver, shimmering   |\n| _Fire giant_  | 25                 | Rare       | 2,000 gp  | Orange, volatile     |\n| _Cloud giant_ | 27                 | Very rare  | 5,000 gp  | Opaque white         |\n| _Storm giant_ | 29                 | Legendary  | 52,500 gp | Swirling black       |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.276",
    "page_no": null,
    "type": "Potion",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-growth",
  "fields": {
    "name": "Potion of Growth",
    "desc": "A golden acorn floating in this translucent liquid grows and retracts roots every few seconds. After drinking this potion, for the next 1d4 hours your size is doubled (as the __enlarge/reduce_  spell but without need for _concentration_ ).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.276",
    "page_no": null,
    "type": "Potion",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-healing",
  "fields": {
    "name": "Potion of Healing",
    "desc": "Drinking this swirling red liquid restores hit points as detailed on the Potions of Healing table.\n\n__**Table: Potions of Healing**__\n| **Potion**         | **Rarity** | **Hit Points** | **Cost** | **Carats needed** |\n| ------------------ | ---------- | -------------- | -------- | ----------------- |\n| _Healing_          | Common     | 2d4+2          | 50 gp    | 1                 |\n| _Greater healing_  | Uncommon   | 4d4+4          | 150 gp   | 2                 |\n| _Superior healing_ | Rare       | 8d4+8          | 550 gp   | 10                |\n| _Supreme healing_  | Rare       | 10d4+20        | 1,500 gp | 50                |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.277",
    "page_no": null,
    "type": "Potion",
    "rarity": "Common",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-heroism",
  "fields": {
    "name": "Potion of Heroism",
    "desc": "After drinking this glowing white potion, for the next hour you gain 10 temporary hit points and the benefits of the _bless_  spell (but without the need for _concentration_ ).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.277",
    "page_no": null,
    "type": "Potion",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-invisibility",
  "fields": {
    "name": "Potion of Invisibility",
    "desc": "The silver liquid in this vial is visible only when shaken or disturbed. After drinking this potion, for the next hour you and anything you’re wearing or carrying becomes _invisible_ . The effect ends early if you attack or cast a spell.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.277",
    "page_no": null,
    "type": "Potion",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-mind-reading",
  "fields": {
    "name": "Potion of Mind Reading",
    "desc": "After drinking this fizzy deep green lime potion, for the next hour you are affected as if you had cast __detect thoughts_  (save DC 13).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.278",
    "page_no": null,
    "type": "Potion",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-poison",
  "fields": {
    "name": "Potion of Poison",
    "desc": "This potion comes in many guises, and always appears to be a beneficial potion (most often the swirling red of a _potion of healing_ ). Its true intent, however, is deadly. \n\nWhen you drink this potion you take 3d6 poison damage and make a DC 13 Constitution _saving throw_  or become _poisoned_ . At the beginning of each of your turns while poisoned in this way, you take 3d6 poison damage. At the end of each of your turns you repeat the saving throw, decreasing the damage dealt by the poison by 1d6 for each successful save. You cease to be poisoned when the damage is reduced to 0.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.278",
    "page_no": null,
    "type": "Potion",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-resistance",
  "fields": {
    "name": "Potion of Resistance",
    "desc": "After you drink this potion, for the next hour you gain resistance to a single type of damage (chosen by the Narrator or determined randomly).\n\n__**Table: Potion of Resistance**__\n| **d10** | **Damage Type** |\n| ------- | --------------- |\n| 1       | Thunder         |\n| 2       | Lightning       |\n| 3       | Cold            |\n| 4       | Poison          |\n| 5       | Fire            |\n| 6       | Psychic         |\n| 7       | Acid            |\n| 8       | Necrotic        |\n| 9       | Radiant         |\n| 10      | Force           |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.278",
    "page_no": null,
    "type": "Potion",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-speed",
  "fields": {
    "name": "Potion of Speed",
    "desc": "An opaque gray liquid that occasionally flashes with sparks of electricity. After drinking this potion, for the next minute you gain the benefits of a _haste_  spell (without the need for _concentration_ ).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.279",
    "page_no": null,
    "type": "Potion",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "potion-of-water-breathing",
  "fields": {
    "name": "Potion of Water Breathing",
    "desc": "After drinking this murky blue potion, you are able to _breathe underwater_  for 1 hour.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.279",
    "page_no": null,
    "type": "Potion",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "restorative-ointment",
  "fields": {
    "name": "Restorative Ointment",
    "desc": "This green glass jar holds 1d4+1 doses of a fresh-smelling mixture. You can use an action to swallow or apply one dose, restoring 2d8+2 hit points and curing both _poison_  and _disease_ .",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.279",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-animal-influence",
  "fields": {
    "name": "Ring of Animal Influence",
    "desc": "While wearing this ring, you can expend 1 of its 3 charges to cast one of the following spells (save DC 13): _animal friendship , fear_  targeting only beasts that have an Intelligence of 3 or less, or _speak with animals_ . The ring regains 1d3 expended charges at dawn.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.280",
    "page_no": null,
    "type": "Ring",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-djinni-summoning",
  "fields": {
    "name": "Ring of Djinni Summoning",
    "desc": "While you are wearing this ring, you can use an action to speak its command word and choose an unoccupied space within 120 feet. You summon a _djinni_  from the Elemental Plane of Air in that space. It is friendly to you and your companions, and obeys any command you give it, no matter what language you use. If you do not command it, the djinni takes no other actions but to defend itself.\n\nThe djinni remains for up to 1 hour as long as you _concentrate_  (as if concentrating on a spell), or until it is reduced to 0 hit points. It then returns to its home plane. After the djinni departs, it cannot be summoned again for 24 hours. The ring becomes nonmagical if the djinni dies.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.280",
    "page_no": null,
    "type": "Ring",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-elemental-command",
  "fields": {
    "name": "Ring of Elemental Command",
    "desc": "This ring is attuned to one of the four Elemental Planes, as determined by the Narrator. While wearing this ring, you have _advantage_  on _attack rolls_  against elementals from the linked plane, and they have _disadvantage_  on attack rolls against you. You can also expend 2 of the ring’s charges to cast _` Freelinking: Node title dominate does not exist `_ monster on an elemental native to the linked plane. The ring imparts additional benefits based on the linked plane.\n\nThe ring has 5 charges and regains 1d4+1 charges at dawn. Spells cast from the ring have a save DC of 17.\n\n**Ring of Air Elemental Command**. You can speak and understand Auran. While wearing this ring, when you fall you descend at a rate of 60 feet per round and take no damage from landing.  \nIf you help kill an air elemental while attuned to this ring, you gain the following:\n\n* Resistance to lightning damage.\n* A flying speed equal to your Speed and the ability to hover.\n* The ability to cast the following spells by expending the necessary charges: __chain lightning_  (3 charges), __gust of wind_  (2 charges), __wind wall_  (1 charge).\n\n**Ring of Earth Elemental Command.** You can speak and understand Terran. While wearing this ring, you are not slowed by _difficult terrain_  composed of rocks, dirt, and other earth.  \nIf you help kill an earth elemental while attuned to this ring, you gain the following:\n\n* Resistance to acid damage.\n* The ability to move through solid rock and earth as if it were _difficult terrain_ . If you end your turn in those areas, you are pushed into the nearest unoccupied space you last occupied.\n* The ability to cast the following spells by expending the necessary charges: _stone shape_  (2 charges), __stoneskin_  (3 charges), _wall of stone_  (3 charges).\n\n**Ring of Fire Elemental Command**. You can speak and understand Ignan. While wearing this ring, you have resistance to fire damage.  \nIf you help kill a fire elemental while attuned to the ring, you gain the following:\n\n* Immunity to fire damage.\n* The ability to cast the following spells by expending the necessary charges: _burning hands_ (1 charge), _fireball_ (2 charges), _wall of fire_ (3 charges).\n\n**Ring of Water Elemental Command.** You can speak and understand Aquan. While wearing this ring, you can stand on and move across any liquid surface as if it were solid ground.  \nIf you help kill a water elemental while attuned to the ring, you gain the following:\n\n* The ability to breathe underwater and have a swimming speed equal to your Speed.\n* The ability to cast the following spells by expending the necessary charges: _create or_ _destroy water_ (1 charge), _ice storm_ (2 charges), _control water_ (3 charges), _wall of ice_ (3 charges).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.280",
    "page_no": null,
    "type": "Ring",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-evasion",
  "fields": {
    "name": "Ring of Evasion",
    "desc": "While wearing this ring, if you fail a Dexterity _saving throw_ , you can use your reaction to expend 1 charge to succeed instead. The ring has 3 charges and regains 1d3 expended charges at dawn.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.280",
    "page_no": null,
    "type": "Ring",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-feather-falling",
  "fields": {
    "name": "Ring of Feather Falling",
    "desc": "While wearing this ring, when you fall you descend at a speed of 60 feet per round and take no damage from landing.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.281",
    "page_no": null,
    "type": "Ring",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-free-action",
  "fields": {
    "name": "Ring of Free Action",
    "desc": "While wearing this ring, you are not slowed by _difficult terrain_ , and magic cannot cause you to be _restrained_ , _paralyzed_ , or slow your movement.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.281",
    "page_no": null,
    "type": "Ring",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-invisibility",
  "fields": {
    "name": "Ring of Invisibility",
    "desc": "While wearing this ring, you can use an action to turn _invisible_  along with anything you are carrying or wearing. You remain invisible until the ring is removed, you attack or cast a spell, or you use a bonus action to become visible.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.282",
    "page_no": null,
    "type": "Ring",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-jumping",
  "fields": {
    "name": "Ring of Jumping",
    "desc": "While wearing this ring, you can use a bonus action to cast the _jump_  spell on yourself.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.282",
    "page_no": null,
    "type": "Ring",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-mind-shielding",
  "fields": {
    "name": "Ring of Mind Shielding",
    "desc": "While wearing this ring, creatures cannot magically read your thoughts, know if you’re lying, or discern your creature type, and you can only be communicated with telepathically if you allow it.\n\nIf you die while wearing this ring, your soul enters the ring upon death, unless another soul already occupies it. You choose when your soul leaves the ring. While within the ring, you can communicate telepathically with anyone wearing it (this communication cannot be prevented.)\n\nYou can use an action to make the ring _invisible_ , and it remains so until it is removed, you die, or you use an action to make it visible.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.282",
    "page_no": null,
    "type": "Ring",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-protection",
  "fields": {
    "name": "Ring of Protection",
    "desc": "While wearing this ring, you gain a +1 bonus to Armor Class and _saving throws_ .",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.282",
    "page_no": null,
    "type": "Ring",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-regeneration",
  "fields": {
    "name": "Ring of Regeneration",
    "desc": "While wearing this ring, as long as you have at least 1 hit point you regain 1d6 hit points every 10 minutes. As long as you have at least 1 hit point the entire time, when you lose a body part over the next 1d6 + 1 days it completely regrows and you regain full functionality.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.283",
    "page_no": null,
    "type": "Ring",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-resistance",
  "fields": {
    "name": "Ring of Resistance",
    "desc": "While wearing this ring, you have resistance to one type of damage based on the ring’s gemstone (either chosen by the Narrator or determined randomly).\n\n__**Table: Ring of Resistance**__\n| **d10** | **Damage Type** | **Gem**     |\n| ------- | --------------- | ----------- |\n| 1       | Acid            | Peridot     |\n| 2       | Cold            | Aquamarine  |\n| 3       | Fire            | Garnet      |\n| 4       | Force           | Sapphire    |\n| 5       | Lightning       | Citrine     |\n| 6       | Necrotic        | Labradorite |\n| 7       | Poison          | Amethyst    |\n| 8       | Psychic         | Moonstone   |\n| 9       | Radiant         | Topaz       |\n| 10      | Thunder         | Spinel      |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.283",
    "page_no": null,
    "type": "Ring",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-shooting-stars",
  "fields": {
    "name": "Ring of Shooting Stars",
    "desc": "While wearing this ring, if you are in _dim light or darkness_  you can use an action to cast _dancing lights_ or _light_. The ring has 6 charges and regains 1d6 expended charges at dawn.\n\n**Faerie Fire.** You can use an action and expend 1 charge to cast _faerie fire ._\n\n**Ball Lightning**. You can use an action and expend 2 charges to create up to four 3-foot-diameter lightning spheres. The number of spheres created determines each sphere’s intensity (see Table: Ball Lightning), each sheds light in a 30-foot radius, and they remain up to 1 minute as long as you _concentrate_  (as if concentrating on a spell). As a bonus action, you can move each sphere up to 30 feet, but no further than 120 feet from you.\n\nWhen a creature other than you comes within 5 feet of a sphere, the sphere discharges lightning at that creature and then disappears. The creature makes a DC 15 Dexterity _saving throw_  or takes lightning damage based on the sphere’s intensity.\n\nShooting Stars. You can use an action to expend 1 to 3 charges. For each expended charge, you shoot a glittering mote of light at a point you can see within 60 feet where it explodes in a 15-foot-cube of sparks. Each creature in the area makes a DC 15 Dexterity _saving throw_ , taking 5d4 fire damage on a failed save, or half damage on a success.\n\n__**Table: Ball Lightning**__\n| **Spheres** | **Lightning Damage** |\n| ----------- | -------------------- |\n| 1           | 4d12                 |\n| 2           | 5d4                  |\n| 3           | 2d6                  |\n| 4           | 2d4                  |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.283",
    "page_no": null,
    "type": "Ring",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-spell-storing",
  "fields": {
    "name": "Ring of Spell Storing",
    "desc": "This ring stores spells cast into it, and holds them for later use. While wearing this ring, you can cast any spell stored within it. The spell has the slot level, spell save DC, spell attack modifier, and spellcasting ability of the original caster. Once the spell is cast, it is no longer stored within the ring.\n\nWhen found, the ring contains 1d6 – 1 levels of stored spells, as determined by the Narrator. The ring can store up to 5 levels worth of spells at a time. To store a spell, a creature casts any spell of 1st- to 5th-level while touching the ring. The spell has no immediate effect. The level the spell is cast at determines how much space it uses. If the ring cannot store the spell, the spell fails and the spell slot is wasted.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.284",
    "page_no": null,
    "type": "Ring",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-spell-turning",
  "fields": {
    "name": "Ring of Spell Turning",
    "desc": "While wearing this ring, you have _advantage_  on _saving throws_  against spells that target only you (not an area of effect spell). Additionally, on a saving throw with a natural 20 if the spell is 7th-level or lower, the spell instead targets the caster, using their original slot level, spell save DC, spell attack modifier, and spellcasting ability.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.284",
    "page_no": null,
    "type": "Ring",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-swimming",
  "fields": {
    "name": "Ring of Swimming",
    "desc": "While wearing this ring, you have a swim speed of 40 feet.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.285",
    "page_no": null,
    "type": "Ring",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-telekinesis",
  "fields": {
    "name": "Ring of Telekinesis",
    "desc": "While wearing this ring, you can cast __telekinesis_ , but you are only able to target unattended objects.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.285",
    "page_no": null,
    "type": "Ring",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-the-ram",
  "fields": {
    "name": "Ring of the Ram",
    "desc": "This ring has 3 charges and regains 1d3 expended charges at dawn. While wearing this ring, you can use an action to expend 1 to 3 charges and choose a creature you can see within 60 feet. A spectral ram’s head launches from the ring to slam into the creature, making its _attack roll_  with a +7 bonus. On a hit, for every expended charge the attack deals 2d10 force damage and the creature is pushed 5 feet away. \n\nAdditionally, you can use an action to expend 1 to 3 charges to break an unattended object you can see within 60 feet. The ring makes a Strength check with a +5 bonus for each expended charge",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.285",
    "page_no": null,
    "type": "Ring",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-three-wishes",
  "fields": {
    "name": "Ring of Three Wishes",
    "desc": "While wearing this ring, you can use an action to expend 1 of its 3 charges to cast __wish_ . When all the ring’s charges are expended, it loses its magic.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.286",
    "page_no": null,
    "type": "Ring",
    "rarity": "Legendary",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-warmth",
  "fields": {
    "name": "Ring of Warmth",
    "desc": "While wearing this ring, you have resistance to cold damage. Additionally, you and anything you are wearing or carrying remain unharmed by temperatures as low as –50° Fahrenheit (–46° Celsius).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.286",
    "page_no": null,
    "type": "Ring",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-water-walking",
  "fields": {
    "name": "Ring of Water Walking",
    "desc": "While wearing this ring, you can choose to stand on or move across any liquid surface as if it were solid ground.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.286",
    "page_no": null,
    "type": "Ring",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "ring-of-x-ray-vision",
  "fields": {
    "name": "Ring of X-Ray Vision",
    "desc": "While wearing this ring, you can use an action to speak its command word and see through solid objects and matter in a 30-foot radius for 1 minute. Solid objects within the radius appear ghostly and transparent, allowing light to pass through them. You can see through up 3 feet of wood and dirt, 1 foot of stone, and 1 inch of common metal (thicker materials or a thin sheet of lead block the vision).\n\nWhen you use this ring again before taking a _long rest_ , you make a DC 15 Constitution _saving throw_  or suffer one level of _fatigue_  and one level of _strife_ .",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.287",
    "page_no": null,
    "type": "Ring",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "robe-of-eyes",
  "fields": {
    "name": "Robe of Eyes",
    "desc": "Numerous upraised eyes are sewn into the fabric of this robe. You gain the following benefits while attuned to and wearing the robe:\n\n* _Advantage_  on sight-based Perception checks.\n* Darkvision to a range of 120 feet.\n* The ability to see 120 feet into the Ethereal Plane.\n* The ability to see _invisible_  creatures and objects within 120 feet.\n* The ability to see in all directions.\n* You are always considered to have your eyes open and may not close or avert them.\n\n When a _daylight_ or __light_ spell is cast within 5 feet of you or on the robe, you are _blinded_  for 1 minute. At the end of each of your turns, you make a DC 11 (_light)_ or DC 15 (_daylight_) Constitution _saving throw_  to end the condition.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.287",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "robe-of-scintillating-colors",
  "fields": {
    "name": "Robe of Scintillating Colors",
    "desc": "While wearing and attuned to this robe of stimulating and lively colors, you can use an action to expend 1 charge and make the garment to emit _bright kaleidoscopic light_  for 30 feet and dim light for an additional 30 feet. The light lasts until the end of your next turn. Creatures that can see you have _disadvantage_  on _attack rolls_  against you, and creatures within 30 feet that can see you when the light is emitted make a DC 15 Wisdom _saving throw_  or are _stunned_  until the end of your next turn.\n\nThe robe has 3 charges and regains 1d3 expended charges at dawn.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.287",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "robe-of-stars",
  "fields": {
    "name": "Robe of Stars",
    "desc": "This robe is the color of the night sky and has a half dozen magical metal stars sewn into it. You gain the following benefits while attuned to and wearing the robe:\n\n* A +1 bonus to _saving throws_\n* You can use an action to shift to the Astral Plane along with everything you are wearing and carrying. You remain there until you use an action to return, appearing either in the space you last occupied or the nearest unoccupied space.\n\nUp to 6 times each day, you can use an action to pull a star from the robe to cast _magic missile_  (as a 5th-level spell). At dusk 1d6 removed stars reappear.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.288",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "robe-of-the-archmagi",
  "fields": {
    "name": "Robe of the Archmagi",
    "desc": "This elegant garment is adorned with runes sewn with metallic thread. You gain the following benefits while attuned to and wearing the robe:\n\n* While not wearing armor, your Armor Class is 15 + your Dexterity modifier.\n* Advantage on _saving throws_  against spells and other magical effects.\n* Your _spell save DC and spell attack bonus_  are increased by 2.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.288",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "robe-of-useful-items",
  "fields": {
    "name": "Robe of Useful Items",
    "desc": "Leather patches of various shapes and colors are sewn into this robe. While attuned to and wearing the robe, you can use an action to detach one of the patches, causing it to become the object it represents. Once the last patch is removed, the robe loses its magical properties.\n\nThe robe has two of each of the following patches: \n\n* _Dagger_\n* _Bullseye lantern_  (filled and lit)\n* _Steel mirror_\n* 10-foot _pole_\n* _Hempen rope_  (50 feet, coiled)\n* _Sack_\n\nIn addition, the robe has 4d4 other patches (either chosen by the Narrator or randomly determined).\n\n__**Table: Robe of Useful Items**__\n| **d100** | **Patch**                                                                                                                                                                                                |\n| -------- | -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| 01–02    | Spade, _bucket_                                                                                                                                                                                          |\n| 03–04    | Pair of empty _waterskins_                                                                                                                                                                               |\n| 05–06    | Luxurious _blanket_                                                                                                                                                                                      |\n| 07–08    | _Grappling hook_                                                                                                                                                                                         |\n| 09–10    | 10 _iron spikes_                                                                                                                                                                                         |\n| 11–12    | _Miner’s pick_                                                                                                                                                                                           |\n| 13–14    | 10 _pitons_                                                                                                                                                                                              |\n| 15–18    | _Wheelchair_                                                                                                                                                                                             |\n| 19–20    | _Flash bomb_ , _smoke bomb_                                                                                                                                                                              |\n| 21–22    | _Block and tackle_ , _bar of soap_                                                                                                                                                                       |\n| 23–25    | Chalk, _crowbar_ , hammer                                                                                                                                                                                |\n| 26       | _Medium cage_                                                                                                                                                                                            |\n| 27–29    | Roll 1d4 (1: _fishing snare_ , 2: _hunting snare_ , 3–4: _hunting trap_ )                                                                                                                                |\n| 30       | _Sled_                                                                                                                                                                                                   |\n| 31–32    | _Cold weather gear_                                                                                                                                                                                      |\n| 33–35    | Roll 1d4 (1–2: _one person tent_ , 3: _two person tent_ , 4: _communal tent_ )                                                                                                                           |\n| 36–37    | 2 _alchemical torches_                                                                                                                                                                                   |\n| 38       | Blank _spellbook_                                                                                                                                                                                        |\n| 39–40    | 10-foot _chain_                                                                                                                                                                                          |\n| 41–42    | _Tinderbox_                                                                                                                                                                                              |\n| 43–44    | _Signal whistle_  and a _small bell_                                                                                                                                                                     |\n| 45–46    | _Backpack_                                                                                                                                                                                               |\n| 47–50    | 4 bags of _caltrops_                                                                                                                                                                                     |\n| 51       | _Mosquito netting_                                                                                                                                                                                       |\n| 52–55    | _Prosthetic leg or foot_                                                                                                                                                                                 |\n| 56–59    | 4 bags of _ball bearings_                                                                                                                                                                                |\n| 60       | _Large cage_                                                                                                                                                                                             |\n| 61–62    | _Merchant’s scales_ , stick of _incense_                                                                                                                                                                 |\n| 63       | _Barrel_                                                                                                                                                                                                 |\n| 64–66    | _Prosthetic arm or hand_                                                                                                                                                                                 |\n| 67–68    | Bottle of ink, inkpen, sealing wax, 2 sheets of paper                                                                                                                                                    |\n| 69–70    | Vial of perfume                                                                                                                                                                                          |\n| 71–72    | _Portable ram_                                                                                                                                                                                           |\n| 73       | _Huge cage_                                                                                                                                                                                              |\n| 74–75    | _Marshland gear_                                                                                                                                                                                         |\n| 76–79    | _Antitoxin_                                                                                                                                                                                              |\n| 80–81    | _Healer’s satchel_  (10 uses)                                                                                                                                                                            |\n| 82–83    | 10 _bandages_  sealed in oilskin                                                                                                                                                                         |\n| 84–86    | _Cart_                                                                                                                                                                                                   |\n| 87–89    | _12-foot long rowboat_                                                                                                                                                                                   |\n| 90       | _Lock_                                                                                                                                                                                                   |\n| 91–92    | Pit (a cube 10 feet on a side) which you can place on the ground within 10 feet                                                                                                                          |\n| 93–94    | _Greataxe_                                                                                                                                                                                               |\n| 95–96    | 24-foot long wooden folding ladder (each section is 6 feet)                                                                                                                                              |\n| 97–98    | Fully glazed window that changes to fit a hole in a wall no larger than 10 feet in any direction                                                                                                         |\n| 99–100   | Iron door (up to 10 feet wide and 10 feet high, barred on one side of your choice), which you can place in an opening you can reach (the door conforms to fit the opening, attaching and hinging itself) |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.289",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "rod-of-absorption",
  "fields": {
    "name": "Rod of Absorption",
    "desc": "While holding this rod, when you are the only target of a spell you can use your reaction to absorb it as it is being cast. An absorbed spell has no effect and its energy is stored within the rod. The spell’s energy equals the spell levels used to cast it. The rod can store up to 50 spell levels worth of energy over the course of its existence. The rod cannot hold more than 50 spell levels worth of energy. If the rod does not have the space to store a spell and you try to absorb it, the rod has no effect.\n\nAfter attuning to the rod you know how much energy it currently contains and how much it has held over the course of its existence. A spellcaster can expend the energy in the rod and convert it to spell slots—for example, you can expend 3 spell levels of energy from the rod to cast a 3rd-level spell, even if you no longer have the spell slots to cast it. The spell must be a spell you know or have prepared, at a level you can cast it, and no higher than 5th-level.\n\nWhen found the rod contains 1d10 spell levels. A rod that can no longer store energy and no longer has any energy remaining within it loses its magical properties.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.289",
    "page_no": null,
    "type": "Rod",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "rod-of-alertness",
  "fields": {
    "name": "Rod of Alertness",
    "desc": "While holding this rod, you have _advantage_  on Perception checks and _initiative_  rolls, and as an action you can cast the following spells: __detect evil and good , detect magic , detect poison and disease ,_ see __invisibility ._\n\n**Protective Aura**. Once per dawn, you can use an action to plant the rod in the ground and speak its command word, causing it to emit _bright light_  in a 60-foot radius and dim light for an additional 60 feet. While in the bright light, you and creatures friendly to you gain a +1 bonus to AC and _saving throws_  and can sense the location of any _invisible_  hostile creature also in the bright light.\n\nThe rod stops glowing and the effect ends after 10 minutes, or sooner if a creature uses an action to pull the rod from the ground.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.289",
    "page_no": null,
    "type": "Rod",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "rod-of-lordly-might",
  "fields": {
    "name": "Rod of Lordly Might",
    "desc": "You have a +3 bonus to _attack and damage rolls_  made with this rod, which appears as a magical mace in its default form. When you hit a creature with a weapon attack using the rod, you can activate one of the following three properties, each of which can be used once per dawn:\n\n* **Drain Life:** The target makes a DC 17 Constitution _saving throw_ , taking an extra 4d6 necrotic damage on a failure. You regain a number of hit points equal to half the necrotic damage dealt.\n* **Paralyze:** The target makes a DC 17 Strength _saving throw_  or is _paralyzed_  for 1 minute. At the end of each of its turns, it repeats the saving throw, ending the effect on a success.\n* **Terrify:** The target makes a DC 17 Wisdom _saving throw_  or is _frightened_  for 1 minute. At the end of each of its turns, it repeats the saving throw, ending the effect on a success.\n\n**Six Buttons.** The rod has buttons along its haft which alter its form when pressed. You can press one of the buttons as a bonus action, and the effect lasts until you push a different button for a new effect, or press the same button again causing the rod to revert to its default form.\n\n* **Button 1:** The rod loses its bonus to attack and damage rolls, instead producing a fiery blade from its haft which you can wield as a _flame tongue_  sword.\n* **Button 2:** The rod transforms into a magic battleaxe.\n* **Button 3:** The rod transforms into a magic spear.\n* **Button 4:** The rod transforms into a climbing pole up to 50 feet long. A spike at the bottom and three hooks at the top anchor the pole into any surface as hard as granite. Horizontal bars 3 inches long fold out from the sides, 1 foot apart, forming a ladder. The pole can bear up to 4,000 pounds. Either excess weight or a lack of solid anchoring causes the rod to revert to its default form.\n* **Button 5:** The rod transforms into a handheld battering ram that grants a +10 bonus to Strength checks made to break through doors, barricades, and other barriers.\n* **Button 6:** The rod assumes or remains in its default form and indicates magnetic north, and how far above or below ground that you are. Nothing happens if this function is used in a location without a magnetic north, or a ground as a reference point.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.290",
    "page_no": null,
    "type": "Rod",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "rod-of-rulership",
  "fields": {
    "name": "Rod of Rulership",
    "desc": "Once per dawn, while holding this rod you can use an action to command obedience. Each creature of your choice that you can see within 120 feet makes a DC 15 Wisdom _saving throw_ . On a failure, a creature is _charmed_  by you for 8 hours. A creature charmed by you regards you as its trusted leader. The charm is broken if you or your companions either command a charmed creature to do something contrary to its nature, or cause the creature harm.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.290",
    "page_no": null,
    "type": "Rod",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "rod-of-security",
  "fields": {
    "name": "Rod of Security",
    "desc": "This rod provides a _haven_  for the decadent adventurer—a safe place to wait out one's problems.\n\n**Supply Storage.** This rod can magically store up to 200 Supply. While holding the rod you can use an action to target up to 20 Supply you can see within 5 feet of you, which instantly vanishes and is stored in the rod. You can’t use this ability in paradise.\n\nA newly found rod has 2d100 Supply already stored.\n\n**Paradise.** While holding the rod, you can use an action to activate it and expend an amount of Supply (1 per creature) for yourself and each willing creature you can see. You and the other creatures are instantly transported into an extraplanar _haven_  that takes the form of any paradise you can imagine (or chosen at random using the Sample Paradises table). It contains enough Supply to sustain its visitors, and for each hour spent in paradise a visitor regains 10 hit points. Creatures don’t age while in paradise, although time passes normally. To maintain the extraplanar space each day beyond the first, an amount of Supply equal to the number of visitors must be expended from the rod.\n\nApart from visitors and the objects they brought into the paradise, everything within the paradise can only exist there. A cushion taken from a palace paradise, for example, disappears when taken outside.\n\nWhen you expend the last Supply stored in the rod or you use an action to end it, all visitors reappear in the location they occupied when you activated the rod, or the nearest unoccupied space, and the rod can’t be used again until 10 days have passed.\n\n__**Table: Sample Paradises**__\n| **d6** | **Paradise**       |\n| ------ | ------------------ |\n| 1      | Cloud castle       |\n| 2      | Cozy tavern        |\n| 3      | Fantastic carnival |\n| 4      | Luxurious palace   |\n| 5      | Tranquil glade     |\n| 6      | Tropical island    |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.290",
    "page_no": null,
    "type": "Rod",
    "rarity": "Legendary",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "rope-of-climbing",
  "fields": {
    "name": "Rope of Climbing",
    "desc": "This magical rope is 60 feet long, holds up to 3,000 pounds, and weighs only 3 pounds. While holding one end of the rope, you can use an action to speak a command word that animates it. With a bonus action, you can make the other end move toward a destination you choose. \n\nThe other end moves 10 feet on each of your turns until it reaches the point, moves its maximum length away, or you command it to halt. You may also command the rope to coil itself, knot itself, unknot itself, or fasten or unfasten itself.\n\nWhile knotted, the rope shortens to 50 feet as knots appear at 1 foot intervals along its length. Creatures have _advantage_  on checks made to climb the rope when it is used in this way.\n\nThe rope has AC 20 and 20 hit points. When damaged the rope recovers 1 hit point every 5 minutes. The rope is destroyed when reduced to 0 hit points.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.291",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "rope-of-entanglement",
  "fields": {
    "name": "Rope of Entanglement",
    "desc": "This magical rope is 60 feet long, holds up to 3,000 pounds, and weighs only 3 pounds. While holding one end of the rope, you can use an action to speak a command word that animates it. With a bonus action, you can make the other end move toward a destination you choose. \n\nThe other end moves 10 feet on each of your turns until it reaches the point, moves its maximum length away, or you command it to halt. You may also command the rope to coil itself, knot itself, unknot itself, or fasten or unfasten itself.\n\nWhile knotted, the rope shortens to 50 feet as knots appear at 1 foot intervals along its length. Creatures have _advantage_  on checks made to climb the rope when it is used in this way.\n\nThe rope has AC 20 and 20 hit points. When damaged the rope recovers 1 hit point every 5 minutes. The rope is destroyed when reduced to 0 hit points.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.291",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "scarab-of-protection",
  "fields": {
    "name": "Scarab of Protection",
    "desc": "After being held in your hand for 1 round, this scarab medallion shimmers with magical inscriptions. The scarab has 12 charges, crumbling into dust when it has no charges left. \n\nThis item has two benefits while it is on your person. First, you gain _advantage_  on _saving throws_  made against spells. Second, if you fail a saving throw against a necromancy spell or either an attack from or trait of an undead creature, you may instead succeed on the saving throw by using your reaction to expend a charge from the scarab.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.291",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "scimitar-of-speed",
  "fields": {
    "name": "Scimitar of Speed",
    "desc": "\\[You gain a +2 bonus to _attack and damage rolls_  made with this magic scimitar, and on each of your turns you can use a bonus action to make one attack with it.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.292",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "shield-of-missile-attraction",
  "fields": {
    "name": "Shield of Missile Attraction",
    "desc": "While wearing this shield you have resistance to damage from ranged weapon attacks.\n\n**Curse.** Whenever a ranged weapon attack is made against a target within 10 feet of you, you become the target instead. Removing the shield does not stop the curse.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.292",
    "page_no": null,
    "type": "Armor",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "slippers-of-spider-climbing",
  "fields": {
    "name": "Slippers of Spider Climbing",
    "desc": "While you are wearing these shoes, you can move on walls and upside down on ceilings without the use of your hands, gaining a climb speed equal to your Speed. The shoes cannot be used on slippery surfaces.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.292",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "sovereign-glue",
  "fields": {
    "name": "Sovereign Glue",
    "desc": "This alabaster liquid adhesive permanently joins together any two objects. When found the bottle has 1d6 + 1 ounces of adhesive inside. \n\nYou may use one ounce to cover a 1-foot square surface which. After 1 minute passes the _sovereign glue_ sets and the bond cannot be broken without using _universal solvent , oil of etherealness_ , or a __wish_ spell.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.293",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "spell-scroll",
  "fields": {
    "name": "Spell Scroll",
    "desc": "A spell scroll bears a sealed spell within. If the spell is on your class’ spell list, you can use the scroll to cast the spell (taking the spell’s normal casting time) without the need for material components. Otherwise the _spell scroll_ is unreadable to you. If you are interrupted while using the scroll, you may attempt to use it again. Once the spell within a scroll has been cast, the scroll crumbles away. \n\nTo use a _spell scroll_ of a higher spell level than you are able to cast, you must succeed on _spellcasting_  ability check (DC 10 + the spell’s level). On a failure, the magical energy within is expended with no effect, leaving behind a blank piece of parchment. \n\nA wizard may use a _spell scroll_ to copy the spell stored within to their spellbook by making an Intelligence (Arcana) check (DC 10 + the spell’s level). Whether the check succeeds or not, the attempt destroys the _spell scroll_. \n\nThe level of the spell stored within a scroll determines the _saving throw_  DC, _attack bonus_ , crafting components, cost, and rarity as per Table: Spell Scrolls. The costs of a _spell scroll_ are in addition to any material components, which are required (and if necessary also consumed) when it is made.\n\n__Table: Spell Scrolls__\n| **Spell Level** | **Rarity** | **Save DC** | **Attack Bonus** | **Cost**  | **Crafting Components**                |\n| --------------- | ---------- | ----------- | ---------------- | --------- | -------------------------------------- |\n| Cantrip         | Common     | 13          | 5                | 10 gp     | Magical inks                           |\n| 1st             | Common     | 13          | 5                | 25gp      | Magical inks                           |\n| 2nd             | Common     | 13          | 5                | 75gp      | Magical inks                           |\n| 3rd             | Uncommon   | 15          | 7                | 175gp     | Dire wolf hide                         |\n| 4th             | Uncommon   | 15          | 7                | 500gp     | Dire wolf hide                         |\n| 5th             | Rare       | 17          | 9                | 1,250 gp  | Parchment infused with planar energy   |\n| 6th             | Rare       | 17          | 9                | 3,000 gp  | Parchment infused with planar energy   |\n| 7th             | Very Rare  | 18          | 10               | 8,000 gp  | Blank pages from a _lich’s_  spellbook |\n| 8th             | Very Rare  | 18          | 10               | 20,000 gp | Blank pages from a _lich’s_  spellbook |\n| 9th             | Legendary  | 19          | 11               | 55,000 gp | Parchment made from a dragon’s hide    |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.293",
    "page_no": null,
    "type": "Scroll",
    "rarity": "Common",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "spellguard-shield",
  "fields": {
    "name": "Spellguard Shield",
    "desc": "While this heavy metal shield is equipped you have _advantage_  on _saving throws_  made against spells and magical effects, and spell attacks against you have _disadvantage_ .",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.294",
    "page_no": null,
    "type": "Armor",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "sphere-of-annihilation",
  "fields": {
    "name": "Sphere of Annihilation",
    "desc": "This floating sphere of darkness is a 2-foot-diameter hole in reality that eliminates all matter that it comes into contact with. Only artifacts can survive contact with the sphere, though some artifacts have a specific weakness to its properties.\n\nAnything that the sphere touches or that touches it that is not instantly obliterated takes 4d10 force damage. The default state of the sphere is stationary, but should a creature be in the way of a moving sphere it makes a DC 13 Dexterity _saving throw_  or takes 4d10 force damage.\n\nWhile within 60 feet of an uncontrolled _sphere of annihilation_, you can use an action to make a DC 25 Intelligence (Arcana) check and take control of it. On a success, the sphere moves in the direction of your choice a number of feet equal to 5 × your Intelligence modifier (minimum 5 feet). On a failure, the sphere moves 10 feet toward you instead. \n\nIf a sphere is controlled by another creature, you may wrest away control by using an action and making an Intelligence (Arcana) check opposed by the controlling creature. On a success, you take control of the sphere and can utilize it as normal. \n\nA unique effect happens when a sphere comes into contact with a planar portal or extradimensional space (such as a _portable hole_ ). In the case of such an event, the Narrator rolls d100 to determine what happens next: on 1–50 the sphere is destroyed, on 51–85 the sphere simply moves through the portal or into the space, and on 86–100 a rift forms that pulls in all creatures and objects within 180 feet. Each object and creature, including the sphere, reappears in a random plane of existence. ",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.294",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "staff-of-charming",
  "fields": {
    "name": "Staff of Charming",
    "desc": "While holding this magical quarterstaff you can use an action and expend charges to cast one of the following spells, using your spell save DC: _charm person_  (1 charge), _command_ (1 charge), _comprehend languages_ (1 charge).\n\nOnce per dawn, when you are holding the staff and fail a _saving throw_  against an enchantment spell, you can instead choose to succeed. When you succeed on a saving throw against an enchantment spell (with or without the staff’s intervention) you can use your reaction to expend 1 charge from the staff and turn the spell back on its caster (targeting only them), as if you had cast the spell.\n\nThe staff has 10 charges and regains 1d8+2 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, it loses its magical properties.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.294",
    "page_no": null,
    "type": "Staff",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "staff-of-fire",
  "fields": {
    "name": "Staff of Fire",
    "desc": "While holding this staff you gain _resistance_  to fire damage, and you can use an action to expend charges to cast one of the following spells, using your spell save DC: __burning hands_ (1 charge), __fireball_ (3 charges), _wall of fire_  (4 charges).\n\nThe staff has 10 charges and regains 1d6+4 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the staff crumbles to ash and is destroyed.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.295",
    "page_no": null,
    "type": "Staff",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "staff-of-frost",
  "fields": {
    "name": "Staff of Frost",
    "desc": "While holding this staff you gain _resistance_  to cold damage, and you can use an action to expend charges to cast one of the following spells, using your spell save DC: __fog cloud_  (1 charge), _ice storm_  (4 charges), _wall of ice_ (4 charges), __cone of cold_  (5 charges).\n\nThe staff has 10 charges and regains 1d6+4 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the staff melts into water and is destroyed.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.295",
    "page_no": null,
    "type": "Staff",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "staff-of-healing",
  "fields": {
    "name": "Staff of Healing",
    "desc": "While holding this staff, you can use an action to expend charges to cast one of the following spells, using your spellcasting ability modifier: _cure wounds_ (1 charge per spell level, up to 4th-level), _lesser restoration_ (2 charges), __mass cure wounds_ (5 charges).\n\nThe staff has 10 charges, regaining 1d6+4 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the staff disappears with a flash of light and is lost forever.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.295",
    "page_no": null,
    "type": "Staff",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "staff-of-power",
  "fields": {
    "name": "Staff of Power",
    "desc": "You have a +2 bonus to attack and damage rolls made with this magic quarterstaff. When you hit with a melee attack using this staff, you can expend 1 charge to deal an extra 1d6 force damage to the target. Additionally, while holding it you gain a +2 bonus to AC, saving throws, and spell attack rolls.\n\n**_Spells._** While holding this staff, you can use an action to expend charges to cast one of the following spells, using your spell save DC and spell attack bonus: _magic missile_  (1 charge), __ray of enfeeblement_ (1 charge), __levitate_  (2 charges), __hold monster_ (5 charges), __lightning bolt_  (5th-level version, 5 charges), __wall of force_  (5 charges), __cone of cold_  (5 charges), __fireball_  (5th-level version, 5 charges), _globe of invulnerability_  (6 charges).\n\nThe staff has 20 charges and regains 2d8+4 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 20, the staff immediately regains 1d8+2 charges. On a 1, the staff loses its magical properties, apart from its +2 bonus to attack and damage rolls.\n\n_**Retributive Strike**._ You can use an action to destroy the staff, releasing its magic in a 30-foot-radius explosion. Roll a d6\\. On an even result, you teleport to a random plane of existence and avoid the explosion. On an odd result, you take damage equal to 16 × the number of charges in the staff. Every other creature in the area makes a DC 17 Dexterity _saving throw_ . On a failed save, a creature takes damage based on how far away it is from the point of origin, as on the Retributive Strike table. On a successful save, a creature takes half as much damage.\n\n__**Table: Retributive Strike**__\n| **Distance from Origin** | **Damage**               |\n| ------------------------ | ------------------------ |\n| 10 feet away or closer   | 8 × charges in the staff |\n| 11 to 20 feet away       | 6 × charges in the staff |\n| 21 to 30 feet away       | 4 x charges in the staff |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.296",
    "page_no": null,
    "type": "Staff",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "staff-of-striking",
  "fields": {
    "name": "Staff of Striking",
    "desc": "You have a +3 bonus to _attack and damage rolls_  made with this magic quarterstaff.\n\nWhen you hit with a melee attack using this staff, you can expend up to 3 of its charges, dealing an extra 1d6 force damage per expended charge.\n\nThe staff has 10 charges and regains 1d6+4 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, it loses its magical properties.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.296",
    "page_no": null,
    "type": "Staff",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "staff-of-swarming-insects",
  "fields": {
    "name": "Staff of Swarming Insects",
    "desc": "While holding this staff, you can use an action to expend charges to conjure an insect cloud, or cast one of the following spells, using your spell save DC: _giant insect_  (4 charges), __insect plague_  (5 charges)\n\n_**Insect Cloud**_ (1 Charge). A swarm of harmless flying insects spreads out in a 30-foot radius from you, _heavily obscuring_  the area for creatures other than you. It moves when you do, with you at its center. The radius of the swarm decreases by 10 feet each time you are included within an area of effect that deals damage. The insects remain for 10 minutes, until the swarm’s radius is less than 10 feet, or it is dispersed by strong wind.\n\nThe staff has 10 charges and regains 1d6+4 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the staff is destroyed as it transforms into a swarm of insects which immediately disperse.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.296",
    "page_no": null,
    "type": "Staff",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "staff-of-the-magi",
  "fields": {
    "name": "Staff of the Magi",
    "desc": "You have a +2 bonus to _attack and damage rolls_  made with this magic quarterstaff. Additionally, while holding it you gain a +2 bonus to _spell attack rolls_  and _advantage_  on _saving throws_  against spells.\n\n_**Spell Absorption.**_ When another creature casts a spell which targets only you, you can use your reaction to cause the staff to absorb the magic of the spell, cancelling its effect and gaining charges equal to the spell’s level. If this brings the staff’s total charges above 50, the staff explodes as if you activated its Retributive Strike.\n\n_**Spells.**_ While holding this staff, you can use an action to expend charges to cast one of the following spells, using your spell save DC and spell attack bonus: __flaming sphere_ (2 charges), _invisibility_ (2 charges), _knock_  (2 charges), _web_ (2 charges), __dispel magic_  (3 charges), _ice storm_  (4 charges), _wall of fire_ (4 charges), __passwall_  (5 charges), __telekinesis_ (5 charges), __conjure elemental_  (7 charges), _fireball_  (7th-level version, 7 charges), _lightning bolt_  (7th-level version, 7 charges), __plane shift_  (7 charges).  \nYou can also use an action to cast the following spells from the staff without expending any charges: __arcane lock , detect magic , enlarge/reduce , light , mage hand , protection from evil and good ._\n\nThe staff has 50 charges and regains 4d6+2 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 20, the staff immediately regains 1d12+1 charges.\n\n_**Retributive Strike.**_ You can use an action to destroy the staff, releasing its magic in a 30-foot-radius explosion. Roll a d6\\. On an even result, you teleport to a random plane of existence and avoid the explosion. On an odd result, you take damage equal to 16 × the number of charges in the staff. Every other creature in the area makes a DC 17 Dexterity _saving throw_ . On a failed save, a creature takes damage based on how far away it is from the point of origin, as on the _Retributive Strike_  table. On a successful save, a creature takes half as much damage.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.297",
    "page_no": null,
    "type": "Staff",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "staff-of-the-python",
  "fields": {
    "name": "Staff of the Python",
    "desc": "You can use an action to speak this staff’s command word and throw it at a point on the ground within 10 feet to transform it into a _giant constrictor snake_ **.** During your turn, while you aren’t incapacitated and remain within 60 feet of it, you can mentally command the snake. The snake acts immediately after you. You decide its moves and actions, or you can issue a general command such as to guard a location.\n\nAs a bonus action, you can transform the snake back into a staff by repeating the command word. The staff appears in the space formerly occupied by the snake. If the snake has at least 1 hit point when it becomes a staff, it regains all its hit points.\n\nIf the snake is reduced to 0 hit points, it is destroyed, reverting to staff form before shattering into pieces.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.297",
    "page_no": null,
    "type": "Staff",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "staff-of-the-woodlands",
  "fields": {
    "name": "Staff of the Woodlands",
    "desc": "You gain a +2 bonus to _attack and damage rolls_  with this magic quarterstaff. Additionally, while holding it you gain a +2 bonus to spell attack rolls.\n\nWhile holding this staff, you can use an action to cast pass without trace, or to expend charges to cast one of the following spells, using your spell save DC: _animal friendship_  (1 charge), _speak with animals_  (1 charge), __barkskin_  (2 charges), _locate animals or plants_  (2 charges), __speak with plants_  (3 charges), __awaken_ (5 charges), __wall of thorns_  (6 charges).\n\n_**Tree Form**._ As an action you can plant the staff in the earth and expend 1 charge, transforming it into a full-grown tree. The tree is 60 feet tall, has a 5-foot-wide trunk, and its highest branches fill a 20-foot radius. The tree looks ordinary but radiates faint transmutation magic if inspected with __detect magic ._ By using an action to touch the tree and speak the staff’s command word, you can transform it back into a staff. Creatures in the tree fall when the staff reverts to its original form.\n\nThe staff has 10 charges and regains 1d6+4 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the staff loses its magical properties.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.297",
    "page_no": null,
    "type": "Staff",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "staff-of-thunder-and-lightning",
  "fields": {
    "name": "Staff of Thunder and Lightning",
    "desc": "You gain a +2 bonus to _attack and damage rolls_  with this magic quarterstaff. Additionally, while holding it you can activate one of the following properties, each of which can be used once per dawn.\n\n**_Lightning._** When you make a successful melee attack with the staff, you deal an extra 2d6 lightning damage.\n\n_**Thunder.**_ When you make a successful melee attack with the staff, you cause it to emit a thunderclap audible up to 300 feet away. The target makes a DC 17 Constitution _saving throw_  or it is _stunned_  until the end of your next turn.\n\n_**Lightning Strike.**_ You can use an action to fire a 120 feet long and 5 foot wide line of lightning from the staff. Each creature in the area makes a DC 17 Dexterity _saving throw_ , taking 9d6 lightning damage on a failure, or half damage on a success.\n\n_**Thunderclap.**_ You can use an action to create a thunderous roar audible up to 600 feet away. Each creature other than you within 60 feet makes a DC 17 Constitution _saving throw_  or takes 2d6 thunder damage and becomes _deafened_  for 1 minute. On a successful save, a creature takes half damage and isn’t deafened.\n\n_**Thunder and Lightning**._ You can use an action to use the Lightning Strike and Thunderclap properties simultaneously. This doesn’t expend the daily uses of those properties, only this one.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.298",
    "page_no": null,
    "type": "Staff",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "staff-of-withering",
  "fields": {
    "name": "Staff of Withering",
    "desc": "This magic quarterstaff has 3 charges and regains 1d3 expended charges each dawn. When you make a successful _melee attack_  with the staff, you can expend 1 charge to deal an extra 2d10 necrotic damage. The target makes a DC 15 Constitution _saving throw_  or for the next hour it has _disadvantage_  on Strength and Constitution checks and saving throws.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.298",
    "page_no": null,
    "type": "Staff",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "stone-of-controlling-earth-elementals",
  "fields": {
    "name": "Stone of Controlling Earth Elementals",
    "desc": "You can use an action to touch this 5 pound stone to the ground and speak a command word, summoning an _earth elemental_  (as the _conjure elemental_ spell). Once used, the stone cannot be used again until the next dawn.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.298",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "stone-of-good-luck-luckstone",
  "fields": {
    "name": "Stone of Good Luck (Luckstone)",
    "desc": "You gain a +1 bonus to ability checks and _savings throws_  as long as this lustrous gemstone is on your person.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.299",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "sun-blade",
  "fields": {
    "name": "Sun Blade",
    "desc": "This weapon first appears to be nothing more than a sword hilt. While holding the hilt, you can use a bonus action to make a blade of sunlight appear or disappear. Being proficient in shortswords or longswords grants proficiency with this magic sword, which also has the finesse property as long as the blade is in existence.\n\nWhile the blade is ignited, you gain +2 bonus to _attack and damage rolls_  made with it, dealing 1d8 radiant damage on a hit (instead of slashing damage), or 2d8 radiant damage if your target is undead.\n\nThe blade shines with _bright sunlight_  in a 15-foot radius and dim sunlight for an additional 15 feet. You can use an action to increase or decrease the bright sunlight and dim sunlight radiuses by 5 feet, up to a maximum of 30 feet each or down to a minimum of 10 feet each.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.299",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "sword-of-life-stealing",
  "fields": {
    "name": "Sword of Life Stealing",
    "desc": "When you use this weapon to make an attack against a creature that is not a construct or undead and roll a natural 20, the creature takes an extra 3d6 necrotic damage and you gain an amount of temporary hit points equal to the necrotic damage dealt.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.299",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "sword-of-sharpness",
  "fields": {
    "name": "Sword of Sharpness",
    "desc": "Objects hit with this sword take the maximum damage the weapon’s damage dice can deal.\n\nWhen you use this sword to _make an attack_  against a creature and roll a natural 20, the target takes an extra 4d6 slashing damage. Then roll an additional d20, and on a natural 20 you chop off one of the target’s limbs (or a portion of its body if it has no limbs). The Narrator determines what effect (if any) the result of this severing off is.\n\nYou may also speak this sword’s command word to make the blade emit bright light in a 10-foot radius and dim light an additional 10 feet. Repeating the command word or sheathing the sword extinguishes the blade’s light.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.300",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "sword-of-wounding",
  "fields": {
    "name": "Sword of Wounding",
    "desc": "Once per turn, when you use this sword to _hit a creature_  with a melee weapon attack, in addition to dealing the attack damage you may inflict it with a wound. A wounded creature takes 1d4 necrotic damage at the start of each of its turns for each wound you have inflicted this way. Whenever the creature is damaged by its wound, it can make a DC 15 Constitution _saving throw_ , ending all wound effects it is suffering from on a success. Alternatively, the wounds can be healed if the wounded creature (or a creature within 5 feet of it) uses an action to make a DC 15 Medicine check, ending all wound effects it is suffering from on a success.\n\nDamage dealt by this sword can only be regained by taking a _short or long rest_ —no other method, magical or otherwise, will restore the hit points.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.300",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "talisman-of-pure-good",
  "fields": {
    "name": "Talisman of Pure Good",
    "desc": "This talisman’s purity harms creatures that do not have the Good trait, dealing 6d6 radiant damage when touched (or 8d6 radiant damage to a creature with the Evil trait). A creature carrying or holding this item takes the same damage at the end of each of its turns as long as it does so.\n\nA cleric or herald with the Good trait can use this talisman as a holy symbol, which grants a +2 bonus to _spell attack rolls_  while held or worn.\n\nIn addition, the talisman has 7 charges. While wielded or worn, you can use an action to expend a charge and choose a target within 120 feet that is on the ground. If the creature has the Evil trait, it makes a DC 20 Dexterity _saving throw_  or is destroyed by a flaming pit that appears beneath it. Once the pit closes no trace of it or the target remains. Once all charges are expended, the talisman collapses into golden specks of light.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.300",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "talisman-of-the-sphere",
  "fields": {
    "name": "Talisman of the Sphere",
    "desc": "When you hold this talisman while making an Intelligence (Arcana) check to control a __sphere of annihilation_ add your proficiency bonus twice. If you are in control of a _sphere of annihilation_ at the start of your turn, you can use an action to move the sphere 10 feet plus a number of additional feet equal to 10 × your Intelligence modifier.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.301",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "talisman-of-ultimate-evil",
  "fields": {
    "name": "Talisman of Ultimate Evil",
    "desc": "This talisman’s blasphemous nature harms creatures that do not have the Evil trait, dealing 6d6 necrotic damage when touched (or 8d6 necrotic damage to a creature with the Good trait). A creature carrying or holding this item takes the same damage at the end of each of its turns as long as it does so. \n\nA cleric or herald with the Evil trait can use this talisman as a holy symbol, which grants a +2 bonus to _spell attack rolls_  while held or worn.\n\nIn addition, the talisman has 6 charges. While wielded or worn, you can use an action to expend a charge and choose a target within 120 feet that is on the ground. If the creature has the Good trait, it makes a DC 20 Dexterity _saving throw_  or is destroyed by a flaming pit that appears beneath it. Once the pit closes no trace of it or the target remains. Once all charges are expended, the talisman melts into a puddle of ooze. ",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.301",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "tome-of-clear-thought",
  "fields": {
    "name": "Tome of Clear Thought",
    "desc": "This magical book dictates methodologies for more rational and logical thinking. Spending 48 hours over 6 days (or fewer) reading and following the book’s methodologies increases your Intelligence score and your maximum Intelligence score by 2\\. The tome then becomes a mundane item for a century before it regains its magic.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.301",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "tome-of-leadership-and-influence",
  "fields": {
    "name": "Tome of Leadership and Influence",
    "desc": "This magical book details techniques for how to best influence others. Spending 48 hours over 6 days (or fewer) reading and practicing the book’s techniques increases your Charisma score and your maximum Charisma score by 2\\. The tome then becomes a mundane item for a century before it regains its magic.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.302",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "tome-of-understanding",
  "fields": {
    "name": "Tome of Understanding",
    "desc": "This magical book contains lessons and practices for enhancing intuition, empathy, and awareness. Spending 48 hours over 6 days (or fewer) reading and memorizing the book’s lessons increases your Wisdom score and your maximum Wisdom score by 2\\. The tome then becomes a mundane item for a century before it regains its magic.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.302",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Very Rare",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "trident-of-fish-command",
  "fields": {
    "name": "Trident of Fish Command",
    "desc": "This weapon has 3 charges. While carrying the trident, you can use an action to expend 1 charge and cast __dominate beast_ (save DC 15) on a beast with an innate swimming speed. At dawn each day the trident regains 1d3 expended charges.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.302",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "universal-solvent",
  "fields": {
    "name": "Universal Solvent",
    "desc": "The scent of alcohol wafts out of this bottle of white liquid. You can use an action to pour the liquid in the bottle onto a surface within your reach and dissolve up to 1 square foot of adhesive (including __sovereign glue )_.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.303",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "vicious-weapon",
  "fields": {
    "name": "Vicious Weapon",
    "desc": "When you roll a natural 20 on an _attack roll_  using this weapon it deals an extra 2d6 damage of the weapon’s type (this extra damage does not double).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.303",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "vorpal-sword",
  "fields": {
    "name": "Vorpal Sword",
    "desc": "You gain a +3 bonus to _attack and damage rolls_  made with this magic sword, and it ignores resistance to slashing damage.\n\nWhen you attack a creature with this blade and it has at least one head, rolling a natural 20 on the _attack roll_  causes the sword to make a snicker-snack sound as it efficiently chops off one of the target’s heads. If the creature can’t survive without its head removed, it dies. This effect does not apply if the target is too big for its head to be removed by the sword (determined at the discretion of the Narrator), it doesn’t need a head or have one, has immunity to slashing damage, or has legendary actions. In cases where a creature cannot lose a head, it takes an additional 6d8 slashing damage (unless it is immune to slashing damage; this extra damage does not double).",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.303",
    "page_no": null,
    "type": "Weapon",
    "rarity": "Legendary",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wand-of-binding",
  "fields": {
    "name": "Wand of Binding",
    "desc": "While holding this wand, you can use an action to expend charges to cast one of the following spells, using your spell save DC: _hold person_ (2 charges), __hold monster_ (5 charges). Alternatively, when you attempt to escape a _grapple_  or are making a _saving throw_  to avoid being _paralyzed_  or _restrained_ , you can use your reaction to expend 1 charge and gain _advantage_ .\n\nThis wand has 7 charges and regains 1d6+1 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the wand folds in on itself until it disappears.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.304",
    "page_no": null,
    "type": "Wand",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wand-of-enemy-detection",
  "fields": {
    "name": "Wand of Enemy Detection",
    "desc": "While holding this wand, you can use an action to speak its command word and expend 1 charge to extend your senses for 1 minute. You sense the direction (but not precise location) of the nearest creature hostile to you within 60 feet (this includes ethereal, _invisible_ , disguised, and hidden creatures, as well as those in plain sight). The effect ends early if you stop holding the wand.\n\nThis wand has 7 charges and regains 1d6+1 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the wand disappears the next time it is unobserved.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.304",
    "page_no": null,
    "type": "Wand",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wand-of-fear",
  "fields": {
    "name": "Wand of Fear",
    "desc": "While holding this wand, you can use an action to expend 1 charge and command another creature to flee or grovel (as the _command_ spell, save DC 15). Alternatively, you can use an action to expend 2 charges, causing the wand to emit a 60-foot cone of light. Each creature in the area makes a DC 15 Wisdom _saving throw_  or becomes _frightened_  of you for 1 minute. A creature frightened in this way must spend its turns trying to move as far away from you as possible, and it can’t willingly move to a space within 30 feet of you. It also can’t take reactions. On its turn, the frightened creature can use only the Dash action or try to escape from an effect that prevents it from moving, or if it has nowhere to move then the Dodge action. A frightened creature can repeat the _saving throw_  at the end of each of its turns, ending the effect on itself on a success.\n\nThis wand has 7 charges and regains 1d6+1 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the wand releases a chilling wail and crumbles into nothing.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.304",
    "page_no": null,
    "type": "Wand",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wand-of-fireballs",
  "fields": {
    "name": "Wand of Fireballs",
    "desc": "While holding this wand, you can use an action to expend 1 or more charges to cast fireball (save DC 15). For 1 charge, you cast the spell’s 3rd-level version. Increase the spell slot level by one for each additional expended charge.\n\nThis wand has 7 charges and regains 1d6+1 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the wand disappears in a flash of fire and smoke.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.305",
    "page_no": null,
    "type": "Wand",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wand-of-lightning-bolts",
  "fields": {
    "name": "Wand of Lightning Bolts",
    "desc": "While holding this wand, you can use an action to expend 1 or more charges to cast __lightning bolt_ (save DC 15). For 1 charge, you cast the spell’s 3rd-level version. Increase the spell slot level by one for each additional expended charge.\n\n This wand has 7 charges and regains 1d6+1 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the wand emits sparks of electricity and disappears in a flash. ",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.305",
    "page_no": null,
    "type": "Wand",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wand-of-magic-detection",
  "fields": {
    "name": "Wand of Magic Detection",
    "desc": "While holding this wand, you can use an action to expend 1 charge to cast __detect magic ._\n\nThis wand has 7 charges and regains 1d6+1 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the wand violently shakes and sparks with magic then disappears.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.305",
    "page_no": null,
    "type": "Wand",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wand-of-magic-missiles",
  "fields": {
    "name": "Wand of Magic Missiles",
    "desc": "This wand has 7 charges. While holding it, you can use an action to expend 1 or more of its charges to cast the _magic missile_ spell from it. For 1 charge, you cast the 1st-level version of the spell. You can increase the spell slot level by one for each additional charge you expend.\n\nThe wand regains 1d6 + 1 expended charges daily at dawn. If you expend the wand's last charge, roll a d20. On a 1, the wand crumbles into ashes and is destroyed.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.306",
    "page_no": null,
    "type": "Wand",
    "rarity": "uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wand-of-paralysis",
  "fields": {
    "name": "Wand of Paralysis",
    "desc": "While holding this wand, you can use an action to expend 1 charge to force a creature within 60 feet to make a DC 15 Constitution _saving throw_  or become _paralyzed_  for 1 minute. The paralyzed creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on success.\n\nThis wand has 7 charges and regains 1d6+1 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the wand shatters into hundreds of pieces.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.306",
    "page_no": null,
    "type": "Wand",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wand-of-polymorph",
  "fields": {
    "name": "Wand of Polymorph",
    "desc": "While holding this wand, you can use an action to expend 1 charge to cast _polymorph_ (save DC 15).\n\nThis wand has 7 charges and regains 1d6+1 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the wand transforms into a Tiny bug that wanders away.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.306",
    "page_no": null,
    "type": "Wand",
    "rarity": "Very Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wand-of-secrets",
  "fields": {
    "name": "Wand of Secrets",
    "desc": "While holding this wand, you can use an action to expend 1 charge to make it pulse and point at the nearest secret door or trap within 30 feet.\n\nThis wand has 3 charges and regains 1d3 expended charges each dawn.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.307",
    "page_no": null,
    "type": "Wand",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wand-of-the-war-mage-1-2-or-3",
  "fields": {
    "name": "Wand of the War Mage, +1, +2, or +3",
    "desc": "While holding this wand, you gain a bonus to spell attack rolls determined by the wand's rarity. In addition, you ignore half cover when making a spell attack.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.307",
    "page_no": null,
    "type": "Wand",
    "rarity": "uncommon (+1), rare (+2), or very rare (+3)",
    "requires_attunement": "requires attunement by a spellcaster",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wand-of-web",
  "fields": {
    "name": "Wand of Web",
    "desc": "While holding this wand, you can use an action to expend 1 charge to cast _web_ (save DC 15).\n\nThis wand has 7 charges and regains 1d6+1 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the wand dissolves into a pile of webbing.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.307",
    "page_no": null,
    "type": "Wand",
    "rarity": "Uncommon",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wand-of-wonder",
  "fields": {
    "name": "Wand of Wonder",
    "desc": "While holding this wand, you can use an action to expend 1 charge and choose a creature, object, or point in space within 120 feet. Roll d100 on the Wand of Wonder table to determine the effect.\n\nSpells cast from the wand have a spell save DC of 15 and a range of 120 feet. Area effects are centered on and include the target. If an effect might target multiple creatures, the Narrator randomly determines which ones are affected.\n\nThis wand has 7 charges and regains 1d6+1 expended charges each dawn. When the last charge is expended, roll a d20\\. On a 1, the wand violently shakes and sparks with magic then disappears.\n\n__**Table: Wand of Wonder**__\n| **d100** | **Effect**                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             |\n| -------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ |\n| 01–05    | You cast _slow ._                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |\n| 06–10    | You cast __faerie fire ._                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |\n| 11–15    | You are awestruck and become _stunned_  until the start of your next turn.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             |\n| 16–20    | You cast _gust of wind ._                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |\n| 21–25    | You cast __detect thoughts_  on the target. If you didn’t target a creature, you take 1d6 psychic damage instead.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |\n| 26–30    | You cast _stinking cloud ._                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |\n| 31–33    | Rain falls in a 60-foot radius centered on the target, making the area __lightly obscured_ until the start of your next turn.                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |\n| 34–36    | A beast appears in an unoccupied space adjacent to the target. You don’t control the animal, which acts as it normally would. Roll a d4 to determine the beast (1: _rhinoceros_ , 2: _elephant_ , 3–4: _rat_ ).                                                                                                                                                                                                                                                                                                                                                                                        |\n| 37–46    | You cast _lightning bolt ._                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |\n| 47–49    | Butterflies fill a 30-foot radius centered on the target, making the area _heavily obscured_ . The butterflies remain for 10 minutes.                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |\n| 50–53    | The target doubles in size (as if you had cast __enlarge/reduce_ ), or if the target is an attended object, you become the spell’s target.                                                                                                                                                                                                                                                                                                                                                                                                                                                             |\n| 54–58    | You cast _darkness ._                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |\n| 59–62    | Grass grows on the ground in a 60-foot radius centered on the target. Existing grass grows to 10 times normal size for 1 minute, becoming _difficult terrain_ .                                                                                                                                                                                                                                                                                                                                                                                                                                        |\n| 63–65    | An unattended object (chosen by the Narrator) within 120 feet of the target disappears into the Ethereal Plane. The object must be able to fit in a 10-foot cube.                                                                                                                                                                                                                                                                                                                                                                                                                                      |\n| 66–69    | You shrink to half your size (as __enlarge/reduce_ ).                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |\n| 70–79    | You cast _fireball ._                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |\n| 80–84    | You cast _invisibility_ on yourself.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   |\n| 85–87    | Leaves grow from the target. If you targeted a point in space, leaves sprout from the creature nearest that point instead. The leaves fall off after 24 hours but can be pruned before that time.                                                                                                                                                                                                                                                                                                                                                                                                      |\n| 88–90    | A stream of 1d4 × 10 gems (each worth 1 gp) shoots from the wand in a 30-foot long, 5-foot wide line. Each gem deals 1 bludgeoning damage. Divide the total damage equally among all creatures in the area.                                                                                                                                                                                                                                                                                                                                                                                            |\n| 91–95    | A burst of shimmering light extends from you in a 30-foot radius. You and each creature in the area that can see make a DC 15 Constitution _saving throw_  or become _blinded_  for 1 minute. A blinded creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success                                                                                                                                                                                                                                                                                 |\n| 96–97    | For the next 1d10 days, the target is able to breathe underwater and its skin turns blue. If you targeted an object or point in space, the creature nearest that target is affected instead.                                                                                                                                                                                                                                                                                                                                                                                                           |\n| 98–100   | If you targeted a creature, it makes a DC 15 Constitution _saving throw_ . If you didn’t target a creature, you become the target instead. A creature that fails the saving throw by 5 or more is instantly _petrified_ . On any other failed save, the creature is _restrained_  and begins to turn to stone. While restrained in this way, the target repeats the saving throw at the end of its next turn, becoming petrified on a failure or ending the effect on a success. A __greater restoration_  spell or similar magic restores a petrified creature but the effect is otherwise permanent. |",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.308",
    "page_no": null,
    "type": "Wand",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "weapon-1-2-or-3",
  "fields": {
    "name": "Weapon, +1, +2, or +3",
    "desc": "You have a bonus to attack and damage rolls made with this magic weapon. The bonus is determined by the weapon's rarity.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.308",
    "page_no": null,
    "type": "Weapon (any)",
    "rarity": "uncommon (+1), rare (+2), or very rare (+3)",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "well-of-many-worlds",
  "fields": {
    "name": "Well of Many Worlds",
    "desc": "When unfolded, this handkerchief-sized piece of lightweight, silky fabric expands into a 6-foot diameter circular sheet.\n\nYou can use an action to unfold the cloth and spread it on a solid surface, creating a two-way portal to another plane of existence chosen by the Narrator. You can use an action to close the portal by folding the cloth. Once a portal has been opened in this manner, it cannot be opened again for 1d8 hours.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.308",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Legendary",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wind-fan",
  "fields": {
    "name": "Wind Fan",
    "desc": "You can use an action to wave this fan and cast _gust of wind_  (save DC 13). Each time the fan is used before the next dawn there is a cumulative 20% chance that it breaks, causing the spell to fail and for it to shred into nonmagical pieces.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.309",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Uncommon",
    "requires_attunement": "",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "winged-boots",
  "fields": {
    "name": "Winged Boots",
    "desc": "While you are wearing these boots, you have a flying speed equal to your Speed and you can hover. You can use these boots to fly for 2 hours, expending at least 10 minutes worth of time with each use. If you are flying when the time runs out, you fall at a rate of 30 feet per round and take no damage from landing.\n\nThe boots regain 1 hour of flying time for every 12 hours they are not in use.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.309",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
},
{
  "model": "api.magicitem",
  "pk": "wings-of-flying",
  "fields": {
    "name": "Wings of Flying",
    "desc": "While you are wearing this cloak, you can use an action speaking its command word to transform it into a pair of wings. The wings last for 1 hour or until you use an action to speak the command word to dismiss them. The wings give you a flying speed of 60 feet. After being used in this way, the wings disappear and cannot be used again for 2d6 hours.",
    "document": 32,
    "created_at": "2023-11-05T00:01:38.309",
    "page_no": null,
    "type": "Wondrous Item",
    "rarity": "Rare",
    "requires_attunement": "requires attunement",
    "route": "magicitems/"
  }
}
]
