[
    {
        "model": "api_v2.item",
        "pk": "brass-clockwork-staff",
        "fields": {
            "name": "Brass Clockwork Staff",
            "desc": "This curved staff is made of coiled brass and glass wire. You can use an action to speak one of three command words and throw the staff on the ground within 10 feet of you. The staff transforms into one of three wireframe creatures, depending on the command word: a unicorn, a hound, or a swarm of tiny beetles. The wireframe creature or swarm is under your control and acts on its own initiative count. On your turn, you can mentally command the wireframe creature or swarm if it is within 60 feet of you and you aren't incapacitated. You decide what action the creature takes and where it moves during its next turn, or you can issue it a general command, such as to attack your enemies or guard a location. The wireframe unicorn lasts for up to 1 hour, uses the statistics of a warhorse, and can be used as a mount. The wireframe hound lasts for up to 5 minutes, uses the statistics of a dire wolf, and has advantage to track any creature you damaged within the past hour. The wireframe beetle swarm lasts for up to 1 minute, uses the statistics of a swarm of beetles, and can destroy nonmagical objects that aren't being worn or carried and that aren't made of stone or metal (destruction happens at a rate of 1 pound of material per round, up to a maximum of 10 pounds). At the end of the duration, the wireframe creature or swarm reverts to its staff form. It reverts to its staff form early if it drops to 0 hit points or if you use an action to speak the command word again while touching it. If it reverts to its staff form early by being reduced to 0 hit points, the staff becomes inert and unusable until the third dawn after the creature was killed. Otherwise, the wireframe creature or swarm has all of its hit points when you transform the staff into the creature again. When a wireframe creature or swarm becomes the staff again, this property of the staff can't be used again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "crystal-staff",
        "fields": {
            "name": "Crystal Staff",
            "desc": "Carved from a single piece of solid crystal, this staff has numerous reflective facets that produce a strangely hypnotic effect. The staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: color spray (1 charge), confound senses* (3 charges), confusion (4 charges), hypnotic pattern (3 charges), jeweled fissure* (3 charges), prismatic ray* (5 charges), or prismatic spray (7 charges). Spells marked with an asterisk (*) can be found in Deep Magic for 5th Edition. At the GM's discretion, spells from Deep Magic for 5th Edition can be replaced with other spells of similar levels and similarly related to light or confusion. The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the crystal shatters, destroying the staff and dealing 2d6 piercing damage to each creature within 10 feet of it.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rowan-staff",
        "fields": {
            "name": "Rowan Staff",
            "desc": "Favored by those with ties to nature and death, this staff can be wielded as a magic quarterstaff that grants a +1 bonus to attack and damage rolls made with it. While holding it, you have an advantage on saving throws against spells. The staff has 10 charges for the following properties. It regains 1d4 + 1 expended charges daily at midnight, though it regains all its charges if it is bathed in moonlight at midnight. If you expend the last charge, roll a d20. On a 1, the staff loses its properties and becomes a nonmagical quarterstaff. Spell. While holding this staff, you can use an action to expend 1 or more of its charges to cast animate dead, using your spell save DC and spellcasting ability. The target bones or corpse can be a Medium or smaller humanoid or beast. Each charge animates a separate target. These undead creatures are under your control for 24 hours. You can use an action to expend 1 charge each day to reassert your control of up to four undead creatures created by this staff for another 24 hours. Deanimate. You can use an action to strike an undead creature with the staff in combat. If the attack hits, the target must succeed on a DC 17 Constitution saving throw or revert to an inanimate pile of bones or corpse in its space. If the undead has the Incorporeal Movement trait, it is destroyed instead. Deanimating an undead creature expends a number of charges equal to twice the challenge rating of the creature (minimum of 1). If the staff doesn’t have enough charges to deanimate the target, the staff doesn’t deanimate the target.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": true,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "seelie-staff",
        "fields": {
            "name": "Seelie Staff",
            "desc": "This white ash staff is decorated with gold and tipped with an uncut crystal of blue quartz. This staff can be wielded as a magic quarterstaff. While holding the staff, you have advantage on Charisma checks made to influence or interact socially with fey creatures. The staff has 10 charges for the following properties. The staff regains 1d6 + 4 charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff dissolves into a shower of fragrant flower petals, which blow away in a sudden wind. Rebuke Fey. When you hit a fey creature with a melee attack using the staff, you can expend 1 charge to deal an extra 2d6 radiant damage to the target. If the fey has an evil alignment, the extra damage increases to 4d6, and the target must succeed on a DC 15 Wisdom saving throw or be frightened of you until the start of your next turn. Spells. While holding this staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: charm person (1 charge), conjure woodland beings (4 charges), disguise self (1 charge), pass without trace (2 charges), or tree stride (5 charges). You can also use an action to cast the vicious mockery cantrip from the staff without using any charges.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "serpent-staff",
        "fields": {
            "name": "Serpent Staff",
            "desc": "Fashioned from twisted ash wood, this staff 's head is carved in the likeness of a serpent preparing to strike. You have resistance to poison damage while you hold this staff. The staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the carved snake head twists and magically consumes the rest of the staff, destroying it. Spells. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: cloudkill (5 charges), detect poison and disease (1 charge), poisoned volley* (2 charges), or protection from poison (2 charges). You can also use an action to cast the poison spray spell from the staff without using any charges. Spells marked with an asterisk (*) can be found in Deep Magic for 5th Edition. Serpent Form. While holding the staff, you can use an action cast polymorph on yourself, transforming into a serpent or snake that has a challenge rating of 2 or lower. While you are in the form of a serpent, you retain your Intelligence, Wisdom, and Charisma scores. You can remain in serpent form for up to 1 minute, and you can revert to your normal form as an action. Once used, this property can’t be used again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "soldras-staff",
        "fields": {
            "name": "Soldra's Staff",
            "desc": "Crafted by a skilled wizard and meant to be a spellcaster's last defense, this staff is 5 feet long, made of yew wood that curves at its top, is iron shod at its mid-section, and capped with a silver dragon's claw that holds a lustrous, though rough and uneven, black pearl. When you make an attack with this staff, it howls and whistles hauntingly like the wind. When you cast a spell from this staff, it chirps like insects on a hot summer night. This staff can be wielded as a magic quarterstaff that grants a +1 bonus to attack and damage rolls made with it. It has 3 charges. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: faerie fire (1 charge) or gust of wind (2 charges). The staff regains 1d3 expended charges daily at dawn. Once daily, it can regain 1 expended charge by exposing the staff 's pearl to moonlight for 1 minute.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "spider-staff",
        "fields": {
            "name": "Spider Staff",
            "desc": "Delicate web-like designs are carved into the wood of this twisted staff, which is often topped with the carved likeness of a spider. The staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, a swarm of spiders appears and consumes the staff then vanishes. Spells. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: giant insect (4 charges), spider climb (2 charges), or web (2 charges). Spider Swarm. While holding the staff, you can use an action and expend 1 charge to cause a swarm of spiders to appear in a space that you can see within 60 feet of you. The swarm is friendly to you and your companions but otherwise acts on its own. The swarm of spiders remains for 1 minute, until you dismiss it as an action, or until you move more than 100 feet away from it.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": true,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "splinter-staff",
        "fields": {
            "name": "Splinter Staff",
            "desc": "This roughly made staff has cracked and splintered ends and can be wielded as a magic quarterstaff. When you roll a 20 on an attack roll made with this weapon, you embed a splinter in the target's body, and the pain and discomfort of the splinter is distracting. While the splinter remains embedded, the target has disadvantage on Dexterity, Intelligence, and Wisdom checks, and, if it is concentrating on a spell, it must succeed on a DC 10 Constitution saving throw at the start of each of its turns to maintain concentration on the spell. A creature, including the target, can take its action to remove the splinter by succeeding on a DC 13 Wisdom (Medicine) check.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-binding",
        "fields": {
            "name": "Staff of Binding",
            "desc": "Made from stout oak with steel bands and bits of chain running its entire length, the staff feels oddly heavy. This staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff constricts in upon itself and is destroyed. Spells. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: arcane lock (2 charges), hold monster (5 charges), hold person (2 charges), lock armor* (2 charges), or planar binding (5 charges). Spells marked with an asterisk (*) can be found in Deep Magic for 5th Edition. Unbound. While holding the staff, you can use your reaction to expend 1 charge and gain advantage on a saving throw you make to avoid being paralyzed or restrained.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-camazotz",
        "fields": {
            "name": "Staff of Camazotz",
            "desc": "This staff of petrified wood is topped with a stylized carving of a bat with spread wings, a mouth baring great fangs, and a pair of ruby eyes. It has 10 charges and regains 1d6 + 4 charges daily at dawn. As long as the staff holds at least 1 charge, you can communicate with bats as if you shared a language. Bat and bat-like beasts and monstrosities never attack you unless magically forced to do so or unless you attack them first. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: darkness (2 charges), dominate monster (8 charges), or flame strike (5 charges).",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-channeling",
        "fields": {
            "name": "Staff of Channeling",
            "desc": "This plain, wooden staff has 5 charges and regains 1d4 + 1 expended charges daily at dawn. When you cast a spell while holding this staff, you can expend 1 or more of its charges as part of the casting to increase the level of the spell. Expending 1 charge increases the spell's level by 1, expending 3 charges increases the spell's level by 2, and expending 5 charges increases the spell's level by 3. When you increase a spell's level using the staff, the spell casts as if you used a spell slot of a higher level, but you don't expend that higher-level spell slot. You can't use the magic of this staff to increase a spell to a slot level higher than the highest spell level you can cast. For example, if you are a 7th-level wizard, and you cast magic missile, expending a 2nd-level spell slot, you can expend 3 of the staff 's charges to cast the spell as a 4th-level spell, but you can't expend 5 of the staff 's charges to cast the spell as a 5th-level spell since you can't cast 5th-level spells.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-desolation",
        "fields": {
            "name": "Staff of Desolation",
            "desc": "This staff can be wielded as a magic quarterstaff that grants a +1 bonus to attack and damage rolls made with it. When you hit an object or structure with a melee attack using the staff, you deal double damage (triple damage on a critical hit). The staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: thunderwave (1 charge), shatter (2 charges), circle of death (6 charges), disintegrate (6 charges), or earthquake (8 charges). The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff crumbles to dust and is destroyed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": true,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-dissolution",
        "fields": {
            "name": "Staff of Dissolution",
            "desc": "A gray crystal floats in the crook of this twisted staff. The crystal breaks into fragments as it slowly revolves, and those fragments break into smaller pieces then into clouds of dust. In spite of this, the crystal never seems to reduce in size. You have resistance to necrotic damage while you hold this staff. The staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: blight (4 charges), disintegrate (6 charges), or shatter (2 charges). The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff crumbles to dust.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": true,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-fate",
        "fields": {
            "name": "Staff of Fate",
            "desc": "One half of this staff is crafted of white ash and capped in gold, while the other is ebony and capped in silver. The staff has 10 charges for the following properties. It regains 1d6 + 4 charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff splits into two halves with a resounding crack and becomes nonmagical. Fortune. While holding the staff, you can use an action to expend 1 of its charges and touch a creature with the gold end of the staff, giving it good fortune. The target can choose to use its good fortune and have advantage on one ability check, attack roll, or saving throw. This effect ends after the target has used the good fortune three times or when 24 hours have passed. Misfortune. While holding the staff, you can use an action to touch a creature with the silver end of the staff. The target must succeed on a DC 15 Wisdom saving throw or have disadvantage on one of the following (your choice): ability checks, attack rolls, or saving throws. If the target fails the saving throw, the staff regains 1 expended charge. This effect lasts until removed by the remove curse spell or until you use an action to expend 1 of its charges and touch the creature with the gold end of the staff. Spells. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: augury (2 charges), bane (1 charge), bless (1 charge), remove curse (3 charges), or divination (4 charges). You can also use an action to cast the guidance spell from the staff without using any charges.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-feathers",
        "fields": {
            "name": "Staff of Feathers",
            "desc": "Several eagle feathers line the top of this long, thin staff. The staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff explodes into a mass of eagle feathers and is destroyed. Feather Travel. When you are targeted by a ranged attack while holding the staff, you can use a reaction to teleport up to 10 feet to an unoccupied space that you can see. When you do, you briefly transform into a mass of feathers, and the attack misses. Once used, this property can’t be used again until the next dawn. Spells. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: conjure animals (2 giant eagles only, 3 charges), fly (3 charges), or gust of wind (2 charges).",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-giantkin",
        "fields": {
            "name": "Staff of Giantkin",
            "desc": "This stout, oaken staff is 7 feet long, bound in iron, and topped with a carving of a broad, thick-fingered hand. While holding this magic quarterstaff, your Strength score is 20. This has no effect on you if your Strength is already 20 or higher. The staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the hand slowly clenches into a fist, and the staff becomes a nonmagical quarterstaff.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-ice-and-fire",
        "fields": {
            "name": "Staff of Ice and Fire",
            "desc": "Made from the branch of a white ash tree, this staff holds a sapphire at one end and a ruby at the other. The staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: flaming sphere (2 charges), freezing sphere (6 charges), sleet storm (3 charges), or wall of fire (4 charges). The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff and its gems crumble into ash and snow and are destroyed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-master-lu-po",
        "fields": {
            "name": "Staff of Master Lu Po",
            "desc": "This plain-looking, wooden staff can be wielded as a magic quarterstaff that grants a +1 bonus to attack and damage rolls made with it. The staff has 12 charges and regains 1d6 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff retains its +1 bonus to attack and damage rolls, loses all other properties, and the next time you roll a 20 on an attack roll using the staff, it explodes, dealing an extra 6d6 force damage to the target then is destroyed. On a 20, the staff regains 1d10 + 2 charges. Some of the staff ’s properties require the target to make a saving throw to resist or lessen the property’s effects. The saving throw DC is equal to 8 + your proficiency bonus + your Wisdom modifier. Bamboo in the Rainy Season. While holding the staff, you can use a bonus action to expend 1 charge to grant the staff the reach property until the start of your next turn. Gate to the Hell of Being Roasted Alive. While holding the staff, you can use an action to expend 1 charge to cast the scorching ray spell from it. When you make the spell’s attacks, you use your Wisdom modifier as your spellcasting ability. Iron Whirlwind. While holding the staff, you use an action to expend 2 charges, causing weighted chains to extend from the end of the staff and reducing your speed to 0 until the end of your next turn. As part of the same action, you can make one attack with the staff against each creature within your reach. If you roll a 1 on any attack, you must immediately make an attack roll against yourself as well before resolving any other attacks against opponents. Monkey Steals the Peach. While holding the staff, you can use a bonus action to expend 1 charge to extend sharp, grabbing prongs from the end of the staff. Until the start of your next turn, each time you hit a creature with the staff, the target takes piercing damage instead of the bludgeoning damage normal for the staff, and the target must make a DC 15 Constitution saving throw. On a failure, the target is incapacitated until the end of its next turn as it suffers crippling pain. On a success, the target has disadvantage on its next attack roll. Rebuke the Disobedient Child. When you are hit by a creature you can see within your reach while holding this staff, you can use a reaction to expend 1 charge to make an attack with the staff against the attacker. Seven Vengeful Demons Death Strike. While holding the staff, you can use an action to expend 7 charges and make one attack against a target within 5 feet of you with the staff. If the attack hits, the target takes bludgeoning damage as normal, and it must make a Constitution saving throw, taking 7d8 necrotic damage on a failed save, or half as much damage on a successful one. If the target dies from this damage, the staff ceases to function as anything other than a magic quarterstaff until the next dawn, but it regains all expended charges when its powers return. A humanoid killed by this damage rises at the start of your next turn as a zombie that is permanently under your command, following your verbal orders to the best of its ability. Swamp Hag's Deadly Breath. While holding the staff, you can use an action to expend 2 charges to expel a 15-foot cone of poisonous gas out of the end of the staff. Each creature in the area must make a Constitution saving throw. On a failure, a creature takes 4d6 poison damage and is poisoned for 1 hour. On a success, a creature takes half the damage and isn’t poisoned. Vaulting Leap of the Clouds. If you are holding the staff and it has at least 1 charge, you can cast the jump spell from it as a bonus action at will without using any charges, but you can target only yourself when you do so.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-midnight",
        "fields": {
            "name": "Staff of Midnight",
            "desc": "Fashioned from a single branch of polished ebony, this sturdy staff is topped by a lustrous jet. While holding it and in dim light or darkness, you gain a +1 bonus to AC and saving throws. This staff has 10 charges. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: circle of death (6 charges), darkness (2 charges), or vampiric touch (3 charges). You can also use an action to cast the chill touch cantrip from the staff without using any charges. The staff regains 1d6 + 4 expended charges daily at dusk. If you expend the last charge, roll a d20. On a 1, the staff crumbles to dark powder and is destroyed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-minor-curses",
        "fields": {
            "name": "Staff of Minor Curses",
            "desc": "This twisted, wooden staff has 10 charges. While holding it, you can use an action to inflict a minor curse on a creature you can see within 30 feet of you. The target must succeed on a DC 10 Constitution saving throw or be affected by the chosen curse. A minor curse causes a non-debilitating effect or change in the creature, such as an outbreak of boils on one section of the target's skin, intermittent hiccupping, transforming the target's ears into small, donkey-like ears, or similar effects. The curse never interrupts spellcasting and never causes disadvantage on ability checks, attack rolls, or saving throws. The curse lasts for 24 hours or until removed by the remove curse spell or similar magic. The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff dissolves into a cloud of noxious gas, and you are targeted with a minor curse of the GM's choice.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-parzelon",
        "fields": {
            "name": "Staff of Parzelon",
            "desc": "This tarnished silver staff is tipped with the unholy visage of a fiendish lion skull carved from labradorite—a likeness of the Arch-Devil Parzelon (see Creature Codex). The staff can be wielded as a magic quarterstaff that grants a +2 bonus to attack and damage rolls made with it. While you hold it, you gain a +2 bonus to spell attack rolls. The staff has 20 charges for the following properties. It regains 2d8 + 4 expended charges daily at dusk. If you expend the last charge, roll a d20. On a 20, the staff regains 1d8 + 2 charges. Spells. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: charm person (1 charge), dominate person (5 charges), lightning bolt (3 charges), locate creature (4 charges), locate object (2 charges), magic missile (1 charge), scrying (5 charges), or suggestion (2 charges). You can also use an action to cast one of the following spells from the staff without using any charges: comprehend languages, detect evil and good, detect magic, identify, or message. Extract Ageless Knowledge. As an action, you can touch the head of the staff to a corpse. You must form a question in your mind as part of this action. If the corpse has an answer to your question, it reveals the information to you. The answer is always brief—no more than one sentence—and very specific to the framed question. The corpse doesn’t need a mouth to answer; you receive the information telepathically. The corpse knows only what it knew in life, and it is under no compulsion to offer a truthful answer if you are hostile to it or it recognizes you as an enemy. This property doesn’t return the creature’s soul to its body, only its animating spirit. Thus, the corpse can’t learn new information, doesn’t comprehend anything that has happened since it died, and can’t speculate about future events. Once the staff has been used to ask a corpse 5 questions, it can’t be used to extract knowledge from that same corpse again until 3 days have passed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-portals",
        "fields": {
            "name": "Staff of Portals",
            "desc": "This iron-shod wooden staff is heavily worn, and it can be wielded as a quarterstaff that grants a +1 bonus to attack and damage rolls made with it. The staff has 10 charges and regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff loses all of its magic and becomes a nonmagical quarterstaff. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: arcane lock (2 charges), dimension door (4 charges), knock (2 charges), or passwall (5 charges).",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-scrying",
        "fields": {
            "name": "Staff of Scrying",
            "desc": "This is a graceful, highly polished wooden staff crafted from willow. A crystal ball tops the staff, and smooth gold bands twist around its shaft. This staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: detect thoughts (2 charges), locate creature (4 charges), locate object (2 charges), scrying (5 charges), or true seeing (6 charges). The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, a bright flash of light erupts from the crystal ball, and the staff vanishes.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-spores",
        "fields": {
            "name": "Staff of Spores",
            "desc": "Mold and mushrooms coat this gnarled wooden staff. The staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff rots into tiny clumps of slimy, organic matter and is destroyed. Mushroom Disguise. While holding the staff, you can use an action to expend 2 charges to cover yourself and anything you are wearing or carrying with a magical illusion that makes you look like a mushroom for up to 1 hour. You can appear to be a mushroom of any color or shape as long as it is no more than one size larger or smaller than you. This illusion ends early if you move or speak. The changes wrought by this effect fail to hold up to physical inspection. For example, if you appear to have a spongy cap in place of your head, someone touching the cap would feel your face or hair instead. Otherwise, a creature must take an action to visually inspect the illusion and succeed on a DC 20 Intelligence (Investigation) check to discern that you are disguised. Speak with Plants. While holding the staff, you can use an action to expend 1 of its charges to cast the speak with plants spell from it. Spore Cloud. While holding the staff, you can use an action to expend 3 charges to release a cloud of spores in a 20-foot radius from you. The spores remain for 1 minute, making the area lightly obscured for creatures other than you. The cloud moves with you, remaining centered on you. When a creature, other than you, enters the cloud of spores for the first time on a turn or starts its turn there, that creature must succeed on a DC 15 Constitution saving throw or take 1d6 poison damage and become poisoned until the start of its next turn. A wind of at least 10 miles per hour disperses the spores and ends the effect.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-thorns",
        "fields": {
            "name": "Staff of Thorns",
            "desc": "This gnarled and twisted oak staff has numerous thorns growing from its surface. Green vines tightly wind their way up along the shaft. The staff can be wielded as a magic quarterstaff that grants a +1 bonus to attack and damage rolls made with it. The staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the thorns immediately fall from the staff and it becomes a nonmagical quarterstaff. Spells. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: barkskin (2 charges), entangle (1 charge), speak with plants (3 charges), spike growth (2 charges), or wall of thorns (6 charges). Thorned Strike. When you hit with a melee attack using the staff, you can expend up to 3 of its charges. For each charge you expend, the target takes an extra 1d6 piercing damage.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-voices",
        "fields": {
            "name": "Staff of Voices",
            "desc": "The length of this wooden staff is carved with images of mouths whispering, speaking, and screaming. This staff can be wielded as a magic quarterstaff. While holding this staff, you can't be deafened, and you can act normally in areas where sound is prevented, such as in the area of a silence spell. Any creature that is not deafened can hear your voice clearly from up to 1,000 feet away if you wish them to hear it. The staff has 10 charges for the following properties. The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the mouths carved into the staff give a collective sigh and close, and the staff becomes a nonmagical quarterstaff. Spells. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: divine word (7 charges), magic mouth (2 charges), speak with animals (1 charge), speak with dead (3 charges), speak with plants (3 charges), or word of recall (6 charges). You can also use an action to cast the vicious mockery cantrip from the staff without using any charges. Thunderous Shout. While holding the staff, you can use an action to expend 1 charge and release a chorus of mighty shouts in a 15-foot cone from it. Each creature in the area must make a Constitution saving throw. On a failure, a creature takes 2d8 thunder damage and is deafened for 1 minute. On a success, a creature takes half the damage and is deafened until the end of its next turn. A deafened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-winter-and-ice",
        "fields": {
            "name": "Staff of Winter and Ice",
            "desc": "This pure white, pine staff is topped with an ornately faceted shard of ice. The entire staff is cold to the touch. You have resistance to cold damage while you hold this staff. The staff has 20 charges for the following properties. It regains 2d8 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff retains its resistance to cold damage but loses all other properties. On a 20, the staff regains 1d8 + 2 charges. Spells. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: Boreas’s breath* (2 charges), cone of cold (5 charges), curse of Boreas* (6 charges), ice storm (4 charges), flurry* (1 charge), freezing fog* (3 charges), freezing sphere (6 charges), frostbite* (5 charges), frozen razors* (3 charges), gliding step* (1 charge), sleet storm (3 charges), snow boulder* (4 charges), triumph of ice* (7 charges), or wall of ice (6 charges). You can also use an action to cast the chill touch or ray of frost spell from the staff without using any charges. Spells marked with an asterisk (*) can be found in Deep Magic for 5th Edition. At the GM’s discretion, spells from Deep Magic for 5th Edition can be replaced with other spells of similar levels and similarly related to ice, snow, or wintry weather. Retributive Strike. You can use an action to break the staff over your knee or against a solid surface, performing a retributive strike. The staff is destroyed and releases its remaining magic in an explosion that expands to fill a 30-foot-radius sphere centered on it. You have a 50 percent chance to instantly travel to a random plane of existence, avoiding the explosion. If you fail to avoid the effect, you take cold damage equal to 16 × the number of charges in the staff. Every other creature in the area must make a DC 17 Dexterity saving throw. On a failed save, a creature takes an amount of cold damage based on how far away it is from the point of origin as shown in the following table. On a successful save, a creature takes half as much damage. | Distance from Origin | Damage |\n| --------------------- | -------------------------------------- |\n| 10 ft. away or closer | 8 × the number of charges in the staff |\n| 11 to 20 ft. away | 6 × the number of charges in the staff |\n| 21 to 30 ft. away | 4 × the number of charges in the staff |",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-the-armada",
        "fields": {
            "name": "Staff of the Armada",
            "desc": "This gold-shod staff is constructed out of a piece of masting from a galleon. The staff can be wielded as a magic quarterstaff that grants you a +1 bonus to attack and damage rolls made with it. While you are on board a ship, this bonus increases to +2. The staff has 10 charges and regains 1d8 + 2 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff loses all of its magic and becomes a nonmagical quarterstaff. Spells. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: control water (4 charges), fog cloud (1 charge), gust of wind (2 charges), or water walk (3 charges). You can also use an action to cast the ray of frost cantrip from the staff without using any charges.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-the-artisan",
        "fields": {
            "name": "Staff of the Artisan",
            "desc": "This simple, wooden staff can be wielded as a magic quarterstaff that grants a +2 bonus to attack and damage rolls made with it. The staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff vanishes in a flash of light, lost forever. Create Object. You can use an action to expend 2 charges to conjure an inanimate object in your hand or on the ground in an unoccupied space you can see within 10 feet of you. The object can be no larger than 3 feet on a side and weigh no more than 10 pounds, and its form must be that of a nonmagical object you have seen. You can’t create items that ordinarily require a high degree of craftsmanship, such as jewelry, weapons, glass, or armor, unless you have proficiency with the type of artisan’s tools used to craft such objects. The object sheds dim light in a 5-foot radius. The object disappears after 1 hour, when you use this property again, or if the object takes or deals any damage. Spells. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: animate objects (5 charges), fabricate (4 charges) or floating disk (1 charge). You can also use an action to cast the mending spell from the staff without using any charges.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-the-cephalopod",
        "fields": {
            "name": "Staff of the Cephalopod",
            "desc": "This ugly staff is fashioned from a piece of gnarled driftwood and is crowned with an octopus carved from brecciated jasper. Its gray and red stone tentacles wrap around the top half of the staff. While holding this staff, you have a swimming speed of 30 feet. This staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the jasper octopus crumbles to dust, and the staff becomes a nonmagical piece of driftwood. Spells. While holding this staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: black tentacles (4 charges), conjure animals (only beasts that can breathe water, 3 charges), darkness (2 charges), or water breathing (3 charges). Ink Cloud. While holding this staff, you can use an action and expend 1 charge to cause an inky, black cloud to spread out in a 30-foot radius from you. The cloud can form in or out of water. The cloud remains for 10 minutes, making the area heavily obscured for creatures other than you. The cloud moves with you, remaining centered on you. A wind of at least 10 miles per hour or a steady current (if underwater) disperses the cloud and ends the effect.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-the-four-winds",
        "fields": {
            "name": "Staff of the Four Winds",
            "desc": "Made of gently twisting ash and engraved with spiraling runes, the staff feels strangely lighter than its size would otherwise suggest. This staff has 10 charges. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: circle of wind* (1 charge), feather fall (1 charge), gust of wind (2 charges), storm god's doom* (3 charges), wind tunnel* (1 charge), wind walk (6 charges), wind wall (3 charges), or wresting wind* (2 charges). You can also use an action to cast the wind lash* spell from the staff without using any charges. Spells marked with an asterisk (*) can be found in Deep Magic for 5th Edition. At the GM's discretion, spells from Deep Magic for 5th Edition can be replaced with other spells of similar levels and similarly related to breezes, wind, or movement. The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff crumbles into ashes and is taken away with the breeze.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-the-lantern-bearer",
        "fields": {
            "name": "Staff of the Lantern Bearer",
            "desc": "An iron hook is affixed to the top of this plain, wooden staff. While holding this staff, you can use an action to cast the light spell from it at will, but the light can emanate only from the staff 's hook. If a lantern hangs from the staff 's hook, you gain the following benefits while holding the staff: - You can control the light of the lantern, lighting or extinguishing it as a bonus action. The lantern must still have oil, if it requires oil to produce a flame.\n- The lantern's flame can't be extinguished by wind or water.\n- If you are a spellcaster, you can use the staff as a spellcasting focus. When you cast a spell that deals fire or radiant damage while using this staff as your spellcasting focus, you gain a +1 bonus to the spell's attack roll, or the spell's save DC increases by 1 (your choice).",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-the-peaks",
        "fields": {
            "name": "Staff of the Peaks",
            "desc": "This staff is made of rock crystal yet weighs the same as a wooden staff. The staff can be wielded as a magic quarterstaff that grants a +2 bonus to attack and damage rolls made with it. While holding it, you gain a +2 bonus to spell attack rolls. In addition, you are immune to the effects of high altitude and severe cold weather, such as hypothermia and frostbite. The staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff shatters into fine stone fragments and is destroyed. Spells. While holding this staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: control weather (8 charges), fault line* (6 charges), gust of wind (2 charges), ice storm (4 charges), jump (1 charge), snow boulder* (4 charges), or wall of stone (5 charges). Spells marked with an asterisk (*) can be found in Deep Magic for 5th Edition. Stone Strike. When you hit a creature or object made of stone or earth with this staff, you can expend 5 of its charges to shatter the target. The target must make a DC 17 Constitution saving throw, taking an extra 10d6 force damage on a failed save, or half as much damage on a successful one. If the target is an object that is being worn or carried, the creature wearing or carrying it must make the saving throw, but only the object takes the damage. If this damage reduces the target to 0 hit points, it shatters and is destroyed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-the-scion",
        "fields": {
            "name": "Staff of the Scion",
            "desc": "This unwholesome staff is crafted of a material that appears to be somewhere between weathered wood and dried meat. It weeps beads of red liquid that are thick and sticky like tree sap but smell of blood. A crystalized yellow eye with a rectangular pupil, like the eye of a goat, sits at its top. You can wield the staff as a magic quarterstaff that grants a +1 bonus to attack and damage rolls made with it. The staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the eye liquifies as the staff shrivels and twists into a blackened, smoking ruin and is destroyed. Ember Cloud. While holding the staff, you can use an action and expend 2 charges to release a cloud of burning embers from the staff. Each creature within 10 feet of you must make a DC 15 Constitution saving throw, taking 21 (6d6) fire damage on a failed save, or half as much damage on a successful one. The ember cloud remains until the start of your next turn, making the area lightly obscured for creatures other than you. A wind of at least 10 miles per hour disperses the cloud and ends the effect. Fiery Strike. When you hit with a melee attack using the staff, you can expend 1 charge to deal an extra 2d6 fire damage to the target. If you take fire damage while wielding the staff, you have advantage on attack rolls with it until the end of your next turn. While holding the staff, you have resistance to fire damage. Spells. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: augury (2 charges), barkskin (2 charges), confusion (4 charges), entangle (1 charge), or wall of fire (4 charges).",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-the-treant",
        "fields": {
            "name": "Staff of the Treant",
            "desc": "This unassuming staff appears to be little more than the branch of a tree. While holding this staff, your skin becomes bark-like, and the hair on your head transforms into a chaplet of green leaves. This staff can be wielded as a magic quarterstaff that grants a +1 bonus to attack and damage rolls made with it. Nature’s Guardian. While holding this staff, you have resistance to cold and necrotic damage, but you have vulnerability to fire and radiant damage. In addition, you have advantage on attack rolls against aberrations and undead, but you have disadvantage on saving throws against spells and other magical effects from fey and plant creatures. One with the Woods. While holding this staff, your AC can’t be less than 16, regardless of what kind of armor you are wearing, and you can’t be tracked when you travel through terrain with excessive vegetation, such as a forest or grassland. Tree Friend. While holding this staff, you can use an action to animate a tree you can see within 60 feet of you. The tree uses the statistics of an animated tree and is friendly to you and your companions. Roll initiative for the tree, which has its own turns. It obeys any verbal commands that you issue to it (no action required by you), as long as they don’t directly harm other trees or the natural world. If you don’t issue any commands to the three, it defends itself from hostile creatures but otherwise takes no actions. Once used, this property can’t be used again until the next dawn. Venerated Tree. If you spend 1 hour in silent reverence at the base of a Huge or larger tree, you can use an action to plant this staff in the soil above the tree’s roots and awaken the tree as a treant. The treant isn’t under your control, but it regards you as a friend as long as you don’t harm it or the natural world around it. Roll a d20. On a 1, the staff roots into the ground, growing into a sapling, and losing its magic. Otherwise, after you awaken a treant with this staff, you can’t do so again until 30 days have passed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-the-unhatched",
        "fields": {
            "name": "Staff of the Unhatched",
            "desc": "This staff carved from a burnt ash tree is topped with an unhatched dragon’s (see Creature Codex) skull. This staff can be wielded as a magic quarterstaff. The staff has 5 charges for the following properties. It regains 1d4 + 1 expended charges daily at dusk. If you expend the last charge, roll a d20. On a 1, the staff crumbles to dust and is destroyed. Necrotic Strike. When you hit with a melee attack using the staff, you can expend 1 charge to deal an extra 1d8 necrotic damage to the target. Spells. While holding the staff, you can use an action to expend 1 charge to cast bane or protection from evil and good from it using your spell save DC. You can also use an action to cast one of the following spells from the staff without using any charges, using your spell save DC and spellcasting ability: chill touch or minor illusion.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "staff-of-the-white-necromancer",
        "fields": {
            "name": "Staff of the White Necromancer",
            "desc": "Crafted from polished bone, this strange staff is carved with numerous arcane symbols and mystical runes. The staff has 10 charges. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: false life (1 charge), gentle repose (2 charges), heartstop* (2 charges), death ward (4 charges), raise dead (5 charges), revivify (3 charges), shared sacrifice* (2 charges), or speak with dead (3 charges). You can also use an action to cast the bless the dead* or spare the dying spell from the staff without using any charges. Spells marked with an asterisk (*) can be found in Deep Magic for 5th Edition. The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the bone staff crumbles to dust.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": true,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "stone-staff",
        "fields": {
            "name": "Stone Staff",
            "desc": "Sturdy and smooth, this impressive staff is crafted from solid stone. Most stone staves are crafted by dwarf mages and few ever find their way into non-dwarven hands. The staff can be wielded as a magic quarterstaff that grants a +1 bonus to attack and damage rolls made with it. The staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: earthskimmer* (4 charges), entomb* (6 charges), flesh to stone (6 charges), meld into stone (3 charges), stone shape (4 charges), stoneskin (4 charges), or wall of stone (5 charges). You can also use an action to cast the pummelstone* or true strike spell from the staff without using any charges. Spells marked with an asterisk (*) can be found in Deep Magic for 5th Edition. The staff regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, hundreds of cracks appear across the staff 's surface and it crumbles into tiny bits of stone.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": true,
            "category": "staff",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "stonedrift-staff",
        "fields": {
            "name": "Stonedrift Staff",
            "desc": "This staff is fashioned from petrified wood and crowned with a raw chunk of lapis lazuli veined with gold. The staff can be wielded as a magic quarterstaff. The staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff crumbles to dust and is destroyed. Spells. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: animate objects (only stone objects, 5 charges), earthquake (8 charges), passwall (only stone surfaces, 5 charges), or stone shape (4 charges). Elemental Speech. You can speak and understand Primordial while holding this staff. Favor of the Earthborn. While holding the staff, you have advantage on Charisma checks made to influence earth elementals or other denizens of the Plane of Earth. Stone Glide. If the staff has at least 1 charge, you have a burrowing speed equal to your walking speed, and you can burrow through earth and stone while holding this staff. While doing so, you don’t disturb the material you move through.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "stygian-crook",
        "fields": {
            "name": "Stygian Crook",
            "desc": "This staff of gnarled, rotted wood ends in a hooked curvature like a twisted shepherd's crook. The staff has 10 charges. While holding it, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC: bestow curse (3 charges), blight (4 charges), contagion (5 charges), false life (1 charge), or hallow (5 charges). The staff regains 1d6 + 4 expended charges daily at dusk. If you expend the last charge, roll a d20. On a 1, the staff turns to live maggots and is destroyed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "umbral-staff",
        "fields": {
            "name": "Umbral Staff",
            "desc": "Made of twisted darkwood and covered in complex runes and sigils, this powerful staff seems to emanate darkness. You have resistance to radiant damage while you hold this staff. The staff has 20 charges for the following properties. It regains 2d8 + 4 expended charges daily at midnight. If you expend the last charge, roll a d20. On a 1, the staff retains its ability to cast the claws of darkness*, douse light*, and shadow blindness* spells but loses all other properties. On a 20, the staff regains 1d8 + 2 charges. Spells. While holding the staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: become nightwing* (6 charges), black hand* (4 charges), black ribbons* (1 charge), black well* (6 charges), cloak of shadow* (1 charge), darkvision (2 charges), darkness (2 charges), dark dementing* (5 charges), dark path* (2 charges), darkbolt* (2 charges), encroaching shadows* (6 charges), night terrors* (4 charges), shadow armor* (1 charge), shadow hands* (1 charge), shadow puppets* (2 charges), or slither* (2 charges). You can also use an action to cast the claws of darkness*, douse light*, or shadow blindness* spell from the staff without using any charges. Spells marked with an asterisk (*) can be found in Deep Magic for 5th Edition. At the GM’s discretion, spells from Deep Magic for 5th Edition can be replaced with other spells of similar levels and similarly related to darkness, shadows, or terror. Retributive Strike. You can use an action to break the staff over your knee or against a solid surface, performing a retributive strike. The staff is destroyed and releases its remaining magic in an explosion of darkness (as the darkness spell) that expands to fill a 30-foot-radius sphere centered on it. You have a 50 percent chance to instantly travel to the Plane of Shadow, avoiding the explosion. If you fail to avoid the effect, you take necrotic damage equal to 16 × the number of charges in the staff. Every other creature in the area must make a DC 17 Dexterity saving throw. On a failed save, a creature takes an amount of damage based on how far away it is from the point of origin as shown in the following table. On a successful save, a creature takes half as much damage. | Distance from Origin | Damage |\n| --------------------- | -------------------------------------- |\n| 10 ft. away or closer | 8 × the number of charges in the staff |\n| 11 to 20 ft. away | 6 × the number of charges in the staff |\n| 21 to 30 ft. away | 4 × the number of charges in the staff |",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": true,
            "category": "staff",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "unseelie-staff",
        "fields": {
            "name": "Unseelie Staff",
            "desc": "This ebony staff is decorated in silver and topped with a jagged piece of obsidian. This staff can be wielded as a magic quarterstaff. While holding the staff, you have advantage on Charisma checks made to influence or interact socially with fey creatures. The staff has 10 charges for the following properties. The staff regains 1d6 + 4 charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the staff dissolves into a shower of powdery snow, which blows away in a sudden, chill wind. Rebuke Fey. When you hit a fey creature with a melee attack using the staff, you can expend 1 charge to deal an extra 2d6 necrotic damage to the target. If the fey has a good alignment, the extra damage increases to 4d6, and the target must succeed on a DC 15 Wisdom saving throw or be frightened of you until the start of your next turn. Spells. While holding this staff, you can use an action to expend 1 or more of its charges to cast one of the following spells from it, using your spell save DC and spellcasting ability: charm person (1 charge), conjure woodland beings (4 charges), confusion (4 charges), invisibility (2 charges), or teleport (7 charges). You can also use an action to cast the vicious mockery cantrip from the staff without using any charges.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "webbed-staff",
        "fields": {
            "name": "Webbed Staff",
            "desc": "This staff is carved of ebony and wrapped in a net of silver wire. While holding it, you can't be caught in webs of any sort and can move through webs as if they were difficult terrain. This staff has 10 charges for the following properties. It regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a 1d20. On a 1, spidersilk surrounds the staff in a cocoon then quickly unravels itself and the staff, destroying the staff.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "quarterstaff",
            "armor": null,
            "requires_attunement": false,
            "category": "staff",
            "rarity": 3
        }
    }
]