[
    {
        "model": "api_v2.item",
        "pk": "ash-of-the-ebon-birch",
        "fields": {
            "name": "Ash of the Ebon Birch",
            "desc": "This salve is created by burning bark from a rare ebon birch tree then mixing that ash with oil and animal blood to create a cerise pigment used to paint yourself or another creature with profane protections. Painting the pigment on a creature takes 1 minute, and you can choose to paint a specific sigil or smear the pigment on a specific part of the creature's body.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "black-dragon-oil",
        "fields": {
            "name": "Black Dragon Oil",
            "desc": "The viscous green-black oil within this magical ceramic pot bubbles slightly. The pot's stone stopper is sealed with greasy, dark wax. The pot contains 5 ounces of pure black dragon essence, obtained by slowly boiling the dragon in its own acidic secretions. You can use an action to apply 1 ounce of the oil to a weapon or single piece of ammunition. The next attack made with that weapon or ammunition deals an extra 2d8 acid damage to the target. A creature that takes the acid damage must succeed on a DC 15 Constitution saving throw at the start of its next turn or be burned for an extra 2d8 acid damage.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "bloodlink-potion",
        "fields": {
            "name": "Bloodlink Potion",
            "desc": "When you and another willing creature each drink at least half this potion, your life energies are linked for 1 hour. When you or the creature who drank the potion with you take damage while your life energies are linked, the total damage is divided equally between you. If the damage is an odd number, roll randomly to assign the extra point of damage. The effect is halted while you and the other creature are separated by more than 60 feet. The effect ends if either of you drop to 0 hit points. This potion's red liquid is viscous and has a metallic taste.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "brain-juice",
        "fields": {
            "name": "Brain Juice",
            "desc": "This foul-smelling, murky, purple-gray liquid is created from the liquefied brains of spellcasting creatures, such as aboleths. Anyone consuming this repulsive mixture must make a DC 15 Intelligence saving throw. On a successful save, the drinker is infused with magical power and regains 1d6 + 4 expended spell slots. On a failed save, the drinker is afflicted with short-term madness for 1 day. If a creature consumes multiple doses of brain juice and fails three consecutive Intelligence saving throws, it is afflicted with long-term madness permanently and automatically fails all further saving throws brought about by drinking brain juice.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "catalyst-oil",
        "fields": {
            "name": "Catalyst Oil",
            "desc": "This special elemental compound draws on nearby energy sources. Catalyst oils are tailored to one specific damage type (not including bludgeoning, piercing, or slashing damage) and have one dose. Whenever a spell or effect of this type goes off within 60 feet of a dose of catalyst oil, the oil catalyzes and becomes the spell's new point of origin. If the spell affects a single target, its original point of origin becomes the new target. If the spell's area is directional (such as a cone or a cube) you determine the spell's new direction. This redirected spell is easier to evade. Targets have advantage on saving throws against the spell, and the caster has disadvantage on the spell attack roll.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "cleaning-concoction",
        "fields": {
            "name": "Cleaning Concoction",
            "desc": "This fresh-smelling, clear green liquid can cover a Medium or smaller creature or object (or matched set of objects, such as a suit of clothes or pair of boots). Applying the liquid takes 1 minute. It removes soiling, stains, and residue, and it neutralizes and removes odors, unless those odors are particularly pungent, such as in skunks or creatures with the Stench trait. Once the potion has cleaned the target, it evaporates, leaving the creature or object both clean and dry.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "companions-broth",
        "fields": {
            "name": "Companion's Broth",
            "desc": "Developed by wizards with an interest in the culinary arts, this simple broth mends the wounds of companion animals and familiars. When a beast or familiar consumes this broth, it regains 2d4 + 2 hit points. Alternatively, you can mix a flower petal into the broth, and the beast or familiar gains 2d4 temporary hit points for 8 hours instead.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "cordial-of-understanding",
        "fields": {
            "name": "Cordial of Understanding",
            "desc": "When you drink this tangy, violet liquid, your mind opens to new forms of communication. For 1 hour, if you spend 1 minute listening to creatures speaking a particular language, you gain the ability to communicate in that language for the duration. This potion's magic can also apply to non-verbal languages, such as a hand signal-based or dance-based language, so long as you spend 1 minute watching it being used and have the appropriate anatomy and limbs to communicate in the language.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "courtesans-allure",
        "fields": {
            "name": "Courtesan's Allure",
            "desc": "This perfume has a sweet, floral scent and captivates those with high social standing. The perfume can cover one Medium or smaller creature, and applying it takes 1 minute. For 1 hour, the affected creature gains a +5 bonus to Charisma checks made to socially interact with or influence nobles, politicians, or other individuals with high social standing.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "draught-of-ambrosia",
        "fields": {
            "name": "Draught of Ambrosia",
            "desc": "The liquid in this tiny vial is golden and has a heady, floral scent. When you drink the draught, it fortifies your body and mind, removing any infirmity caused by old age. You stop aging and are immune to any magical and nonmagical aging effects. The magic of the ambrosia lasts ten years, after which time its power fades, and you are once again subject to the ravages of time and continue aging.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "draught-of-the-black-owl",
        "fields": {
            "name": "Draught of the Black Owl",
            "desc": "When you drink this potion, you transform into a black-feathered owl for 1 hour. This effect works like the polymorph spell, except you can take only the form of an owl. While you are in the form of an owl, you retain your Intelligence, Wisdom, and Charisma scores. If you are a druid with the Wild Shape feature, you can transform into a giant owl instead. Drinking this potion doesn't expend a use of Wild Shape.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "efficacious-eyewash",
        "fields": {
            "name": "Efficacious Eyewash",
            "desc": "This clear liquid glitters with miniscule particles of light. A bottle of this potion contains 6 doses, and its lid comes with a built-in dropper. You can use an action to apply 1 dose to the eyes of a blinded creature. The blinded condition is suppressed for 2d4 rounds. If the blinded condition has a duration, subtract those rounds from the total duration; if doing so reduces the overall duration to 0 rounds or less, then the condition is removed rather than suppressed. This eyewash doesn't work on creatures that are naturally blind, such as grimlocks, or creatures blinded by severe damage or removal of their eyes.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "elixir-of-corruption",
        "fields": {
            "name": "Elixir of Corruption",
            "desc": "This elixir looks, smells, and tastes like a potion of heroism; however, it is actually a poisonous elixir masked by illusion magic. An identify spell reveals its true nature. If you drink it, you must succeed on a DC 15 Constitution saving throw or be corrupted by the diabolical power within the elixir for 1 week. While corrupted, you lose immunity to diseases, poison damage, and the poisoned condition. If you aren't normally immune to poison damage, you instead have vulnerability to poison damage while corrupted. The corruption can be removed with greater restoration or similar magic.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "elixir-of-deep-slumber",
        "fields": {
            "name": "Elixir of Deep Slumber",
            "desc": "The milky-white liquid in this vial smells of jasmine and sandalwood. When you drink this potion, you fall into a deep sleep, from which you can't be physically awakened, for 1 hour. A successful dispel magic (DC 13) cast on you awakens you but cancels any beneficial effects of the elixir. When you awaken at the end of the hour, you benefit from the sleep as if you had finished a long rest.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "elixir-of-focus",
        "fields": {
            "name": "Elixir of Focus",
            "desc": "This deep amber concoction seems to glow with an inner light. When you drink this potion, you have advantage on the next ability check you make within 10 minutes, then the elixir's effect ends.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "elixir-of-mimicry",
        "fields": {
            "name": "Elixir of Mimicry",
            "desc": "When you drink this sweet, oily, black liquid, you can imitate the voice of a single creature that you have heard speak within the past 24 hours. The effects last for 3 minutes.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "elixir-of-oracular-delirium",
        "fields": {
            "name": "Elixir of Oracular Delirium",
            "desc": "This pearlescent fluid perpetually swirls inside its container with a slow kaleidoscopic churn. When you drink this potion, you can cast the guidance spell for 1 hour at will. You can end this effect early as an action and gain the effects of the augury spell. If you do, you are afflicted with short-term madness after learning the spell's results.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "elixir-of-spike-skin",
        "fields": {
            "name": "Elixir of Spike Skin",
            "desc": "Slivers of bone float in the viscous, gray liquid inside this vial. When you drink this potion, bone-like spikes protrude from your skin for 1 hour. Each time a creature hits you with a melee weapon attack while within 5 feet of you, it must succeed on a DC 15 Dexterity saving throw or take 1d4 piercing damage from the spikes. In addition, while you are grappling a creature or while a creature is grappling you, it takes 1d4 piercing damage at the start of your turn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "elixir-of-wakefulness",
        "fields": {
            "name": "Elixir of Wakefulness",
            "desc": "This effervescent, crimson liquid is commonly held in a thin, glass vial capped in green wax. When you drink this elixir, its effects last for 8 hours. While the elixir is in effect, you can't fall asleep by normal means. You have advantage on saving throws against effects that would put you to sleep. If you are affected by the sleep spell, your current hit points are considered 10 higher when determining the effects of the spell.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "elixir-of-the-clear-mind",
        "fields": {
            "name": "Elixir of the Clear Mind",
            "desc": "This cerulean blue liquid sits calmly in its flask even when jostled or shaken. When you drink this potion, you have advantage on Wisdom checks and saving throws for 1 hour. For the duration, if you fail a saving throw against an enchantment or illusion spell or similar magic effect, you can choose to succeed instead. If you do, you draw upon all the potion's remaining power, and its effects end immediately thereafter.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "elixir-of-the-deep",
        "fields": {
            "name": "Elixir of the Deep",
            "desc": "This thick, green, swirling liquid tastes like salted mead. For 1 hour after drinking this elixir, you can breathe underwater, and you can see clearly underwater out to a range of 60 feet. The elixir doesn't allow you to see through magical darkness, but you can see through nonmagical clouds of silt and other sedimentary particles as if they didn't exist. For the duration, you also have advantage on saving throws against the spells and other magical effects of fey creatures native to water environments, such as a Lorelei (see Tome of Beasts) or Water Horse (see Creature Codex).",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "extract-of-dual-mindedness",
        "fields": {
            "name": "Extract of Dual-Mindedness",
            "desc": "This potion can be distilled only from a hormone found in the hypothalamus of a two-headed giant of genius intellect. For 1 minute after drinking this potion, you can concentrate on two spells at the same time, and you have advantage on Constitution saving throws made to maintain your concentration on a spell when you take damage.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ghoulbane-oil",
        "fields": {
            "name": "Ghoulbane Oil",
            "desc": "This rusty-red gelatinous liquid glistens with tiny sparkling crystal flecks. The oil can coat one weapon or 5 pieces of ammunition. Applying the oil takes 1 minute. For 1 hour, if a ghoul, ghast, or Darakhul (see Tome of Beasts) takes damage from the coated item, it takes an extra 2d6 damage of the weapon's type.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "grave-reagent",
        "fields": {
            "name": "Grave Reagent",
            "desc": "This luminous green concoction creates an undead servant. If you spend 1 minute anointing the corpse of a Small or Medium humanoid, this arcane solution imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes a zombie under your control (the GM has the zombie's statistics). On each of your turns, you can use a bonus action to verbally command the zombie if it is within 60 feet of you. You decide what action the zombie will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the zombie only defends itself against hostile creatures. Once given an order, the zombie continues to follow it until its task is complete. The zombie is under your control for 24 hours, after which it stops obeying any command you've given it.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "greater-potion-of-troll-blood",
        "fields": {
            "name": "Greater Potion of Troll Blood",
            "desc": "When drink this potion, you regain 3 hit points at the start of each of your turns. After it has restored 30 hit points, the potion's effects end.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "hardening-polish",
        "fields": {
            "name": "Hardening Polish",
            "desc": "This gray polish is viscous and difficult to spread. The polish can coat one metal weapon or up to 10 pieces of ammunition. Applying the polish takes 1 minute. For 1 hour, the coated item hardens and becomes stronger, and it counts as an adamantine weapon for the purpose of overcoming resistance and immunity to attacks and damage not made with adamantine weapons.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "hewers-draught",
        "fields": {
            "name": "Hewer's Draught",
            "desc": "When you drink this potion, you have advantage on attack rolls made with weapons that deal piercing or slashing damage for 1 minute. This potion's translucent amber liquid glimmers when agitated.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "honey-of-the-warped-wildflowers",
        "fields": {
            "name": "Honey of the Warped Wildflowers",
            "desc": "This spirit honey is made from wildflowers growing in an area warped by magic, such as the flowers growing at the base of a wizard's tower or growing in a magical wasteland. When you consume this honey, you have resistance to psychic damage, and you have advantage on Intelligence saving throws. In addition, you can use an action to warp reality around one creature you can see within 60 feet of you. The target must succeed on a DC 15 Intelligence saving throw or be bewildered for 1 minute. At the start of a bewildered creature's turn, it must roll a die. On an even result, the creature can act normally. On an odd result, the creature is incapacitated until the start of its next turn as it becomes disoriented by its surroundings and unable to fully determine what is real and what isn't. You can't warp the reality around another creature in this way again until you finish a long rest.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "interplanar-paint",
        "fields": {
            "name": "Interplanar Paint",
            "desc": "This black, tarry substance can be used to paint a single black doorway on a flat surface. A pot contains enough paint to create one doorway. While painting, you must concentrate on a plane of existence other than the one you currently occupy. If you are not interrupted, the doorway can be painted in 5 minutes. Once completed, the painting opens a two-way portal to the plane you imagined. The doorway is mirrored on the other plane, often appearing on a rocky face or the wall of a building. The doorway lasts for 1 week or until 5 gallons of water with flecks of silver worth at least 2,000 gp is applied to one side of the door.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ironskin-oil",
        "fields": {
            "name": "Ironskin Oil",
            "desc": "This grayish fluid is cool to the touch and slightly gritty. The oil can cover a Medium or smaller creature, along with the equipment it's wearing and carrying (one additional vial is required for each size category above Medium). Applying the oil takes 10 minutes. The affected creature has resistance to piercing and slashing damage for 1 hour.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "liquid-courage",
        "fields": {
            "name": "Liquid Courage",
            "desc": "This magical cordial is deep red and smells strongly of fennel. You have advantage on the next saving throw against being frightened. The effect ends after you make such a saving throw or when 1 hour has passed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "liquid-shadow",
        "fields": {
            "name": "Liquid Shadow",
            "desc": "The contents of this bottle are inky black and seem to absorb the light. The dark liquid can cover a single Small or Medium creature. Applying the liquid takes 1 minute. For 1 hour, the coated creature has advantage on Dexterity (Stealth) checks. Alternately, you can use an action to hurl the bottle up to 20 feet, shattering it on impact. Magical darkness spreads from the point of impact to fill a 15-foot-radius sphere for 1 minute. This darkness works like the darkness spell.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "locksmiths-oil",
        "fields": {
            "name": "Locksmith's Oil",
            "desc": "This shimmering oil can be applied to a lock. Applying the oil takes 1 minute. For 1 hour, any creature that makes a Dexterity check to pick the lock using thieves' tools rolls a d4 ( 1d4) and adds the number rolled to the check.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "luring-perfume",
        "fields": {
            "name": "Luring Perfume",
            "desc": "This pungent perfume has a woodsy and slightly musky scent. As an action, you can splash or spray the contents of this vial on yourself or another creature within 5 feet of you. For 1 minute, the perfumed creature attracts nearby humanoids and beasts. Each humanoid and beast within 60 feet of the perfumed creature and that can smell the perfume must succeed on a DC 15 Wisdom saving throw or be charmed by the perfumed creature until the perfume fades or is washed off with at least 1 gallon of water. While charmed, a creature is incapacitated, and, if the creature is more than 5 feet away from the perfumed creature, it must move on its turn toward the perfumed creature by the most direct route, trying to get within 5 feet. It doesn't avoid opportunity attacks, but before moving into damaging terrain, such as lava or a pit, and whenever it takes damage, the target can repeat the saving throw. A charmed target can also repeat the saving throw at the end of each of its turns. If the saving throw is successful, the effect ends on it.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "maidens-tears",
        "fields": {
            "name": "Maiden's Tears",
            "desc": "This fruity mead is the color of liquid gold and is rumored to be brewed with a tear from the goddess of bearfolk herself. When you drink this mead, you regenerate lost hit points for 1 minute. At the start of your turn, you regain 10 hit points if you have at least 1 hit point.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "odorless-oil",
        "fields": {
            "name": "Odorless Oil",
            "desc": "This odorless, colorless oil can cover a Medium or smaller object or creature, along with the equipment the creature is wearing or carrying (one additional vial is required for each size category above Medium). Applying the oil takes 10 minutes. For 1 hour, the affected target gives off no scent, can't be tracked by scent, and can't be detected with Wisdom (Perception) checks that rely on smell.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "oil-of-concussion",
        "fields": {
            "name": "Oil of Concussion",
            "desc": "You can apply this thick, gray oil to one bludgeoning weapon or up to 5 pieces of bludgeoning ammunition. Applying the oil takes 1 minute. For 1 hour, any attack with the coated item scores a critical hit on a roll of 19 or 20.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "oil-of-defoliation",
        "fields": {
            "name": "Oil of Defoliation",
            "desc": "Sometimes known as weedkiller oil, this greasy amber fluid contains the crushed husks of dozens of locusts. One vial of the oily substance can coat one weapon or up to 5 pieces of ammunition. Applying the oil takes 1 minute. For 1 hour, the coated item deals an extra 1d6 necrotic damage to plants or plant creatures on a successful hit. The oil can also be applied directly to a willing, restrained, or immobile plant or plant creature. In this case, the substance deals 4d6 necrotic damage, which is enough to kill most ordinary plant life smaller than a large tree.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "oil-of-extreme-bludgeoning",
        "fields": {
            "name": "Oil of Extreme Bludgeoning",
            "desc": "This viscous indigo-hued oil smells of iron. The oil can coat one bludgeoning weapon or up to 5 pieces of bludgeoning ammunition. Applying the oil takes 1 minute. For 1 hour, the coated item is magical, has a +1 bonus to attack and damage rolls, and deals an extra 1d4 force damage on a hit.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "oil-of-numbing",
        "fields": {
            "name": "Oil of Numbing",
            "desc": "This astringent-smelling oil stings slightly when applied to flesh, but the feeling quickly fades. The oil can cover a Medium or smaller creature (one additional vial is required for each size category above Medium). Applying the oil takes 10 minutes. For 1 hour, the affected creature has advantage on Constitution saving throws to maintain its concentration on a spell when it takes damage, and it has advantage on ability checks and saving throws made to endure pain. However, the affected creature's flesh is slightly numbed and senseless, and it has disadvantage on ability checks that require fine motor skills or a sense of touch.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "oil-of-sharpening",
        "fields": {
            "name": "Oil of Sharpening",
            "desc": "You can apply this fine, silvery oil to one piercing or slashing weapon or up to 5 pieces of piercing or slashing ammunition. Applying the oil takes 1 minute. For 1 hour, any attack with the coated item scores a critical hit on a roll of 19 or 20.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "philter-of-luck",
        "fields": {
            "name": "Philter of Luck",
            "desc": "When you drink this vibrant green, effervescent potion, you gain a finite amount of good fortune. Roll a d3 to determine where your fortune falls: ability checks (1), saving throws (2), or attack rolls (3). When you make a roll associated with your fortune, you can choose to tap into your good fortune and reroll the d20. This effect ends after you tap into your good fortune or when 1 hour has passed. | d3 | Use fortune for |\n| --- | --------------- |\n| 1 | ability checks |\n| 2 | saving throws |\n| 3 | attack rolls |",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potent-cure-all",
        "fields": {
            "name": "Potent Cure-All",
            "desc": "The milky liquid in this bottle shimmers when agitated, as small, glittering particles swirl within it. When you drink this potion, it reduces your exhaustion level by one, removes any reduction to one of your ability scores, removes the blinded, deafened, paralyzed, and poisoned conditions, and cures you of any diseases currently afflicting you.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-air-breathing",
        "fields": {
            "name": "Potion of Air Breathing",
            "desc": "This potion's pale blue fluid smells like salty air, and a seagull's feather floats in it. You can breathe air for 1 hour after drinking this potion. If you could already breathe air, this potion has no effect.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-bad-taste",
        "fields": {
            "name": "Potion of Bad Taste",
            "desc": "This brown, sludgy potion tastes extremely foul. When you drink this potion, the taste of your flesh is altered to be unpalatable for 1 hour. During this time, if a creature hits you with a bite attack, it must succeed on a DC 10 Constitution saving throw or spend its next action gagging and retching. A creature with an Intelligence of 4 or lower avoids biting you again unless compelled or commanded by an outside force or if you attack it.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-bouncing",
        "fields": {
            "name": "Potion of Bouncing",
            "desc": "A small, red sphere bobs up and down in the clear, effervescent liquid inside this bottle but disappears when the bottle is opened. When you drink this potion, your body becomes rubbery, and you are immune to falling damage for 1 hour. If you fall at least 10 feet, your body bounces back the same distance. As a reaction while falling, you can angle your fall and position your legs to redirect this distance. For example, if you fall 60 feet, you can redirect your bounce to propel you 30 feet up and 30 feet forward from the position where you landed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-buoyancy",
        "fields": {
            "name": "Potion of Buoyancy",
            "desc": "When you drink this clear, effervescent liquid, your body becomes unnaturally buoyant for 1 hour. When you are immersed in water or other liquids, you rise to the surface (at a rate of up to 30 feet per round) to float and bob there. You have advantage on Strength (Athletics) checks made to swim or stay afloat in rough water, and you automatically succeed on such checks in calm waters.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-dire-cleansing",
        "fields": {
            "name": "Potion of Dire Cleansing",
            "desc": "For 1 hour after drinking this potion, you have resistance to poison damage, and you have advantage on saving throws against being blinded, deafened, paralyzed, and poisoned. In addition, if you are poisoned, this potion neutralizes the poison. Known for its powerful, somewhat burning smell, this potion is difficult to drink, requiring a successful DC 13 Constitution saving throw to drink it. On a failure, you are poisoned for 10 minutes and don't gain the benefits of the potion.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-ebbing-strength",
        "fields": {
            "name": "Potion of Ebbing Strength",
            "desc": "When you drink this potion, your Strength score changes to 25 for 1 hour. The potion has no effect on you if your Strength is equal to or greater than that score. The recipe for this potion is flawed and infused with dangerous Void energies. When you drink this potion, you are also poisoned. While poisoned, you take 2d4 poison damage at the end of each minute. If you are reduced to 0 hit points while poisoned, you have disadvantage on death saving throws. This bubbling, pale blue potion is commonly used by the derro and is almost always paired with a Potion of Dire Cleansing or Holy Verdant Bat Droppings (see page 147). Warriors who use this potion without a method of removing the poison don't intend to return home from battle.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-effulgence",
        "fields": {
            "name": "Potion of Effulgence",
            "desc": "When you drink this potion, your skin glows with radiance, and you are filled with joy and bliss for 1 minute. You shed bright light in a 30-foot radius and dim light for an additional 30 feet. This light is sunlight. While glowing, you are blinded and have disadvantage on Dexterity (Stealth) checks to hide. If a creature with the Sunlight Sensitivity trait starts its turn in the bright light you shed, it takes 2d4 radiant damage. This potion's golden liquid sparkles with motes of sunlight.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-empowering-truth",
        "fields": {
            "name": "Potion of Empowering Truth",
            "desc": "A withered snake's tongue floats in the shimmering gold liquid within this crystalline vial. When you drink this potion, you regain one expended spell slot or one expended use of a class feature, such as Divine Sense, Rage, Wild Shape, or other feature with limited uses. Until you finish a long rest, you can't speak a deliberate lie. You are aware of this effect after drinking the potion. Your words can be evasive, as long as they remain within the boundaries of the truth.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-freezing-fog",
        "fields": {
            "name": "Potion of Freezing Fog",
            "desc": "After drinking this potion, you can use an action to exhale a cloud of icy fog in a 20-foot cube originating from you. The cloud spreads around corners, and its area is heavily obscured. It lasts for 1 minute or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it. When a creature enters the cloud for the first time on a turn or starts its turn there, that creature must succeed on a DC 13 Constitution saving throw or take 2d4 cold damage. The effects of this potion end after you have exhaled one fog cloud or 1 hour has passed. This potion has a gray, cloudy appearance and swirls vigorously when shaken.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-malleability",
        "fields": {
            "name": "Potion of Malleability",
            "desc": "The glass bottle holding this thick, red liquid is strangely pliable, and compresses in your hand under the slightest pressure while it still holds the magical liquid. When you drink this potion, your body becomes extremely flexible and adaptable to pressure. For 1 hour, you have resistance to bludgeoning damage, can squeeze through a space large enough for a creature two sizes smaller than you, and have advantage on Dexterity (Acrobatics) checks made to escape a grapple.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-sand-form",
        "fields": {
            "name": "Potion of Sand Form",
            "desc": "This potion's container holds a gritty liquid that moves and pours like water filled with fine particles of sand. When you drink this potion, you gain the effect of the gaseous form spell for 1 hour (no concentration required) or until you end the effect as a bonus action. While in this gaseous form, your appearance is that of a vortex of spiraling sand instead of a misty cloud. In addition, you have advantage on Dexterity (Stealth) checks while in a sandy environment, and, while motionless in a sandy environment, you are indistinguishable from an ordinary swirl of sand.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-skating",
        "fields": {
            "name": "Potion of Skating",
            "desc": "For 1 hour after you drink this potion, you can move across icy surfaces without needing to make an ability check, and difficult terrain composed of ice or snow doesn't cost you extra movement. This sparkling blue liquid contains tiny snowflakes that disappear when shaken.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-transparency",
        "fields": {
            "name": "Potion of Transparency",
            "desc": "The liquid in this vial is clear like water, and it gives off a slight iridescent sheen when shaken or swirled. When you drink this potion, you and everything you are wearing and carrying turn transparent, but not completely invisible, for 10 minutes. During this time, you have advantage on Dexterity (Stealth) checks, and ranged attacks against you have disadvantage.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "potion-of-worg-form",
        "fields": {
            "name": "Potion of Worg Form",
            "desc": "Small flecks of brown hair are suspended in this clear, syrupy liquid. When you drink this potion, you transform into a worg for 1 hour. This works like the polymorph spell, but you retain your Intelligence, Wisdom, and Charisma scores. While in worg form, you can speak normally, and you can cast spells that have only verbal components. This transformation doesn't give you knowledge of the Goblin or Worg languages, and you are able to speak and understand those languages only if you knew them before the transformation.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rainbow-extract",
        "fields": {
            "name": "Rainbow Extract",
            "desc": "This thin, oily liquid shimmers with the colors of the spectrum. For 1 hour after drinking this potion, you can use an action to change the color of your hair, skin, eyes, or all three to any color or mixture of colors in any hue, pattern, or saturation you choose. You can change the colors as often as you want for the duration, but the color changes disappear at the end of the duration.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "royal-jelly",
        "fields": {
            "name": "Royal Jelly",
            "desc": "This oil is distilled from the pheromones of queen bees and smells faintly of bananas. The oil can cover a Medium or smaller creature, along with the equipment it's wearing and carrying. For larger creatures, one additional vial is required for each size category above Medium. Applying the oil takes 10 minutes. The affected creature then has advantage on Charisma (Persuasion) checks for 1 hour.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "superior-potion-of-troll-blood",
        "fields": {
            "name": "Superior Potion of Troll Blood",
            "desc": "When you drink this potion, you regain 5 hit points at the start of each of your turns. After it has restored 50 hit points, the potion's effects end.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "supreme-potion-of-troll-blood",
        "fields": {
            "name": "Supreme Potion of Troll Blood",
            "desc": "When you drink this potion, you regain 8 hit points at the start of each of your turns. After it has restored 80 hit points, the potion's effects end.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "tincture-of-moonlit-blossom",
        "fields": {
            "name": "Tincture of Moonlit Blossom",
            "desc": "This potion is steeped using a blossom that grows only in the moonlight. When you drink this potion, your shadow corruption (see Midgard Worldbook) is reduced by three levels. If you aren't using the Midgard setting, you gain the effect of the greater restoration spell instead.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "tonic-for-the-troubled-mind",
        "fields": {
            "name": "Tonic for the Troubled Mind",
            "desc": "This potion smells and tastes of lavender and chamomile. When you drink it, it removes any short-term madness afflicting you, and it suppresses any long-term madness afflicting you for 8 hours.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "tonic-of-blandness",
        "fields": {
            "name": "Tonic of Blandness",
            "desc": "This deeply bitter, black, oily liquid deadens your sense of taste. When you drink this tonic, you can eat all manner of food without reaction, even if the food isn't to your liking, for 1 hour. During this time, you automatically fail Wisdom (Perception) checks that rely on taste. This tonic doesn't protect you from the effects of consuming poisoned or spoiled food, but it can prevent you from detecting such impurities when you taste the food.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "trollsblood-elixir",
        "fields": {
            "name": "Trollsblood Elixir",
            "desc": "This thick, pink liquid sloshes and moves even when the bottle is still. When you drink this potion, you regenerate lost hit points for 1 hour. At the start of your turn, you regain 5 hit points. If you take acid or fire damage, the potion doesn't function at the start of your next turn. If you lose a limb, you can reattach it by holding it in place for 1 minute. For the duration, you can die from damage only by being reduced to 0 hit points and not regenerating on your turn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "verdant-elixir",
        "fields": {
            "name": "Verdant Elixir",
            "desc": "Multi-colored streaks of light occasionally flash through the clear liquid in this container, like bottled lightning. As an action, you can pour the contents of the vial onto the ground. All normal plants in a 100-foot radius centered on the point where you poured the vial become thick and overgrown. A creature moving through the area must spend 4 feet of movement for every 1 foot it moves. Alternatively, you can apply the contents of the vial to a plant creature within 5 feet of you. For 1 hour, the target gains 2d10 temporary hit points, and it gains the enlarge effect of the enlarge/reduce spell (no concentration required).",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "wisp-of-the-void",
        "fields": {
            "name": "Wisp of the Void",
            "desc": "The interior of this bottle is pitch black, and it feels empty. When opened, it releases a black vapor. When you inhale this vapor, your eyes go completely black. For 1 minute, you have darkvision out to a range of 60 feet, and you have resistance to necrotic damage. In addition, you gain a +1 bonus to damage rolls made with a weapon.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "witchs-brew",
        "fields": {
            "name": "Witch's Brew",
            "desc": "For 1 minute after drinking this potion, your spell attacks deal an extra 1d4 necrotic damage on a hit. This revolting green potion's opaque liquid bubbles and steams as if boiling.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "wrathful-vapors",
        "fields": {
            "name": "Wrathful Vapors",
            "desc": "Roiling vapors of red, orange, and black swirl in a frenzy of color inside a sealed glass bottle. As an action, you can open the bottle and empty its contents within 5 feet of you or throw the bottle up to 20 feet, shattering it on impact. If you throw it, make a ranged attack against a creature or object, treating the bottle as an improvised weapon. When you open or break the bottle, the smoke releases in a 20-foot-radius sphere that dissipates at the end of your next turn. A creature that isn't an undead or a construct that enters or starts its turn in the area must succeed on a DC 13 Wisdom saving throw or be overcome with rage for 1 minute. On its turn, a creature overcome with rage must attack the creature nearest to it with whatever melee weapon it has on hand, moving up to its speed toward the target, if necessary. The raging creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "potion",
            "rarity": 2
        }
    }
]