[
    {
        "model": "api_v2.item",
        "pk": "blooddrinker-spear",
        "fields": {
            "name": "Blooddrinker Spear",
            "desc": "Prized by gnolls, the upper haft of this spear is decorated with tiny animal skulls, feathers, and other adornments. You gain a +1 bonus to attack and damage rolls with this magic weapon. When you hit a creature with this spear, you mark that creature for 1 hour. Until the mark ends, you deal an extra 1d6 damage to the target whenever you hit it with the spear, and you have advantage on any Wisdom (Perception) or Wisdom (Survival) check you make to find the target. If the target drops to 0 hit points, the mark ends. This property can't be used on a different creature until you spend a short rest cleaning the previous target's blood from the spear.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "spear",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "gnawing-spear",
        "fields": {
            "name": "Gnawing Spear",
            "desc": "You gain a +1 bonus to attack and damage rolls with this magic weapon. When you roll a 20 on an attack roll made with this spear, its head animates, grows serrated teeth, and lodges itself in the target. While the spear is lodged in the target and you are wielding the spear, the target is grappled by you. At the start of each of your turns, the spear twists and grinds, dealing 2d6 piercing damage to the grappled target. If you release the spear, it remains lodged in the target, dealing damage each round as normal, but the target is no longer grappled by you. While the spear is lodged in a target, you can't make attacks with it. A creature, including the restrained target, can take its action to remove the spear by succeeding on a DC 15 Strength check. The target takes 1d6 piercing damage when the spear is removed. You can use an action to speak the spear's command word, causing it to dislodge itself and fall into an unoccupied space within 5 feet of the target.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "spear",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "pestilent-spear",
        "fields": {
            "name": "Pestilent Spear",
            "desc": "The head of this spear is deadly sharp, despite the rust and slimy residue on it that always accumulate no matter how well it is cleaned. When you hit a creature with this magic weapon, it must succeed on a DC 13 Constitution saving throw or contract the sewer plague disease.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "spear",
            "armor": null,
            "requires_attunement": false,
            "category": "weapon",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "serpents-tooth",
        "fields": {
            "name": "Serpent's Tooth",
            "desc": "When you hit with an attack using this magic spear, the target takes an extra 1d6 poison damage. In addition, while you hold the spear, you have advantage on Dexterity (Acrobatics) checks.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "spear",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "spear-of-the-north",
        "fields": {
            "name": "Spear of the North",
            "desc": "This spear has an ivory haft, and tiny snowflakes occasionally fall from its tip. You gain a +2 bonus to attack and damage rolls made with this magic weapon. When you hit with an attack using this magic spear, the target takes an extra 1d6 cold damage. You can use an action to transform the spear into a pair of snow skis. While wearing the snow skis, you have a walking speed of 40 feet when you walk across snow or ice, and you can walk across icy surfaces without needing to make an ability check. You can use a bonus action to transform the skis back into the spear. While the spear is transformed into a pair of skis, you can't make attacks with it.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "spear",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "spear-of-the-stilled-heart",
        "fields": {
            "name": "Spear of the Stilled Heart",
            "desc": "This rowan wood spear has a thick knot in the center of the haft that uncannily resembles a petrified human heart. When you hit with an attack using this magic spear, the target takes an extra 1d6 necrotic damage. The spear has 3 charges, and it regains all expended charges daily at dusk. When you hit a creature with an attack using it, you can expend 1 charge to deal an extra 3d6 necrotic damage to the target. You regain hit points equal to the necrotic damage dealt.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "spear",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "spear-of-the-western-whale",
        "fields": {
            "name": "Spear of the Western Whale",
            "desc": "You gain a +1 bonus to attack and damage rolls made with this magic weapon. Fashioned in the style of a whaling spear, this long, barbed weapon is made from bone and heavy, yet pliant, ash wood. Its point is lined with decorative engravings of fish, clam shells, and waves. While you carry this spear, you have advantage on any Wisdom (Survival) checks to acquire food via fishing, and you have advantage on all Strength (Athletics) checks to swim. When set on the ground, the spear always spins to point west. When thrown in a westerly direction, the spear deals an extra 2d6 cold damage to the target.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "spear",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 4
        }
    }
]