[
    {
        "model": "api_v2.item",
        "pk": "shepherds-flail",
        "fields": {
            "name": "Shepherd's Flail",
            "desc": "The handle of this simple flail is made of smooth lotus wood. The three threshers are made of carved and painted wooden beads. You gain a + 1 bonus to attack and damage rolls made with this magic weapon. True Authority (Requires Attunement). You must be attuned to a crook of the flock (see page 72) to attune to this weapon. The attunement ends if you are no longer attuned to the crook. While you are attuned to this weapon and holding it, your Charisma score increases by 4 and can exceed 20, but not 30. When you hit a beast with this weapon, the beast takes an extra 3d6 bludgeoning damage. For the purpose of this weapon, “beast” refers to any creature with the beast type. The flail also has 5 charges. When you reduce a humanoid to 0 hit points with an attack from this weapon, you can expend 1 charge. If you do so, the humanoid stabilizes, regains 1 hit point, and is charmed by you for 24 hours. While charmed in this way, the humanoid regards you as its trusted leader, but it otherwise retains its statistics and regains hit points as normal. If harmed by you or your companions, or commanded to do something contrary to its nature, the target ceases to be charmed in this way. The flail regains 1d4 + 1 expended charges daily at dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "flail",
            "armor": null,
            "requires_attunement": false,
            "category": "weapon",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "tenebrous-flail-of-screams",
        "fields": {
            "name": "Tenebrous Flail of Screams",
            "desc": "The handle of this flail is made of mammoth bone wrapped in black leather made from bat wings. Its pommel is adorned with raven's claws, and the head of the flail dangles from a flexible, preserved braid of entrails. The head is made of petrified wood inlaid with owlbear and raven beaks. When swung, the flail lets out an otherworldly screech. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit a creature with this flail, the target takes an extra 1d6 psychic damage. When you roll a 20 on an attack roll made with this weapon, the target must succeed on a DC 15 Wisdom saving throw or be incapacitated until the end of its next turn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "flail",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    }
]