[
    {
        "model": "api_v2.item",
        "pk": "phidjetz-spinner",
        "fields": {
            "name": "Phidjetz Spinner",
            "desc": "This dart was crafted by the monk Phidjetz, a martial recluse obsessed with dragons. The spinner consists of a golden central disk with four metal dragon heads protruding symmetrically from its center point: one red, one white, one blue and one black. As an action, you can spin the disk using the pinch grip in its center. You choose a single target within 30 feet and make a ranged attack roll. The spinner then flies at the chosen target. Once airborne, each dragon head emits a blast of elemental energy appropriate to its type. When you hit a creature, determine which dragon head affects it by rolling a d4 on the following chart. | d4 | Effect |\n| --- | ---------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| 1 | Red. The target takes 1d6 fire damage and combustible materials on the target ignite, doing 1d4 fire damage each turn until it is put out. |\n| 2 | White. The target takes 1d6 cold damage and is restrained until the start of your next turn. |\n| 3 | Blue. The target takes 1d6 lightning damage and is paralyzed until the start of your next turn. |\n| 4 | Black. The target takes 1d6 acid damage and is poisoned until the start of your next turn. | After the attack, the spinner flies up to 60 feet and tries to return to your hand. If you have no hand free, it falls to the ground at your feet.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dart",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "tracking-dart",
        "fields": {
            "name": "Tracking Dart",
            "desc": "When you hit a Large or smaller creature with an attack using this colorful magic dart, the target is splattered with magical paint, which outlines the target in a dim glow (your choice of color) for 1 minute. Any attack roll against a creature outlined in the glow has advantage if the attacker can see the creature, and the creature can't benefit from being invisible. The creature outlined in the glow can end the effect early by using an action to wipe off the splatter of paint.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dart",
            "armor": null,
            "requires_attunement": false,
            "category": "weapon",
            "rarity": 1
        }
    }
]