[
    {
        "model": "api_v2.item",
        "pk": "aberrant-agreement",
        "fields": {
            "name": "Aberrant Agreement",
            "desc": "This long scroll bears strange runes and seals of eldritch powers. When you use an action to present this scroll to an aberration whose Challenge Rating is equal to or less than your level, the binding powers of the scroll compel it to listen to you. You can then attempt to strike a bargain with the aberration, negotiating a service from it in exchange for a reward. The aberration is under no compulsion to strike the bargain; it is compelled only to parley long enough for you to present a bargain and allow for negotiations. If you or your allies attack or otherwise attempt to harm the aberration, the truce is broken, and the creature can act normally. If the aberration refuses the offer, it is free to take any actions it wishes. Should you and the aberration reach an agreement that is satisfactory to both parties, you must sign the agreement and have the aberration do likewise (or make its mark, if it has no form of writing). The writing on the scroll changes to reflect the terms of the agreement struck. The magic of the charter holds both you and the aberration to the agreement until its service is rendered and the reward paid, at which point the scroll blackens and crumbles to dust. An aberration's thinking is alien to most humanoids, and vaguely worded contracts may result in unintended consequences, as the creature may have different thoughts as to how to best meet the goal. If either party breaks the bargain, that creature immediately takes 10d6 psychic damage, and the charter is destroyed, ending the contract.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "scroll",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "binding-oath",
        "fields": {
            "name": "Binding Oath",
            "desc": "This lengthy scroll is the testimony of a pious individual's adherence to their faith. The author has emphatically rewritten these claims many times, and its two slim, metal rollers are wrapped in yards of parchment. When you attune to the item, you rewrite certain passages to align with your own religious views. You can use an action to throw the scroll at a Huge or smaller creature you can see within 30 feet of you. Make a ranged attack roll. On a hit, the scroll unfurls and wraps around the creature. The target is restrained until you take a bonus action to command the scroll to release the creature. If you command it to release the creature or if you miss with the attack, the scroll curls back into a rolled-up scroll. If the restrained target's alignment is the opposite of yours along the law/chaos or good/evil axis, you can use a bonus action to cause the writing to blaze with light, dealing 2d6 radiant damage to the target. A creature, including the restrained target, can use an action to make a DC 17 Strength check to tear apart the scroll. On a success, the scroll is destroyed. Such an attempt causes the writing to blaze with light, dealing 2d6 radiant damage to both the creature making the attempt and the restrained target, whether or not the attempt is successful. Alternatively, the restrained creature can use an action to make a DC 17 Dexterity check to slip free of the scroll. This action also triggers the damage effect, but it doesn't destroy the scroll. Once used, the scroll can't be used again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "scroll",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "blasphemous-writ",
        "fields": {
            "name": "Blasphemous Writ",
            "desc": "The Infernal runes inscribed upon this vellum scroll radiate a faint, crimson glow. When you use this spell scroll of command, the save DC is 15 instead of 13, and you can also affect targets that are undead or that don't understand your language.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "scroll",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "celestial-charter",
        "fields": {
            "name": "Celestial Charter",
            "desc": "Challenge Rating is equal to or less than your level, the binding powers of the scroll compel it to listen to you. You can then attempt to strike a bargain with the celestial, negotiating a service from it in exchange for a reward. The celestial is under no compulsion to strike the bargain; it is compelled only to parley long enough for you to present a bargain and allow for negotiations. If you or your allies attack or otherwise attempt to harm the celestial, the truce is broken, and the creature can act normally. If the celestial refuses the offer, it is free to take any actions it wishes. Should you and the celestial reach an agreement that is satisfactory to both parties, you must sign the charter and have the celestial do likewise (or make its mark, if it has no form of writing). The writing on the scroll changes to reflect the terms of the agreement struck. The magic of the charter holds both you and the celestial to the agreement until its service is rendered and the reward paid, at which point the scroll vanishes in a bright flash of light. A celestial typically attempts to fulfill its end of the bargain as best it can, and it is angry if you exploit any loopholes or literal interpretations to your advantage. If either party breaks the bargain, that creature immediately takes 10d6 radiant damage, and the charter is destroyed, ending the contract.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "scroll",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "feysworn-contract",
        "fields": {
            "name": "Feysworn Contract",
            "desc": "This long scroll is written in flowing Elvish, the words flickering with a pale witchlight, and marked with the seal of a powerful fey or a fey lord or lady. When you use an action to present this scroll to a fey whose Challenge Rating is equal to or less than your level, the binding powers of the scroll compel it to listen to you. You can then attempt to strike a bargain with the fey, negotiating a service from it in exchange for a reward. The fey is under no compulsion to strike the bargain; it is compelled only to parley long enough for you to present a bargain and allow for negotiations. If you or your allies attack or otherwise attempt to harm the fey, the truce is broken, and the creature can act normally. If the fey refuses the offer, it is free to take any actions it wishes. Should you and the fey reach an agreement that is satisfactory to both parties, you must sign the agreement and have the fey do likewise (or make its mark, if it has no form of writing). The writing on the scroll changes to reflect the terms of the agreement struck. The magic of the charter holds both you and the fey to the agreement until its service is rendered and the reward paid, at which point the scroll fades into nothingness. Fey are notoriously clever folk, and while they must adhere to the letter of any bargains they make, they always look for any advantage in their favor. If either party breaks the bargain, that creature immediately takes 10d6 poison damage, and the charter is destroyed, ending the contract.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "scroll",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "fiendish-charter",
        "fields": {
            "name": "Fiendish Charter",
            "desc": "This long scroll bears the mark of a powerful creature of the Lower Planes, whether an archduke of Hell, a demon lord of the Abyss, or some other powerful fiend or evil deity. When you use an action to present this scroll to a fiend whose Challenge Rating is equal to or less than your level, the binding powers of the scroll compel it to listen to you. You can then attempt to strike a bargain with the fiend, negotiating a service from it in exchange for a reward. The fiend is under no compulsion to strike the bargain; it is compelled only to parley long enough for you to present a bargain and allow for negotiations. If you or your allies attack or otherwise attempt to harm the fiend, the truce is broken, and the creature can act normally. If the fiend refuses the offer, it is free to take any actions it wishes. Should you and the fiend reach an agreement that is satisfactory to both parties, you must sign the charter in blood and have the fiend do likewise (or make its mark, if it has no form of writing). The writing on the scroll changes to reflect the terms of the agreement struck. The magic of the charter holds both you and the fiend to the agreement until its service is rendered and the reward paid, at which point the scroll ignites and burns into ash. The contract's wording should be carefully considered, as fiends are notorious for finding loopholes or adhering to the letter of the agreement to their advantage. If either party breaks the bargain, that creature immediately takes 10d6 necrotic damage, and the charter is destroyed, ending the contract.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "scroll",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "pact-paper",
        "fields": {
            "name": "Pact Paper",
            "desc": "This smooth paper is like vellum but is prepared from dozens of scales cast off by a Pact Drake (see Creature Codex). A contract can be inked on this paper, and the paper limns all falsehoods on it with a fiery glow. A command word clears the paper, allowing for several drafts. Another command word locks the contract in place and leaves space for signatures. Creatures signing the contract are afterward bound by the contract with all other signatories alerted when one of the signatories breaks the contract. The creature breaking the contract must succeed on a DC 15 Charisma saving throw or become blinded, deafened, and stunned for 1d6 minutes. A creature can repeat the saving throw at the end of each of minute, ending the conditions on itself on a success. After the conditions end, the creature has disadvantage on saving throws until it finishes a long rest. Once a contract has been locked in place and signed, the paper can't be cleared. If the contract has a duration or stipulation for its end, the pact paper is destroyed when the contract ends, releasing all signatories from any further obligations and immediately ending any effects on them.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "scroll",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "scroll-of-fabrication",
        "fields": {
            "name": "Scroll of Fabrication",
            "desc": "You can draw a picture of any object that is Large or smaller on the face of this blank scroll. When the drawing is complete, it becomes a real, nonmagical, three-dimensional object. Thus, a drawing of a backpack becomes an actual backpack you can use to store and carry items. Any object created by the scroll can be destroyed by the dispel magic spell, by taking it into the area of an antimagic field, or by similar circumstances. Nothing created by the scroll can have a value greater than 25 gp. If you draw an object of greater value, such as a diamond, the object appears authentic, but close inspection reveals it to be made from glass, paste, bone or some other common or worthless material. The object remains for 24 hours or until you dismiss it as a bonus action. The scroll can't be used this way again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "scroll",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "scroll-of-treasure-finding",
        "fields": {
            "name": "Scroll of Treasure Finding",
            "desc": "Each scroll of treasure finding works for a specific type of treasure. You can use an action to read the scroll and sense whether that type of treasure is present within 1 mile of you for 1 hour. This scroll reveals the treasure's general direction, but not its specific location or amount. The GM chooses the type of treasure or determines it by rolling a d100 and consulting the following table. | dice: 1d% | Treasure Type |\n| ----------- | ------------- |\n| 01-10 | Copper |\n| 11-20 | Silver |\n| 21-30 | Electrum |\n| 31-40 | Gold |\n| 41-50 | Platinum |\n| 51-75 | Gemstone |\n| 76-80 | Art objects |\n| 81-00 | Magic items |",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "scroll",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "scrolls-of-correspondence",
        "fields": {
            "name": "Scrolls of Correspondence",
            "desc": "These vellum scrolls always come in pairs. Anything written on one scroll also appears on the matching scroll, as long as they are both on the same plane of existence. Each scroll can hold up to 75 words at a time. While writing on one scroll, you are aware that the words are appearing on a paired scroll, and you know if no creature bears the paired scroll. The scrolls don't translate words written on them, and the reader and writer must be able to read and write the same language to understanding the writing on the scrolls. While holding one of the scrolls, you can use an action to tap it three times with a quill and speak a command word, causing both scrolls to go blank. If one of the scrolls in the pair is destroyed, the other scroll becomes nonmagical.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "scroll",
            "rarity": 1
        }
    }
]