[
    {
        "model": "api_v2.item",
        "pk": "blade-of-the-dervish",
        "fields": {
            "name": "Blade of the Dervish",
            "desc": "This magic scimitar is empowered by your movements. For every 10 feet you move before making an attack, you gain a +1 bonus to the attack and damage rolls of that attack, and the scimitar deals an extra 1d6 slashing damage if the attack hits (maximum of +3 and 3d6). In addition, if you use the Dash action and move within 5 feet of a creature, you can attack that creature as a bonus action. On a hit, the target takes an extra 2d6 slashing damage.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "scimitar",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "mutineers-blade",
        "fields": {
            "name": "Mutineer's Blade",
            "desc": "This finely balanced scimitar has an elaborate brass hilt. You gain a +2 bonus on attack and damage rolls made with this magic weapon. You can use a bonus action to speak the scimitar's command word, causing the blade to shed bright green light in a 10-foot radius and dim light for an additional 10 feet. The light lasts until you use a bonus action to speak the command word again or until you drop or sheathe the scimitar. When you roll a 20 on an attack roll made with this weapon, the target is overcome with the desire for mutiny. On the target's next turn, it must make one attack against its nearest ally, then the effect ends, whether or not the attack was successful.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "scimitar",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "scimitar-of-the-desert-winds",
        "fields": {
            "name": "Scimitar of the Desert Winds",
            "desc": "You gain a +1 bonus to attack and damage rolls made with this magic weapon. While holding or carrying this scimitar, you can tolerate temperatures as low as –50 degrees Fahrenheit or as high as 150 degrees Fahrenheit without any additional protection.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "scimitar",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "valkyries-bite",
        "fields": {
            "name": "Valkyrie's Bite",
            "desc": "This black-bladed scimitar has a guard that resembles outstretched raven wings, and a polished amethyst sits in its pommel. You have a +2 bonus to attack and damage rolls made with this magic weapon. While attuned to the scimitar, you have advantage on initiative rolls. While you hold the scimitar, it sheds dim purple light in a 10-foot radius.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "scimitar",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    }
]