[
    {
        "model": "api_v2.item",
        "pk": "kobold-firework",
        "fields": {
            "name": "Kobold Firework",
            "desc": "These small pouches and cylinders are filled with magical powders and reagents, and they each have a small fuse protruding from their closures. You can use an action to light a firework then throw it up to 30 feet. The firework activates immediately or on initiative count 20 of the following round, as detailed below. Once a firework’s effects end, it is destroyed. A firework can’t be lit underwater, and submersion in water destroys a firework. A lit firework can be destroyed early by dousing it with at least 1 gallon of water.\n Blinding Goblin-Cracker (Uncommon). This bright yellow firework releases a blinding flash of light on impact. Each creature within 15 feet of where the firework landed and that can see it must succeed on a DC 13 Constitution saving throw or be blinded for 1 minute. A blinded creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n Deafening Kobold-Barker (Uncommon). This firework consists of several tiny green cylinders strung together and bursts with a loud sound on impact. Each creature within 15 feet of where the firework landed and that can hear it must succeed on a DC 13 Constitution saving throw or be deafened for 1 minute. A deafened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n Enchanting Elf-Fountain (Uncommon). This purple pyramidal firework produces a fascinating and colorful shower of sparks for 1 minute. The shower of sparks starts on the round after you throw it. While the firework showers sparks, each creature that enters or starts its turn within 30 feet of the firework must make a DC 13 Wisdom saving throw. On a failed save, the creature has disadvantage on Wisdom (Perception) checks made to perceive any creature or object other than the firework until the start of its next turn.\n Fairy Sparkler (Common). This narrow firework is decorated with stars and emits a bright, sparkling light for 1 minute. It starts emitting light on the round after you throw it. The firework sheds bright light in a 30-foot radius and dim light for an additional 30 feet. Invisible creatures and objects are visible as long as they are in the firework’s bright light.\n Priest Light (Rare). This silver cylinder firework produces a tall, argent flame and numerous golden sparks for 10 minutes. The flame appears on the round after you throw it. The firework sheds bright light in a 30-foot radius and dim light for an additional 30 feet. An undead creature can’t willingly enter the firework’s bright light by nonmagical means. If the undead creature tries to use teleportation or similar interplanar travel to do so, it must first succeed on a DC 15 Charisma saving throw. If an undead creature is in the bright light when it appears, the creature must succeed on a DC 15 Wisdom saving throw or be compelled to leave the bright light. It won’t move into any obviously deadly hazard, such as a fire or pit, but it will provoke opportunity attacks to move out of the bright light. In addition, each non-undead creature in the bright light can’t be charmed, frightened, or possessed by an undead creature.\n Red Dragon’s Breath (Very Rare). This firework is wrapped in gold leaf and inscribed with scarlet runes, and it erupts into a vertical column of fire on impact. Each creature in a 10-foot-radius, 60-foot-high cylinder centered on the point of impact must make a DC 17 Dexterity saving throw, taking 10d6 fire damage on a failed save, or half as much damage on a successful one.\n Snake Fountain (Rare). This short, wide cylinder is red, yellow, and black with a scale motif, and it produces snakes made of ash for 1 minute. It starts producing snakes on the round after you throw it. The firework creates 1 poisonous snake each round. The snakes are friendly to you and your companions. Roll initiative for the snakes as a group, which has its own turns. They obey any verbal commands that you issue to them (no action required by you). If you don’t issue any commands to them, they defend themselves from hostile creatures, but otherwise take no actions. The snakes remain for 10 minutes, until you dismiss them as a bonus action, or until they are doused with at least 1 gallon of water.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "wondrous-item",
            "rarity": 1
        }
    }
]