[
    {
        "model": "api_v2.item",
        "pk": "akaasit-blade",
        "fields": {
            "name": "Akaasit Blade",
            "desc": "You gain a +1 bonus to attack and damage rolls made with this magic weapon. This dagger is crafted from the arm blade of a defeated Akaasit (see Tome of Beasts 2). You can use an action to activate a small measure of prescience within the dagger for 1 minute. If you are attacked by a creature you can see within 5 feet of you while this effect is active, you can use your reaction to make one attack with this dagger against the attacker. If your attack hits, the dagger loses its prescience, and its prescience can't be activated again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dagger",
            "armor": null,
            "requires_attunement": false,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "asps-kiss",
        "fields": {
            "name": "Asp's Kiss",
            "desc": "This haladie features two short, slightly curved blades attached to a single hilt with a short, blue-sheened spike on the hand guard. You gain a +2 bonus to attack and damage rolls made with this magic weapon. While attuned to this sword, you have immunity to poison damage, and, when you take the Dash action, the extra movement you gain is double your speed instead of equal to your speed. When you use the Attack action with this sword, you can make one attack with its hand guard spike (treat as a dagger) as a bonus action. You can use an action to cause indigo poison to coat the blades of this sword. The poison remains for 1 minute or until two attacks using the blade of this weapon hit one or more creatures. The target must succeed on a DC 17 Constitution saving throw or take 2d10 poison damage and its hit point maximum is reduced by an amount equal to the poison damage taken. This reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0. The sword can't be used this way again until the next dawn. When you kill a creature with this weapon, it sheds a single, blue tear as it takes its last breath.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dagger",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "black-and-white-daggers",
        "fields": {
            "name": "Black and White Daggers",
            "desc": "These matched daggers are identical except for the stones set in their pommels. One pommel is chalcedony (opaque white), the other is obsidian (opaque black). You gain a +1 bonus to attack and damage rolls with both magic weapons. The bonus increases to +3 when you use the white dagger to attack a monstrosity, and it increases to +3 when you use the black dagger to attack an undead. When you hit a monstrosity or undead with both daggers in the same turn, that creature takes an extra 1d6 piercing damage from the second attack.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dagger",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "dagger-of-the-barbed-devil",
        "fields": {
            "name": "Dagger of the Barbed Devil",
            "desc": "You gain a +1 bonus to attack and damage rolls made with this magic weapon. You can use an action to cause sharp, pointed barbs to sprout from this blade. The barbs remain for 1 minute. When you hit a creature while the barbs are active, the creature must succeed on a DC 15 Dexterity saving throw or a barb breaks off into its flesh and the dagger loses its barbs. At the start of each of its turns, a creature with a barb in its flesh must make a DC 15 Constitution saving throw. On a failure, it has disadvantage on attack rolls and ability checks until the start of its next turn as it is wracked with pain. The barb remains until a creature uses its action to remove the barb, dealing 1d4 piercing damage to the barbed creature. Once you cause barbs to sprout from the dagger, you can't do so again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dagger",
            "armor": null,
            "requires_attunement": false,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "dirk-of-daring",
        "fields": {
            "name": "Dirk of Daring",
            "desc": "You gain a +1 bonus to attack and damage rolls made with this magic weapon. While holding the dagger, you have advantage on saving throws against being frightened.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dagger",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "exsanguinating-blade",
        "fields": {
            "name": "Exsanguinating Blade",
            "desc": "This double-bladed dagger has an ivory hilt, and its gold pommel is shaped into a woman's head with ruby eyes and a fanged mouth opened in a scream. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you roll a 20 on an attack roll made with this weapon against a creature that has blood, the dagger gains 1 charge. The dagger can hold 1 charge at a time. You can use a bonus action to expend 1 charge from the dagger to cause one of the following effects: - You or a creature you touch with the blade regains 2d8 hit points. - The next time you hit a creature that has blood with this weapon, it deals an extra 2d8 necrotic damage.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dagger",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "kyshaarths-fang",
        "fields": {
            "name": "Kyshaarth's Fang",
            "desc": "This dagger's blade is composed of black, bone-like material. Tales suggest the weapon is fashioned from a Voidling's (see Tome of Beasts) tendril barb. When you hit with an attack using this magic weapon, the target takes an extra 2d6 necrotic damage. If you are in dim light or darkness, you regain a number of hit points equal to half the necrotic damage dealt.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dagger",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "lockbreaker",
        "fields": {
            "name": "Lockbreaker",
            "desc": "You can use this stiletto-bladed dagger to open locks by using an action and making a Strength check. The DC is 5 less than the DC to pick the lock (minimum DC 10). On a success, the lock is broken.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dagger",
            "armor": null,
            "requires_attunement": false,
            "category": "weapon",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "stinger",
        "fields": {
            "name": "Stinger",
            "desc": "You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit a creature with an attack using this weapon, you can use a bonus action to inject paralyzing venom in the target. The target must succeed on a DC 15 Constitution saving throw or become paralyzed for 1 minute. It can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. Creatures immune to poison are also immune to this dagger's paralyzing venom. The dagger can't be used this way again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dagger",
            "armor": null,
            "requires_attunement": false,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "survival-knife",
        "fields": {
            "name": "Survival Knife",
            "desc": "When holding this sturdy knife, you can use an action to transform it into a crowbar, a fishing rod, a hunting trap, or a hatchet (mainly a chopping tool; if wielded as a weapon, it uses the same statistics as this dagger, except it deals slashing damage). While holding or touching the transformed knife, you can use an action to transform it into another form or back into its original shape.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dagger",
            "armor": null,
            "requires_attunement": false,
            "category": "weapon",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "thirsting-scalpel",
        "fields": {
            "name": "Thirsting Scalpel",
            "desc": "You gain a +1 bonus to attack and damage rolls with this magic weapon, which deals slashing damage instead of piercing damage. When you attack a creature with this weapon and roll a 20 on the attack roll, that target takes an extra 2d6 slashing damage. If the target is a creature other than an undead or construct, it must succeed on a DC 13 Constitution saving throw or lose 2d6 hit points at the start of each of its turns from a bleeding wound. Any creature can take an action to stanch the wound with a successful DC 11 Wisdom (Medicine) check. The wound also closes if the target receives magical healing. In addition, once every 7 days while the scalpel is on your person, you must succeed on a DC 15 Charisma saving throw or become driven to feed blood to the scalpel. You have advantage on attack rolls with the scalpel until it is sated. The dagger is sated when you roll a 20 on an attack roll with it, after you deal 14 slashing damage with it, or after 1 hour elapses. If the hour elapses and you haven't sated its thirst for blood, the dagger deals 14 slashing damage to you. If the dagger deals damage to you as a result of the curse, you can't heal the damage for 24 hours. The remove curse spell removes your attunement to the item and frees you from the curse. Alternatively, casting the banishment spell on the dagger forces the bearded devil's essence to leave it. The scalpel then becomes a +1 dagger with no other properties.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dagger",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "unquiet-dagger",
        "fields": {
            "name": "Unquiet Dagger",
            "desc": "Forged by creatures with firsthand knowledge of what lies between the stars, this dark gray blade sometimes appears to twitch or ripple like water when not directly observed. You gain a +1 bonus to attack and damage rolls with this magic weapon. In addition, when you hit with an attack using this dagger, the target takes an extra 2d6 psychic damage. You can use an action to cause the blade to ripple for 1 minute. While the blade is rippling, each creature that takes psychic damage from the dagger must succeed on a DC 15 Charisma saving throw or become frightened of you for 1 minute. A frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. The dagger can't be used this way again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dagger",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "vile-razor",
        "fields": {
            "name": "Vile Razor",
            "desc": "This perpetually blood-stained straight razor deals slashing damage instead of piercing damage. You gain a +1 bonus to attack and damage rolls made with this magic weapon. Inhuman Alacrity. While holding the dagger, you can take two bonus actions on your turn, instead of one. Each bonus action must be different; you can’t use the same bonus action twice in a single turn. Once used, this property can’t be used again until the next dusk. Unclean Cut. When you hit a creature with a melee attack using the dagger, you can use a bonus action to deal an extra 2d4 necrotic damage. If you do so, the target and each of its allies that can see this attack must succeed on a DC 15 Wisdom saving throw or be frightened for 1 minute. Once used, this property can’t be used again until the next dusk. ",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "dagger",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    }
]