[
    {
        "model": "api_v2.item",
        "pk": "figurehead-of-prowess",
        "fields": {
            "name": "Figurehead of Prowess",
            "desc": "A figurehead of prowess must be mounted on the bow of a ship for its magic to take effect. While mounted on a ship, the figurehead’s magic affects the ship and every creature on the ship. A figurehead can be mounted on any ship larger than a rowboat, regardless if that ship sails the sea, the sky, rivers and lakes, or the sands of the desert. A ship can have only one figurehead mounted on it at a time. Most figureheads are always active, but some have properties that must be activated. To activate a figurehead’s special property, a creature must be at the helm of the ship, referred to below as the “pilot,” and must use an action to speak the figurehead’s command word. \nAlbatross (Uncommon). While this figurehead is mounted on a ship, the ship’s pilot can double its proficiency bonus with navigator’s tools when navigating the ship. In addition, the ship’s pilot doesn’t have disadvantage on Wisdom (Perception) checks that rely on sight when peering through fog, rain, dust storms, or other natural phenomena that would ordinarily lightly obscure the pilot’s vision. \nBasilisk (Uncommon). While this figurehead is mounted on a ship, the ship’s AC increases by 2. \nDragon Turtle (Very Rare). While this figurehead is mounted on a ship, each creature on the ship has resistance to fire damage, and the ship’s damage threshold increases by 5. If the ship doesn’t normally have a damage threshold, it gains a damage threshold of 5. \nKraken (Rare). While this figurehead is mounted on a ship, the pilot can animate all of the ship’s ropes. If a creature on the ship uses an animated rope while taking the grapple action, the creature has advantage on the check. Alternatively, the pilot can command the ropes to move as if being moved by a crew, allowing a ship to dock or a sailing ship to sail without a crew. The pilot can end this effect as a bonus action. When the ship’s ropes have been animated for a total of 10 minutes, the figurehead’s magic ceases to function until the next dawn. \nManta Ray (Rare). While this figurehead is mounted on a ship, the ship’s speed increases by half. For example, a ship with a speed of 4 miles per hour would have a speed of 6 miles per hour while this figurehead was mounted on it. \nNarwhal (Very Rare). While this figurehead is mounted on a ship, each creature on the ship has resistance to cold damage, and the ship can break through ice sheets without taking damage or needing to make a check. \nOctopus (Rare). This figurehead can be mounted only on ships designed for water travel. While this figurehead is mounted on a ship, the pilot can force the ship to dive beneath the water. The ship moves at its normal speed while underwater, regardless of its normal method of locomotion. Each creature on the ship remains on the ship and can breathe normally as long as the creature starts and ends its turn in contact with the ship. The pilot can end this effect as a bonus action, causing the ship to resurface at a rate of 60 feet per round. When the ship has spent a total of 1 hour underwater, the figurehead’s magic ceases to function until the next dawn. \nSphinx (Legendary). This figurehead can be mounted only on a ship that isn’t designed for air travel. While this figurehead is mounted on a ship, the pilot can command the ship to rise into the air. The ship moves at its normal speed while in the air, regardless of its normal method of locomotion. Each creature on the ship remains on the ship as long as the creature starts and ends its turn in contact with the ship. The pilot can end this effect as a bonus action, causing the ship to descend at a rate of 60 feet per round until it reaches land or water. When the ship has spent a total of 8 hours in the sky, the figurehead’s magic ceases to function until the next dawn. \nXorn (Very Rare). This figurehead can be mounted only on a ship designed for land travel. While this figurehead is mounted on a ship, the pilot can force the ship to burrow into the earth. The ship moves at its normal speed while burrowing, regardless of its normal method of locomotion. The ship can burrow through nonmagical, unworked sand, mud, earth, and stone, and it doesn’t disturb the material it moves through. Each creature on the ship remains on the ship and can breathe normally as long as the creature starts and ends its turn in contact with the ship. The pilot can end this effect as a bonus action, causing the ship to resurface at a rate of 60 feet per round. When the ship has spent a total of 1 hour burrowing, the figurehead’s magic ceases to function until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "wondrous-item",
            "rarity": 1
        }
    }
]