[
    {
        "model": "api_v2.item",
        "pk": "big-dipper",
        "fields": {
            "name": "Big Dipper",
            "desc": "This wooden rod is topped with a ridged ball. The rod has 7 charges for the following properties. It regains 1d6 + 1 expended charges daily at dawn. If you expend the rod's last charge, roll a d20. On a 1, the rod melts into a pool of nonmagical honey and is destroyed. Anytime you expend 1 or more charges for this rod's properties, the ridged ball flows with delicious, nonmagical honey for 1 minute.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "crook-of-the-flock",
        "fields": {
            "name": "Crook of the Flock",
            "desc": "This plain crook is made of smooth, worn lotus wood and is warm to the touch.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "eldritch-rod",
        "fields": {
            "name": "Eldritch Rod",
            "desc": "This bone rod is carved into the shape of twisting tendrils or tentacles. You can use this rod as an arcane focus. The rod has 3 charges and regains all expended charges daily at dawn. When you cast a spell that requires an attack roll and that deals damage while holding this rod, you can expend 1 of its charges as part of the casting to enhance that spell. If the attack hits, the spell also releases tendrils that bind the target, grappling it for 1 minute. At the start of each of your turns, the grappled target takes 1d6 damage of the same type dealt by the spell. At the end of each of its turns, the grappled target can make a Dexterity saving throw against your spell save DC, freeing itself from the tendrils on a success. The rod's magic can grapple only one target at a time. If you use the rod to grapple another target, the effect on the previous target ends.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "elk-horn-rod",
        "fields": {
            "name": "Elk Horn Rod",
            "desc": "This rod is fashioned from elk or reindeer horn. As an action, you can grant a +1 bonus on saving throws against spells and magical effects to a target touched by the wand, including yourself. The bonus lasts 1 round. If you are holding the rod while performing the somatic component of a dispel magic spell or comparable magic, you have a +1 bonus on your spellcasting ability check.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "freerunner-rod",
        "fields": {
            "name": "Freerunner Rod",
            "desc": "Tightly intertwined lengths of grass, bound by additional stiff, knotted blades of grass, form this rod, which is favored by plains-dwelling druids and rangers. While holding it and in grasslands, you leave behind no tracks or other traces of your passing, and you can pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard. In addition, beasts with an Intelligence of 3 or lower that are native to grasslands must succeed on a DC 15 Charisma saving throw to attack you. The rod has 10 charges, and it regains 1d6 + 4 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the rod collapses into a pile of grass seeds and is destroyed. Among the grass seeds are 1d10 berries, consumable as if created by the goodberry spell.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ghoulbane-rod",
        "fields": {
            "name": "Ghoulbane Rod",
            "desc": "Arcane glyphs decorate the spherical head of this tarnished rod, while engravings of cracked and broken skulls and bones circle its haft. When an undead creature is within 120 feet of the rod, the rod's arcane glyphs emit a soft glow. As an action, you can plant the haft end of the rod in the ground, whereupon the rod's glyphs flare to life and the rod's magic activates. When an undead creature enters or starts its turn within 30 feet of the planted rod, it must succeed on a DC 15 Wisdom saving throw or have disadvantage on attack rolls against creatures that aren't undead until the start of its next turn. If a ghoul fails this saving throw, it also takes a –2 penalty to AC and Dexterity saving throws, its speed is halved, and it can't use reactions. The rod's magic remains active while planted in the ground, and after it has been active for a total of 10 minutes, its magic ceases to function until the next dawn. A creature can use an action to pull the rod from the ground, ending the effect early for use at a later time. Deduct the time it was active in increments of 1 minute from the rod's total active time.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "howling-rod",
        "fields": {
            "name": "Howling Rod",
            "desc": "This sturdy, iron rod is topped with the head of a howling wolf with red carnelians for eyes. The rod has 5 charges for the following properties, and it regains 1d4 + 1 expended charges daily at dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "lightning-rod",
        "fields": {
            "name": "Lightning Rod",
            "desc": "This rod is made from the blackened wood of a lightning-struck tree and topped with a spike of twisted iron. It functions as a magic javelin that grants a +1 bonus to attack and damage rolls made with it. While holding it, you are immune to lightning damage, and each creature within 5 feet of you has resistance to lightning damage. The rod can hold up to 6 charges, but it has 0 charges when you first attune to it. Whenever you are subjected to lightning damage, the rod gains 1 charge. While the rod has 6 charges, you have resistance to lightning damage instead of immunity. The rod loses 1d6 charges daily at dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-blade-bending",
        "fields": {
            "name": "Rod of Blade Bending",
            "desc": "This simple iron rod functions as a magic mace that grants a +1 bonus to attack and damage rolls made with it. Blade Bend. While holding the rod, you can use an action to activate it, creating a magical field around you for 10 minutes. When a creature attacks you with a melee weapon that deals piercing or slashing damage while the field is active, it must make a DC 15 Wisdom saving throw. On a failure, the creature’s attack misses. On a success, the creature’s attack hits you, but you have resistance to any piercing or slashing damage dealt by the attack as the weapon bends partially away from your body. Once used, this property can’t be used again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-bubbles",
        "fields": {
            "name": "Rod of Bubbles",
            "desc": "This rod appears to be made of foamy bubbles, but it is completely solid to the touch. This rod has 3 charges. While holding it, you can use an action to expend 1 of its charges to conjure a bubble around a creature or object within 30 feet. If the target is a creature, it must make a DC 15 Strength saving throw. On a failed save, the target becomes trapped in a 10-foot sphere of water. A Huge or larger creature automatically succeeds on this saving throw. A creature trapped within the bubble is restrained unless it has a swimming speed and can't breathe unless it can breathe water. If the target is an object, it becomes soaked in water, any fire effects are extinguished, and any acid effects are negated. The bubble floats in the exact spot where it was conjured for up to 1 minute, unless blown by a strong wind or moved by water. The bubble has 50 hit points, AC 8, immunity to acid damage and vulnerability to piercing damage. The inside of the bubble also has resistance to all damage except piercing damage. The bubble disappears after 1 minute or when it is reduced to 0 hit points. When not in use, this rod can be commanded to take liquid form and be stored in a small vial. The rod regains 1d3 expended charges daily at dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-conveyance",
        "fields": {
            "name": "Rod of Conveyance",
            "desc": "The top of this rod is capped with a bronze horse head, and its foot is decorated with a horsehair plume. By placing the rod between your legs, you can use an action to temporarily transform the rod into a horse-like construct. This works like the phantom steed spell, except you can use a bonus action to end the effect early to use the rod again at a later time. Deduct the time the horse was active in increments of 1 minute from the spell's 1-hour duration. When the rod has been a horse for a total of 1 hour, the magic ceases to function until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "rod",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-deflection",
        "fields": {
            "name": "Rod of Deflection",
            "desc": "This thin, flexible rod is made of braided silver and brass wire and topped with a spoon-like cup. While holding the rod, you can use a reaction to deflect a ranged weapon attack against you. You can simply cause the attack to miss, or you can attempt to redirect the attack against another target, even your attacker. The attack must have enough remaining range to reach the new target. If the additional distance between yourself and the new target is within the attack's long range, it is made at disadvantage as normal, using the original attack roll as the first roll. The rod has 3 charges. You can expend a charge as a reaction to redirect a ranged spell attack as if it were a ranged weapon attack, up to the spell's maximum range. The rod regains 1d3 expended charges daily at dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-ghastly-might",
        "fields": {
            "name": "Rod of Ghastly Might",
            "desc": "The knobbed head of this tarnished silver rod resembles the top half of a jawless, syphilitic skull, and it functions as a magic mace that grants a +2 bonus to attack and damage rolls made with it. The rod has properties associated with five different buttons that are set erratically along the haft. It has three other properties as well, detailed below. If you press **button 1**, the rod's head erupts in a fiery nimbus of abyssal energy that sheds dim light in a 5-foot radius. While the rod is ablaze, it deals an extra 1d6 fire damage and 1d6 necrotic damage to any target it hits. If you press **button 2**, the rod's head becomes enveloped in a black aura of enervating energy. When you hit a target with the rod while it is enveloped in this energy, the target must succeed on a DC 17 Constitution saving throw or deal only half damage with weapon attacks that use Strength until the end of its next turn. If you press **button 3**, a 2-foot blade springs from the tip of the rod's handle as the handle lengthens into a 5-foot haft, transforming the rod into a magic glaive that grants a +2 bonus to attack and damage rolls made with it. If you press **button 4**, a 3-pronged, bladed grappling hook affixed to a long chain springs from the tip of the rod's handle. The bladed grappling hook counts as a magic sickle with reach that grants a +2 bonus to attack and damage rolls made with it. When you hit a target with the bladed grappling hook, the target must succeed on an opposed Strength check or fall prone. If you press **button 5**, the rod assumes or remains in its normal form and you can extinguish all nonmagical flames within 30 feet of you. Turning Defiance. While holding the rod, you and any undead allies within 30 feet of you have advantage on saving throws against effects that turn undead. Contagion. When you hit a creature with a melee attack using the rod, you can force the target to make a DC 17 Constitution saving throw. On a failure, the target is afflicted with a disease. This works like the contagion spell. Once used, this property can’t be used again until the next dusk. Create Specter. As an action, you can target a humanoid within 10 feet of you that was killed by the rod or one of its effects and has been dead for no longer than 1 minute. The target’s spirit rises as a specter under your control in the space of its corpse or in the nearest unoccupied space. You can have no more than one specter under your control at one time. Once used, this property can’t be used again until the next dusk.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-hellish-grounding",
        "fields": {
            "name": "Rod of Hellish Grounding",
            "desc": "This curious jade rod is tipped with a knob of crimson crystal that glows and shimmers with eldritch phosphorescence. While holding or carrying the rod, you have darkvision out to a range of 30 feet, and you have advantage on Dexterity (Acrobatics) checks. Hellish Desiccation. While holding this rod, you can use an action to fire a crimson ray at an object or creature made of metal that you can see within 60 feet of you. The ray forms a 5-foot wide line between you and the target. Each creature in that line that isn’t a construct or an undead must make a DC 15 Dexterity saving throw, taking 8d6 force damage on a failed save, or half as much damage on a successful one. Creatures and objects made of metal are unaffected. If this damage reduces a creature to 0 hit points, it is desiccated. A desiccated creature is reduced to a withered corpse, but everything it is wearing and carrying is unaffected. The creature can be restored to life only by means of a true resurrection or a wish spell. Once used, this property can’t be used again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-icicles",
        "fields": {
            "name": "Rod of Icicles",
            "desc": "This white crystalline rod is shaped like an icicle. The rod has 5 charges and regains 1d4 + 1 expended charges daily at dawn. While holding the rod, you can use an action to expend 1 of its charges to attack one creature you can see within 60 feet of you. The rod launches an icicle at the target and makes its attack roll with a +7 bonus. On a hit, the target takes 2d6 piercing damage and 2d6 cold damage. On a critical hit, the target is also paralyzed until the end of its next turn as it momentarily freezes. If you take fire damage while holding this rod, you become immune to fire damage for 1 minute, and the rod loses 2 charges. If the rod has only 1 charge remaining when you take fire damage, you become immune to fire damage, as normal, but the rod melts into a puddle of water and is destroyed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-reformation",
        "fields": {
            "name": "Rod of Reformation",
            "desc": "This rod of polished white oak is wrapped in a knotted cord with three iron rings binding each end. If you are holding the rod and fail a saving throw against a transmutation spell or other effect that would change your body or remove or alter parts of you, you can choose to succeed instead. The rod can’t be used this way again until the next dawn. The rod has 5 charges for the following properties. It regains 1d4 + 1 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the rings fall off, the cord unknots, and the entire rod slowly falls to pieces and is destroyed. Cure Transformation. While holding the rod, you can use an action to expend 1 charge while touching a creature that has been affected by a transmutation spell or other effect that changed its physical form, such as the polymorph spell or a medusa's Petrifying Gaze. The rod restores the creature to its original form. If the creature is willingly transformed, such as a druid using Wild Shape, you must make a melee weapon attack roll, using the rod. You are proficient with the rod if you are proficient with clubs. On a hit, you can expend 1 of the rod’s charges to force the target to make a DC 15 Constitution saving throw. On a failure, the target reverts to its original form. Mend Form. While holding the rod, you can use an action to expend 2 charges to reattach a creature's severed limb or body part. The limb must be held in place while you use the rod, and the process takes 1 minute to complete. You can’t reattach limbs or other body parts to dead creatures. If the limb is lost, you can spend 4 charges instead to regenerate the missing piece, which takes 2 minutes to complete. Reconstruct Form. While holding the rod, you can use an action to expend 5 charges to reconstruct the form of a creature or object that has been disintegrated, burned to ash, or similarly destroyed. An item is completely restored to its original state. A creature’s body is fully restored to the state it was in before it was destroyed. The creature isn’t restored to life, but this reconstruction of its form allows the creature to be restored to life by spells that require the body to be present, such as raise dead.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-repossession",
        "fields": {
            "name": "Rod of Repossession",
            "desc": "This short, metal rod is engraved with arcane runes and images of open hands. The rod has 3 charges and regains all expended charges daily at dawn. While holding the rod, you can use an action to expend 1 of its charges and target an object within 30 feet of you that isn't being worn or carried. If the object weighs no more than 25 pounds, it floats to your open hand. If you have no hands free, the object sticks to the tip of the rod until the end of your next turn or until you remove it as a bonus action.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "rod",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-sacrificial-blessing",
        "fields": {
            "name": "Rod of Sacrificial Blessing",
            "desc": "This silvery rod is set with rubies on each end. One end holds rubies shaped to resemble an open, fanged maw, and the other end's rubies are shaped to resemble a heart. While holding this rod, you can use an action to spend one or more Hit Dice, up to half your maximum Hit Dice, while pointing the heart-shaped ruby end of the rod at a target within 60 feet of you. For each Hit Die spent in this way, you roll the die and add your Constitution modifier to it. You lose hit points equal to the total, and the target regains hit points equal to the total hit points you lost. You can't use this feature if you don't have blood. Hit Dice spent on this feature can't be used to regain hit points during a short rest. You regain spent Hit Dice as normal.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-sanguine-mastery",
        "fields": {
            "name": "Rod of Sanguine Mastery",
            "desc": "This rod is topped with a red ram's skull with two backswept horns. As an action, you can spend one or more Hit Dice, up to half of your maximum Hit Dice. For each Hit Die spent in this way, you roll the die and add your Constitution modifier to it. You lose hit points equal to the total, and a target within 60 feet of you must make a DC 17 Dexterity saving throw, taking necrotic damage equal to the total on a failed save, or half as much damage on a successful one. You can't use this feature if you don't have blood. Hit Dice spent on this feature can't be used to regain hit points during a short rest. You regain spent Hit Dice as normal.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-swarming-skulls",
        "fields": {
            "name": "Rod of Swarming Skulls",
            "desc": "An open-mouthed skull caps this thick, onyx rod. The rod has 5 charges and regains 1d4 + 1 expended charges daily at dusk. While holding the rod, you can use an action and expend 1 of the rod's charges to unleash a swarm of miniature spectral blue skulls at a target within 30 feet. The target must make a DC 15 Wisdom saving throw. On a failure, it takes 3d6 psychic damage and becomes paralyzed with fear until the end of its next turn. On a success, it takes half the damage and isn't paralyzed. Creatures that can't be frightened are immune to this effect.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-thorns",
        "fields": {
            "name": "Rod of Thorns",
            "desc": "Several long sharp thorns sprout along the edge of this stout wooden rod, and it functions as a magic mace that grants a +1 bonus to attack and damage rolls made with it. The rod has 5 charges and regains 1d4 + 1 expended charges daily at dawn. While holding the rod, you can use an action to expend 1 of its charges to cast the spike growth spell (save DC 15) from it. Embed Thorn. When you hit a creature with this rod, you can expend 1 of its charges to embed a thorn in the creature. At the start of each of the creature’s turns, it must succeed on a DC 15 Constitution saving throw or take 2d6 piercing damage from the embedded thorn. If the creature succeeds on two saving throws, the thorn falls out and crumbles to dust. The successes don’t need to be consecutive. If the creature dies while the thorn is embedded, its body transforms into a patch of nonmagical brambles, which fill its space with difficult terrain.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-underworld-navigation",
        "fields": {
            "name": "Rod of Underworld Navigation",
            "desc": "This finely carved rod is decorated with gold and small dragon scales. While underground and holding this rod, you know how deep below the surface you are. You also know the direction to the nearest exit leading upward. As an action while underground and holding this rod, you can use the find the path spell to find the shortest, most direct physical route to a location you are familiar with on the surface. Once used, the find the path property can't be used again until 3 days have passed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-vapor",
        "fields": {
            "name": "Rod of Vapor",
            "desc": "This wooden rod is topped with a dragon's head, carved with its mouth yawning wide. While holding the rod, you can use an action to cause a thick mist to issue from the dragon's mouth, filling your space. As long as you maintain concentration, you leave a trail of mist behind you when you move. The mist forms a line that is 5 feet wide and as long as the distance you travel. This mist you leave behind you lasts for 2 rounds; its area is heavily obscured on the first round and lightly obscured on the second, then it dissipates. When the rod has produced enough mist to fill ten 5-foot-square areas, its magic ceases to function until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "rod",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-verbatim",
        "fields": {
            "name": "Rod of Verbatim",
            "desc": "Tiny runic script covers much of this thin brass rod. While holding the rod, you can use a bonus action to activate it. For 10 minutes, it translates any language spoken within 30 feet of it into Common. The translation can be auditory, or it can appear as glowing, golden script, a choice you make when you activate it. If the translation appears on a surface, the surface must be within 30 feet of the rod and each word remains for 1 round after it was spoken. The rod's translation is literal, and it doesn't replicate or translate emotion or other nuances in speech, body language, or culture. Once used, the rod can't be used again until 1 hour has passed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "rod",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-warning",
        "fields": {
            "name": "Rod of Warning",
            "desc": "This plain, wooden rod is topped with an orb of clear, polished crystal. You can use an action activate it with a command word while designating a particular kind of creature (orcs, wolves, etc.). When such a creature comes within 120 feet of the rod, the crystal glows, shedding bright light in a 10-foot radius and dim light for an additional 10 feet. You can use an action to deactivate the rod's light or change the kind of creature it detects. The rod doesn't need to be in your possession to function, but you must have it in hand to activate it, deactivate it, or change the kind of creature it detects.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "rod",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-the-disciplinarian",
        "fields": {
            "name": "Rod of the Disciplinarian",
            "desc": "This black lacquered wooden rod is banded in steel, has a flanged head, and functions as a magic mace. As a bonus action, you can brandish the rod at a creature and demand it refrain from a particular activity— attacking, casting, moving, or similar. The activity can be as specific (don't attack the person next to you) or as open (don't cast a spell) as you want, but the activity must be a conscious act on the creature's part, must be something you can determine is upheld or broken, and can't immediately jeopardize the creature's life. For example, you can forbid a creature from lying only if you are capable of determining if the creature is lying, and you can't forbid a creature that needs to breathe from breathing. The creature can act normally, but if it performs the activity you forbid, you can use a reaction to make a melee attack against it with the rod. You can forbid only one creature at a time. If you forbid another creature from performing an activity, the previous creature is no longer forbidden from performing activities. Justicars are arbiters of law and order, operating independently of any official city guard or watch divisions. They are recognizable by their black, hooded robes, silver masks, and the rods they carry as weapons. These stern sentinels are overseen by The Magister, a powerful wizard of whom little is known other than their title. The Magister has made it their duty to oversee order in the city and executes their plans through the Justicars, giving them the Magister's mark, a signet ring, as a symbol of their authority. While some officers and members of the watch may be resentful of the Justicars' presence, many are grateful for their aid, especially in situations that could require magic. Justicar's are a small, elite group, typically acting as solo agents, though extremely dangerous situations bring them together in pairs or larger groups as needed. The Justicars are outfitted with three symbols of authority that are also imbued with power: their masks, rods, and rings. Each by itself is a useful item, but they are made stronger when worn together. The combined powers of this trinity of items make a Justicar a formidable force in the pursuit of law and order.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-the-infernal-realms",
        "fields": {
            "name": "Rod of the Infernal Realms",
            "desc": "The withered, clawed hand of a demon or devil tops this iron rod. While holding this rod, you gain a +2 bonus to spell attack rolls, and the save DC for your spells increases by 2. Frightful Eyes. While holding this rod, you can use a bonus action to cause your eyes to glow with infernal fire for 1 minute. While your eyes are glowing, a creature that starts its turn or enters a space within 10 feet of you must succeed on a Wisdom saving throw against your spell save DC or become frightened of you until your eyes stop glowing. A frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. Once used, you can’t use this property again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-the-jester",
        "fields": {
            "name": "Rod of the Jester",
            "desc": "This wooden rod is decorated with colorful scarves and topped with a carving of a madly grinning head. Caper. While holding the rod, you can dance and perform general antics that attract attention. Make a DC 10 Charisma (Performance) check. On a success, one creature that can see and hear you must succeed on a DC 15 Wisdom saving throw or have disadvantage on Wisdom (Perception) checks made to perceive any creature other than you for 1 minute. The effect ends if the target can no longer see or hear you or if you are incapacitated. You can affect one additional creature for each 5 points by which you beat the DC (two creatures with a result of 15, three creatures with a result of 20, and so on). Once used, this property can’t be used again until the next dawn. Hideous Laughter. While holding the rod, you can use an action to cast the hideous laughter spell (save DC 15) from it. Once used, this property can’t be used again until the next dawn. Slapstick. You can use an action to swing the rod in the direction of a creature within 5 feet of you. The target must succeed on a DC 15 Dexterity saving throw or be pushed up to 5 feet away from you and knocked prone. If the target fails the saving throw by 5 or more, it is also stunned until the end of its next turn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-the-mariner",
        "fields": {
            "name": "Rod of the Mariner",
            "desc": "This thin bone rod is topped with the carved figurine of an albatross in flight. The rod has 5 charges. You can use an action to expend 1 or more of its charges and point the rod at one or more creatures you can see within 30 feet of you, expending 1 charge for each creature. Each target must succeed on a DC 15 Wisdom saving throw or be cursed for 1 minute. A cursed creature has disadvantage on attack rolls and saving throws while within 100 feet of a body of water that is at least 20 feet deep. The rod regains 1d4 + 1 expended charges daily at dawn. If you expend the last charge, roll a d20. On a 1, the rod crumbles to dust and is destroyed, and you must succeed on a DC 15 Wisdom saving throw or be cursed for 1 minute as if you had been the target of the rod's power.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rod-of-the-wastes",
        "fields": {
            "name": "Rod of the Wastes",
            "desc": "Created by a holy order of knights to protect their most important members on missions into badlands and magical wastelands, these red gold rods are invaluable tools against the forces of evil. This rod has a rounded head, and it functions as a magic mace that grants a +2 bonus to attack and damage rolls made with it. While holding or carrying the rod, you have advantage on Wisdom (Perception) and Wisdom (Survival) checks made in badlands and wasteland terrain, and you have advantage on saving throws against being charmed or otherwise compelled by aberrations and fiends. If you are charmed or magically compelled by an aberration or fiend, the rod flashes with crimson light, alerting others to your predicament. Aberrant Smite. If you use Divine Smite when you hit an aberration or fiend with this rod, you use the highest number possible for each die of radiant damage rather than rolling one or more dice for the extra radiant damage. You must still roll damage dice for the rod’s damage, as normal. Once used, this property can’t be used again until the next dawn. Spells. You can use an action to cast one of the following spells from the rod: daylight, lesser restoration, or shield of faith. Once you cast a spell with this rod, you can’t cast that spell again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "root-of-the-world-tree",
        "fields": {
            "name": "Root of the World Tree",
            "desc": "Crafted from the root burl of a sacred tree, this rod is 2 feet long with a spiked, knobby end. Runes inlaid with gold decorate the full length of the rod. This rod functions as a magic mace. Blood Anointment. You can perform a 1-minute ritual to anoint the rod in your blood. If you do, your hit point maximum is reduced by 2d4 until you finish a long rest. While your hit point maximum is reduced in this way, you gain a +1 bonus to attack and damage rolls made with this magic weapon, and, when you hit a fey or giant with this weapon, that creature takes an extra 2d6 necrotic damage. Holy Anointment. If you spend 1 minute anointing the rod with a flask of holy water, you can cast the augury spell from it. The runes carved into the rod glow and move, forming an answer to your query.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "rod",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "scepter-of-majesty",
        "fields": {
            "name": "Scepter of Majesty",
            "desc": "While holding this bejeweled, golden rod, you can use an action to cast the enthrall spell (save DC 15) from it, exhorting those in range to follow you and obey your commands. When you finish speaking, 1d6 creatures that failed their saving throw are affected as if by the dominate person spell. Each such creature treats you as its ruler, obeying your commands and automatically fighting in your defense should anyone attempt to harm you. If you are also attuned to and wearing a Headdress of Majesty (see page 146), your charmed subjects have advantage on attack rolls against any creature that attacked you or that cast an obvious spell on you within the last round. The scepter can't be used this way again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "rod",
            "rarity": 3
        }
    }
]