[
    {
        "model": "api_v2.item",
        "pk": "angry-hornet",
        "fields": {
            "name": "Angry Hornet",
            "desc": "This black ammunition has yellow fletching or yellow paint. When you fire this magic ammunition, it makes an angry buzzing sound, and it multiplies in flight. As it flies, 2d4 identical pieces of ammunition magically appear around it, all speeding toward your target. Roll separate attack rolls for each additional arrow or bullet. Duplicate ammunition disappears after missing or after dealing its damage. If the angry hornet and all its duplicates miss, the angry hornet remains magical and can be fired again, otherwise it is destroyed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ammunition",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "arrow-of-grabbing",
        "fields": {
            "name": "Arrow of Grabbing",
            "desc": "This arrow has a barbed head and is wound with a fine but strong thread that unravels as the arrow soars. If a creature takes damage from the arrow, the creature must succeed on a DC 17 Constitution saving throw or take 4d6 damage and have the arrowhead lodged in its flesh. A creature grabbed by this arrow can't move farther away from you. At the end of its turn, the creature can attempt a DC 17 Constitution saving throw, taking 4d6 piercing damage and dislodging the arrow on a success. As an action, you can attempt to pull the grabbed creature up to 10 feet in a straight line toward you, forcing the creature to repeat the saving throw. If the creature fails, it moves up to 10 feet closer to you. If it succeeds, it takes 4d6 piercing damage and the arrow is dislodged.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ammunition",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "arrow-of-unpleasant-herbs",
        "fields": {
            "name": "Arrow of Unpleasant Herbs",
            "desc": "This arrow's tip is filled with magically preserved, poisonous herbs. When a creature takes damage from the arrow, the arrowhead breaks, releasing the herbs. The creature must succeed on a DC 15 Constitution saving throw or be incapacitated until the end of its next turn as it retches and reels from the poison.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ammunition",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "bullseye-arrow",
        "fields": {
            "name": "Bullseye Arrow",
            "desc": "This arrow has bright red fletching and a blunt, red tip. You gain a +1 bonus to attack rolls made with this magic arrow. On a hit, the arrow deals no damage, but it paints a magical red dot on the target for 1 minute. While the dot lasts, the target takes an extra 1d4 damage of the weapon's type from any ranged attack that hits it. In addition, ranged weapon attacks against the target score a critical hit on a roll of 19 or 20. When this arrow hits a target, the arrow vanishes in a flash of red light and is destroyed.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ammunition",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "crimson-starfall-arrow",
        "fields": {
            "name": "Crimson Starfall Arrow",
            "desc": "This arrow is a magic weapon powered by the sacrifice of your own life energy and explodes upon impact. If you hit a creature with this arrow, you can spend one or more Hit Dice, up to your maximum Hit Dice. For each Hit Die spent in this way, you roll the die and add your Constitution modifier to it. You lose hit points equal to the total, and each creature within 10 feet of the target, including the target, must make a DC 15 Dexterity saving throw, taking necrotic damage equal to the hit points you lost on a failed save, or half as much damage on a successful one. You can't use this feature of the arrow if you don't have blood. Hit Dice spent on this arrow's feature can't be used to regain hit points during a short rest. You regain spent Hit Dice as normal.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ammunition",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "deadfall-arrow",
        "fields": {
            "name": "Deadfall Arrow",
            "desc": "You gain a +1 bonus to attack and damage rolls made with this magic arrow. On a hit, the arrow transforms into a 10-foot-long wooden log centered on the target, destroying the arrow. The target and each creature in the log's area must make a DC 15 Dexterity saving throw. On a failure, a creature takes 3d6 bludgeoning damage and is knocked prone and restrained under the log. On a success, a creature takes half the damage and isn't knocked prone or restrained. A restrained creature can take its action to free itself by succeeding on a DC 15 Strength check. The log lasts for 1 minute then crumbles to dust, freeing those restrained by it.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ammunition",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "enraging-ammunition",
        "fields": {
            "name": "Enraging Ammunition",
            "desc": "When you hit a creature with a ranged attack using this magical ammunition, the target must succeed on a DC 13 Wisdom saving throw or become enraged for 1 minute. On its turn, an enraged creature moves toward you by the most direct route, trying to get within 5 feet of you. It doesn't avoid opportunity attacks, but it moves around or avoids damaging terrain, such as lava or a pit. If the enraged creature is within 5 feet of you, it attacks you. An enraged creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ammunition",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ensnaring-ammunition",
        "fields": {
            "name": "Ensnaring Ammunition",
            "desc": "When you hit a creature with a ranged attack using this magical ammunition, the target takes only half the damage from the attack, and the target is restrained as the ammunition bursts into entangling strands that wrap around it. As an action, the restrained target can make a DC 13 Strength check, bursting the bonds on a success. The strands can also be attacked and destroyed (AC 10; hp 5; immunity to bludgeoning, poison, and psychic damage).",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ammunition",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "flash-bullet",
        "fields": {
            "name": "Flash Bullet",
            "desc": "When you hit a creature with a ranged attack using this shiny, polished stone, it releases a sudden flash of bright light. The target takes damage as normal and must succeed on a DC 11 Constitution saving throw or be blinded until the end of its next turn. Creatures with the Sunlight Sensitivity trait have disadvantage on this saving throw.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ammunition",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "fog-stone",
        "fields": {
            "name": "Fog Stone",
            "desc": "This sling stone is carved to look like a fluffy cloud. Typically, 1d4 + 1 fog stones are found together. When you fire the stone from a sling, it transforms into a miniature cloud as it flies through the air, and it creates a 20-foot-radius sphere of fog centered on the target or point of impact. The sphere spreads around corners, and its area is heavily obscured. It lasts for 10 minutes or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ammunition",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "siege-arrow",
        "fields": {
            "name": "Siege Arrow",
            "desc": "This magic arrow's tip is enchanted to soften stone and warp wood. When this arrow hits an object or structure, it deals double damage then becomes a nonmagical arrow.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ammunition",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "sling-stone-of-screeching",
        "fields": {
            "name": "Sling Stone of Screeching",
            "desc": "This sling stone is carved with an open mouth that screams in hellish torment when hurled with a sling. Typically, 1d4 + 1 sling stones of screeching are found together. When you fire the stone from a sling, it changes into a screaming bolt, forming a line 5 feet wide that extends out from you to a target within 30 feet. Each creature in the line excluding you and the target must make a DC 13 Constitution saving throw. On a failure, a creature takes 2d8 thunder damage and is knocked prone. On a success, a creature takes half the damage and isn't knocked prone. Make a ranged weapon attack against the target. On a hit, the target takes damage from the sling stone plus 3d8 thunder damage and is knocked prone. Once a sling stone of screeching has dealt its damage to a creature, it becomes a nonmagical sling stone.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ammunition",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "web-arrows",
        "fields": {
            "name": "Web Arrows",
            "desc": "Carvings of spiderwebs decorate the arrowhead and shaft of these arrows, which always come in pairs. When you fire the arrows from a bow, they become the two anchor points for a 20-foot cube of thick, sticky webbing. Once you fire the first arrow, you must fire the second arrow within 1 minute. The arrows must land within 20 feet of each other, or the magic fails. The webs created by the arrows are difficult terrain and lightly obscure the area. Each creature that starts its turn in the webs or enters them during its turn must make a DC 13 Dexterity saving throw. On a failed save, the creature is restrained as long as it remains in the webs or until it breaks free. A creature, including the restrained creature, can take its action to break the creature free from the webbing by succeeding on a DC 13 Strength check. The webs are flammable. Any 5-foot cube of webs exposed to fire burns away in 1 round, dealing 2d4 fire damage to any creature that starts its turn in the fire.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ammunition",
            "rarity": 2
        }
    }
]