[
    {
        "model": "api_v2.item",
        "pk": "humble-cudgel-of-temperance",
        "fields": {
            "name": "Humble Cudgel of Temperance",
            "desc": "This simple, polished club has a studded iron band around one end. When you attack a poisoned creature with this magic weapon, you have advantage on the attack roll. When you roll a 20 on an attack roll made with this weapon, the target becomes poisoned for 1 minute. If the target was already poisoned, it becomes incapacitated instead. The target can make a DC 13 Constitution saving throw at the end of each of its turns, ending the poisoned or incapacitated condition on itself on a success. Formerly a moneylender with a heart of stone and a small army of brutal thugs, Faustin the Drunkard awoke one day with a punishing hangover that seemed never-ending. He took this as a sign of punishment from the gods, not for his violence and thievery, but for his taste for the grape, in abundance. He decided all problems stemmed from the “demon” alcohol, and he became a cleric. No less brutal than before, he and his thugs targeted public houses, ale makers, and more. In his quest to rid the world of alcohol, he had the humble cudgel of temperance made and blessed with terrifying power. Now long since deceased, his simple, humble-appearing club continues to wreck havoc wherever it turns up.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "club",
            "armor": null,
            "requires_attunement": false,
            "category": "weapon",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "impact-club",
        "fields": {
            "name": "Impact Club",
            "desc": "This magic weapon has 3 charges and regains 1d3 expended charges daily at dawn. When you hit a target on your turn, you can take a bonus action to spend 1 charge and attempt to shove the target. The club grants you a +1 bonus on your Strength (Athletics) check to shove the target. If you roll a 20 on your attack roll with the club, you have advantage on your Strength (Athletics) check to shove the target, and you can push the target up to 10 feet away.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "club",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "knockabout-billet",
        "fields": {
            "name": "Knockabout Billet",
            "desc": "This stout, oaken cudgel helps you knock your opponents to the ground or away from you. When you hit a creature with this magic weapon, you can shove the target as part of the same attack, using your attack roll in place of a Strength (Athletics) check. The weapon deals damage as normal, regardless of the result of the shove. This property of the club can be used no more than once per hour.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "club",
            "armor": null,
            "requires_attunement": false,
            "category": "weapon",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rowdys-club",
        "fields": {
            "name": "Rowdy's Club",
            "desc": "This knobbed stick is marked with nicks, scratches, and notches. You gain a +1 bonus to attack and damage rolls made with this magic weapon. While wielding the club, you can use an action to tap it against your open palm, the side of your leg, a surface within reach, or similar. If you do, you have advantage on your next Charisma (Intimidation) check. If you are also wearing a rowdy's ring (see page 87), you can use an action to frighten a creature you can see within 30 feet of you instead. The target must succeed on a DC 13 Wisdom saving throw or be frightened of you until the end of its next turn. Once this special action has been used three times, it can't be used again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "club",
            "armor": null,
            "requires_attunement": false,
            "category": "weapon",
            "rarity": 2
        }
    }
]