[
    {
        "model": "api_v2.item",
        "pk": "brazen-band",
        "fields": {
            "name": "Brazen Band",
            "desc": "Made by kobold clockwork mages, this brass clockwork ring is formed to look like a coiled dragon. When you speak or whisper the Draconic command word etched on the inside of the ring, the brass dragon uncoils and attempts to pick any lock within 10 feet of you. The dragon picks the lock using your proficiency bonus but with advantage. It is treated as having thieves' tools when attempting to pick locks. It uses your Dexterity (Stealth) bonus for purposes of not being spotted but with advantage due to its extremely small size. Whether successful or not, once you have used the ring to attempt to pick a lock, it can't be used again until the next sunset.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "clockwork-rogue-ring",
        "fields": {
            "name": "Clockwork Rogue Ring",
            "desc": "Made by kobold clockwork mages, this brass clockwork ring is formed to look like a coiled dragon. When you speak or whisper the Draconic command word etched on the inside of the ring, the brass dragon uncoils and attempts to pick any lock within 10 feet of you. The dragon picks the lock using your proficiency bonus but with advantage. It is treated as having thieves' tools when attempting to pick locks. It uses your Dexterity (Stealth) bonus for purposes of not being spotted but with advantage due to its extremely small size. Whether successful or not, once you have used the ring to attempt to pick a lock, it can't be used again until the next sunset.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "deaths-mirror",
        "fields": {
            "name": "Death's Mirror",
            "desc": "Made from woven lead and silver, this ring fits only on the hand's smallest finger. As the moon is a dull reflection of the sun's glory, so too is the power within this ring merely an imitation of the healing energies that can bestow true life. The ring has 3 charges and regains all expended charges daily at dawn. While wearing the ring, you can expend 1 charge as a bonus action to gain 5 temporary hit points for 1 hour.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "glamour-rings",
        "fields": {
            "name": "Glamour Rings",
            "desc": "These rings are made from twisted loops of gold and onyx and are always found in pairs. The rings' magic works only while you and another humanoid of the same size each wear one ring and are on the same plane of existence. While wearing a ring, you or the other humanoid can use an action to swap your appearances, if both of you are willing. This effect works like the Change Appearance effect of the alter self spell, except you can change your appearance to only look identical to each other. Your clothing and equipment don't change, and the effect lasts until one of you uses this property again or until one of you removes the ring.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "kraken-clutch-ring",
        "fields": {
            "name": "Kraken Clutch Ring",
            "desc": "This green copper ring is etched with the image of a kraken with splayed tentacles. The ring has 5 charges, and it regains 1d4 + 1 expended charges daily at dawn, as long as it was immersed in water for at least 1 hour since the previous dawn. If the ring has at least 1 charge, you have advantage on grapple checks. While wearing this ring, you can expend 1 or more of its charges to cast one of the following spells from it, using spell save DC 15: black tentacles (2 charges), call lightning (1 charge), or control weather (4 charges).",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "recondite-shield",
        "fields": {
            "name": "Recondite Shield",
            "desc": "While wearing this ring, you can use a bonus action to create a weightless, magic shield that shimmers with arcane energy. You must be proficient with shields to wield this semitranslucent shield, and you wield it in the same hand that wears the ring. The shield lasts for 1 hour or until you dismiss it (no action required). Once used, you can't use the ring in this way again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-arcane-adjustment",
        "fields": {
            "name": "Ring of Arcane Adjustment",
            "desc": "This stylized silver ring is favored by spellcasters accustomed to fighting creatures capable of shrugging off most spells. The ring has 3 charges and regains 1d3 expended charges daily at dawn. When you cast a spell of 5th level or lower that has only one target and the target succeeds on the saving throw, you can use a reaction and expend 1 charge from the ring to change the spell's target to a new target within the spell's range. The new target is then affected by the spell, but the new target has advantage on the saving throw. You can't move the spell more than once this way, even if the new target succeeds on the saving throw. You can't move a spell that affects an area, that has multiple targets, that requires an attack roll, or that allows the target to make a saving throw to reduce, but not prevent, the effects of the spell, such as blight or feeblemind.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-bravado",
        "fields": {
            "name": "Ring of Bravado",
            "desc": "This polished brass ring has 3 charges. While wearing the ring, you are inspired to daring acts that risk life and limb, especially if such acts would impress or intimidate others who witness them. When you choose a course of action that could result in serious harm or possible death (your GM has final say in if an action qualifies), you can expend 1 of the ring's charges to roll a d10 and add the number rolled to any d20 roll you make to achieve success or avoid damage, such as a Strength (Athletics) check to scale a sheer cliff and avoid falling or a Dexterity saving throw made to run through a hallway filled with swinging blades. The ring regains all expended charges daily at dawn. In addition, if you fail on a roll boosted by the ring, and you failed the roll by only 1, the ring regains 1 expended charge, as its magic recognizes a valiant effort.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-deceivers-warning",
        "fields": {
            "name": "Ring of Deceiver's Warning",
            "desc": "This copper ring is set with a round stone of blue quartz. While you wear the ring, the stone's color changes to red if a shapechanger comes within 30 feet of you. For the purpose of this ring, “shapechanger” refers to any creature with the Shapechanger trait.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ring",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-dragons-discernment",
        "fields": {
            "name": "Ring of Dragon's Discernment",
            "desc": "A large, orange cat's eye gem is held in the fittings of this ornate silver ring, looking as if it is grasped by scaled talons. While wearing this ring, your senses are sharpened. You have advantage on Intelligence (Investigation) and Wisdom (Perception) checks, and you can take the Search action as a bonus action. In addition, you are able to discern the value of any object made of precious metals or minerals or rare materials by handling it for 1 round.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-featherweight-weapons",
        "fields": {
            "name": "Ring of Featherweight Weapons",
            "desc": "If you normally have disadvantage on attack rolls made with weapons with the Heavy property due to your size, you don't have disadvantage on those attack rolls while you wear this ring. This ring has no effect on you if you are Medium or larger or if you don't normally have disadvantage on attack rolls with heavy weapons.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-giant-mingling",
        "fields": {
            "name": "Ring of Giant Mingling",
            "desc": "While wearing this ring, your size changes to match the size of those around you. If you are a Large creature and start your turn within 100 feet of four or more Medium creatures, this ring makes you Medium. Similarly, if you are a Medium creature and start your turn within 100 feet of four or more Large creatures, this ring makes you Large. These effects work like the effects of the enlarge/reduce spell, except they persist as long as you wear the ring and satisfy the conditions.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-hoarded-life",
        "fields": {
            "name": "Ring of Hoarded Life",
            "desc": "This ring stores hit points sacrificed to it, holding them until the attuned wearer uses them. The ring can store up to 30 hit points at a time. When found, it contains 2d10 stored hit points. While wearing this ring, you can use an action to spend one or more Hit Dice, up to your maximum Hit Dice. For each Hit Die spent in this way, you roll the die and add your Constitution modifier to it. Your hit point maximum is reduced by the total, and the ring stores the total, up to 30 hit points. This hit point maximum reduction can't be removed with the greater restoration spell or similar magic and lasts as long as hit points remain stored in the ring. You can't store hit points in the ring if you don't have blood. When hit points are stored in the ring, you can cause one of the following effects: - You can use a bonus action to remove stored hit points from the ring and regain that number of hit points.\n- You can use an action to remove stored hit points from the ring while touching the ring to a creature. If you do so, the creature regains hit points equal to the amount of hit points you removed from the ring.\n- When you are reduced to 0 hit points and are not killed outright, you can use a reaction to empty the ring of stored hit points and regain hit points equal to that amount. Hit Dice spent on this ring's features can't be used to regain hit points during a short rest. You regain spent Hit Dice as normal.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-imperious-command",
        "fields": {
            "name": "Ring of Imperious Command",
            "desc": "Embossed in gold on this heavy iron ring is the image of a crown. The ring has 3 charges and regains 1d3 expended charges daily at dawn. While wearing this ring, you have advantage on Charisma (Intimidation) checks, and you can project your voice up to 300 feet with perfect clarity. In addition, you can use an action and expend 1 of the ring's charges to command a creature you can see within 30 feet of you to kneel before you. The target must make a DC 15 Charisma saving throw. On a failure, the target spends its next turn moving toward you by the shortest and most direct route then falls prone and ends its turn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-lights-comfort",
        "fields": {
            "name": "Ring of Light's Comfort",
            "desc": "A disc of white chalcedony sits within an encompassing band of black onyx, set into fittings on this pewter ring. While wearing this ring in dim light or darkness, you can use a bonus action to speak the ring's command word, causing it to shed bright light in a 30-foot radius and dim light for an additional 30 feet. The ring automatically sheds this light if you start your turn within 60 feet of an undead or lycanthrope. The light lasts until you use a bonus action to repeat the command word. In addition, you can't be charmed, frightened, or possessed by undead or lycanthropes.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-nights-solace",
        "fields": {
            "name": "Ring of Night's Solace",
            "desc": "A disc of black onyx sits within an encompassing band of white chalcedony, set into fittings on this pewter ring. While wearing this ring in bright light, you are draped in a comforting cloak of shadow, protecting you from the harshest glare. If you have the Sunlight Sensitivity trait or a similar trait that causes you to have disadvantage on attack rolls or Wisdom (Perception) checks while in bright light or sunlight, you don't suffer those effects while wearing this ring. In addition, you have advantage on saving throws against being blinded.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-powerful-summons",
        "fields": {
            "name": "Ring of Powerful Summons",
            "desc": "When you summon a creature with a conjuration spell while wearing this ring, the creature gains a +1 bonus to attack and damage rolls and 1d4 + 4 temporary hit points.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-remembrance",
        "fields": {
            "name": "Ring of Remembrance",
            "desc": "This ring is a sturdy piece of string, tied at the ends to form a circle. While wearing it, you can use an action to invoke its power by twisting it on your finger. If you do so, you have advantage on the next Intelligence check you make to recall information. The ring can't be used this way again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ring",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-sealing",
        "fields": {
            "name": "Ring of Sealing",
            "desc": "This ring appears to be made of golden chain links. It has 3 charges and regains 1d3 expended charges daily at dawn. When you hit a creature with a melee attack while wearing this ring, you can use a bonus action and expend 1 of the ring's charges to cause mystical golden chains to spring from the ground and wrap around the creature. The target must make a DC 17 Wisdom saving throw. On a failure, the magical chains hold the target firmly in place, and it is restrained. The target can't move or be moved by any means. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. However, if the target fails three consecutive saving throws, the chains bind the target permanently. A successful dispel magic (DC 17) cast on the chains destroys them.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-shadows",
        "fields": {
            "name": "Ring of Shadows",
            "desc": "While wearing this ebony ring in dim light or darkness, you have advantage on Dexterity (Stealth) checks. When you roll a 20 on a Dexterity (Stealth) check, the ring's magic ceases to function until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ring",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-small-mercies",
        "fields": {
            "name": "Ring of Small Mercies",
            "desc": "While wearing this plain, beaten pewter ring, you can use an action to cast the spare the dying spell from it at will.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ring",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-stored-vitality",
        "fields": {
            "name": "Ring of Stored Vitality",
            "desc": "While you are attuned to and wearing this ring of polished, white chalcedony, you can feed some of your vitality into the ring to charge it. You can use an action to suffer 1 level of exhaustion. For each level of exhaustion you suffer, the ring regains 1 charge. The ring can store up to 3 charges. As the ring increases in charges, its color reddens, becoming a deep red when it has 3 charges. Your level of exhaustion can be reduced by normal means. If you already suffer from 3 or more levels of exhaustion, you can't suffer another level of exhaustion to restore a charge to the ring. While wearing the ring and suffering exhaustion, you can use an action to expend 1 or more charges from the ring to reduce your exhaustion level. Your exhaustion level is reduced by 1 for each charge you expend.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-ursa",
        "fields": {
            "name": "Ring of Ursa",
            "desc": "This wooden ring is set with a strip of fossilized honey. While wearing this ring, you gain the following benefits: - Your Strength score increases by 2, to a maximum of 20.\n- You have advantage on Charisma (Persuasion) checks made to interact with bearfolk. In addition, while attuned to the ring, your hair grows thick and abundant. Your facial features grow more snout-like, and your teeth elongate. If you aren't a bearfolk, you gain the following benefits while wearing the ring:\n- You can now make a bite attack as an unarmed strike. When you hit with it, your bite deals piercing damage equal to 1d6 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. - You gain a powerful build and count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-the-dolphin",
        "fields": {
            "name": "Ring of the Dolphin",
            "desc": "This gold ring bears a jade carving in the shape of a leaping dolphin. While wearing this ring, you have a swimming speed of 40 feet. In addition, you can hold your breath for twice as long while underwater.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-the-frog",
        "fields": {
            "name": "Ring of the Frog",
            "desc": "A pale chrysoprase cut into the shape of a frog is the centerpiece of this tarnished copper ring. While wearing this ring, you have a swimming speed of 20 feet, and you can jump three times the normal distance, though you can't jump farther than your remaining movement would allow.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-the-frost-knight",
        "fields": {
            "name": "Ring of the Frost Knight",
            "desc": "This white gold ring is covered in a thin sheet of ice and always feels cold to the touch. The ring has 3 charges and regains 1d3 expended charges daily at dawn. While wearing the ring, you can use an action to expend 1 charge to surround yourself in a suit of enchanted ice that resembles plate armor. For 1 hour, your AC can't be less than 16, regardless of what kind of armor you are wearing, and you have resistance to cold damage. The icy armor melts, ending the effect early, if you take 20 fire damage or more.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-the-groves-guardian",
        "fields": {
            "name": "Ring of the Grove's Guardian",
            "desc": "This pale gold ring looks as though made of delicately braided vines wrapped around a small, rough obsidian stone. While wearing this ring, you have advantage on Wisdom (Perception) checks. You can use an action to speak the ring's command word to activate it and draw upon the vitality of the grove to which the ring is bound. You regain 2d10 hit points. Once used, this property can't be used again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-the-jarl",
        "fields": {
            "name": "Ring of the Jarl",
            "desc": "This thick band of hammered yellow gold is warm to the touch even in the coldest of climes. While you wear it, you have resistance to cold damage. If you are also wearing boots of the winterlands, you are immune to cold damage instead. Bolstering Shout. When you roll for initiative while wearing this ring, you can use a reaction to shout a war cry, bolstering your allies. Each friendly creature within 30 feet of you and that can hear you gains a +2 bonus on its initiative roll, and it has advantage on attack rolls for a number of rounds equal to your Charisma modifier (minimum of 1 round). Once used, this property of the ring can’t be used again until the next dawn. Wergild. While wearing this ring, you can use an action to create a nonmagical duplicate of the ring that is worth 100 gp. You can bestow this ring upon another as a gift. The ring can’t be used for common barter or trade, but it can be used for debts and payment of a warlike nature. You can give this ring to a subordinate warrior in your service or to someone to whom you owe a blood-debt, as a weregild in lieu of further fighting. You can create up to 3 of these rings each week. Rings that are not gifted within 24 hours of their creation vanish again.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "ring-of-the-water-dancer",
        "fields": {
            "name": "Ring of the Water Dancer",
            "desc": "This thin braided purple ring is fashioned from a single piece of coral. While wearing this ring, you can stand on and move across any liquid surface as if it were solid ground. In addition, while walking atop any liquid, your movement speed increases by 10 feet and you gain a +1 bonus to your AC.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "rowdys-ring",
        "fields": {
            "name": "Rowdy's Ring",
            "desc": "The face of this massive ring is a thick slab of gold-plated lead, which is attached to twin rings that are worn over the middle and ring fingers. The slab covers your fingers from the first and second knuckles, and it often has a threatening word or image engraved on it. While wearing the ring, your unarmed strike uses a d4 for damage and attacks made with the ring hand count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "second-wind",
        "fields": {
            "name": "Second Wind",
            "desc": "This plain, copper band holds a clear, spherical crystal. When you run out of breath or are choking, you can use a reaction to activate the ring. The crystal shatters and air fills your lungs, allowing you to continue to hold your breath for a number of minutes equal to 1 + your Constitution modifier (minimum 30 seconds). A shattered crystal magically reforms at the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "ring",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "shimmer-ring",
        "fields": {
            "name": "Shimmer Ring",
            "desc": "This ring is crafted of silver with an inlay of mother-of-pearl. While wearing the ring, you can use an action to speak a command word and cause the ring to shed white and sparkling bright light in a 20-foot radius and dim light for an additional 20 feet. The light lasts until you use a bonus action to repeat the command word. The ring has 6 charges for the following properties. It regains 1d6 charges daily at dawn. Bestow Shimmer. While wearing the ring, you can use a bonus action to expend 1 of its charges to charge a weapon you wield with silvery energy until the start of your next turn. When you hit with an attack using the charged weapon, the target takes an extra 1d6 radiant damage. Shimmering Aura. While wearing the ring, you can use an action to expend 1 of its charges to surround yourself with a silvery, shimmering aura of light for 1 minute. This bright light extends from you in a 5-foot radius and is sunlight. While you are surrounded in this light, you have resistance to radiant damage. Shimmering Bolt. While wearing the ring, you can use an action to expend 1 to 3 of its charges to attack one creature you can see within 60 feet of you. The ring produces a bolt of silvery light and makes its attack roll with a +7 bonus. On a hit, the target takes 2d6 radiant damage for each charge you expend.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "signet-of-the-magister",
        "fields": {
            "name": "Signet of the Magister",
            "desc": "This heavy, gold ring is set with a round piece of carnelian, which is engraved with the symbol of an eagle perched upon a crown. While wearing the ring, you have advantage on saving throws against enchantment spells and effects. You can use an action to touch the ring to a creature—requiring a melee attack roll unless the creature is willing or incapacitated—and magically brand it with the ring’s crest. When a branded creature harms you, it takes 2d6 psychic damage and must succeed on a DC 15 Wisdom saving throw or be stunned until the end of its next turn. On a success, a creature is immune to this property of the ring for the next 24 hours, but the brand remains until removed. You can remove the brand as an action. The remove curse spell also removes the brand. Once you brand a creature, you can’t brand another creature until the next dawn. Instruments of Law. If you are also attuned to and wearing a Justicar’s mask (see page 149), you can cast the locate creature to detect a branded creature at will from the ring. If you are also attuned to and carrying a rod of the disciplinarian (see page 83), the psychic damage from the brand increases to 3d6 and the save DC increases to 16.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "slatelight-ring",
        "fields": {
            "name": "Slatelight Ring",
            "desc": "This decorated thick gold band is adorned with a single polished piece of slate. While wearing this ring, you have darkvision out to a range of 60 feet. If you already have darkvision, wearing this ring increases its range by 60 feet. In addition, you can use an action to cast the faerie fire spell (DC 15) from it. The ring can't be used this way again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "umbral-band",
        "fields": {
            "name": "Umbral Band",
            "desc": "This blackened steel ring is cold to the touch. While wearing this ring, you have darkvision out to a range of 30 feet, and you have advantage on Dexterity (Stealth) checks while in an area of dim light or darkness.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "voidwalker",
        "fields": {
            "name": "Voidwalker",
            "desc": "This band of tarnished silver bears no ornament or inscription, but it is icy cold to the touch. The patches of dark corrosion on the ring constantly, but subtly, move and change; though, this never occurs while anyone observes the ring. While wearing Voidwalker, you gain the benefits of a ring of free action and a ring of resistance (cold). It has the following additional properties. The ring is clever and knows that most mortals want nothing to do with the Void directly. It also knows that most of the creatures with strength enough to claim it will end up in dire straits sooner or later. It doesn't overplay its hand trying to push a master to take a plunge into the depths of the Void, but instead makes itself as indispensable as possible. It provides counsel and protection, all the while subtly pushing its master to take greater and greater risks. Once it's maneuvered its wearer into a position of desperation, generally on the brink of death, Voidwalker offers a way out. If the master accepts, it opens a gate into the Void, most likely sealing the creature's doom.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 5
        }
    },
    {
        "model": "api_v2.item",
        "pk": "wolfbite-ring",
        "fields": {
            "name": "Wolfbite Ring",
            "desc": "This heavy iron ring is adorned with the stylized head of a snarling wolf. The ring has 3 charges and regains 1d3 expended charges daily at dawn. When you make a melee weapon attack while wearing this ring, you can use a bonus action to expend 1 of the ring's charges to deal an extra 2d6 piercing damage to the target. Then, the target must succeed on a DC 15 Strength saving throw or be knocked prone.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "zipline-ring",
        "fields": {
            "name": "Zipline Ring",
            "desc": "This plain gold ring features a magnificent ruby. While wearing the ring, you can use an action to cause a crimson zipline of magical force to extend from the gem in the ring and attach to up to two solid surfaces you can see. Each surface must be within 150 feet of you. Once the zipline is connected, you can use a bonus action to magically travel up to 50 feet along the line between the two surfaces. You can bring along objects as long as their weight doesn't exceed what you can carry. While the zipline is active, you remain suspended within 5 feet of the line, floating off the ground at least 3 inches, and you can't move more than 5 feet away from the zipline. When you magically travel along the line, you don't provoke opportunity attacks. The hand wearing the ring must be pointed at the line when you magically travel along it, but you otherwise can act normally while the zipline is active. You can use a bonus action to end the zipline. When the zipline has been active for a total of 1 minute, the ring's magic ceases to function until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "ring",
            "rarity": 2
        }
    }
]