[
    {
        "model": "api_v2.item",
        "pk": "brazen-bulwark",
        "fields": {
            "name": "Brazen Bulwark",
            "desc": "This rectangular shield is plated with polished brass and resembles a crenelated tower. While wielding this shield, you gain a +1 bonus to AC. This bonus is in addition to the shield's normal bonus to AC.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "shield",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "crusaders-shield",
        "fields": {
            "name": "Crusader's Shield",
            "desc": "A bronze boss is set in the center of this round shield. When you attune to the shield, the boss changes shape, becoming a symbol of your divine connection: a holy symbol for a cleric or paladin or an engraving of mistletoe or other sacred plant for a druid. You can use the shield as a spellcasting focus for your spells.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "shield",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "goblin-shield",
        "fields": {
            "name": "Goblin Shield",
            "desc": "This shield resembles a snarling goblin's head. It has 3 charges and regains 1d3 expended charges daily at dawn. While wielding this shield, you can use a bonus action to expend 1 charge and command the goblin's head to bite a creature within 5 feet of you. Make a melee weapon attack with the shield. You have proficiency with this attack if you are proficient with shields. On a hit, the target takes 2d4 piercing damage.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "shield",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "grasping-shield",
        "fields": {
            "name": "Grasping Shield",
            "desc": "The boss at the center of this shield is a hand fashioned of metal. While wielding this shield, you gain a +1 bonus to AC. This bonus is in addition to the shield's normal bonus to AC.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "shield",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "grim-escutcheon",
        "fields": {
            "name": "Grim Escutcheon",
            "desc": "This blackened iron shield is adorned with the menacing relief of a monstrously gaunt skull. You gain a +1 bonus to AC while you wield this shield. This bonus is in addition to the shield's normal bonus to AC. While holding this shield, you can use a bonus action to speak its command word to cast the fear spell (save DC 13). The shield can't be used this way again until the next dusk.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "shield",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "shield-of-gnawing",
        "fields": {
            "name": "Shield of Gnawing",
            "desc": "The wooden rim of this battered oak shield is covered in bite marks. While holding this shield, you gain a +1 bonus to AC. This bonus is in addition to the shield's normal bonus to AC. In addition, you can use the Shove action as a bonus action while raging.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "shield",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "shield-of-missile-reversal",
        "fields": {
            "name": "Shield of Missile Reversal",
            "desc": "While wielding this shield, you gain a +1 bonus to AC. This bonus is in addition to the shield's normal bonus to AC. When you would be struck by a ranged attack, you can use a reaction to cause the outer surface of the shield to emit a flash of magical energy, sending the missile hurtling back at your attacker. Make a ranged weapon attack roll against your attacker using the attacker's bonuses on the roll. If the attack hits, roll damage as normal, using the attacker's bonuses.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "shield",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "shield-of-the-fallen",
        "fields": {
            "name": "Shield of the Fallen",
            "desc": "Your allies can use this shield to move you when you aren't capable of moving. If you are paralyzed, petrified, or unconscious, and a creature lays you on this shield, the shield rises up under you, bearing you and anything you currently wear or carry. The shield then follows the creature that laid you on the shield for up to 1 hour before gently lowering to the ground. This property otherwise works like the floating disk spell. Once used, the shield can't be used this way again for 1d12 hours.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "shield",
            "rarity": 1
        }
    },
    {
        "model": "api_v2.item",
        "pk": "tarian-graddfeydd-ddraig",
        "fields": {
            "name": "Tarian Graddfeydd Ddraig",
            "desc": "This metal shield has an outer coating consisting of hardened resinous insectoid secretions embedded with flakes from ground dragon scales collected from various dragon wyrmlings and one dragon that was killed by shadow magic. While holding this shield, you gain a +2 bonus to AC. This bonus is in addition to the shield's normal bonus to AC. In addition, you have resistance to acid, cold, fire, lightning, necrotic, and poison damage dealt by the breath weapons of dragons. While wielding the shield in an area of dim or bright light, you can use an action to reflect the light off the shield's dragon scale flakes to cause a cone of multicolored light to flash from it (15-foot cone if in dim light; 30-foot cone if in bright light). Each creature in the area must make a DC 17 Dexterity saving throw. For each target, roll a d6 and consult the following table to determine which color is reflected at it. The shield can't be used this way again until the next dawn. | d6 | Effect |\n| --- | --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| 1 | **Red**. The target takes 6d6 fire damage on a failed save, or half as much damage on a successful one. |\n| 2 | **White**. The target takes 4d6 cold damage and is restrained until the start of your next turn on a failed save, or half as much damage and is not restrained on a successful one. |\n| 3 | **Blue**. The target takes 4d6 lightning damage and is paralyzed until the start of your next turn on a failed save, or half as much damage and is not paralyzed on a successful one. |\n| 4 | **Black**. The target takes 4d6 acid damage on a failed save, or half as much damage on a successful one. If the target failed the save, it also takes an extra 2d6 acid damage on the start of your next turn. |\n| 5 | **Green**. The target takes 4d6 poison damage and is poisoned until the start of your next turn on a failed save, or half as much damage and is not poisoned on a successful one. |\n| 6 | **Shadow**. The target takes 4d6 necrotic damage and its Strength score is reduced by 1d4 on a failed save, or half as much damage and does not reduce its Strength score on a successful one. The target dies if this Strength reduction reduces its Strength to 0. Otherwise, the reduction lasts until the target finishes a short or long rest. |",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "shield",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "verses-of-vengeance",
        "fields": {
            "name": "Verses of Vengeance",
            "desc": "This massive, holy tome is bound in brass with a handle on the back cover. A steel chain dangles from the sturdy metal cover, allowing you to hang the tome from your belt or hook it to your armor. A locked clasp holds the tome closed, securing its contents. You gain a +1 bonus to AC while you wield this tome as a shield. This bonus is in addition to the shield's normal bonus to AC. Alternatively, you can make melee weapon attacks with the tome as if it was a club. If you make an attack using use the tome as a weapon, you lose the shield's bonus to your AC until the start of your next turn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "shield",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "void-touched-buckler",
        "fields": {
            "name": "Void-Touched Buckler",
            "desc": "This simple wood and metal buckler belonged to an adventurer slain by a void dragon wyrmling (see Tome of Beasts). It sat for decades next to a small tear in the fabric of reality, which led to the outer planes. It has since become tainted by the Void. While wielding this shield, you have a +1 bonus to AC. This bonus is in addition to the shield’s normal bonus to AC. Invoke the Void. While wielding this shield, you can use an action to invoke the shield’s latent Void energy for 1 minute, causing a dark, swirling aura to envelop the shield. For the duration, when a creature misses you with a weapon attack, it must succeed on a DC 17 Wisdom saving throw or be frightened of you until the end of its next turn. In addition, when a creature hits you with a weapon attack, it has advantage on weapon attack rolls against you until the end of its next turn. You can’t use this property of the shield again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "shield",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "zephyr-shield",
        "fields": {
            "name": "Zephyr Shield",
            "desc": "This round metal shield is painted bright blue with swirling white lines across it. You gain a +2 bonus to AC while you wield this shield. This is an addition to the shield's normal AC bonus. Air Bubble. Whenever you are immersed in a body of water while holding this shield, you can use a reaction to envelop yourself in a 10-foot radius bubble of fresh air. This bubble floats in place, but you can move it up to 30 feet during your turn. You are moved with the bubble when it moves. The air within the bubble magically replenishes itself every round and prevents foreign particles, such as poison gases and water-borne parasites, from entering the area. Other creatures can leave or enter the bubble freely, but it collapses as soon as you exit it. The exterior of the bubble is immune to damage and creatures making ranged attacks against anyone inside the bubble have disadvantage on their attack rolls. The bubble lasts for 1 minute or until you exit it. Once used, this property can’t be used again until the next dawn. Sanctuary. You can use a bonus action to cast the sanctuary spell (save DC 13) from the shield. This spell protects you from only water elementals and other creatures composed of water. Once used, this property can’t be used again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": false,
            "category": "shield",
            "rarity": 4
        }
    }
]