[
    {
        "model": "api_v2.item",
        "pk": "anointing-mace",
        "fields": {
            "name": "Anointing Mace",
            "desc": "Also called an anointing gada, you gain a +1 bonus to attack and damage rolls made with this magic weapon. In addition, the ornately decorated head of the mace holds a reservoir perforated with small holes. As an action, you can fill the reservoir with a single potion or vial of liquid, such as holy water or alchemist's fire. You can press a button on the haft of the weapon as a bonus action, which opens the holes. If you hit a target with the weapon while the holes are open, the weapon deals damage as normal and the target suffers the effects of the liquid. For example,\nan anointing mace filled with holy water deals an extra 2d6 radiant damage if it hits a fiend or undead. After you press the button and make an attack roll, the liquid is expended, regardless if your attack hits.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "mace",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "bludgeon-of-nightmares",
        "fields": {
            "name": "Bludgeon of Nightmares",
            "desc": "You gain a +2 bonus to attack and damage rolls made with this weapon. The weapon appears to be a mace of disruption, and an identify spell reveals it to be such. The first time you use this weapon to kill a creature that has an Intelligence score of 5 or higher, you begin having nightmares and disturbing visions that disrupt your rest. Each time you complete a long rest, you must make a Wisdom saving throw. The DC equals 10 + the total number of creatures with Intelligence 5 or higher that you've reduced to 0 hit points with this weapon. On a failure, you gain no benefits from that long rest, and you gain one level of exhaustion.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "mace",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "clockwork-mace-of-divinity",
        "fields": {
            "name": "Clockwork Mace of Divinity",
            "desc": "This clockwork mace is composed of several different metals. While attuned to this magic weapon, you have proficiency with it. As a bonus action, you can command the mace to transform into a trident. When you hit with an attack using this weapon's trident form, the target takes an extra 1d6 radiant damage.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "mace",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "consuming-rod",
        "fields": {
            "name": "Consuming Rod",
            "desc": "This bone mace is crafted from a humanoid femur. One end is carved to resemble a ghoulish face, its mouth open wide and full of sharp fangs. The mace has 8 charges, and it recovers 1d6 + 2 charges daily at dawn. You gain a +1 bonus to attack and damage rolls made with this magic mace. When it hits a creature, the mace's mouth stretches gruesomely wide and bites the target, adding 3 (1d6) piercing damage to the attack. As a reaction, you can expend 1 charge to regain hit points equal to the piercing damage dealt. Alternatively, you can use your reaction to expend 5 charges when you hit a Medium or smaller creature and force the mace to swallow the target. The target must succeed on a DC 15 Dexterity saving throw or be swallowed into an extra-dimensional space within the mace. While swallowed, the target is blinded and restrained, and it has total cover against attacks and other effects outside the mace. The target can still breathe. As an action, you can force the mace to regurgitate the creature, which falls prone in a space within 5 feet of the mace. The mace automatically regurgitates a trapped creature at dawn when it regains charges.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "mace",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 4
        }
    }
]