[
    {
        "model": "api_v2.item",
        "pk": "bone-whip",
        "fields": {
            "name": "Bone Whip",
            "desc": "This whip is constructed of humanoid vertebrae with their edges magically sharpened and pointed. The bones are joined together into a coiled line by strands of steel wire. The handle is half a femur wrapped in soft leather of tanned humanoid skin. You gain a +1 bonus to attack and damage rolls with this weapon. You can use an action to cause fiendish energy to coat the whip. For 1 minute, you gain 5 temporary hit points the first time you hit a creature on each turn. In addition, when you deal damage to a creature with this weapon, the creature must succeed on a DC 17 Constitution saving throw or its hit point maximum is reduced by an amount equal to the damage dealt. This reduction lasts until the creature finishes a long rest. Once used, this property of the whip can't be used again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "whip",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "poison-strand",
        "fields": {
            "name": "Poison Strand",
            "desc": "When you hit with an attack using this magic whip, the target takes an extra 2d4 poison damage. If you hold one end of the whip and use an action to speak its command word, the other end magically extends and darts forward to entangle a creature you can see within 20 feet of you. The target must succeed on a DC 17 Dexterity saving throw or become restrained. While restrained, the target takes 2d4 poison damage at the start of each of its turns, and you can use an action to pull the target up to 20 feet toward you. If you would move the target into damaging terrain, such as lava or a pit, it can make a DC 17 Strength saving throw. On a success, the target isn't pulled toward you. You can't use the whip to make attacks while it is restraining a target, and if you release your end of the whip, the target is no longer restrained. The restrained target can use an action to make a DC 17 Strength (Athletics) or Dexterity (Acrobatics) check (target's choice). On a success, the target is no longer restrained by the whip. When the whip has restrained creatures for a total of 1 minute, you can't restrain a creature with the whip again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "whip",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "searing-whip",
        "fields": {
            "name": "Searing Whip",
            "desc": "Inspired by the searing breath weapon of a light drake (see Tome of Beasts 2), this whip seems to have filaments of light interwoven within its strands. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit a creature with this weapon, the creature takes an extra 1d4 radiant damage. When you roll a 20 on an attack roll made with this weapon, the target is blinded until the end of its next turn. The whip has 3 charges, and it regains 1d3 expended charges daily at dawn or when exposed to a daylight spell for 1 minute. While wielding the whip, you can use an action to expend 1 of its charges to transform the whip into a searing beam of light. Choose one creature you can see within 30 feet of you and make one attack roll with this whip against that creature. If the attack hits, that creature and each creature in a line that is 5 feet wide between you and the target takes damage as if hit by this whip. All of this damage is radiant. If the target is undead, you have advantage on the attack roll.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "whip",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "tamers-whip",
        "fields": {
            "name": "Tamer's Whip",
            "desc": "This whip is braided from leather tanned from the hides of a dozen different, dangerous beasts. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you attack a beast using this weapon, you have advantage on the attack roll.\nWhen you roll a 20 on the attack roll made with this weapon and the target is a beast, the beast must succeed on a DC 15 Wisdom saving throw or become charmed or frightened (your choice) for 1 minute.\nIf the creature is charmed, it understands and obeys one-word commands, such as “attack,” “approach,” “stay,” or similar. If it is charmed and understands a language, it obeys any command you give it in that language. The charmed or frightened creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "whip",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 3
        }
    },
    {
        "model": "api_v2.item",
        "pk": "trident-of-the-vortex",
        "fields": {
            "name": "Trident of the Vortex",
            "desc": "This bronze trident has a shaft of inlaid blue pearl. You gain a +2 bonus to attack and damage rolls with this magic weapon. Whirlpool. While wielding the trident underwater, you can use an action to speak its command word and cause the water around you to whip into a whirlpool for 1 minute. For the duration, each creature that enters or starts its turn in a space within 10 feet of you must succeed on a DC 15 Strength saving throw or be restrained by the whirlpool. The whirlpool moves with you, and creatures restrained by it move with it. A creature within 5 feet of the whirlpool can pull a creature out of it by taking an action to make a DC 15 Strength check and succeeding. A restrained creature can try to escape by taking an action to make a DC 15 Strength check. On a success, the creature escapes and enters a space of its choice within 5 feet of the whirlpool. Once used, this property can’t be used again until the next dawn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "whip",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 4
        }
    },
    {
        "model": "api_v2.item",
        "pk": "tyrants-whip",
        "fields": {
            "name": "Tyrant's Whip",
            "desc": "This wicked whip has 3 charges and regains all expended charges daily at dawn. When you hit with an attack using this magic whip, you can use a bonus action to expend 1 of its charges to cast the command spell (save DC 13) from it on the creature you hit. If the attack is a critical hit, the target has disadvantage on the saving throw.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "whip",
            "armor": null,
            "requires_attunement": false,
            "category": "weapon",
            "rarity": 2
        }
    },
    {
        "model": "api_v2.item",
        "pk": "whip-of-fangs",
        "fields": {
            "name": "Whip of Fangs",
            "desc": "The skin of a large asp is woven into the leather of this whip. The asp's head sits nestled among the leather tassels at its tip. You gain a +1 bonus to attack and damage rolls made with this magic weapon. When you hit with an attack using this magic weapon, the target takes an extra 1d4 poison damage and must succeed on a DC 13 Constitution saving throw or be poisoned until the end of its next turn.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": "whip",
            "armor": null,
            "requires_attunement": true,
            "category": "weapon",
            "rarity": 2
        }
    }
]