[
    {
        "model": "api_v2.item",
        "pk": "phase-mirror",
        "fields": {
            "name": "Phase Mirror",
            "desc": "Unlike other magic items, multiple creatures can attune to the phase mirror by touching it as part of the same short rest. A creature remains attuned to the mirror as long as it is on the same plane of existence as the mirror or until it chooses to end its attunement to the mirror during a short rest. Phase mirrors look almost identical to standard mirrors, but their surfaces are slightly clouded. These mirrors are found in a variety of sizes, from handheld to massive disks. The larger the mirror, the more power it can take in, and consequently, the more creatures it can affect. When it is created, a mirror is connected to a specific plane. The mirror draws in starlight and uses that energy to move between its current plane and its connected plane. While holding or touching a fully charged mirror, an attuned creature can use an action to speak the command word and activate the mirror. When activated, the mirror transports all creatures attuned to it to the mirror's connected plane or back to the Material Plane at a destination of the activating creature's choice. This effect works like the plane shift spell, except it transports only attuned creatures, regardless of their distance from each other, and the destination must be on the Material Plane or the mirror's connected plane. If the mirror is broken, its magic ends, and each attuned creature is trapped in whatever plane it occupies when the mirror breaks. Once activated, the mirror stays active for 24 hours and any attuned creature can use an action to transport all attuned creatures back and forth between the two planes. After these 24 hours have passed, the power drains from the mirror, and it can't be activated again until it is recharged. Each phase mirror has a different recharge time and limit to the number of creatures that can be attuned to it, depending on the mirror's size.",
            "size": 1,
            "weight": "0.0",
            "armor_class": 0,
            "hit_points": 0,
            "document": "vault-of-magic",
            "cost": 0,
            "weapon": null,
            "armor": null,
            "requires_attunement": true,
            "category": "wondrous-item",
            "rarity": 2
        }
    }
]