[
{
  "model": "api_v2.background",
  "pk": "crime-syndicate-member",
  "fields": {
    "name": "Crime Syndicate Member",
    "desc": "Whether you grew up in the slum-run streets bamboozling foolish gamblers out of their fortune, or spent your youth pilfering loose coin from the pockets of less-attentive travelers, your lifestyle of deceiving-to-survive eventually drew the attention of an organized and dangerous crime syndicate. Offering protection, a modicum of kinship, and a number of useful resources to further develop your craft as a criminal, you agree to receive the syndicate’s brand and join their ranks.\nYou might have been working the guild’s lower ranks, wandering the alleys as a simple cutpurse to fill the meager coffers with wayward gold until the opportunity arose to climb the professional ladder. Or you may have become a clever actor and liar whose skill in blending in with all facets of society has made you an indispensable agent of information gathering. Perhaps your technique with a blade and swiftness of action led you to become a feared hitman for a syndicate boss, sending you on the occasional contract to snuff the life of some unfortunate soul who crossed them. Regardless, while the threat of the law is ever looming, the advantages to having a foot in such a powerful cartel can greatly outweigh the paranoia.",
    "document": "taldorei"
  }
},
{
  "model": "api_v2.background",
  "pk": "elemental-warden",
  "fields": {
    "name": "Elemental Warden",
    "desc": "Away from the complex political struggles of the massive cities, you’ve instead been raised to revere and uphold the protection of the natural world, while policing, bending, and guiding the elemental powers that either foster life or destroy it. Living among smaller bands of tribal societies means you have stronger ties to your neigh- bors than most, and the protection of this way of life is of cardinal importance. Each elemental warden is tethered to one of the four elemental tribes and their villages. You must select one: Fire, Water, Earth, or Wind.\nYour upbringing may have prepared you to be a fierce warrior, trained in combat to defend your culture and charge as protectors of the rifts. It’s possible your meditation on the balance of the elements has brought you peace of mind with strength of body as a monk. Perhaps you found strength in bending the elements yourself, joining the ranks of the powerful elemental druids. Regardless, your loyalties ultimately lie with the continued safety of your tribe, and you’ve set out to gather allies to your cause and learn more about the world around you.",
    "document": "taldorei"
  }
},
{
  "model": "api_v2.background",
  "pk": "fate-touched",
  "fields": {
    "name": "Fate-Touched",
    "desc": "Many lives and many souls find their ways through the patterns of fate and destiny, their threads following the path meant for them, oblivious and eager to be a part of the woven essence of history meant for them. Some souls, however, glide forth with mysterious influence, their threads bending the weave around them, toward them, unknowingly guiding history itself wherever they walk. Events both magnificent and catastrophic tend to follow such individuals. These souls often become great rulers and terrible tyrants, powerful mages, religious leaders, and legendary heroes of lore. These are the fate-touched.\nFew fate-touched ever become aware of their prominent nature. Outside of powerful divination magics, it’s extremely difficult to confirm one as fate-touched. There are many communities that regard the status as a terrible omen, treating a confirmed fate-touched with mistrust and fear. Others seek them as a blessing, rallying around them for guidance. Some of renown and power grow jealous, wishing to bend a fate-touched beneath their will, and some stories speak of mages of old attempting to extract or transfer the essence itself.\nPlayers are not intended to select this background, but this is instead provided for the dungeon master to consider for one or more of their players, or perhaps a prominent NPC, as their campaign unfolds. It provides very minor mechanical benefit, but instead adds an element of lore, importance, and fate-bearing responsibility to a character within your story. Being fate-touched overlaps and co-exists with the character’s current background, only adding to their mystique. Consider it for a player character who would benefit from being put more central to the coming conflicts of your adventure, or for an NPC who may require protection as they come into their destiny. Perhaps consider a powerful villain discovering their fate-twisting nature and using it to wreak havoc. All of these possibilities and more can be explored should you choose to include a fate-touched within your campaign.",
    "document": "taldorei"
  }
},
{
  "model": "api_v2.background",
  "pk": "lyceum-student",
  "fields": {
    "name": "Lyceum Student",
    "desc": "You most likely came up through money or a family of social prestige somewhere in the world, as tuition at a lyceum is not inexpensive. Your interests and pursuits have brought you to the glittering halls of a place of learning, soaking in all and every lesson you can to better make your mark on the world (or at least you should be, but every class has its slackers). However, the call to adventure threatens to pull you from your studies, and now the challenge of balancing your education with the tide of destiny sweeping you away is looming.\nYou may have come to better research and understand the history and lore of the lands you now call home, perhaps seeking a future here at the lyceum as a professor. You could also have been drawn by the promise of prosperity in politics, learning the inner workings of government and alliances to better position yourself as a future writer of history. Perhaps you’ve discovered a knack for the arcane, coming here to focus on refining your spellcraft in the footsteps of some of the finest wizards and sorcerers in days of yore.",
    "document": "taldorei"
  }
},
{
  "model": "api_v2.background",
  "pk": "recovered-cultist",
  "fields": {
    "name": "Recovered Cultist",
    "desc": "The rise of cults are scattered and separated, with little to no unity between the greater evils. Hidden hierarchies of power-hungry mortals corrupt and seduce, promising a sliver of the same power they had been promised when the time comes to reap their harvest.\nYou once belonged to such a cult. Perhaps it was brief, embracing the rebellious spirit of youth and curious where this path may take you. You also may have felt alone and lost, this community offering a welcome you had been subconsciously seeking. It’s possible you were raised from the beginning to pray to the gods of shadow and death. Then one day the veil was lifted and the cruel truth shook your faith, sending you running from the false promises and seeking redemption.\nYou have been freed from the bindings of these dangerous philosophies, but few secret societies find comfort until those who abandon their way are rotting beneath the soil.",
    "document": "taldorei"
  }
}
]
