[
{
  "model": "api.archetype",
  "pk": "oathless-betrayer",
  "fields": {
    "name": "Oathless Betrayer",
    "desc": "Those who fall from the loftiest heights may reach the darkest depths. A paladin who breaks their oath and turns their back on redemption may instead pledge themselves to a dark power or cause. Sometimes known as antipaladins, such betrayers may gain abilities in a mockery of their former goodness, spreading evil where once they fought for the cause of right.\n\nAt 3rd level or higher, a paladin of evil alignment may become an Oathless Betrayer. Unlike other oaths, paladins who take this path can do so in spite of having taken a previous oath, and the features of this subclass replace those of their former Sacred Oath.\n\nNote: this subclass is primarily for NPCs, but a player can choose it at their DM’s discretion.\n\n##### Tenets of the Betrayer\n\nBy their very nature, Oathless Betrayers do not share any common ideals, but may hold to one of the following tenets.\n\n**_Twisted Honor._** You still cling to your former oath, but distorted to serve your new purpose. For instance, you may still demand a fair fight against a worthy adversary, but show only contempt to those you deem weak.\n\n**_Utter Depravity._** You follow some part of your former oath to the opposite extreme. If you were once honest to a fault, you might now tell lies for the simple pleasure of causing others pain.\n\n**_Misguided Revenge._** You blame your fall not on your own failings but on the actions of another, possibly one who remained righteous where you wavered. Your all-consuming hate clouds your reason, and you’ve dedicated yourself to revenge at any cost for imagined wrongs.\n\n##### Oath Spells\n\nYou gain oath spells at the paladin levels listed.\n\n| Level | Paladin Spells                 |\n|-------|--------------------------------|\n| 3rd   | hellish rebuke, inflict wounds |\n| 5th   | crown of madness, darkness     |\n| 9th   | animate dead, bestow curse     |\n| 13th  | blight, confusion              |\n| 17th  | contagion, dominate person     |\n\n##### Channel Divinity\n\nAs an Oathless Betrayer paladin of 3rd level or higher, you gain the following two Channel Divinity options.\n\n**_Command the Undead._** As an action, you may target one undead creature within 30 feet that you can see. If the target creature fails a Wisdom saving throw against your spellcasting DC, it is compelled to obey you for the next 24 hours. The effect ends on the target creature if you use this ability on a different target, and you cannot use this ability on an undead creature if its challenge rating exceeds or is equal to your paladin class level.\n\n**_Frightful Bearing._** As an action, you take on a menacing aspect to terrify your enemies. You target any number of creatures within 30 feet that can see you to make a Wisdom saving throw. Each target that fails its save becomes frightened of you. The creature remains frightened for 1 minute, but it may make a new Wisdom saving throw to end the effect if it is more than 30 feet away from you at the end of its turn.\n\n##### Aura of Loathing\n\nStarting at 7th level, you add your Charisma modifier to damage rolls from melee weapons (with a minimum bonus of +1). Creatures of the fiend or undead type within 10 feet of you also gain this bonus, but the bonus does not stack with the same bonus from another paladin.\n\nAt 18th level, the range of this aura increases to 30 feet.\n\n##### Unearthly Barrier\n\nBeginning at 15th level, you receive resistance to nonmagical bludgeoning, piercing, and slashing damage.\n\n##### Master of Doom\n\nAt 20th level, as an action, you can cloak yourself and any allied creatures of your choice within 30-feet in an aura of darkness. For 1 minute, bright light in this radius becomes dim light, and any creatures that use primarily sight suffer disadvantage on attack rolls against you and the others cloaked by you.\n\nIf an enemy that starts its turn in the aura is frightened of you, it suffers 4d10 psychic damage. You may also use a bonus action to lash out with malicious energy against one creature on your turn during the duration of the aura. If you succeed on a melee spell attack against the target, you deal 3d10 + your Charisma modifier in necrotic damage.\n\nOnce you use this feature, you can't use it again until you finish a long rest.",
    "document": 31,
    "created_at": "2023-11-05T00:01:38.191",
    "page_no": null,
    "char_class": "paladin",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "storm-domain",
  "fields": {
    "name": "Storm Domain",
    "desc": "Nothing inspires fear in mortals quite like a raging storm. This domain encompasses deities such as Enlil, Indra, Raijin, Taranis, Zeus, and Zojz. Many of these are the rulers of their respective pantheons, wielding the thunderbolt as a symbol of divine might. Most reside in the sky, but the domain also includes lords of the sea (like Donbettyr) and even the occasional chthonic fire deity (such as Pele). They can be benevolent (like Tlaloc), nourishing crops with life-giving rain; they can also be martial deities (such as Perun and Thor), splitting oaks with axes of lightning or battering their foes with thunderous hammers; and some (like Tiamat) are fearsome destroyers, spoken of only in whispers so as to avoid drawing their malevolent attention. Whatever their character, the awesome power of their wrath cannot be denied.\n\n**Storm Domain Spells (table)**\n\n| Cleric Level | Spells                               |\n|--------------|---------------------------------|\n| 1st          | fog cloud, thunderwave          |\n| 3rd          | gust of wind, shatter           |\n| 5th          | call lightning, sleet storm     |\n| 7th          | control water, ice storm        |\n| 9th          | destructive wave, insect plague |\n\n##### Bonus Proficiency\n\nWhen you choose this domain at 1st level, you gain proficiency with heavy armor as well as with martial weapons.\n\n##### Tempest’s Rebuke\n\nAlso starting at 1st level, you can strike back at your adversaries with thunder and lightning. If a creature hits you with an attack, you can use your reaction to target it with this ability. The creature must be within 5 feet of you, and you must be able to see it. The creature must make a Dexterity saving throw, taking 2d8 damage on a failure. On a success, the creature takes only half damage. You may choose to deal either lightning or thunder damage with this ability.\n\nYou may use this feature a number of times equal to your Wisdom modifier (at least once). When you finish a long rest, you regain your expended uses.\n\n##### Channel Divinity: Full Fury\n\nStarting at 2nd level, you can use your Channel Divinity to increase the fury of your storm based attacks. Whenever you would deal lightning or thunder damage from an attack, rather than roll damage, you can use the Channel Divinity feature to deal the maximum possible damage.\n\n##### Storm Blast\n\nBeginning at 6th level, you can choose to push a Large or smaller creature up to 10 feet away from you any time you deal lightning damage to it.\n\n##### Divine Strike\n\nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage to the target. When you reach 14th level, the extra damage increases to 2d8.\n\n##### Sky’s Blessing\n\nStarting at 17th level, you gain a flying speed whenever you are outdoors. Your flying speed is equal to your present walking speed.",
    "document": 31,
    "created_at": "2023-11-05T00:01:38.189",
    "page_no": null,
    "char_class": "cleric",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "mischief-domain",
  "fields": {
    "name": "Mischief Domain",
    "desc": "While most deities inspire awe with their might and power, some prefer subtler methods. Gods of the mischief domain favor cunning to advance their agendas, and they encourage this trait in the followers as well. Some deities of mischief, like Anansi and Hermes, are good natured tricksters. Some, like the impetuous Susanoo, vacillate between being helpful or hindering on a whim. Deities like Loki and Veles are primarily antagonistic to their respective pantheons, but their mercurial nature means they might make the odd alliance with their more serious kin. Gods associated with the moon, like Hecate, mirror the moon’s changing shape as patrons of mischief. Gods of fortune, like Tyche and Bes, are often tricksters who make their own luck. Meanwhile, culture heroes like Kokopelli, Lemminkäinen, and Maui often use deceit to bring prosperity to their people. These diverse deities count among their worshippers criminals, freedom fighters, and free spirits alike, united only by their willingness to upset the status quo. Some use tricks to lead people to a greater truth, while others use mischief to stay one step ahead of the competition.\n\n**Mischeif Domain Spells (table)**\n\n| Cleric Level | Spells                           |\n|--------------|----------------------------------|\n| 1st          | charm person, disguise self      |\n| 3rd          | mirror image, pass without trace |\n| 5th          | blink, dispel magic              |\n| 7th          | dimension door, polymorph        |\n| 9th          | dominate person, modify memory   |\n\n#### Spreader of Mischief\n\nAt 1st level, when you choose this domain, you can endow others with the power to make mischief. As an action, you may touch a willing creature, and that creature gains advantage when making Dexterity (Stealth) checks for the next hour. The effect ends early if you use the feature on a different creature. You may not use this feature on yourself.\n\n#### Channel Divinity: Double Trouble\n\nOnce you reach 2nd level, you gain the power to create an illusory double of yourself with the Channel Divinity class feature. You may use your action to manifest the illusion in an unoccupied space visible to you and within 30 feet of yourself. You must concentrate to maintain the illusion as if it were a spell, and you can do so for up to 1 minute. On your turn, you can use a bonus action to move up to 30 feet, but it must remain in your view and cannot move more than 120 feet away from you.\n\nWhile you maintain the illusion, when you cast a spell, you can use the position of the illusion rather than your own for determining range, area of effect, and line of sight. However, you cannot actually “see” through the illusion’s eyes, so you must rely on your own vision if the spell requires you to see a target or space.\n\nYour illusion can disorient foes, so you gain advantage on attack rolls against any creature that can see the illusion if both you and the illusion are within 5 feet of the creature.\n\n#### Channel Divinity: Walk Unseen\n\nBeginning at 6th level, with your Channel Divinity feature, you can use an action to become invisible. This invisibility lasts until the end of your next turn, or if you cast a spell or attack.\n\n#### Divine Strike\n\nAt 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage to the target. When you reach 14th level, the extra damage increases to 2d8.\n\n#### Double Trouble Doubled\n\nStarting at 17th level, your Double Trouble feature becomes more potent. Instead of one double, you can create up to four, and you can move as many of them as you like on your turn with a bonus action following the rules outlined in that feature.",
    "document": 31,
    "created_at": "2023-11-05T00:01:38.189",
    "char_class": "cleric",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "college-of-skalds",
  "fields": {
    "name": "College of Skalds",
    "desc": "Skalds are poets of battle, recounting the deeds of heroes and the bloody battles that shook nations. But you do more than just tell stories; a skald draws on the tales of past greatness in his own quest for glory on the battlefield. While learning the sagas of bygone years, you have also taken up a practical study of combat, allowing you to use more weapons and with greater effectiveness than most bards. When you sing the song of battle to bolster your allies, you are right alongside them, going toe to toe with formidable foes to become worthy of the poems from the skalds who will recount your tale.\n\n##### Combat Aptitude\n\nWhen you choose the College of Skalds at 3rd level, you become proficient in all martial weapons, as well as in the use of medium armor and shields.\n\n##### Saga of Deeds\n\nStarting at 3rd level, you can use your stories of the great battles of legend to inspire your allies in combat. The dice gained from your Bardic Inspiration feature can be used in the following ways:\n\n* After rolling damage for a successful weapon attack, a creature can choose to roll a Bardic Inspiration die and add the result to the damage dealt.\n* When a creature is the target of an attack roll, before knowing whether the rolled number is a hit or a miss, it may roll a Bardic Inspiration die as a reaction, adding the result to its armor class for this specific attack only.\n\n##### Battle Fury\n\nAt 6th level, you can unleash even more fury in combat. When you use the attack action, you can make two attacks instead of one.\n\n##### Song and Strike\n\nStarting at 14th level, you can wade into combat even as you wield your bardic magic. Any time you cast a bard spell as an action, you can use your bonus action to make a single weapon attack.",
    "document": 31,
    "created_at": "2023-11-05T00:01:38.189",
    "char_class": "bard",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "arcane-warrior",
  "fields": {
    "name": "Arcane Warrior",
    "desc": "Most fighters train exhaustively with their preferred weapons to hone their power and reflexes. To some, this easily flows into the careful practice of magic as well. Unlike wizards, arcane warriors focus on a smaller number of spells that they commit to memory, particularly from the schools of magic that focus on protection and direct damage which are particularly useful in a combat setting. An arcane warrior can be a jack of all trades, solving problems with force or magic as the situation warrants. They can also aim to master a few strategies that use their martial and mental aptitude in equal measure.\n\n##### Spellcasting\n\nBeginning at 3rd level, you can cast spells from the wizard spell list.\n\n**_Cantrips._** Choose two cantrips from the wizard spell list to learn. At 10th level, you learn one additional cantrip from the same list.\n\n**_Spell Slots._** You use spell slots to cast 1st level and higher spells, expending a spell slot equal to or higher than the level of the spell you wish to cast. When you complete a long rest, you regain any spell slots you have used. The number of spell slots of different levels available are shown on the Arcane Warrior Spells table.\nFor example, if you are a 7th-level Arcane Warrior who knows the 1st-level spell _magic missile_, you could use any of your unused 1st or 2nd-level spell slots to cast the spell. However, if you wanted to cast 2nd-level spell _shatter_, you would need to expend a 2nd-level spell slot in order to cast it.\n\n**_1st-Level and Higher Spells Known._** Upon choosing this archetype at 3rd level, you learn three 1st-level spells from the wizard spell list. At least two of these spells must be from the abjuration or evocation schools.\n\nYou automatically learn additional spells from the wizard spell list as you gain levels, as shown on the Arcane Warrior Spells table. When you learn a new spell, it must be of a level that you can cast with your existing spell slots. Initially, you must choose your new spells from the evocation and abjuration schools, but starting at 8th level, you can choose from any type of spell on the wizard spell list.\n\nFor instance, upon reaching 7th level in this class, an Arcane Warrior could learn a new spell of either 1st or 2nd-level, but it must be from either the abjuration or evocation schools. At 8th level, the Arcane Warrior learns another spell of 1st or 2nd-level, which can be chosen from any spell school.\n\nEvery time you gain a new level of Arcane Warrior, you have the choice to replace one of your known wizard spells with a different spell from the same list of a level for which you have spell slots. However, if your Arcane Warrior level is 7th or lower, you can only know one spell of 1st level or higher from a school other than abjuration or evocation. At 8th level or higher in this class, you can learn additional spells from other schools, but at least 4 of your known spells of 1st level or higher must be from these two schools.\n\n**_Spellcasting Ability._** You use rote memorization and diligent study to master your wizard spells, so your spellcasting ability for these is Intelligence. You use your Intelligence modifier when making a spell attack roll with a wizard spell, as well as to calculate the DC of a saving throw against one of your wizard spells. If the text of a spell refers to your spellcasting ability, use your Intelligence.\n\n**Spell save DC** = 8 + your proficiency bonus + your Intelligence modifier\n\n**Spell attack modifier** = your proficiency bonus + your Intelligence modifier\n\n**Arcane Warrior Spells (table)**\n\n| Fighter Level | Known Cantrips | Known Spells | 1st | 2nd | 3rd | 4th |\n|---------------|----------------|--------------|-----|-----|-----|-----|\n| 3rd           | 2              | 3            | 2   | -   | -   | -   |\n| 4th           | 2              | 4            | 3   | -   | -   | -   |\n| 5th           | 2              | 4            | 3   | -   | -   | -   |\n| 6th           | 2              | 4            | 3   | -   | -   | -   |\n| 7th           | 2              | 5            | 4   | 2   | -   | -   |\n| 8th           | 2              | 6            | 4   | 2   | -   | -   |\n| 9th           | 2              | 6            | 4   | 2   | -   | -   |\n| 10th          | 3              | 7            | 4   | 3   | -   | -   |\n| 11th          | 3              | 8            | 4   | 3   | -   | -   |\n| 12th          | 3              | 8            | 4   | 3   | -   | -   |\n| 13th          | 3              | 9            | 4   | 3   | 2   | -   |\n| 14th          | 3              | 10           | 4   | 3   | 2   | -   |\n| 15th          | 3              | 10           | 4   | 3   | 2   | -   |\n| 16th          | 3              | 11           | 4   | 3   | 3   | -   |\n| 17th          | 3              | 11           | 4   | 3   | 3   | -   |\n| 18th          | 3              | 11           | 4   | 3   | 3   | -   |\n| 19th          | 3              | 12           | 4   | 3   | 3   | 1   |\n| 20th          | 3              | 13           | 4   | 3   | 3   | 1   |\n\n##### Bonded Weapon\n\nStarting at 3rd level, you can create a magical bond between you and a particular weapon of your choice. This weapon becomes almost like a part of you, and unless you are incapacitated, no one can disarm it from you. If you are not holding the weapon, you can use a bonus action to summon it instantly into your hand via teleportation unless it is on another plane of existence.\n\nTo create the magical bond with your weapon, you must perform a ritual that takes 1 hour. During the ritual, the weapon you are attempting to bond with must always be at your side, but you can otherwise complete the ritual over the course of a short rest. You can perform the ritual multiple times, but you can only remain bonded to two particular weapons at any given time. Bonding with a third weapon will break the bond with one of your other weapons that you choose. Furthermore, you can only use your bonus action to summon one bonded weapon per turn.\n\n##### Battle Magic\n\nAt 7th level, you can use your bonus action to make a weapon attack on a turn that you use an action to cast a cantrip.\n\n##### Arcane Strike\n\nStarting at 10th level, foes you strike in combat become more susceptible to your magical offensives as well. Creatures suffer disadvantage on a saving throw against your spells if you have hit them with a weapon attack. This effect only lasts until the end of your next turn after hitting the creature, and only applies to the first saving throw they make against one of your spells during this time.\n\n##### Eldritch Charge\n\nStarting at 15th level, your ferocious charges let you briefly plunge through the ethereal plane. When you use an Action Surge, in addition to gaining an additional action, you can teleport to any unoccupied space that you can see within 30 feet. This teleportation and your extra action can be used in either order.\n\n##### Improved Battle Magic\n\nAt 18th level, your ability to use spells in combat further improves. You can use your bonus action to make an attack after using your action to cast a spell of any level, not just cantrips.",
    "document": 31,
    "created_at": "2023-11-05T00:01:38.189",
    "char_class": "fighter",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "oathless-betrayer",
  "fields": {
    "name": "Oathless Betrayer",
    "desc": "Those who fall from the loftiest heights may reach the darkest depths. A paladin who breaks their oath and turns their back on redemption may instead pledge themselves to a dark power or cause. Sometimes known as antipaladins, such betrayers may gain abilities in a mockery of their former goodness, spreading evil where once they fought for the cause of right.\n\nAt 3rd level or higher, a paladin of evil alignment may become an Oathless Betrayer. Unlike other oaths, paladins who take this path can do so in spite of having taken a previous oath, and the features of this subclass replace those of their former Sacred Oath.\n\nNote: this subclass is primarily for NPCs, but a player can choose it at their DM’s discretion.\n\n##### Tenets of the Betrayer\n\nBy their very nature, Oathless Betrayers do not share any common ideals, but may hold to one of the following tenets.\n\n**_Twisted Honor._** You still cling to your former oath, but distorted to serve your new purpose. For instance, you may still demand a fair fight against a worthy adversary, but show only contempt to those you deem weak.\n\n**_Utter Depravity._** You follow some part of your former oath to the opposite extreme. If you were once honest to a fault, you might now tell lies for the simple pleasure of causing others pain.\n\n**_Misguided Revenge._** You blame your fall not on your own failings but on the actions of another, possibly one who remained righteous where you wavered. Your all-consuming hate clouds your reason, and you’ve dedicated yourself to revenge at any cost for imagined wrongs.\n\n##### Oath Spells\n\nYou gain oath spells at the paladin levels listed.\n\n| Level | Paladin Spells                 |\n|-------|--------------------------------|\n| 3rd   | hellish rebuke, inflict wounds |\n| 5th   | crown of madness, darkness     |\n| 9th   | animate dead, bestow curse     |\n| 13th  | blight, confusion              |\n| 17th  | contagion, dominate person     |\n\n##### Channel Divinity\n\nAs an Oathless Betrayer paladin of 3rd level or higher, you gain the following two Channel Divinity options.\n\n**_Command the Undead._** As an action, you may target one undead creature within 30 feet that you can see. If the target creature fails a Wisdom saving throw against your spellcasting DC, it is compelled to obey you for the next 24 hours. The effect ends on the target creature if you use this ability on a different target, and you cannot use this ability on an undead creature if its challenge rating exceeds or is equal to your paladin class level.\n\n**_Frightful Bearing._** As an action, you take on a menacing aspect to terrify your enemies. You target any number of creatures within 30 feet that can see you to make a Wisdom saving throw. Each target that fails its save becomes frightened of you. The creature remains frightened for 1 minute, but it may make a new Wisdom saving throw to end the effect if it is more than 30 feet away from you at the end of its turn.\n\n##### Aura of Loathing\n\nStarting at 7th level, you add your Charisma modifier to damage rolls from melee weapons (with a minimum bonus of +1). Creatures of the fiend or undead type within 10 feet of you also gain this bonus, but the bonus does not stack with the same bonus from another paladin.\n\nAt 18th level, the range of this aura increases to 30 feet.\n\n##### Unearthly Barrier\n\nBeginning at 15th level, you receive resistance to nonmagical bludgeoning, piercing, and slashing damage.\n\n##### Master of Doom\n\nAt 20th level, as an action, you can cloak yourself and any allied creatures of your choice within 30-feet in an aura of darkness. For 1 minute, bright light in this radius becomes dim light, and any creatures that use primarily sight suffer disadvantage on attack rolls against you and the others cloaked by you.\n\nIf an enemy that starts its turn in the aura is frightened of you, it suffers 4d10 psychic damage. You may also use a bonus action to lash out with malicious energy against one creature on your turn during the duration of the aura. If you succeed on a melee spell attack against the target, you deal 3d10 + your Charisma modifier in necrotic damage.\n\nOnce you use this feature, you can't use it again until you finish a long rest.",
    "document": 31,
    "created_at": "2023-11-05T00:01:38.189",
    "char_class": "paladin",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "eldritch-trickster",
  "fields": {
    "name": "Eldritch Trickster",
    "desc": "A rogue is not defined merely by swift reflexes, but also by a quick mind. Some rogues are even able to pick up some magical tricks during their career to complement their mundane skills. Though they lack the power of a full fledged wizard, they can apply their magic in unexpected ways, performing feats that would leave their arcane compatriots dumbfounded. An eldritch prankster may be a traditional burglar enhanced by magic, a carefree trickster mixing arcane elements with run of the mill legerdemain, or even an adventurer with so many more tools in their proverbial toolkit.\n\n##### Spellcasting\n\nBeginning at 3rd level, you can cast spells from the wizard spell list.\n\n**_Cantrips._** You learn the cantrip _mage hand_ and two additional cantrips of your choice, picking from the wizard spell list. At 10th level, you learn one additional cantrip from the same list.\n\n**_Spell Slots._** You use spell slots to cast 1st level and higher spells, expending a spell slot equal to or higher than the level of the spell you wish to cast. When you complete a long rest, you regain any spell slots you have used. The number of spell slots of different levels available are shown on the Eldritch Prankster Spells table.\nFor example, if you are a 7th-level Eldritch Prankster who knows the 1st-level spell _disguise self_, you could use any of your unused 1st or 2nd-level spell slots to cast the spell. However, if you wanted to cast 2nd-level spell _invisibility_, you would need to expend a 2nd-level spell slot in order to cast it.\n\n**_1st-Level and Higher Spells Known._** Upon choosing this archetype at 3rd level, you learn three 1st-level spells from the wizard spell list. At least two of these spells must be from the enchantment or illusion schools.\n\nYou automatically learn additional spells from the wizard spell list as you gain levels, as shown on the Eldritch Prankster Spells table. When you learn a new spell, it must be of a level that you can cast with your existing spell slots. Initially, you must choose your new spells from the illusion and enchantment schools, but starting at 8th level, you can choose from any type of spell on the wizard spell list.\n\nFor instance, upon reaching 7th level in this class, an Eldritch Prankster could learn a new spell of either 1st or 2nd-level, but it must be from either the enchantment or illusion schools. At 8th level, the Eldritch Prankster learns another spell of 1st or 2nd-level, which can be chosen from any spell school.\n\nEvery time you gain a new level of Eldritch Prankster, you have the choice to replace one of your known wizard spells with a different spell from the same list of a level for which you have spell slots. However, if your Eldritch Prankster level is 7th or lower, you can only know one spell of 1st level or higher from a school other than enchantment or illusion. At 8th level or higher in this class, you can learn additional spells from other schools, but at least 4 of your known spells of 1st level or higher must be from these two schools.\n\n**_Spellcasting Ability._** You use rote memorization and diligent study to master your wizard spells, so your spellcasting ability for these is Intelligence. You use your Intelligence modifier when making a spell attack roll with a wizard spell, as well as to calculate the DC of a saving throw against one of your wizard spells. If the text of a spell refers to your spellcasting ability, use your Intelligence.\n\n**Spell save DC** = 8 + your proficiency bonus + your Intelligence modifier\n\n**Spell attack modifier** = your proficiency bonus + your Intelligence modifier\n\n**Eldritch Prankster Spells (table)**\n\n| Rogue Level | Known Cantrips | Known Spells | 1st | 2nd | 3rd | 4th |\n|---------------|----------------|--------------|-----|-----|-----|-----|\n| 3rd           | 3              | 3            | 2   | -   | -   | -   |\n| 4th           | 3              | 4            | 3   | -   | -   | -   |\n| 5th           | 3              | 4            | 3   | -   | -   | -   |\n| 6th           | 3              | 4            | 3   | -   | -   | -   |\n| 7th           | 3              | 5            | 4   | 2   | -   | -   |\n| 8th           | 3              | 6            | 4   | 2   | -   | -   |\n| 9th           | 3              | 6            | 4   | 2   | -   | -   |\n| 10th          | 4              | 7            | 4   | 3   | -   | -   |\n| 11th          | 4              | 8            | 4   | 3   | -   | -   |\n| 12th          | 4              | 8            | 4   | 3   | -   | -   |\n| 13th          | 4              | 9            | 4   | 3   | 2   | -   |\n| 14th          | 4              | 10           | 4   | 3   | 2   | -   |\n| 15th          | 4              | 10           | 4   | 3   | 2   | -   |\n| 16th          | 4              | 11           | 4   | 3   | 3   | -   |\n| 17th          | 4              | 11           | 4   | 3   | 3   | -   |\n| 18th          | 4              | 11           | 4   | 3   | 3   | -   |\n| 19th          | 4              | 12           | 4   | 3   | 3   | 1   |\n| 20th          | 4              | 13           | 4   | 3   | 3   | 1   |\n\n##### Sleight of Mage Hand\n\nIf you cast the cantrip _mage hand_, you may cause the spectral, floating hand created by the spell to be invisible to observers. In addition to the functions described in the spell’s description, you may carry out the following tasks:\n\n* You can disarm traps and pick locks using thieves’ tools at the range of the spell.\n* You can pick a creature’s pocket, retrieving an object in a container that is being carried or worn by that creature.\n* You can also plant an object being held by the hand into a container that is being carried or worn by another creature.\n\nIn order to complete any of these tasks without being noticed, you must contest the target creature’s Wisdom (Perception) with a successful Dexterity (Sleight of Hand) check. Rather than controlling the spectral hand with an action, you may use the bonus action from your Cunning Action feature.\n\n##### Arcane Ambuscade\n\nAt 9th level, you can set potent magical ambushes. Creatures have disadvantage on saving throws against your spells if you are hidden during casting. If the spell allows multiple saving throws, this effect only applies to the turn when you cast the spell.\n\n##### Magical Misdirection\n\nStarting at 13th level, you can use the spell _mage hand_ to create distractions. You may choose one creature within 5 feet spectral, floating hand you create with the spell and use a bonus action on your turn to divert the creature’s attention away from yourself. Until the end of the turn, you gain advantage on attack rolls against the distracted creature.\n\n##### Eldritch Grift\n\nStarting at 17th level, your thieving cunning combined with your magical skill allow you to steal another spellcaster’s spell, temporarily granting you the knowledge to cast it while also depriving them of the ability to do so.\n\nAs a reaction when a creature targets you with a spell, or when you are in the area of effect of a spell cast by another creature, you force the creature to make a saving throw with a DC equal to your spell save DC, adding their spellcasting ability modifier to the check. If the creature fails this saving throw, not only are you unaffected by the spell, but you can cast the spell for the next 8 hours as long as you have spell slots to do so. During the same period, the original caster is unable to cast the spell.\n\nYou can only use this ability if the spell is 1st level or higher. You cannot steal a spell if it is of a higher level than you are able to cast with your spell slots, but you can steal a spell even if it is not on the wizard spell list. After you use this feature, you lose the ability to use it again until you have finished a long rest.",
    "document": 31,
    "created_at": "2023-11-05T00:01:38.189",
    "char_class": "rogue",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "wyrd magic",
  "fields": {
    "name": "Wyrd Magic",
    "desc": "Sorcerers have a gift. Unlike wizards who have to study magic, or warlocks who must bargain for it, sorcerers have magic in their blood. However, sometimes this magic surges out of its own accord in unpredictable ways. Sorcerers with a wyrd bloodline may derive it from a powerful chaotic force, perhaps the Elemental Chaos itself. They may suffer a curse of fate, or some creature’s idea of a blessing. They may just contain more magical potency than they know how to readily control. Still, while they can never truly tame their magic, they can learn to better bend it to their advantage.\n\n#### Flood of Chaos\n\nBeginning at 1st level when you select this bloodline, you sometimes release a flood of magical energy with your spellcasting. The DM can tell you to roll 1d20 at any time right after you cast a sorcerer spell that is not a cantrip. If the result is a 1, you then roll 1d100 on the Flood of Chaos table to determine an additional magical effect at random. A Flood of Chaos can happen at most once per turn.\n\nSometimes a Flood of Chaos forces you to cast a spell. Unlike normal spells, you cannot apply any Metamagic to them, and they do not require concentration, instead lasting the full duration.\n\n**Flood of Chaos (table)**\n\n| d100  | Effect |\n|---------|----------|\n| 01-02 | For the next minute, roll again on this table at the beginning of your turn, but ignore this result if rolled again during this time. |\n| 03-04 | You are able to see invisible creatures within your line of sight for the next minute. |\n| 05-06 | The DM chooses a sentient construct of CR 2 or less to materialize within 5 feet of you in an unoccupied space. The DM controls the construct for the next minute, at which point it disappears. |\n| 07-08 | You cast a 3rd level fireball with yourself at the center of the area of effect. |\n| 09-10 | You cast the spell magic missile as if from a 5th level spell slot. |\n| 11-12 | Your total height changes by 1d10 inches, to a minimum of 1 inch tall. Your height decreases on an odd roll and increases on an even roll. |\n| 13-14 | You cast the spell confusion with yourself at the center of the area of effect. |\n| 15-16 | At the beginning of your turn, you gain up to 5 hit points, not exceeding your maximum. This effect lasts for one minute. |\n| 17-18 | A beard of feathers grows from your face. The feathers erupt in all directions if you sneeze. |\n| 19-20 | You cast the spell grease with yourself at the center of the area of effect. |\n| 21-22 | For the next minute, whenever you cast a spell that requires a saving throw, creatures targeted by the spell have disadvantage on the saving throw. |\n| 23-24 | The color of your skin changes to a vivid bluish hue, unless your skin was already blue, in which case it turns a vibrant red. This effect can be ended by a remove curse spell. |\n| 25-26 | For the next minute, you gain an additional eye in the center of your forehead. You gain advantage on Wisdom (Perception) checks using sight for the duration. |\n| 27-28 | You spells that have a casting time of one action are instead cast as a bonus action for one minute. |\n| 29-30 | You choose an unoccupied space within 60 feet and instantly teleport to it. |\n| 31-32 | You are magically conveyed to a random spot on the Astral Plane. At the end of your next turn, you return to your previous location, or the nearest unoccupied space. |\n| 33-34 | The first damage dealing spell you cast in the next minute deals maximum damage. |\n| 35-36 | Your total age changes by 1d10 years, to a minimum of 1 year old. Your age decreases on an odd roll and increases on an even roll. |\n| 37-38 | 1d6 flumphs that are frightened of you materialize within a 60 foot radius around you. The DM controls the flumphs for the next minute, at which point they disappear. |\n| 39-40 | Roll 2d10. You gain that many hit points, not exceeding your maximum. |\n| 41-42 | You are transformed into a plant in a tiny pot, you become vulnerable to all damage types and are incapacitated but keep your current hit point total. You change back at the start of your next turn or if you are reduced to 0 hit points. |\n| 43-44 | You gain the ability to teleport as a bonus action once per turn. The teleportation range is 20 feet at maximum, and you lose the ability after one minute. |\n| 45-46 | You cast the spell levitate with yourself as the target. |\n| 47-48 | A unicorn materializes within 5 feet of you in an unoccupied space. The DM controls the unicorn for the next minute, at which point it disappears. |\n| 49-50 | For one minute, you are unable to speak and emit rosy colored bubbles if you open your mouth. |\n| 51-52 | For one minute, you are protected by an incorporeal magic shield which gives you +2 to your AC and makes you immune to the spell magic missile. |\n| 53-54 | For 5d6 days, you cannot become intoxicated from alcohol regardless of how much you drink. |\n| 55-56 | You lose all of your hair, and it regrows 24 hours later. |\n| 57-58 | Any time you touch a flammable object in the next minute that is not worn or carried by another creature, the object immediately ignites. |\n| 59-60 | You gain back a spell slot of the lowest level you have expended for the day. |\n| 61-62 | You lose control of the volume of your voice for one minute. Whenever you speak, it is at shouting volume. |\n| 63-64 | You cast the spell fog cloud with yourself at the center of the area of effect. |\n| 65-66 | You deal 4d10 lightning damage to up to three creatures of your choice in a radius of 30 feet from you. |\n| 67-68 | You become frightened of whatever creature is closest to you. The effect ends at the end of your next turn. |\n| 69-70 | All creatures in a 30 foot radius centered on you become invisible. The effect ends on each creature after a minute, or if the creature attacks or casts a spell. |\n| 71-72 | For one minute, you have resistance to all types of damage. |\n| 73-74 | The DM randomly chooses one creature within a 60 foot radius of you. For the next 1d4 hours, the creature is poisoned. |\n| 75-76 | For one minute, you glow luminously. The area within 30 feet of you is considered to be brightly lit, and a creature within 5 feet of you at the end of its turn becomes blinded, regaining its sight at the end of its next turn. |\n| 77-78 | You cast the spell polymorph with yourself on the target. You may make a saving throw against your own save DC. On a failure, you became for the duration a 0 CR creature with no attacks such as a sheep. |\n| 79-80 | For one minute, an illusion of floating flower petals and flying butterflies appears in a 10 foot radius around you and moves with you. |\n| 81-82 | You are able to instantly use an additional action. |\n| 83-84 | All creatures in a 30 radius of you, excluding you, suffer 1d10 necrotic damage. However much damage is dealt by this effect, you gain that many hit points, not exceeding your hit point maximum. |\n| 85-86 | You cast the spell mirror image with yourself as the target. |\n| 87-88 | You cast the spell fly with a random creature as the target. The creature cannot be more than 60 feet away from you. |\n| 89-90 | You turn invisible, and though not silenced, other creatures are unable to hear you. The effect ends after one minute, or if you attack or cast any spell. |\n| 91-92 | Any time during the next minute, if you are killed, you are affected by the spell reincarnate. |\n| 93-94 | You become one size larger, reverting after one minute. |\n| 95-96 | All creatures in a 30 foot radius from you, including yourself, become vulnerable to piercing damage. The effect ends after one minute. |\n| 97-98 | In the area around you, a quiet and otherworldly melody can be heard for one minute. |\n| 99-00 | Your total available sorcery points increases to your maximum daily limit. |\n\n#### Wyrd Weaver\n\nAlso beginning at 1st level, you can weave the endless possibilities of fate in order to give yourself advantage on a single ability check, attack roll, or saving throw. After you use this feature, you cannot do so again until after you finish a long rest. However, you gain use of the feature immediately if the DM has you roll on the Flood of Chaos table for casting a 1st level or higher sorcerer spell.\n\n#### Tip the Scales of Fate\n\nAt 6th level, you can subtly manipulate another creature’s luck for good or ill. When you see another creature make an ability check, attack roll, or saving throw, you can use 2 sorcery points as a reaction to roll 1d4. You choose to either add the result to or subtract it from the creature’s roll, doing so after the roll has been made but before any effects occur resulting from the roll.\n\n#### Direct the Flood of Chaos\n\nStarting at 14th level, you learn to influence your magic’s unpredictable effects to a small degree. Any time while rolling on the Flood of Chaos table, you may roll twice, choosing either result.\n\n#### Magical Deluge\n\nAt 18th level, you can infuse your damage dealing spells with extra energy. Once per turn, after you have rolled damage from a spell, you may choose one die on which you rolled the largest possible value. You can roll this die again, adding both results to the final damage total.",
    "document": 31,
    "created_at": "2023-11-05T00:01:38.189",
    "char_class": "sorcerer",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "the-great-elder-thing",
  "fields": {
    "name": "The Great Elder Thing",
    "desc": "Your patron, if you can call it that, is an alien mind from a far realm beyond the multiverse as we know it. Not evil per se, its motives are incomprehensible to the understanding of mortals. It might see you as a tool to further these strange aims, bidding you on seemingly unconnected but always unsettling errands. Or, you might tap into its unspeakable power without so much as gaining the notice of its vast awareness, having learned the proper rituals in some maddening grimoire. If you have a name for your patron, it could be an ancient primordial, the King in Yellow, one of the gods of Pegana, or a being from the expanded Cthulhu mythos. Regardless, you can draw on strange and terrible magic from the Great Elder Thing.\n\n#### Expanded Spell List\n\nThe Great Elder Thing lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.\n\n**Great Elder Thing Expanded Spells (table)**\n\n| Spell Level | Spells                               |\n|-------------|----------------------------------|\n| 1st         | dissonant whispers, hideous laughter |\n| 2nd         | detect thoughts, phantasmal force    |\n| 3rd         | clairvoyance, sending                |\n| 4th         | dominate beast, black tentacles      |\n| 5th         | dominate person, telekinesis         |\n\n#### Outward Cerebration\n\nBeginning at 1st level, you can push your thoughts into other minds, speaking telepathically to a creature within 30 feet as long as you can see that creature. The creature must know some language to hear your projections, but it does not need to speak the same language as you.\n\n#### Inhuman Reflex\n\nStarting at 6th level, you can briefly react with an impossible speed. As a reaction, triggered by an enemy attack roll targeting you, you force the creature to make the roll with disadvantage. If the enemy attack ends up missing, then you gain advantage on the next attack roll you make against that creature until the end of your next turn. You can only use this feature once per short or long rest.\n\n#### Mental Barrier\n\nAt 10th level, your thoughts become shielded against others. Your mind cannot be read by magic, telepathy, or other methods without your consent. You also become resistant to the psychic damage type, and if you do suffer psychic damage, you deal the same amount of psychic damage to the creature which dealt it to you.\n\n#### Cosmic Enthrallment\n\nStarting at 14th level, you gain the ability to flood a creature’s mind with the cosmic presence of your terrible patron. As an action, you can touch a humanoid that is incapacitated, causing it to be charmed by you. You can speak to this thrall telepathically as long as both of you remain on the same plane of existence. The charm has no end duration, but can be negated by a remove curse spell or another power that removes the charmed condition. You relinquish the charm the next time you use this feature.",
    "document": 31,
    "created_at": "2023-11-05T00:01:38.189",
    "char_class": "warlock",
    "route": "archetypes/"
  }
},
{
  "model": "api.archetype",
  "pk": "school-of-illusions-and-phantasms",
  "fields": {
    "name": "School of Illusions and Phantasms",
    "desc": "An illusionist calls forth phantom images and sounds from the plane of shadow to deceive the minds of the unwary. They can create the appearance of an object where none is, and they can also hide real creatures and objects from sight. They can dazzle and disorient with flashes of color, or call forth a target’s deepest inner fears. Practitioners of illusions and phantasms are often some of the most creative wizards, as every time they call upon one of their signature spells, they can make a unique experience for the situation. This school is particularly popular among gnome wizards, who have a history of relying on illusory magic to keep themselves hidden and safe from larger foes.\n\n##### Expert Illusionist\n\nStarting at 2nd level when you choose this school, you only need to spend half as much time and gold as normal in order to copy a spell into your spellbook if the spell is from the illusion school.\n\n##### Enhanced Cantrip\n\nAt 2nd level, you gain one additional cantrip, either _minor illusion_ or, if you already knew this spell, then another that you choose. Your mastery of this spell is such that, when you cast it, you can create an illusory image and a sound with the same casting. When calculating your cantrips known per level, this spell does not count against your total.\n\n##### Mutable Mirage\n\nAt 6th level, you can use your action to alter the illusion created by a spell you previously cast. You can only use this feature on spells with a duration of at least 1 minute, and you must be able to see the illusion when you alter it. You cannot change the illusion in a way not allowed by the initial casting of the spell.\n\n##### Second Semblance\n\nStarting at 10th level, if you are the target of an attack roll by another creature, you can substitute an illusion of yourself between you and your attacker. You use your reaction, causing the attack to miss you and hit the illusion, and your illusion vanishes afterwards. You can use this feature once per short or long rest.\n\n##### Phantasmagoria\n\nStarting at 14th level, you can draw energy from the plane of shadow to give parts of your illusions a temporary physical essence. Any time after you cast an illusion spell of at least 1st level, while the spell is in effect, you can use a bonus action to apply this power to a single nonmagical, inanimate object within the illusion of the spell. For 1 minute, this object can be physically interacted with, but it can’t be used to deal damage.\n\nAs an example, you could create an illusory staircase and scale it, or create an illusory portcullis to bar a pursuer, but you could not dispatch an enemy by dropping an illusory boulder on them.",
    "document": 31,
    "created_at": "2023-11-05T00:01:38.189",
    "char_class": "wizard",
    "route": "archetypes/"
  }
}
]