[
{
  "model": "api.background",
  "pk": "con-artist",
  "fields": {
    "name": "Con Artist",
    "desc": "You have always had a knack for getting people to see your point of view, often to their own detriment. You know how people think, what they want, and how to best use that to your advantage.\n\nPeople should know better than to trust you when you offer exactly what they need for exactly as much money as they have, but for the desperate caution is a resource in short supply. Your mysterious bottles, unlikely rumors, and secret maps offer to deliver the salvation they need. When they realize they've been had, you're nowhere to be found.",
    "document": 31,
    "created_at": "2023-11-05T00:01:38.187",
    "page_no": null,
    "skill_proficiencies": "Deception, Sleight of Hand",
    "tool_proficiencies": "Two of your choice",
    "languages": null,
    "equipment": "A set of fine clothes, a disguise kit, tools for your typical con (such as bottles full of colored water, a set of weighted dice, a deck of marked or filed cards, or a seal from an imaginary-or real-noble), and a pouch containing 15gp",
    "feature": "Cover Story",
    "feature_desc": "You have created a secondary persona that includes documents, mannerisms, a social presence and acquaintances. This also includes an alternate set of clothing and accessories as well as any elements needed for the disguise such as a wig or false teeth. Additionally, you can duplicate or fake documents-including official documents or personal correspondence-as long as you have seen a similar document and have an appropriate handwriting sample.",
    "suggested_characteristics": "Coming soon!",
    "route": "backgrounds/"
  }
},
{
  "model": "api.background",
  "pk": "scoundrel",
  "fields": {
    "name": "Scoundrel",
    "desc": "You were brought up in a poor neighborhood in a crowded town or city. You may have been lucky enough to have a leaky roof over your head, or perhaps you grew up sleeping in doorways or on the rooftops. Either way, you didn't have it easy, and you lived by your wits. While never a hardened criminal, you fell in with the wrong crowd, or you ended up in trouble for stealing food from an orange cart or clean clothes from a washing line. You're no stranger to the city watch in your hometown and have outwitted or outrun them many times.",
    "document": 31,
    "created_at": "2023-11-05T00:01:38.187",
    "page_no": null,
    "skill_proficiencies": "Athletics, Sleight of Hand",
    "tool_proficiencies": "One type of gaming set, thieves' tools",
    "languages": "No additional languages",
    "equipment": "A bag of 1,000 ball bearings, a pet monkey wearing a tiny fez, a set of common clothes, and a pouch containing 10 gp",
    "feature": "Urban Explorer",
    "feature_desc": "You are familiar with the layout and rhythms of towns and cities. When you arrive in a new city, you can quickly locate places to stay, where to buy good quality gear, and other facilities. You can shake off pursuers when you are being chased through the streets or across the rooftops. You have a knack for leading pursuers into a crowded market filled with stalls piled high with breakable merchandise, or down a narrow alley just as a dung cart is coming in the other direction.",
    "suggested_characteristics": "Despite their poor upbringing, scoundrels tend to live a charmed life—never far from trouble, but usually coming out on top. Many are thrill-seekers who delight in taunting their opponents before making a flashy and daring escape. Most are generally good-hearted, but some are self-centered to the point of arrogance. Quieter, introverted types and the lawfully-inclined can find them very annoying.\n\n| d8 | Personality Trait                                                     |\n|----|-----------------------------------------------------------------------|\n| 1  | Flashing a big smile often gets me out of trouble.                    |\n| 2  | If I can just keep them talking, it will give me time to escape.      |\n| 3  | I get fidgety if I have to sit still for more than ten minutes or so. |\n| 4  | Whatever I do, I try to do it with style and panache.                 |\n| 5  | I don't hold back when there's free food and drink on offer.          |\n| 6  | Nothing gets me more annoyed than being ignored.                      |\n| 7  | I always sit with my back to the wall and my eyes on the exits.       |\n| 8  | Why walk down the street when you can run across the rooftops?        |\n\n| d6 | Ideal                                                                                                                 |\n|----|-----------------------------------------------------------------------------------------------------------------------|\n| 1  | **Freedom.** Ropes and chains are made to be broken. Locks are made to be picked. Doors are meant to be opened. (Chaotic) |\n| 2  | **Community.** We need to look out for one another and keep everyone safe. (Lawful)                                       |\n| 3  | **Charity.** I share my wealth with those who need it the most. (Good)                                                    |\n| 4  | **Friendship.** My friends matter more to me than lofty ideals. (Neutral)                                                 |\n| 5  | **Aspiration.** One day my wondrous deeds will be known across the world. (Any)                                           |\n| 6  | **Greed.** I'll stop at nothing to get what I want. (Evil)                                                                |\n\n| d6 | Bond                                                                                                                                |\n|----|-------------------------------------------------------------------------------------------------------------------------------------|\n| 1  | My elder sibling taught me how to find a safe hiding place in the city. This saved my life at least once.                           |\n| 2  | I stole money from someone who couldn't afford to lose it and now they're destitute. One day I'll make it up to them.               |\n| 3  | The street kids in my town are my true family.                                                                                      |\n| 4  | My mother gave me an old brass lamp. I polish it every night before going to sleep.                                                 |\n| 5  | When I was young, I was too scared to leap from the tallest tower in my hometown onto the hay cart beneath. I'll try again someday. |\n| 6  | A city guardsman let me go when they should have arrested me for stealing. I am forever in their debt.                              |\n\n| d6 | Flaw                                                                    |\n|----|-------------------------------------------------------------------------|\n| 1  | If there's a lever to pull, I'll pull it.                               |\n| 2  | It's not stealing if nobody realizes it's gone.                         |\n| 3  | If I don't like the odds, I'm out of there.                             |\n| 4  | I often don't know when to shut up.                                     |\n| 5  | I once filched a pipe from a priest. Now I think the god has cursed me. |\n| 6  | I grow angry when someone else steals the limelight.                    |",
    "route": "backgrounds/"
  }
}
]
